Repository: KDE/documentation-develop-kde-org
Catalog: po/*/develop-kde-org.po
Languages: ca, eo, es, fr, he, it, ja, ko, nl, pl, pt, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

source: Previous
ca: Anterior
eo: Antaŭa
es: Anterior
fr: Précédent
he: הקודם
it: Precedente
ja: 前のページ
ko: 이전
nl: Vorige
pl: Poprzedni
pt: Anterior
pt_br: Anterior
sl: Nazaj
sv: Föregående
tr: Önceki
uk: Назад
zh_cn: 上一个
zh_tw: 上一頁

source: Next
ca: Següent
eo: Sekva
es: Siguiente
fr: Suivant
he: הבא
it: Successivo
ja: 次のページ
ko: 다음
nl: Volgende
pl: Następny
pt: Seguinte
pt_br: Próximo
sl: Naprej
sv: Nästa
tr: Sonraki
uk: Далі
zh_cn: 下一个
zh_tw: 下一頁

source: Read more
ca: Llegiu més
eo: Legi pli
es: Leer más
fr: En savoir plus
he: מידע נוסף
it: Maggiori informazioni
ja: さらに読む
ko: 자세한 내용 보기
nl: Lees meer
pl: Przeczytaj więcej
pt: Ler mais
pt_br: Ler mais
sl: Preberi več
sv: Läs mer
tr: Daha fazla oku
uk: Дізнайтеся більше
zh_cn: 了解更多
zh_tw: 閱讀更多

source: Search this site…
ca: Cerca en aquest lloc…
eo: Priserĉi ĉi retejon…
es: Buscar este sitio…
fr: Rechercher ce site...
he: חיפוש באתר הזה…
it: Cerca in questo sito...
ja: このサイトを検索する…
ko: 이 사이트 검색…
nl: Deze site doorzoeken…
pl: Poszukaj na tej stronie...
pt: Procurar nesta página…
pt_br: Pesquisar neste site...
sl: Preiščite to spletno mesto…
sv: Sök på webbplatsen…
tr: Bu sitede ara…
uk: Шукати на цьому сайті…
zh_cn: 站内搜索...
zh_tw: 搜尋此網站…

source: Copy to clipboard
ca: Copia al porta-retalls
eo: Kopii al tondujo
es: Copiar al portapapeles
fr: Copier dans le presse-papier
he: העתקה ללוח הגזירים
it: Copia negli appunti
nl: Naar klembord kopiëren
pt_br: Copiar para a área de transferência
sl: Kopiraj na odložišče
sv: Kopiera till klippbordet
tr: Panoya Kopyala
uk: Копіювати до буфера
zh_cn: 复制到剪贴板

source: Copied
ca: Copiat
eo: Kopiita
es: Copiado
fr: Copié
he: הועתק
it: Copiato
nl: Gekopieerd
pt_br: Copiado
sl: Prekopirano
sv: Kopierad
tr: Kopyalandı
uk: Скопійовано
zh_cn: 已复制

source: in
ca: en
eo: en
es: en
fr: entrant
he: ב־
ja: に
pl: w
pt: em
pt_br: em
sl: v
sv: i
tr: içinde
zh_cn: 于
zh_tw: 於

source: Developer
ca: Desenvolupador
eo: Evoluiganto
es: Desarrollador
fr: Développeur
he: מפתח
it: Sviluppatore
nl: Ontwikkelaar
pt_br: Desenvolvedor
sl: Razvijalec
sv: Utvecklare
tr: Geliştirici
uk: Розробник
zh_cn: 开发者

source: Made by KDE
ca: Creat per la comunitat KDE
eo: Verkita de KDE
es: Creado por KDE
fr: Réalisé par KDE
he: נוצר על ידי KDE
it: Creato da KDE
nl: Gemaakt door KDE
pt_br: Feito pelo KDE
sl: Izdelano v KDE
sv: Tillverkat av KDE
tr: Bir KDE Ürünü
uk: Створено KDE
zh_cn: KDE 社区项目

source: All Rights Reserved
ca: Tots els drets reservats
eo: Ĉiuj Rajtoj Rezervitaj
es: Todos los derechos reservados
fr: Tous droits réservés
he: כל הזכויות שמורות
it: Tutti i diritti riservati
ja: すべての権利を留保する
nl: Alle rechten voorbehouden
pl: Wszystkie prawa zastrzeżone
pt: Todos os Direitos Reservados
pt_br: Todos os direitos reservados
sl: Vse pravice pridržane
sv: Alla rättigheter förbehållna
tr: Tüm Hakları Saklıdır
uk: Усі права захищено
zh_cn: 版权所有
zh_tw: 保留所有權利

source: Privacy Policy
ca: Política de privadesa
eo: Privateca Politiko
es: Política de privacidad
fr: Politique de confidentialité
he: מדיניות פרטיות
it: Politica di riservatezza
ja: プライバシーポリシー
ko: 개인 정보 처리 방침
nl: Privacybeleid
pl: Zasady prywatności
pt: Política de Privacidade
pt_br: Política de privacidade
sl: Politika zasebnosti
sv: Integritetspolicy
tr: Gizlilik Politikası
uk: Правила конфіденційності
zh_cn: 隐私政策
zh_tw: 隱私權政策

source: By
ca: Per
eo: De
es: Por
fr: De
he: מאת
it: Di
ja: によって
nl: Door
pl: Przez
pt: De
pt_br: Por
sl: Od
sv: Av
tr: Kim tarafından
uk: Автор
zh_cn: 作者：
zh_tw: 由

source: Created
ca: Creada
eo: Kreita
es: Creado
fr: Créé
he: נוצר
it: Creato
ja: 作成された
ko: 만든 날짜
nl: Aangemaakt
pl: Utworzony
pt: Criado
pt_br: Criado
sl: Ustvarjeno
sv: Skapad
tr: Oluşturulma
uk: Створено
zh_cn: 创建时间
zh_tw: 建立

source: Last modified
ca: Última modificació
eo: Laste modifita
es: Última modificación
fr: Dernière modification
he: שינוי אחרון
it: Ultima modifica
ja: 最終更新
ko: 수정한 날짜
nl: Laatst gewijzigd
pl: Ostatnia zmiana
pt: Última modificação
pt_br: Última modificação
sl: Zadnjič spremenjeno
sv: Senast ändrad
tr: Son değişiklik
uk: Востаннє змінено
zh_cn: 最后修改时间
zh_tw: 最後變更

source: Edit this page
ca: Edita aquesta pàgina
eo: Redakti ĉi tiun paĝon
es: Editar esta página
fr: Modifier cette page
he: עריכת העמוד הזה
it: Modifica questa pagina
ja: このページを編集する
ko: 이 페이지 편집하기
nl: Deze pagina bewerken
pl: Edytuj tę stronę
pt: Editar esta página
pt_br: Editar esta página
sl: Uredi to stran
sv: Redigera sidan
tr: Bu sayfayı düzenle
uk: Редагувати цю сторінку
zh_cn: 编辑此页面
zh_tw: 編輯此頁面

source: Create documentation issue
ca: Crea un problema de documentació
eo: Krei problemraporton pri dokumentado
es: Crear problema de documentación
fr: Créer un point ouvert de documentation
he: דיווח על תקלה בתיעוד
it: Crea un problema relativo alla documentazione
ja: 資料についての issue を作成する
ko: 문서 이슈 만들기
nl: Documentatieprobleem aanmaken
pl: Utwórz problem z dokumentacją
pt: Registar um problema na documentação
pt_br: Criar um bug sobre a documentação
sl: Ustvari poročilo o težavi z dokumentacijo
sv: Skapa dokumentationsfelrapport
tr: Belgelendirme hatası bildir
uk: Створити повідомлення про ваду у документації
zh_cn: 创建文档问题
zh_tw: 為說明文件建立 issue

source: Create project issue
ca: Crea un problema de projecte
eo: Krei problemraporton pri projekto
es: Crear problema de proyecto
fr: Créer un point ouvert de projet
he: יצירת דיווח על מיזם
it: Crea un problema relativo al progetto
ja: プロジェクトについての issue を作成する
ko: 프로젝트 이슈 만들기
nl: Projectprobleem aanmaken
pl: Utwórz problem w projekcie
pt: Registar um problema no projecto
pt_br: Criar um bug sobre o projeto
sl: Ustvari poročilo o težavi s projektom
sv: Skapa projektfelrapport
tr: Proje hatası bildir
uk: Створити повідомлення про ваду у проєкті
zh_cn: 创建项目问题
zh_tw: 為專案建立 issue

source: Posts in
ca: Publicacions a
eo: Afiŝoj en
es: Publicaciones en
fr: Messages entrants
he: רשומות ב־
it: Pubblica in
ja: 投稿
nl: Posten in
pl: Nowa wiadomość w
pt: Publicações em
pt_br: Posts em
sl: Objave v
sv: Inlägg i
tr: Gönderi konumu
uk: Дописи у
zh_cn: 发布于
zh_tw: 文章

source: Icons
ca: Icones
eo: Piktogramoj
es: Iconos
fr: Icônes
he: סמלים
it: Icone
ja: アイコン
ko: 아이콘
nl: Pictogrammen
pl: Ikony
pt: Ícones
pt_br: Ícones
sl: Ikone
sv: Ikoner
tr: Simgeler
uk: Піктограми
zh_cn: 图标
zh_tw: 圖示

source: Categories
eo: Kategorioj
es: Categorías
fr: Catégories
he: קטגוריות
it: Categorie
ja: カテゴリー
ko: 분류
nl: Categorieën
pl: Kategorie
pt: Categorias
pt_br: Categorias
sl: Kategorije
sv: Kategorier
tr: Kategoriler
uk: Категорії
zh_cn: 类别
zh_tw: 分類

source: Search for icons
ca: Cerca icones
eo: Serĉi piktogramojn
es: Buscar iconos
fr: Rechercher des icônes
he: חיפוש סמלים
it: Cerca icone
ja: アイコンを検索する
ko: 아이콘 검색
nl: Naar pictogrammen zoeken
pl: Poszukaj ikon
pt: Procurar por ícones
pt_br: Pesquisar por ícones
sl: Iskanje ikon
sv: Sök efter ikoner
tr: Simgelerde ara
uk: Шукати піктограми
zh_cn: 搜索图标
zh_tw: 搜尋圖示

source: Start typing to filter...
ca: Per a filtrar, comenceu a escriure...
eo: Komencu tajpi por filtri...
es: Empiece a escribir para filtrar…
fr: Démarrage de la saisie pour le filtrage...
he: הקלדה תתחיל סינון…
it: Inizia a digitare per filtrare...
ja: フィルターを開始…
nl: Met typen beginnen om te filteren...
pl: Zacznij pisać, aby odfiltrować...
pt: Comece a escrever para filtrar...
pt_br: Comece a digitar para filtrar...
sl: Začnite tipkati za filtriranje ...
sv: Börja skriva för att filtrera...
tr: Süzmek için yazmaya başla…
uk: Введіть щось для фільтрування…
zh_cn: 输入条件开始过滤...
zh_tw: 開始打字來過濾...

source: Nothing found for this category/keyword combination.
ca: No s'ha trobat res per a aquesta combinació de categoria/paraula clau.
eo: Nenio trovita en ĉi tiu kombino de kategorio/ŝlosilvorto.
es: No se ha encontrado nada para esta combinación de categoría y palabra clave.
fr: Aucun résultat trouvé pour cette combinaison de catégorie / mots clé
he: לא נמצא שום דבר לשילוב בין הקטגוריה למילת המפתח הזאת.
it: Non è stato trovato niente con questa combinazione di categoria e parola chiave.
ja: このカテゴリー/キーワードの結びつきが見つかりませんでした。
nl: Niets gevonden voor deze combinatie van categorie/trefwoord.
pl: Nie znaleziono niczego dla tego połączenia kategorii/słów kluczowych.
pt: Não foi encontrado nada nesta combinação de categorias/palavras-chave.
pt_br: Nada encontrado para esta combinação de categoria/palavra-chave.
sl: Nič ni bilo najdeno za to kombinacijo kategorij/ključnih besed.
sv: Ingenting hittades för den här kombinationen av kategori och nyckelord.
tr: Bu kategori/anahtar sözcük kombinasyonu için bir sonuç bulunamadı.
uk: Нічого не знайдено для цієї комбінації категорії і ключових слів.
zh_cn: 找不到此类别/关键字组合。
zh_tw: 此分類/關鍵字組合沒有找到結果。

source: Search Results
ca: Resultats de la cerca
eo: Serĉrezultoj
es: Resultado de la búsqueda
fr: Résultats de recherche
he: תוצאות חיפוש
it: Risultati della ricerca
nl: Zoekresultaten
pt_br: Resultados da pesquisa
sl: Zadetki iskanja
sv: Sökresultat
tr: Arama Sonuçları
uk: Результати пошуку
zh_cn: 搜索结果

source: No results found for your query
ca: No s'ha trobat cap resultat de la consulta
eo: Neniuj rezultoj trovitaj por via aldemando
es: Su consulta no ha encontrado resultados
fr: Aucun résultat trouvé suite à votre demande
he: לא נמצאו תוצאות לשאילתה שלך
it: Nessun risultato trovato per la tua interrogazione
nl: Geen resultaten van uw zoekopdracht gevonden
pt_br: Nenhum resultado encontrado para a sua pesquisa
sl: Ni zadetkov vaše poizvedbe
sv: Inga resultat hittades för frågan
tr: Sorgunuz için herhangi bir sonuç bulunamadı
uk: За вашим запитом нічого не знайдено
zh_cn: 没有找到您查询的结果

source: KDE Developer Platform
ca: Plataforma de desenvolupadors del KDE
eo: Evoluigista Platformo de KDE
es: Plataforma de desarrollo de KDE
fr: Plate-forme de développement sous KDevelop
he: פלטפורמת הפיתוח של KDE
it: Piattaforma di sviluppo di KDE
ko: KDE 개발 플랫폼
nl: Platform voor ontwikkelaar van KDE
pl: Platforma programistyczna KDE
pt: Plataforma de Desenvolvimento do KDE
pt_br: Plataforma do Desenvolvedor KDE
sl: Razvijalska platforma KDE
sv: KDE utvecklingsplattform
tr: KDE Geliştirici Platformu
uk: Платформа розробників KDE
zh_cn: KDE 开发者平台
zh_tw: KDE 開發者平台

source: Design, build and distribute beautiful, usable applications with KDE technologies.
ca: Dissenyeu, construïu i distribuïu aplicacions belles i usables amb les tecnologies del KDE.
eo: Dezajnu, konstruu kaj distribuu belajn, uzeblajn aplikaĵojn kun teknologioj de KDE.
es: Diseñe, compile y distribuya aplicaciones atractivas y usables con las tecnologías de KDE.
fr: Concevoir, développer et distribuer de belles applications, utilisables avec les technologies de KDE.
he: תכנון, בנייה והפצה של יישומים יפים ושימושיים עם הטכנולוגיות של KDE.
it: Progetta, compila e distribuisci con le tecnologie di KDE delle applicazioni magnifiche e usabili.
ja: KDE の技術で美しく便利なアプリケーションをデザイン、ビルドそして配布する。
ko: KDE 기술을 사용하여 아름답고 사용하기 편한 프로그램을 설계, 개발, 배포하십시오.
nl: Ontwerp, bouw en distribueer prachtige, bruikbare toepassingen met KDE technologieën.
pl: Projektuj, buduj i rozpowszechniaj ładne i użyteczne aplikacje w technologii KDE.
pt: Desenhe, compile e distribua aplicações bonitas e úteis com as tecnologias do KDE.
pt_br: Projete, desenvolva e distribua aplicativos bonitos e úteis com as tecnologias do KDE.
sl: Oblikujte, gradite in razširjajte prekrasne, uporabne aplikacije s tehnologijami KDE.
sv: Skapa, bygg och distribuera vackra, användbara program med KDE-teknologier.
tr: KDE teknolojileriyle güzel, kullanılabilir uygulamalar tasarlayın, oluşturun ve dağıtın.
uk: Компонуйте, збирайте і розповсюджуйте красиві і корисні програми з використанням технологій KDE.
zh_cn: 利用 KDE 技术设计、构建并分发美观且易用的应用程序。
zh_tw: 使用 KDE 科技來設計、製作並發佈漂亮且好用的應用程式。

source: Multi-Platform
ca: Multiplataforma
eo: Plur-Platforma
es: Multiplataforma
fr: Multi-Plate-forme
he: ריבוי פלטפורמות
it: Multi piattaforma
ja: マルチプラットフォーム
ko: 멀티 플랫폼
pl: Wieloplatformowe
pt: Multi-Plataforma
pt_br: Multi plataforma
sl: Za različne platforme hkrati
sv: För flera plattformar
tr: Çok Platformlu
uk: Багатоплатфомовість
zh_cn: 多平台
zh_tw: 多平台

source: Develop once, deploy everywhere. Built on top of Qt, KDE's technologies work on every platform.
ca: Desenvolupeu una vegada i que funcioni arreu. Construïda damunt de les Qt, les tecnologies del KDE funcionen sobre cada plataforma.
eo: Evoluigu unufoje, disponigu ĉie. Konstruitaj surbaze de Qt, la teknologioj de KDE funkcias en ĉiu platformo.
es: Desarrolle una vez, implemente en todas partes. Construidas sobre Qt, las tecnologías de KDE funcionan en todas las plataformas.
fr: Développer une première fois, déployer partout. Conçu à partir de Qt, les technologies de KDE fonctionnent sur n'importe quelle plate-forme.
it: Sviluppa una volta, distribuisci ovunque. Costruite sopra Qt, le tecnologie di KDE funzionano su tutte le piattaforme.
ja: 1度の開発で、どこにでもデプロイできます。Qt 上に構築された KDE の技術はすべてのプラットフォームで動作します。
ko: 한 번 개발하고 여러 곳에 배포하십시오. Qt를 기반으로 하는 KDE 기술은 어느 플랫폼에서도 작동합니다.
nl: Ontwikkel eenmalig, pas overal toe. Bouw bovenop Qt, technologieën van KDE werken op elk platform.
pl: Opracuj raz, wykorzystaj wszędzie. Buduj na podstawie technologi Qt oraz KDE, które działają na każdej platformie.
pt: Desenvolva uma vez e instale em todo o lado. Construídas com base no Qt, as tecnologias do KDE funcionam em todas as plataformas.
pt_br: Desenvolva em um lugar, implemente em qualquer lugar. Construídas sobre o Qt, as tecnologias do KDE funcionam em qualquer plataforma.
sl: Razvijte enkrat, razmestite povsod. Tehnologije KDE, zgrajene na osnovi Qt, delujejo na vseh platformah.
sv: Utveckla en gång, utplacera överallt. Byggt på Qt, KDE:s teknologier fungerar på alla plattformar.
tr: Bir kez geliştirin, her yere dağıtın. Qt üzerine yapılan KDE teknolojileri, her platformda çalışır.
uk: Єдиний процес розробки для усіх платформ одразу. Побудовані на основі Qt, технології KDE працюють на усіх програмних платформах.
zh_cn: 开发一次，随处部署。KDE 的技术基于 Qt 构建，可在所有平台上运行。
zh_tw: 開發一次，部署到所有地方。建基於 Qt 上的 KDE 科技在所有平台上都能運作。

source: Desktop Linux, Android, Windows, macOS, embedded, and more
ca: Escriptori Linux, Android, Windows, macOS, incrustat i molt més
eo: Labortabla Linux, Android, Windows, macOS, enkorpigita kaj pli
es: Escritorio de Linux, Android, Window, macOS, integradas y más
fr: Linux sur ordinateur fixe, Android, Windows, macOS, en embarqué et encore plus.
he: לינוקס למחשבים אישיים, Android,‏ Windows,‏ macOS, מכשירים משובצים ועוד
it: Desktop Linux, Android, Windows, macOS, incorporato e altro
ja: デスクトップ版 Linux、Android、Windows、macOS、組み込みなど
ko: 데스크톱 리눅스, Android, Windows, macOS, 임베디드, 그리고 더
nl: Linux bureaublad, Android, Windows, macOS, ingebed en meer
pl: Pulpit Linuksa, Android, Windows, macOS, osadzone oraz więcej
pt: Linux em Computadores Pessoais, Android, Windows, macOS, sistemas embebidos, etc
pt_br: Desktop Linux, Android, Windows, macOS, incorporado e muito mais
sl: Namizni Linux, Android, Windows, macOS, vdelani sistemi in še več
sv: Linux på en skrivbordsdator, Android, Windows, macOS, inbäddat, med mera
tr: Masaüstü Linux, Android, Windows, macOS, yerleşik platformlar ve daha fazlası
uk: Робочі станції на основі Linux, Android, Windows, macOS, вбудовані системи тощо
zh_cn: 桌面 Linux、Android、Windows、macOS、嵌入式系统，还有更多
zh_tw: 桌面 Linux、Android、Windows、macOS、嵌入式環境等等

source: Plasma running on a phone, laptop and TV
ca: El Plasma executant-se en un telèfon, ordinador portàtil i televisor
eo: Plasma rulanta en poŝtelefono, tekkomputilo kaj TV
es: Plasma funcionando en un teléfono, un portátil y en un televisor
fr: Exécution de Plasma sur un téléphone, sur un ordinateur portable et sur une télévision.
he: פלזמה רצה על טלפונים, מחשבים ניידים וטלוויזיות
it: Plasma viene eseguito su telefoni, computer e TV
ja: Plasma は携帯、ラップトップ、テレビで動作
ko: 휴대폰, 노트북, TV에서 실행 중인 Plasma
nl: Plasma draaiend op een telefoon, laptop en TV
pl: Plazma działająca na telefonie, laptopie oraz telewizorze
pt: O Plasma a correr num telemóvel, num portátil e na TV
pt_br: Plasma rodando em um celular, laptop e TV
sl: Plasma teče na telefonu, prenosnem računalniku in TV-ju
sv: Plasma som kör på en telefon, bärbar dator och teve
tr: Telefonda, dizüstü bilgisayarda ve televizyonda çalışan Plasma
uk: Плазма працює на телефоні, ноутбуці і телевізорі
zh_cn: Plasma 在手机、 笔记本电脑和电视上运行
zh_tw: Plasma 在手機上、筆電上或電視上執行

source: KDE Frameworks: Enhance the Qt Experience
ca: Frameworks del KDE: Millora l'experiència de les Qt
eo: KDE Frameworks: Plibonigu la Sperton pri Qt
es: KDE Frameworks: Mejora la experiencia de Qt
fr: Environnement de développement de KDE : améliorez l'expérience avec Qt
he: תשתיות KDE: הרחבת חוויית ה־Qt
it: KDE Frameworks: migliora l'esperienza con Qt
ja: KDE Frameworks: Qt での体験を向上
ko: KDE 프레임워크: Qt 경험 강화
nl: KDE Frameworks: verbeter de Qt ervaring
pl: Szkielety KDE: Podnoszą wrażenia z używania Qt
pt: Plataformas do KDE: Melhore a Experiência com o Qt
pt_br: Frameworks do KDE: Melhore a experiência no Qt
sl: Ogrodje KDE Frameworks: izboljšajte izkušnjo Qt
sv: KDE Ramverk: Förbättra upplevelsen av Qt
tr: KDE Frameworks: Qt deneyimini geliştir
uk: KDE Frameworks: розширення спектра Qt
zh_cn: KDE 程序框架：扩展 Qt 体验
zh_tw: KDE Frameworks：強化 Qt 體驗

source: KDE Frameworks cover 80 add-on libraries for programming with Qt. All libraries have been well-tested in real world scenarios and are comprehensively documented. KDE's libraries are distributed under LGPL or MIT licenses.
ca: Els Frameworks del KDE cobreixen 80 biblioteques de complements per a la programació amb les Qt. Totes les biblioteques han estat ben provades en escenaris del món real i estan completament documentades. Les biblioteques del KDE es distribueixen sota les llicències LGPL o MIT.
eo: KDE Frameworks kovras 80 aldonajn bibliotekojn por programado kun Qt. Ĉiuj bibliotekoj estis bone testitaj en realmondaj scenaroj kaj estas amplekse dokumentitaj. La bibliotekoj de KDE estas distribuitaj sub LGPL- aŭ MIT-licencoj.
es: KDE Frameworks contiene 80 bibliotecas complementarias para programar con Qt. Todas las bibliotecas se han probado minuciosamente en escenarios del mundo real y están exhaustivamente documentadas. Las bibliotecas de KDE se distribuyen bajo las licencias LGPL o MIT.
fr: L'environnement de développement de KDevelop regroupe 80 bibliothèques supplémentaires pour la programmation avec Qt. Toutes les bibliothèques ont été largement testées dans des scénarios du monde réel et sont entièrement documentées. Les bibliothèques de KDE sont distribuées sous licence « LGPL » ou « MIT ».
it: KDE Frameworks copre 80 librerie di componenti aggiuntivi per programmare con Qt. Tutte le librerie sono state accuratamente testate per gli scenari del mondo reale, e sono state documentate in modo completo. Le librerie di KDE sono distribuite con licenza LGPL o MIT.
ja: KDE Frameworks は Qt を利用したプログラミングのための 80 のアドオンライブラリーを含んでいます。すべてのライブラリーは現実世界のシナリオで十分に試験されており、包括的な資料が用意されています。KDE のライブラリーは LGPL または MIT ライセンスの下に配布されています。
ko: KDE 프레임워크는 Qt 프로그래밍에 사용할 수 있는 80여 개의 추가 기능 라이브러리입니다. 모든 라이브러리는 실제 상황에서 사용할 수 있도록 테스트되었으며 모든 부분이 문서화되어 있습니다. KDE 라이브러리는 LGPL이나 MIT 라이선스로 배포됩니다.
nl: KDE Frameworks dekt 80 add-on bibliotheken voor programmeren met Qt. Alle bibliotheken zijn goed getest in scenarios uit de echte wereld en zijn uitgebreid gedocumenteerd. Bibliotheken van KDE worden gedistribueerd onder LGPL of MIT licenties.
pl: Szkielety KDE stanowi 80 bibliotek-dodatków do programowania w Qt. Wszystkie biblioteki zostały dobrze wypróbowane w świecie rzeczywistym i są szczegółowo opisane. Biblioteki KDE są rozpowszechniane na licencjach LGPL oraz MIT.
pt: As Plataformas do KDE cobrem 80 bibliotecas de extensão para programar com o Qt. Todas as bibliotecas foram bem testadas em cenários da vida real e estão devidamente documentadas. As bibliotecas do KDE são distribuídas segundo as licenças LGPL ou MIT.
pt_br: As Frameworks do KDE consistem em 80 bibliotecas complementares para programação em Qt. Todas as bibliotecas foram testadas em cenários reais e estão bem documentadas. As bibliotecas do KDE são distribuídas sob as licenças LGPL ou MIT.
sl: Ogrodja KDE zajemajo 80 knjižnic dodatkov za programiranje s Qt. Vse knjižnice so bile dobro preizkušene v realnem svetu in so celovito dokumentirane. Knjižnice KDE se razširjajo z dovoljenjem LGPL ali MIT.
sv: KDE Ramverk omfattar 80 tilläggsbibliotek för programmering med Qt. Alla bibliotek är väl utprovade i scenarier från verkligheten och har omfattande dokumentation. KDE:s bibliotek distribueras med LGPL- och MIT-licenser.
tr: KDE Frameworks, Qt ile programlama için 80 eklenti kitaplığını kapsar. Tüm kitaplıklar, gerçek dünya senaryolarında iyi bir şekilde sınanmıştır ve kapsamlı bir şekilde belgelendirilmiştir. KDE Frameworks, LGPL veya MIT lisansları altında dağıtılmaktadır.
uk: KDE Frameworks складається з 80 додаткових бібліотек для програмування з використанням Qt. Усі бібліотеки ретельно перевірено у сценаріях з реального життя і повністю документовано. Розповсюдження бібліотек KDE відбувається за умов ліцензування LGPL або MIT.
zh_cn: KDE 程序框架涵盖了 80 个用于 Qt 编程的附加库。所有库都在实际场景中经过了充分测试，并有全面的文档说明。KDE 的库在 LGPL 或 MIT 许可证下分发。
zh_tw: KDE Frameworks 包含 80 個 Qt 程式可以使用的擴充函式庫。這些函式庫全部皆在現實情境下經過良好的測試，並且有非常完整的說明文件。KDE 的函式庫以 LGPL 或 MIT 授權條款釋出。

source: Kirigami UI Framework
ca: Marc de treball IU en Kirigami
es: Framework de interfaz de usuario Kirigami
fr: Environnement de développement pour interface utilisateur Kirigami
he: תשתית ממשק המשתמש Kirigami
it: Framework per l'interfaccia grafica con Kirigami
ko: Kirigami UI 프레임워크
pl: Szkielet interfejsów Kirigami
pt: Plataforma Gráfica do Kirigami
sl: Ogrodje za vmesnike Kirigami
sv: Kirigami ramverk för användargränssnitt
tr: Kirigami Grafik Arayüz Çatısı
uk: Бібліотека інтерфейсу Kirigami
zh_cn: Kirigami UI 框架
zh_tw: Kirigami UI 框架

source: Build Beautiful, Convergent Apps that Run on Phones, TVs and Everything in Between.
ca: Construïu aplicacions boniques i convergents que funcionin en els telèfons, televisors i tot el que hi ha entre ells.
eo: Konstruu Belajn, Konverĝajn Apojn, kiuj Funkcias per Telefonoj, Televidiloj kaj Ĉio Intere.
es: Cree aplicaciones atractivas y convergentes que se ejecuten en teléfonos, televisores y en cualquier cosa entre ambos.
fr: Développer de belles applications convergentes pouvant fonctionner sur les téléphones, les téléviseurs et tout se trouvant entre les deux.
it: Costruisci magnifici programmi convergenti che funzionano su telefoni, TV e su tutto quello che c'è in mezzo.
ja: 携帯やテレビ、その中間などで動作する、美しく融合したアプリケーションを構築する。
ko: 휴대폰, TV, 그 사이에 있는 모든 것에서 실행되는 아름답고 통합된 앱을 개발하십시오.
nl: Prachtig gebouwd, convergente toepassingen die draaien op telefoons, TV's en alles er tussenin.
pl: Buduj ładne, wieloplatformowe aplikacje, które działają na telefonach, telewizorach i wszystkim pomiędzy.
pt: Crie Aplicações Bonitas e Convergentes que Correm em Telemóveis, TV's e Tudo o Resto.
pt_br: Crie aplicativos bonitos e convergentes que rodam em celulares, TVs e muito mais.
sl: Zgradite krasne, konvergentne aplikacije, ki delujejo na telefonih, računalnikih in vsem vmes.
sv: Bygg vackra, konvergerande program som kör på telefoner, teve-apparater och allt däremellan.
tr: Telefonlarda, televizyonlarda ve arasındaki her şeyde çalışan alımlı ve yakınsak uygulamalar yazın.
uk: Будуйте красиві однорідні програми, які працюватимуть на телефонах, телевізорах та усіх проміжних пристроях.
zh_cn: 构建美观、兼容不同设备布局的应用程序，使其能在手机、电视以及介于两者之间的所有设备上运行。
zh_tw: 建構能夠在手機、電視和任何大小介於其間的裝置上運作且好看的響應式應用程式。
