Repository: KDE/documentation-develop-kde-org
Catalog: po/*/develop-kde-org.po
Languages: ca, eo, es, fr, he, it, ja, ko, nl, pl, pt, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

source: The line between desktop and mobile is blurring and users expect the same quality experience on every device. Applications using Kirigami adapt brilliantly to mobile, desktop, TVs, infotainment systems and everything in between.
ca: La línia entre l'escriptori i el mòbil està desdibuixada, i els usuaris esperen la mateixa experiència de qualitat en cada dispositiu. Les aplicacions que empren Kirigami s'adapten brillantment als mòbils, escriptoris, televisors, sistemes d'informació i tot el que hi ha entre ells.
es: La línea entre escritorio y móvil se está diluyendo y los usuarios esperan la misma calidad de experiencia en cualquier dispositivo. Las aplicaciones que usan Kirigami se adaptan de una forma brillante al móvil, el escritorio, el televisor, sistemas de infoentretenimiento y cualquier cosa entre ellos.
fr: La séparation entre ordinateur fixe et périphérique mobile devient floue. Les personnes utilisatrices attendent la même expérience de qualité sur chaque périphérique. Les applications utilisant Kirigami s'adaptent avec brio aux périphériques mobiles, aux ordinateurs fixes, aux télévisions, aux systèmes multimédia et tout ce qui est intermédiaire.
it: La divisione tra desktop e mobile si sta assottigliando e gli utenti si aspettano la stessa esperienza di qualità su ogni dispositivo. Le applicazioni che utilizzano Kirigami si adattano in maniera brillante ai sistemi mobili, ai desktop, alle TV, ai sistemi di infotainment e a tutte le sfumature intermedie.
nl: De lijn tussen bureaublad en mobiel is aan het vervagen en gebruikers verwachten dezelfde kwalitatieve ervaring op elk apparaat. Toepassingen die Kirigami gebruiken passen zich brilliant aan aan mobieltjes, bureaubladen, TV's, infotainmentsystemen en alles er tussenin.
pt_br: A linha entre o desktop e o celular está se apagando e os usuários esperam a mesma experiência de qualidade em todos os dispositivos. Aplicativos que usam o Kirigami se adaptam brilhantemente para dispositivos móveis, desktops, TVs, sistemas de entretenimento e muito mais.
sl: Razmejitev med namizjem in mobilnim telefonom je zamegljena in uporabniki pričakujejo enako kakovostno izkušnjo na vsaki napravi. Aplikacije, ki uporabljajo kirigami, se briljantno prilagodijo mobilnim, namiznim, televizorjem, sistemom za zabavo in vse vmes.
sv: Linjen mellan skrivbord och mobil suddas ut och användare förväntar sig samma upplevelsekvalitet på alla apparater. Program som använder Kirigami anpassar sig briljant till mobil, skrivbord, teve, infotainment och allt däremellan.
tr: Masaüstü ve taşınabilir aygıtlar arasındaki çizgi bulanıklaşıyor ve kullanıcılar artık her aygıtta aynı kalitede deneyim bekliyor. Kirigami kullanan uygulamalar cep telefonuna, masaüstüne, televizyonlara, bilgi eğlence sistemlerine ve aradaki her şeye harika bir şekilde uyum sağlar.
uk: Межа між робочою станцією та мобільним пристроєм розмивається — користувачі очікують однакової якості користування на будь-якому пристрої. Програми, у яких використано Kirigami, чудово підлаштовуються до мобільних пристроїв, робочих станцій, телевізорів, систем інформування та розваг та будь-яких проміжних пристроїв.

source: Kirigami's components are good looking and consistent, and Kirigami itself provides a clearly defined workflow. Users of Kirigami apps will appreciate the smart choices made in the API and uncluttered design.
ca: Els components de Kirigami són atractius i coherents, i el Kirigami mateix proporciona un flux de treball definit amb claredat. Els usuaris de les aplicacions en Kirigami apreciaran les opcions intel·ligents realitzades a l'API i el disseny adequat.
es: Los componentes de Kirigami tienen buen aspecto y son consistentes, mientras que el propio Kirigami proporciona un flujo de trabajo claramente definido. Los usuarios de aplicaciones Kirigami apreciarán las inteligentes elecciones realizadas en la API y el despejado diseño.
fr: Les composants de Kirigami sont beaux et cohérents. Kirigami lui-même fournit un flux de travail clairement défini. Les personnes utilisatrices d'applications sous Kirigami apprécieront les choix judicieux faits dans l'API et la conception épurée.
it: I componenti di Kirigami sono gradevoli alla vista e coerenti, inoltre Kirigami stesso mette a disposizione un flusso di lavoro definito chiaramente. Gli utenti dei programmi in Kirigami apprezzeranno le scelte intelligenti fatte nell'interfaccia e la progettazione ordinata.
nl: De componenten van Kirigami zien er goed uit en zijn consistent en Kirigami zelf biedt een helder gedefinieerde workflow. Gebruikers van Kirigami-toepassingen zullen de slimme keuzes gemaakt in de API en niet-klonterige ontwerp waarderen.
pt_br: Os componentes do Kirigami são bonitos e consistentes, e o próprio Kirigami fornece um fluxo de trabalho claramente definido. Os usuários de aplicativos Kirigami vão gostar das escolhas inteligentes feitas na API e no design organizado.
sl: Komponente Kirigamija so lepe in dosledne, Kirigami sam pa zagotavlja jasno opredeljen potek dela. Uporabniki aplikacij Kirigami bodo cenili pametne odločitve v API in izčiščeno oblikovanje.
sv: Kirigamis komponenter ser bra ut och är likformiga, och själva Kirigami erbjuder ett klart definierat arbetsflöde. Användare av Kirigami-program uppskattar de smarta valen gjorda i programmeringsgränssnittet och den snygga designen.
tr: Kirigami’nin bileşenleri güzel görünür ve tutarlıdır; Kirigami’nin kendisi açıkça tanımlanmış bir iş akışı sağlar. Kirigami uygulamalarının kullanıcıları, API’de yapılan akıllı seçimleri ve düzenli tasarımı takdir edeceklerdir.
uk: Компоненти Kirigami виглядають добре і однорідно, сама Kirigami використовує точно визначені робочі процедури. Користувачів програм Kirigami оцінять продуманий вибір у програмних інтерфейсах та незахаращений дизайн.

source: Discover Kirigami
ca: Descobriu el Kirigami
eo: Malkovru Kirigami
es: Descubra Kirigami
fr: Découvrir Kirigami
it: Scopri Kirigami
ja: Kirigami を探す
ko: Kirigami 둘러보기
nl: Kirigami ontdekken
pl: Odkryj Kirigami
pt: Descubra o Kirigami
pt_br: Conheçer o Kirigami
sl: Odkrijte Kirigami
sv: Upptäck Kirigami
tr: Kirigami’yi Keşfet
uk: Знайомимося з Kirigami
zh_cn: 探索 Kirigami
zh_tw: 探索 Kirigami

source: logo of the Kirigami library
ca: logotip de la biblioteca Kirigami
eo: emblemo de la biblioteko Kirigami
es: Logo de la biblioteca Kirigami
fr: Logo de la bibliothèque Kirigami
he: הלוגו של ספריית Kirigami
it: logo della libreria Kirigami
nl: logo van de Kirigami bibliotheek
pt_br: logotipo da biblioteca do Kirigami
sl: logotip knjižnice Kirigami
sv: Kirigami-bibliotekets logotyp
tr: Kirigami kitaplığının logosu
uk: логотип бібліотеки Kirigami
zh_cn: Kirigami 程序库徽标

source: Getting Started
ca: Com començar
eo: Je la Ekkomenco
es: Primeros pasos
fr: Pour commencer
he: איך מתחילים
it: Primi passi
nl: Hoe te beginnen
pt_br: Primeiros passos
sl: Kako začeti
sv: Komma igång
tr: Başlarken
uk: Початкові зауваження
zh_cn: 新手入门

source: Learn the basics and create your first KDE application
ca: Apreneu els conceptes bàsics i creeu la primera aplicació KDE
eo: Eksciu la bazaĵojn kaj kreu vian unuan KDE-aplikon
es: Aprenda lo básico y cree su primera aplicación de KDE
fr: Apprenez les bases et créez votre première application pour KDE
he: היסודות ליצירת יישום ה־KDE הראשון שלך
it: Impara le basi e crea la tua prima applicazione KDE
nl: Leer de basis en maak uw eerste KDE toepassing
pt_br: Aprenda o básico e crie seu primeiro aplicativo KDE
sl: Naučite se osnov in ustvarite svojo prvo aplikacijo KDE
sv: Lär dig grunderna och skapa ditt första KDE-program
tr: Temel şeyleri öğrenin ve ilk KDE uygulamanızı yaratın
uk: Вивчіть основи і створіть вашу першу програму KDE
zh_cn: 学习基础知识并创建您的第一款 KDE 应用程序

source: KDE logo
ca: Logotip de KDE
eo: KDE-emblemo
es: Logo de KDE
fr: Logo de KDE
he: הלוגו של KDE
it: Logo di KDE
pt_br: Logotipo do KDE
sl: Logotip KDE
sv: KDE:s logotyp
tr: KDE logosu
uk: логотип KDE
zh_cn: KDE 徽标

source: KDevelop
tr: K Geliştir

source: A cross-platform IDE for C, C++, Python, QML/JavaScript and PHP
ca: Un IDE multiplataforma per a C, C++, Python, QML/JavaScript i PHP
eo: Transplatforma IDE por C, C++, Python, QML/JavaScript kaj PHP
es: Un IDE multiplataforma para C, C++, Python, QML/JavaScript y PHP
fr: Un environnement de développement intégré en plate-forme croisée pour C, C++, Python, QML / JavaScript et PHP.
he: סביבת פיתוח משולבת עבור מגוון פלטפורמות ל־C,‏ C++‎,‏ Python,‏ QML/JavaScript ו־PHP
it: Un IDE multi-piattaforma per C, C++, Python, QML/JavaScript e PHP
ja: C、C++、Python、QML/JavaScript、PHP 向けのクロスプラットフォーム IDE
ko: C, C++, Python, QML/자바스크립트, PHP 등을 지원하는 크로스 플랫폼 통합 개발 환경
nl: Een cross-platform IDE voor C, C++, Python, QML/JavaScript en PHP
pl: Wieloplatformowe IDE dla C, C++, Python, QML/JavaScript oraz PHP
pt: Um IDE multi-plataforma para o C, C++, Python, QML/JavaScript e PHP
pt_br: Um IDE multiplataforma para C, C++, Python, QML/JavaScript e PHP
sl: Razvojno okolje (IDE) za navzkrižne platforme v jezikih C, C++, Python, QML/JavaScript in PHP
sv: En integrerad utvecklingsmiljö på flera plattformar för C, C++, Python, QML/JavaScript och PHP
tr: C, C++, Python, QML/JavaScript ve PHP için çapraz platform bir tümleşik geliştirme ortamı
uk: Комплексне середовище розробки мовами C, C++, Python, QML/JavaScript і PHP, яке може працювати на багатьох програмних платформах
zh_cn: 一款适用于 C、C++、Python、QML/JavaScript 和 PHP 的跨平台集成开发环境
zh_tw: 一個支援 C、C++、Python、QML/JavaScript 與 PHP 的跨平台整合開發環境

source: Open Source, powerful and fast, KDevelop offers a seamless development environment to programmers that work on projects of any size. KDevelop helps you get the job done while staying out of your way.
ca: Codi obert, potent i ràpid, el KDevelop ofereix un entorn de desenvolupament sense fissures als programadors que treballen en projectes de qualsevol mida. El KDevelop us ajudarà a fer la feina mentre resta fora del vostre camí.
eo: Malfermfonta, potenca kaj rapida, KDevelop ofertas senjuntan evolumedion al programistoj kiuj laboras pri projektoj de ajna grandeco. KDevelop helpas vin plenumi la taskon dum ĝi ne altrudas sin en via labormaniero.
es: De código abierto, potente y rápido, KDevelop ofrece un entorno de desarrollo perfecto para los programadores que trabajan en proyectos de cualquier tamaño. KDevelop le ayuda a realizar su trabajo sin estorbarle.
fr: « Open Source », puissant et rapide, KDevelop offre un environnement de développement transparent aux développeurs travaillant sur des projets de toute taille. KDevelop vous aide à faire le travail sans quitter votre logique de développement.
it: Open source, potente e veloce, KDevelop offre un ambiente semplice ai programmatori che lavorano su progetti di qualsiasi dimensione. KDevelop ti aiuta a completare il lavoro senza darti fastidio.
ja: オープンソースで、強力で高速な KDevelop はあらゆる規模のプロジェクトに携わるプログラマーにシームレスな開発環境を提供します。KDevelop はあなたの作業を邪魔せずに仕事を終わらせる手伝いをします。
ko: 오픈 소스, 강력함, 빠름. KDevelop은 어떠한 크기의 프로젝트라도 편하게 개발할 수 있는 통합 개발 환경을 제공합니다. KDevelop을 사용하여 집중을 잃지 않고 작업을 완료할 수 있습니다.
nl: Open-source, krachtig en snel, KDevelop biedt een naadloze ontwikkelomgeving aan programmeurs die werken aan projecten van elke grootte. KDevelop helpt u om de job gedaan te krijgen terwijl deze niet in de weg zal zitten.
pl: Otwarty kod, rozbudowany i szybki, KDevelop daje programistom środowisko do programowania, które działa na projektach o dowolnym rozmiarze. KDevelop pomaga wykonywać pracę, nie stojąc przy tym na drodze.
pt: Em código aberto, poderoso e rápido, o KDevelop oferece um ambiente de desenvolvimento transparente para os programadores que lidam com projectos de qualquer tamanho. O KDevelop ajuda-o a concluir as suas tarefas sem se intrometer.
pt_br: Feito em código aberto, poderoso e rápido, o KDevelop oferece um ambiente de desenvolvimento perfeito para programadores que trabalham em projetos de qualquer tamanho. O KDevelop ajuda você a fazer o trabalho sem te atrapalhar.
sl: Odprtokoden, zmogljiv in hiter: KDevelop ponuja prijazno razvojno okolje programerjem, ki delajo na projektih poljubne velikosti. KDevelop vam pomaga opraviti delo, pri čemer vas pusti delati.
sv: KDevelop, med öppen källkod, kraftfullt och snabbt, erbjuder en sömlös utvecklingsmiljö för programmerare som arbetar med projekt av vilken storlek som helst. KDevelop hjälper till att få jobbet gjort medan det håller sig ur vägen.
tr: Açık kaynaklı, güçlü ve hızlı. K Geliştir, her boyutta proje üzerinde çalışan programcılara sorunsuz bir geliştirme ortamı sunar. K Geliştir, yolunuza çıkmadan işi bitirmenize yardımcı olur.
uk: Потужна і швидка, з відкритим кодом KDevelop пропонує вам самодостатнє середовище розробки для програмістів, які працюють із проєктами будь-якого розміру. KDevelop допоможе вам виконати роботу, не заважаючи вам ні у чому.
zh_cn: KDevelop 是一款自由开源、强大高效的开发工具，为从事任何规模项目开发的程序员提供无缝的开发环境。KDevelop 能助您高效完成工作，同时又不会妨碍您的操作。
zh_tw: 開源、功能強大且快速。KDevelop 提供能夠處理任何專案大小的無縫開發環境。KDevelop 幫助您做好您的工作而不阻礙您。

source: Get KDevelop
ca: Obteniu el KDevelop
eo: Ekprenu KDevelop
es: Obtener KDevelop
fr: Obtenir KDevelop
it: Ottieni KDevelop
ja: KDevelop を入手する
ko: KDevelop 설치
nl: KDevelop ophalen
pl: Pobierz KDevelop
pt: Obtenha o KDevelop
pt_br: Baixar o KDevelop
sl: Pridobi KDevelop
sv: Hämta KDevelop
tr: K Geliştir’i Al
uk: Отримати KDevelop
zh_cn: 获取 KDevelop
zh_tw: 取得 KDevelop

source: screenshot of app KDevelop
ca: captura de pantalla de l'aplicació KDevelop
eo: ekrankopio de apo KDevelop
es: Captura de pantalla de KDevelop
fr: Copie d'écran de l'application KDevelop
he: צילום מסך של היישום KDevelop
it: schermata del programma KDevelop
nl: schermafdruk van toepassing KDevelop
pt_br: captura de tela do aplicativo KDevelop
sl: posnetek zaslona aplikacije KDevelop
sv: skärmbild av programmet KDevelop
tr: K Geliştir ekran görüntüsü
uk: знімок вікна програми KDevelop
zh_cn: KDevelop 的应用程序截图

source: Documentation
ca: Documentació
eo: Dokumentaro
es: Documentación
he: תיעוד
it: Documentazione
ja: 資料
ko: 문서
nl: Documentatie
pl: Dokumentacja
pt: Documentação
pt_br: Documentação
sl: Dokumentacija
sv: Dokumentation
tr: Belgelendirme
uk: Документація
zh_cn: 文档
zh_tw: 說明文件

source: From beginners to experienced Qt developers, here is all you will need to know to start developing KDE applications.
ca: Des dels principiants fins als experimentats desenvolupadors de les Qt, aquí hi ha tot el que cal saber per a començar a desenvolupar aplicacions KDE.
eo: De komencantoj ĝis spertaj programistoj de Qt, jen ĉio, kion vi bezonos scii por komenci disvolvi KDE-aplikaĵojn.
es: Desde principiantes hasta experimentados desarrolladores de Qt, esto es todo lo que necesita para saber cómo empezar a desarrollar aplicaciones de KDE.
fr: Des débutants aux développeurs Qt expérimentés, voici tout ce que vous devez savoir pour commencer à développer des applications pour KDE.
it: Dai principianti agli sviluppatori esperti con Qt, qui trovi tutto quello di cui hai bisogno per iniziare a sviluppare le applicazioni di KDE.
ja: 初心者から熟練した Qt の開発者まで、ここに KDE アプリケーションの開発を始めるのに知る必要のあるすべてのものが揃っています。
ko: 초보자부터 전문 Qt 개발자까지 모두가 참조할 수 있는 KDE 프로그램 개발을 시작할 때 필요한 자료입니다.
nl: Vanaf beginners tot ervaren Qt-ontwikkelaars, hier is alles wat u nodig zult hebben om te starten met het ontwikkelen van KDE-toepassingen.
pl: Od początkujących do doświadczonych programistów Qt, tutaj znajduje się wszystko, czego potrzebujesz, aby zacząć rozwijać aplikacje dla KDE.
pt: Dos principiantes aos programadores experientes do Qt, aqui está tudo o que precisa de saber para começar a desenvolver aplicações para o KDE.
pt_br: De iniciantes a desenvolvedores experientes em Qt, aqui temos tudo o que você precisa para começar a desenvolver aplicativos KDE.
sl: Za začetnike in izkušene razvijalce Qt je tukaj vse, kar boste rabili vedeti, da začnete razvijati aplikacije KDE.
sv: Här finns allt som man behöver veta för att börja utveckla KDE-program, från nybörjare till erfarna Qt-utvecklare.
tr: Yeni başlayanlardan deneyimli Qt geliştiricilerine kadar, KDE uygulamalarını geliştirmeye başlamak için bilmeniz gereken her şey burada.
uk: Від початківців до досвідчених розробників на Qt — тут є усе, що знадобиться вам для того, щоб почати розробку програм KDE.
zh_cn: 无论是 Qt 开发的新手还是老手，您都可以在这里找到着手开发 KDE 应用程序所需的一切知识。
zh_tw: 不論您是初心者還是富有經驗的 Qt 開發者，在此有您要開始開發 KDE 應用程式的所有資訊。

source: Design
ca: Disseny
eo: Dezajno
es: Diseño
fr: Conception
he: עיצוב
it: Progettazione
ja: デザイン
ko: 디자인
nl: Ontwerp
pl: Projekt
pt: Desenho
sl: Oblikovanje
tr: Tasarım
uk: Дизайн
zh_cn: 设计
zh_tw: 設計

source: Read KDE's human interface guidelines
ca: Llegiu les directrius d'interfície humana de KDE
es: Consulte las directrices de interfaces humanas de KDE
fr: Veuillez lire les directives sur les interfaces graphiques de KDE
he: מעבר לקריאת הנחיות ממשק אנוש של KDE
it: Leggi le linee guida per l'interfaccia umana di KDE
nl: Lees richtlijnen voor menselijk interface van KDE
pt_br: Leia as diretrizes da interface humana do KDE
sl: Preberite smernice za človeški vmesnik KDE
sv: Läs KDE:s riktlinjer för mänskliga gränssnitt
tr: KDE’nin insan arayüzü yönergelerini okuyun
uk: Прочитайте настанови зі зручності інтерфейсу KDE
zh_cn: 阅读 KDE 人机界面指南

source: Tutorials
ca: Guies d'aprenentatge
es: Tutoriales
fr: Tutoriels
he: מדריכים
it: Esercitazioni
nl: Handleidingen
pt_br: Tutoriais
sl: Vadnice
sv: Handledningar
tr: Öğreticiler
uk: Покрокові настанови
zh_cn: 教程

source: Learn how to build KDE apps and themes
ca: Apreneu com construir aplicacions i temes de KDE
es: Aprenda a compilar aplicaciones y temas de KDE
fr: Apprenez comment créer des applications et des thèmes pour KDE
he: מידע על בניית יישומים וערכות עיצוב של KDE
it: Impara a creare applicazioni e temi per KDE
nl: Leer hoe KDE-toepassingen en thema's te bouwen
pt_br: Aprenda a criar aplicativos e temas do KDE
sl: Naučite se graditi aplikacije in teme KDE
sv: Lär dig hur man bygger KDE-program och teman
tr: Nasıl KDE uygulamaları ve temaları yapacağınızı öğrenin
uk: Дізнайтеся про побудову програм та тем KDE
zh_cn: 学习如何构建 KDE 应用程序和主题

source: Read API docs for KDE's development libraries
ca: Llegiu els documents de les API de les biblioteques de desenvolupament de KDE
es: Consulte la documentación de la API de las bibliotecas de desarrollo de KDE
fr: Lire la documentation de l’API pour les bibliothèques de développement de KDE
it: Leggi la documentazione delle API delle librerie di sviluppo di KDE
nl: Lees de API documenten voor ontwikkelbibliotheken van KDE
pt_br: Leia a documentação da API para as bibliotecas de desenvolvimento do KDE
sl: Preberite dokumentacijo API-jev za razvojne knjižnice KDE
sv: Läs dokument om programmeringsgränssnittet för KDE:s utvecklingsbibliotek
tr: KDE’nin geliştirme kitaplıkları için olan API belgelerini okuyun
uk: Прочитайте документацію до програмного інтерфейсу бібліотек для розробки KDE
zh_cn: 阅读 KDE 开发库的 API 文档

source: Distribute
ca: Distribució
eo: Distribui
es: Distribución
fr: Distribuer
he: הפצה
it: Distribuisci
ja: 貢献
ko: 배포
nl: Verdelen
pl: Rozmieść
pt: Distribuir
pt_br: Distribuição
sl: Razširjajte
sv: Fördela
tr: Dağıt
uk: Поширення
zh_cn: 分发
zh_tw: 發佈

source: Get your KDE app in front of users
ca: Feu que la vostra aplicació KDE arribi als usuaris
es: Ponga su aplicación al alcance de los usuarios.
fr: Développez votre application pour KDE en présence de personnes utilisatrices
it: Metti la tua applicazione di KDE di fronte agli utenti
nl: Krijg uw KDE-toepassing in het zicht van gebruikers
pt_br: Coloque seu aplicativo KDE o mais próximo possível dos usuários
sl: Predstavite svojo aplikacijo uporabnikom KDE
sv: Låt användare ta del av ditt KDE-program
tr: KDE uygulamanızı kullanıcıların önüne çıkarın
uk: Покажіть вашу програму KDE користувачам
zh_cn: 将您开发的 KDE 应用呈现给用户

source: API
sv: Programmeringsgränssnitt
uk: Програмний інтерфейс

source: The line between desktop and mobile is blurring and users expect the same quality experience on every device. Applications using Kirigami adapt brilliantly to mobile, desktop, TVs, infortainment systems and everything in between.
ko: 데스크톱과 모바일 사이의 경계선은 점점 흐려지고 있으며, 사용자들은 모든 장치에서 비슷한 사용자 경험을 기대하고 있습니다. Kirigami를 사용하는 프로그램은 모바일, 데스크톱, TV, 인포테인먼트 시스템뿐만 아니라 그 사이에 있는 어떤 것에도 융합됩니다.

source: Kirigami's components are goodlooking and consistent, and Kirigami itself provides a clearly defined workflow. Users of Kirigami apps will appreciate the smart choices made in the API and uncluttered design.
ko: Kirigami의 구성 요소는 미적인 요소뿐만 아니라 일관성도 고려되었으며, Kirigami 자체적으로도 작업의 흐름을 정합니다. Kirigami 앱을 사용해 보았다면 API 설계 방식과 번잡하지 않은 디자인을 높게 살 것입니다.

source: Learn about KDE's design guidelines for apps and icons
ko: KDE의 앱과 아이콘 디자인 가이드라인 알아보기

source: Develop
ko: 개발

source: Check out the tools and libraries that help you build KDE apps
ko: KDE 앱을 만들 때 필요한 도구와 라이브러리 알아보기

source: Get your application in front of users
ko: 내 프로그램을 사용자에게 배포하기
