Repository: KDE/documentation-develop-kde-org
Catalog: po/*/hig.po
Languages: ca, eo, es, fi, fr, it, ko, nl, pl, pt, pt_br, sl, sv, tr, uk

source: Design determines not only how well something fulfills its functional purpose, but also how enjoyable it is to interact with. If either is lacking, the result will be frustrating. People won't want to use a poorly-designed app, and if forced to, they'll be resentful and spread negativity about it. Avoid this through good design!
ca: El disseny determina no només com de bé compleix alguna cosa el seu propòsit funcional, sinó també com d'agradable és interactuar amb ell. Si falta alguna cosa, el resultat serà frustrant. La gent no voldrà utilitzar una aplicació mal dissenyada, i si es veu obligada a fer-ho, es mostraran ressentits i difondran negativitat sobre això. Eviteu-ho amb un bon disseny!
nl: Ontwerp bepaalt niet alleen hoe goed het zijn functionele doel vervult, maar ook hoe plezierig het is om er mee om te gaan. Als een van tweeën ontbreekt, zal het resultaat frustrerend zijn. Mensen willen geen slecht ontworpen toepassing en als ze het moeten gebruiken, zullen dat met tegenzin doen en negativiteit erover verspreiden. Vermijd dat door een goed ontwerp!
sv: Design avgör inte bara hur väl något uppfyller sitt funktionella syfte, utan också hur njutbart det är att interagera med. Om någondera saknas blir resultatet frustrerande. Folk vill inte använda ett dåligt utformat program, och om de tvingas till det blir de förbittrade och sprider negativitet om det. Undvik det genom bra design!
uk: Дизайн визначає не тільки те, наскільки добре щось виконує своє функціональне призначення, але й наскільки приємно з ним взаємодіяти. Якщо чогось із цього не вистачає, результат буде неприємним. Люди не захочуть користуватися погано розробленою програмою, а якщо їх змусять, вони обурюватимуться та поширюватимуть негатив. Уникніть цього завдяки продуманому дизайну!

source: Welcome to the KDE Human Interface Guidelines! Following them will help you build a beautiful and powerful app that feels at home in a KDE environment, and works well outside of it. Users will learn how to use it quickly, accomplish their goals with ease, and encounter fewer issues requiring support.
ca: Us donem la benvinguda a les Directrius d'Interfície Humana de KDE! Seguir-les us ajudarà a construir una aplicació bonica i potent que se senti com a casa en un entorn KDE i que funcioni bé fora d'ell. Els usuaris aprendran a utilitzar-lo ràpidament, compliran els seus objectius amb facilitat i trobaran menys problemes que requereixin suport.
nl: Welkom bij de richtlijnen van KDE voor het menselijke interface (HIG)! Ze volgen zal u helpen een mooie en krachtige toepassing te bouwen die zich thuis voelt in de KDE omgeving en goed werkt erbuiten. Gebruikers zullen het snel leren gebruiken, hun doelen met gemak halen en minder problemen tegenkomen die ondersteuning vereisen.
sv: Välkommen till KDE:s riktlinjer för människa-maskin-gränssnitt! Att följa dem hjälper dig att bygga ett snyggt och kraftfullt program som känns hemma i en KDE-miljö och fungerar bra utanför den. Användare lär sig snabbt att använda det, uppnå sina mål med lätthet och stöta på färre problem som kräver support.

source: This document is a set of design guidelines, not instructions for implementing every specific component. While some technical guidance will be provided, much more detail can be found in components' own [usage](https://develop.kde.org/docs/) and [API](https://api.kde.org/) documentation as well as the [source code of existing KDE apps](https://invent.kde.org/explore/groups?sort=name_asc). It's more of a *what* and a *why*, not a *how*.
ca: Aquest document és un conjunt de directrius de disseny, no instruccions per implementar cada component específic. Tot i que es proporcionarà alguna guia tècnica, es pot trobar molt més detall en l'[ús](https://develop.kde.org/docs/) i l'[API](https://api.kde.org/) de la pròpia documentació, així com el [codi font de les aplicacions KDE existents](https://invent.kde.org/explore/groups?sort).nameasc). És més un *què* i un *per què*, que no pas un *com*.
nl: Dit document is een set met ontwerprichtlijnen, geen instructies voor het implementeren van elk specifieke component. Terwijl enige technische begeleiding geleverd zal worden, zal veel meer detail te vinden zijn in eigen [gebruik](https://develop.kde.org/docs/) van componenten en [API](https://api.kde.org/) documentatie evenals de [broncode van bestaande KDE toepassingen](https://invent.kde.org/explore/groups?sort=name_asc). Het is meer een *wat* en een *waarom*, geen *hoe*.
sv: Dokument är en uppsättning riktlinjer för design, inte instruktioner för implementering av varje specifik komponent. Även om viss teknisk vägledning tillhandahålls, kan mycket mer information hittas i komponenternas egen [användning](https://develop.kde.org/docs/) och [API](https://api.kde.org/ ) dokumentation samt [källkoden för befintliga KDE-program](https://invent.kde.org/explore/groups?sort=name_asc). Det är mer ett *vad* och ett *varför*, inte ett *hur*.
