Repository: KDE/documentation-develop-kde-org
Catalog: po/*/hig.po
Languages: ca, eo, es, fi, fr, it, ko, nl, pl, pt, pt_br, sl, sv, tr, uk

source: Design involves targeted decisions and trade-offs that bring a project closer to its intended goals and usage paradigms. The best apps know which users and use cases they're targeting, and which ones they leave for others. It's better to succeed by focusing on what you can do well than to spread yourself thin and fail. Under-promise and over-deliver, never the reverse.
ca: El disseny implica decisions dirigides i compromisos que acosten un projecte als seus objectius i paradigmes d'ús. Les millors aplicacions saben quins usuaris i casos d'ús estan apuntant, i quins deixen per a altres. És millor tenir èxit centrant-se en el que pots fer bé que dispersar-se i fallar. Promeses reduïdes i lliuraments augmentats, mai al revés.
eo: Dezajno implikas laŭcelajn decidojn kaj kompromisojn kiuj alportas projekton pli proksime al ĝiaj intencitaj celoj kaj uzadparadigmoj. La plej bonaj programoj scias kiujn uzantojn kaj uzkazojn ili celas, kaj kiujn ili lasas al aliaj. Estas pli bone sukcesi koncentriĝante pri tio, kion vi povas bone fari, ol disvastigi vin maldika kaj malsukcesi. Subpromesu kaj tro liveru, neniam inverse.
es: El diseño implica decisiones específicas y compensaciones que acercan un proyecto a sus objetivos previstos y paradigmas de uso. Las mejores aplicaciones saben a qué usuarios y casos de uso están enfocadas, y cuáles dejan para otros. Es mejor tener éxito concentrándose en lo que se puede hacer bien que extenderse y fracasar. Pocas promesas y muchas entregas, nunca al revés.
fr: La conception implique des décisions et des compromis ciblés permettant de rapprocher un projet de ses objectifs et de ses paradigmes d'utilisation. Les meilleures applications savent quelles personnes vont les utiliser et quels en sont les cas d'utilisation visés et les cas qu'elles laissent aux autres applications. Il est préférable de réussir en se concentrant sur ce que vous pouvez bien faire bien plutôt que de vous éparpiller et d'échouer. Promettre moins et fournir plus mais jamais l'inverse.
it: La progettazione implica decisioni mirate e compromessi che avvicinano un progetto agli obiettivi previsti e ai paradigmi di utilizzo. Le migliori applicazioni sanno a quali utenti e casi d'uso si rivolgono e quali lasciano ad altri. È meglio avere successo concentrandoti su ciò che sai fare bene piuttosto che dilapidarti e non riuscire. Poche promesse e numerosi rilasci, mai il contrario.
nl: Ontwerpen houd in gerichte beslissingen en afwegingen die een project dichter bij zijn bedoelde doelen en gebruiksparadigma's brengt. De beste toepassingen weten op welke gebruikers en gebruiksgevallen ze zich richten en welke ze overlaten voor anderen. Het is beter succes te hebben door de focus te richten op wat u goed kan doen dan van alles te doen en te falen. Onder-belofte en over-aflevering, nooit het omgekeerde.
pt_br: O design envolve decisões e compensações direcionadas que aproximam um projeto dos objetivos e paradigmas de uso pretendidos. Os melhores aplicativos sabem quais usuários e casos de uso estão almejando e quais deixam para outros. É melhor ter sucesso focando no que você faz bem do que se dispersar e fracassar. Prometa pouco e entregue muito, nunca o contrário.
sl: Oblikovanje vključuje ciljno usmerjene odločitve in kompromise, ki projekt približajo predvidenim ciljem in paradigmam uporabe. Najboljše aplikacije vedo, na katere uporabnike in primere uporabe ciljajo ter katere pustijo drugim. Bolje je uspeti tako, da se osredotočite na tisto, kar lahko naredite dobro, kot pa se raztegniti in spodleteti. Obljubljajte premalo in izpolnite preveč, nikoli obratno.
sv: Design innebär riktade beslut och avvägningar som för ett projekt närmare dess avsedda mål och användningsparadigm. De bästa programmen vet vilka användare och användningsfall de riktar sig till och vilka de lämnar åt andra. Det är bättre att lyckas genom att fokusera på vad du kan göra bra än att sprida sig för brett och misslyckas. Lova lite och leverera mer, aldrig tvärtom.
tr: Tasarım, bir projeyi amaçlanan hedeflerine ve kullanım paradigmalarına yaklaştıran hedefli kararları ve ödünleşmeleri içerir. En iyi uygulamalar, hangi kullanıcıları ve kullanıcıları hedeflediklerini ve hangilerini başkaları için bıraktıklarını bilir. Kendinizi zayıflatmak ve başarısız olmaktan çok iyi yapabileceğiniz şeylere odaklanarak başarılı olmak daha yeğdir. Her zaman daha az söz verin ve daha fazlasını sağlayın; hiçbir zaman tersini yapmayın.
uk: Частиною проєктування є прийняття цілеспрямованих рішень і використання компромісів, які наближають проєкт до запланованих цілей і парадигм використання. Найкращі програми знають, на яких користувачів і випадки використання вони націлені, а які слід віддати іншим програмам. Краще досягти успіху, зосередившись на тому, що ви вмієте робити добре, ніж розтягнутися й зазнати невдачі. Менше обіційте і більше реалізуйте, але ніколи не навпаки.

source: Topics not covered
ca: Temes no coberts
eo: Temoj ne kovritaj
es: Temas no cubiertos
fr: Sujets non traités
it: Argomenti non trattati
nl: Niet gedekte onderwerpen
pt_br: Tópicos não abordados
sl: Teme niso zajete
sv: Ämnen som inte tas upp
tr: Kapsanmayan konular
uk: Теми, які тут не висвітлено

source: This document is a set of design guidelines, not instructions for implementing every specific component. While some technical guidance will be provided, much more detail can be found in the components' own [usage](https://develop.kde.org/docs/) and [API](https://api.kde.org/) documentation as well as the [source code of existing KDE apps](https://invent.kde.org/explore/groups?sort=name_asc). It's more of a *what* and a *why*, not a *how*.
eo: Ĉi tiu dokumento estas aro de dezajnaj gvidlinioj, ne instrukcioj por efektivigi ĉiun specifan komponanton. Dum iu teknika gvidado estos provizita, multe pli da detaloj troveblas en la propra dokumentaro pri [uzado](https://develop.kde.org/docs/) kaj [API](https://api.kde.org/) de la komponantoj. Temas pli pri *kio* kaj *kial*, ne *kiel*.
es: Este documento es un conjunto de directrices de diseño, no las instrucciones para implementar cada componente específico. Si bien se proporcionará cierta orientación técnica, se pueden encontrar muchos más detalles en el [uso](https://develop.kde.org/docs/) y la documentación de la [API](https://api.kde.org/) de los propios componentes, así como en el [código fuente de las aplicaciones de KDE](https://invent.kde.org/explore/groups?sort=name_asc). Es más un *qué* y un *por qué*, no un *cómo*.
fr: Ce document regroupe un ensemble de directives de conception et non des instructions pour la mise en œuvre de chaque composant spécifique. Bien que certaines directives techniques soient fournies, vous trouverez beaucoup plus de détails dans les documentations [spécifiques à chaque composant](https://develop.kde.org/docs/) et dans [l'interface API](https://api.kde.org/) ainsi que dans le [code source des applications KDE existantes](https://invent.kde.org/explore/groups?sort=name_asc). C'est plus un *quoi* et un *pourquoi*, plutôt qu'un *comment*.
it: Questo documento è un insieme di linee guida di progettazione, non istruzioni per l'implementazione di ogni componente specifico. Anche se saranno fornite alcune indicazioni tecniche, molti più dettagli possono sono disponibili nella documentazione di [utilizzo](https://develop.kde.org/docs/) e dell'[API](https://api.kde.org/) dei componenti, così come il [codice sorgente delle applicazioni KDE esistenti](https://invent.kde.org/explore/groups?sort=name_asc). È più un *cosa* e un *perché*, non un *come*.
pt_br: Este documento é um conjunto de diretrizes de design, não instruções para implementar cada componente específico. Embora algumas orientações técnicas sejam fornecidas, muito mais detalhes podem ser encontrados na documentação [de uso](https://develop.kde.org/docs/) e [da API](https://api.kde.org/) dos próprios componentes, bem como no [código-fonte dos aplicativos KDE existentes](https://invent.kde.org/explore/groups?sort=name_asc). É mais um *o quê* e um *por quê*, não um *como*.
sl: Ta dokument je zbirka smernic za načrtovanje in ne navodil za implementacijo vsake posamezne komponente. Čeprav bo na voljo nekaj tehničnih navodil, je veliko več podrobnosti mogoče najti v komponentah v [uporabi](https://develop.kde.org/docs/) in [API] (https://api.kde.org/) dokumentacijo kot tudi [izvorno kodo obstoječih aplikacij KDE](https://invent.kde.org/explore/groups?sort=name_asc). Gre bolj za *kaj* in *zakaj*, ne za *kako*.
tr: Bu belge, her bir bileşeni nasıl gerçekleyeceğinize odaklanan talimatlardan çok bir nevi tasarım kılavuzudur. Bir nebze teknik konularda yol gösterilse de, bileşenlerin kendi [kullanım](https://develop.kde.org/docs/) ve [API](https://api.kde.org/) belgelendirmelerinde ve [var olan KDE uygulamalarının kaynak kodlarında](https://invent.kde.org/explore/groups?sort=name_asc) çok daha ayrıntılı bilgi bulunabilir. Bu, bir “nasıl”dan ziyade *ne* ve *neden* konularına yöneliktir.
uk: Цей документ є набором рекомендацій щодо проєктування, а не інструкцій щодо впровадження кожного конкретного компонента. Хоча деякі технічні вказівки будуть надані, набагато більше подробиць можна знайти на сторінці [використання](https://develop.kde.org/docs/) компонентів та [програмного інтерфейсу](https://api.kde.org/), а також на сторінках [початкового коду наявних програм KDE](https://invent.kde.org/explore/groups?sort=name_asc). Тут розміщено здебільшого відомості про *що* і *чому*, а не *як*.

source: This document is not intended to be an ironclad law code. By learning and following the rules, you'll understand how to safely innovate within the guidelines, and when it can be appropriate to break them if it produces a superior result.
ca: Aquest document no pretén ser un codi legal forjat en ferro. Aprenent i seguint les normes, entendreu com innovar amb seguretat dins de les directrius, i que pot ser adequat trencar-les si produeix un resultat millor.
eo: Ĉi tiu dokumento ne intencas esti nepra leĝkodo. Lernante kaj sekvante la regulojn, vi komprenos kiel sekure novigi ene de la gvidlinioj, kaj kiam povas esti konvene rompi ilin se ĝi produktas superan rezulton.
es: Este documento no pretende ser un estricto código legal. Al aprender y seguir las reglas, comprenderá cómo innovar de manera segura dentro de las directrices y cuándo puede ser apropiado romperlas si se obtiene un resultado superior.
fr: Ce document n'est pas destiné à être un code juridique à toute épreuve. En apprenant et en suivant les règles, vous comprendrez comment innover en toute sécurité dans le respect des directives et quand il peut être approprié de les enfreindre si cela produit un meilleur résultat.
it: Questo documento non vuole essere un codice di leggi ferree. Imparando e seguendo le regole, capirai come innovare in sicurezza nel rispetto delle linee guida e quando può essere opportuno infrangerle se ciò produce un risultato superiore.
nl: Dit document is niet bedoeld om een ijzersterke wet voor coderen te zijn. Door het leren en volgen van de regels, zult u begrijpen hoe veilig te innoveren binnen de richtlijnen en wanneer het toepasselijk kan zijn om met ze te breken als het een superieur resultaat produceert.
pt_br: Este documento não pretende ser um código de leis rígido. Ao aprender e seguir as regras, você entenderá como inovar com segurança dentro das diretrizes e quando pode ser apropriado quebrá-las caso isso produza um resultado superior.
sl: Ta dokument ni mišljen kot strog pravni kodeks. Z učenjem in upoštevanjem pravil boste razumeli, kako varno inovirati v smernicah in kdaj je primerno, da jih kršite, če prinašajo vrhunske rezultate.
sv: Dokumentet är inte avsett att vara en oangripbar lag. Genom att lära dig och följa reglerna förstår du hur du säkert kan förnya dig inom riktlinjerna och när det kan vara lämpligt att bryta mot dem om det ger ett överlägset resultat.
tr: Bu belgenin bir katı töre olması amaçlanmamıştır. Kuralları öğrenerek ve izleyerek, yönergeler içinde nasıl güvenlice inovatif olacağınızı ve üstün bir sonuç ortaya çıkarsa onları ne zaman törpülemenin uygun olabileceğini anlayacaksınız.
uk: Цей документ не має на меті бути жорстким кодексом законів. Вивчивши та дотримуючись правил, ви зрозумієте, як безпечно впроваджувати інновації в межах настанов і коли їх доцільно порушувати, якщо це дає чудовий результат.

source: Contributing
ca: Col·laboració
eo: Kontribuado
es: Colaboración
fr: Contributions
it: Contribuire
nl: Bijdragen
pt_br: Contribuindo
sl: Prispevki
sv: Bidra
tr: Katkıda bulunmak
uk: Участь у розробці

source: This is a living document, intended to be updated over time to reflect current KDE design trends and best practices. Contributions are welcome!
ca: Aquest és un document viu, destinat a actualitzar-se amb el temps per a reflectir les tendències actuals del disseny de KDE i les millors pràctiques. Les col·laboracions són benvingudes!
eo: Ĉi tio estas vivanta dokumento, intencita por esti ĝisdatigita laŭlonge de la tempo por reflekti aktualajn KDE-dezajnajn tendencojn kaj plej bonajn praktikojn. Kontribuoj estas bonvenaj!
es: Este es un documento vivo, destinado a actualizarse a lo largo del tiempo para reflejar las tendencias y las mejores prácticas de diseño actual de KDE. ¡Las colaboraciones son bienvenidas!
fr: Il s'agit d'un document évolutif, destiné à être mis à jour au fil du temps pour refléter les tendances actuelles de la conception de KDE et les meilleures pratiques. Toutes les contributions sont les bienvenues !
it: Questo è un documento vivo, destinato ad essere aggiornato nel tempo per riflettere le attuali tendenze e le migliori pratiche di progettazione di KDE. I contributi sono benvenuti!
nl: Dit is een levend document, bedoeld om in de tijd bijgewerkt te worden om huidige ontwerptrends en beste praktijken in KDE weer te geven. Bijdragen zijn welkom!
pt_br: Este é um documento dinâmico, que deve ser atualizado ao longo do tempo para refletir as tendências atuais de design e as melhores práticas do KDE. Contribuições são bem-vindas!
sl: To je živi dokument, ki naj bi ga sčasoma posodobili, da odraža trenutne trende oblikovanja in najboljše prakse KDE. Prispevki so dobrodošli!
sv: Det här är ett levande dokument, avsett att uppdateras med tiden för att återspegla aktuella KDE-designtrender och bästa praxis. Bidrag är välkomna!
tr: Bu, geçerli KDE tasarım eğilimlerini ve en iyi pratikleri yansıtması için hazırlanan, canlı ve yaşayan bir belgedir. Her zaman katkılarınızı bekleriz.
uk: Це документ, який може змінюватися, призначений для оновлення з часом, щоб відбивати поточні тенденції дизайну KDE та найкращі практики. Будемо раді вашому внеску!

source: Content is written in [Markdown](https://commonmark.org/help/), and the source files are hosted in a [Git repository](https://invent.kde.org/documentation/develop-kde-org.git). To quickly edit a page, the GitLab editor can be opened on any page with the “Edit this page” button in the drawer on the right. Tasks and changes are organized via https://invent.kde.org. To learn how to submit changes, see the [README file](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
ca: El contingut està escrit en [Markdown](https://commonmark.org/help/), i els fitxers font estan allotjats en un [repositori Git](https://invent.kde.org/documentation/develop-kde-org.git). Per a editar ràpidament una pàgina, l'editor de GitLab es pot obrir en qualsevol pàgina amb el botó «Edita aquesta pàgina» al calaix de la dreta. Les tasques i els canvis s'organitzen a través de https://invent.kde.org. Per a aprendre a enviar canvis, vegeu el fitxer [README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
eo: Enhavo estas skribita en [Markdown](https://commonmark.org/help/), kaj la fontdosieroj estas gastigitaj en [Git-deponejo](https://invent.kde.org/documentation/develop-kde-org.git). Por rapide redakti paĝon, la GitLab-redaktilo povas esti malfermita sur iu ajn paĝo per la butono “Redakti ĉi tiun paĝon” en la tirkesto dekstre. Taskoj kaj ŝanĝoj estas organizitaj per https://invent.kde.org. Por ekscii kiel sendi ŝanĝojn, vidu la [README-dosieron](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
es: El contenido está escrito en [Markdown](https://commonmark.org/help/) y los archivos fuente residen en un [repositorio Git](https://invent.kde.org/documentation/develop-kde-org.git). Para editar rápidamente una página, se puede abrir el editor de GitLab en cualquier página con el botón «Editar esta página» que hay a la derecha. Las tareas y las modificaciones se organizan mediante https://invent.kde.org. Para aprender a enviar cambios, consulte el [archivo README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
fr: Le contenu est écrit en langage [Markdown](https://commonmark.org/help/). Les fichiers sources sont hébergés dans un [dépôt Git](https://invent.kde.org/documentation/develop-kde-org.git). Pour modifier rapidement une page, l'éditeur de GitLab peut être ouvert sur n'importe quelle page grâce au bouton dans le panneau de droite. Les tâches et les modifications sont organisées grâce aux services du site « https://invent.kde.org ». Pour savoir comment soumettre des modifications, veuillez consulter le [fichier « README »](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
it: Il contenuto è scritto in [Markdown](https://commonmark.org/help/) e i file sorgente sono ospitati in un [deposito Git](https://invent.kde.org/documentation/develop-kde-org.git). Per modificare rapidamente una pagina, l'editor di GitLab può essere aperto su qualsiasi pagina con il pulsante «Edit this page» nel cassetto a destra. Le attività e le modifiche sono organizzate tramite https://invent.kde.org. Per sapere come inviare modifiche, vedi il [file README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
nl: Inhoud is geschreven in [Markdown](https://commonmark.org/help/) en de bronbestanden staan in een [Git-opslagruimte](https://invent.kde.org/documentation/develop-kde-org.git). Om snel een pagina te bewerken kan de GitLab-bewerker geopend worden op elke pagina met de knop “Deze pagina bewerken” in de schuiflade rechts. Taken en wijzigingen zijn georganiseerd via https://invent.kde.org. Om te leren hoe wijzigingen in te dienen, zie het [README bestand](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
pt_br: O conteúdo foi escrito em [Markdown](https://commonmark.org/help/), e os arquivos de código-fonte são hospedados em um [repositório Git](https://invent.kde.org/documentation/develop-kde-org.git). Para editar uma página rapidamente, o editor do GitLab pode ser aberto em qualquer página com o botão "Editar esta página" na gaveta à direita. Tarefas e alterações são organizadas em https://invent.kde.org. Para saber como enviar alterações, consulte o arquivo [README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
sl: Vsebina je napisana v [Markdown](https://commonmark.org/help/), izvorne datoteke pa gostujejo v [Git repozitoriju](https://invent.kde.org/documentation/develop-kde-org.git). Za hitro urejanje strani lahko urejevalnik GitLab odprete na kateri koli strani z gumbom “Uredi to stran“ v predalu na desni. Naloge in spremembe so organizirane preko https://invent.kde.org. Če želite izvedeti, kako predložiti spremembe, glejte [datoteko README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
sv: Innehållet är skrivet i [Markdown](https://commonmark.org/help/), och källfilerna finns i ett [Git-arkiv](https://invent.kde.org/documentation/develop-kde-org .git). För att snabbt redigera en sida kan editorn i GitLab öppnas på vilken sida som helst med knappen "Edit this page" i lådan till höger. Uppgifter och ändringar organiseras via https://invent.kde.org. För att lära dig hur du skickar in ändringar, se [README-filen](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).
tr: İçerik [Markdown](https://commonmark.org/help/) ile yazılır ve kaynak dosyaları bir [Git deposunda](https://invent.kde.org/documentation/develop-kde-org.git) bulunur. Bir sayfayı tez düzenlemek için GitLab düzenleyicisi, her bir sayfanın sağ üst köşesindeki çekmecede bulunan “Edit This Page” düğmesi ile kullanılabilir. Görevler ve değişiklikler https://invent.kde.org ile organize edilir. Nasıl değişiklikler göndereceğinizi öğrenmek için [README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md) dosyasına bakın.
uk: Початковий вміст написано мовою [Markdown](https://commonmark.org/help/), а файли коду розміщено у [сховищі Git](https://invent.kde.org/documentation/develop-kde-org.git). Завдання і зміни упорядковано на https://invent.kde.org. Щоб ознайомитися із правилами надсилання змін, прочитайте [файл README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md). Для швидкого редагування сторінки, можна на будь-якій сторінці відкрити редактор GitLab за допомогою кнопки «Редагувати цю сторінку» на висувній панелі праворуч. Завдання та зміни організовано за допомогою https://invent.kde.org. Щоб дізнатися, як надіслати зміни, перегляньте [файл README](https://invent.kde.org/documentation/develop-kde-org/-/blob/master/README.md).

source: Read the guidelines
eo: Legu la gvidliniojn
es: Leer las directrices
fr: Lire les directives
it: Leggi le linee guida
pt_br: Leia as diretrizes
sl: Preberite smernice
tr: Yönergeleri okuyun
uk: Ознайомитися із настановами

source: Click on any of these tiles to jump to a page:
eo: Alklaku iun el ĉi tiuj kaheloj por salti al paĝo:
es: Pulse en cualquiera de esos apartados para ir a una página:
fr: Cliquez sur l'une de ces tuiles pour accéder à une page :
it: Fai clic su uno di questi riquadri per passare a una pagina:
pt_br: Clique em qualquer um desses blocos para pular para uma página:
sl: Za skok na stran kliknite katero koli od teh ploščic:
tr: Bir sayfaya atlamak için bu karolardan birine tıklayın:
uk: Натисніть на будь-якому із заголовків, щоб перейти до сторінки:
