Repository: KDE/documentation-develop-kde-org
Catalog: po/*/hig.po
Languages: ca, eo, es, fi, fr, it, ko, nl, pl, pt, pt_br, sl, sv, tr, uk

source: KDE Human Interface Guidelines
ca: Guia d'interfície humana de KDE
eo: KDE-Gvidlinioj pri Homa Interfaco
es: Directrices de interfaz humana de KDE
fi: KDE:n käyttöliittymäohjeet
fr: Directives de KDE pour les interfaces Homme / Machine
it: Linee guida di interfaccia umana di KDE
ko: KDE 휴먼 인터페이스 가이드라인
nl: Human-interface richtlijnen van KDE
pl: Wytyczne dotyczące Przewodnik po interfejsach ludzkich KDE
pt: Guias de Interfaces Humanas do KDE
pt_br: Diretrizes da interface humana do KDE
sl: Smernice za uporabniški vmesnik KDE
sv: KDE:s riktlinjer för mänskliga gränssnitt
tr: KDE İnsan Arayüzü Yönergeleri
uk: Настанови щодо зручності інтерфейсу KDE

source: The **KDE Human Interface Guidelines (HIG)** offer designers and developers a set of recommendations for producing beautiful, usable, and consistent user interfaces for convergent desktop and mobile applications and workspace widgets. Our aim is to improve the experience for users by making consistent interfaces for desktop, mobile, and everything in between, more consistent, intuitive and learnable.
ko: **KDE 휴먼 인터페이스 가이드라인(HIG)**은 디자이너와 개발자에게 데스크톱과 모바일 앱 및 작업 공간 위젯의 아름답고, 사용하기 편하고, 일관적인 사용자 인터페이스를 개발할 때 필요한 추천 사항을 제공합니다. 가이드라인의 목표는 데스크톱, 모바일, 그 사이에 있는 것들에서 더 일관적이고, 더 직관적이고, 더 익히기 쉬운 인터페이스를 제공하여사용자 경험을 개선하는 것입니다.
pt: As **Linhas-Guia de Interfaces Humanas do KDE (HIG)** oferecem aos desenhadores e programadores um conjunto de recomendações para produzir interfaces de utilizador bonitas, úteis e consistentes nas aplicações convergentes para computadores e dispositivos móveis, bem como nos elementos gráficos do ambiente de trabalho. O seu objectivo é melhorar a experiência dos utilizadores, criando interfaces das aplicações e elementos mais consistentes e, deste modo, mais intuitivas e fáceis de aprender.

source: Design Vision
ko: 디자인 비전
pl: Wizja projektu
pt: Visão do Desenho

source: Our design vision focuses on two attributes of KDE software that connect its future to its history:
ko: 우리의 디자인 비전은 KDE 소프트웨어의 과거와 미래를 연결하는 두 가지 속성에 초점을 맞춥니다.
pt: A visão do desenho geral foca-se em dois atributos das aplicações do KDE que interligam o seu futuro com o seu histórico:

source: ![Simple by default, powerful when needed.](/hig/HIGDesignVisionFullBleed.png)
ko: ![첫 시작은 간단하게, 필요할 때에는 강력하게.](/hig/HIGDesignVisionFullBleed.png)
pl: ![Domyślnie proste, w razie potrzeby potężne.] (/hig/HIGDesignVisionFullBleed.png)
pt: ![Simples por omissão, poderoso quando necessário.](/hig/HIGDesignVisionFullBleed.png)

source: Simple by default...
fi: Oletuksena yksinkertainen…
ko: 첫 시작은 간단하게...
pl: Domyślnie proste...
pt: Simples por omissão...

source: *Simple and inviting. KDE software is pleasant to experience and easy to use.*
fi: *Yksinkertainen ja houkutteleva. KDE-ohjelmat ovat mukavia kokea ja helppoja käyttää.*
ko: *간단함과 첫 인상. KDE 소프트웨어는 향상된 경험을 제공하고 사용하기 쉽습니다.*
pl: *Proste i zachęcające. Oprogramowanie KDE jest przyjemne w odbiorze i łatwe w użyciu.*
pt: *Simples e convidativo. As aplicações do KDE são agradáveis de interagir e fáceis de usar.*

source: **Make it easy to focus on what matters**
fi: ***Tee oleelliseen keskittymisestä helppoa**
ko: **중요한 것에 쉽게 집중하기**
pt: **Facilitar o foco no que interessa**

source: Remove or minimize elements not crucial to the primary or main task. Use spacing to keep things organized. Use color to draw attention. Reveal additional information or optional functions only when needed.
fi: Poista tai vähennä osia, jotka eivät ole olennaisia päätehtävän kannalta. Osoita järjestys käyttämällä tyhjää tilaa. Kiinnitä huomiota värein. Paljasta lisätiedot ja -ominaisuudet vain tarvittaessa.
ko: 주 작업과 관련이 없는 구성 요소를 제거하거나 최소화합니다. 공백을 사용하여 사물을 정리합니다. 색을 사용하여 주의를 끕니다. 필요한 경우에만 추가 정보나 선택적 기능을 표시합니다.
pt: Remover ou minimizar os elementos não cruciais para a tarefa principal. Use espaços de intervalo para manter as coisas organizadas. Use cores para chamar a atenção. Revele as informações adicionais ou funções opcionais só quando for necessário.

source: **"I know how to do that!"**
fi: **”Tiedän, mitä se tehdään!”**
ko: **어떻게 하는지 알고 있어요!**
pt: **"Sei como fazê-lo!"**

source: Make things easier to learn by reusing design patterns from other applications. Other applications that use good design are a precedent to follow.
fi: Tee asioista helppoja oppia uusiokäyttämällä muiden sovellusten kaavaa. Muut hyvin suunnitellut sovellukset asettavat mallin, jota seurata.
ko: 다른 앱의 디자인 패턴을 재사용하여 쉽게 익힐 수 있도록 합니다. 좋은 디자인을 사용하는 다른 앱의 예시를 따릅니다.
pt: Torne as coisas mais simples de aprender, reutilizando padrões de desenho de outras aplicações. As aplicações que usam um bom desenho são um precedente a seguir.

source: **Do the heavy lifting for me**
fi: **Hoida vaikein puolestani**
ko: **중대한 작업을 대신 수행**
pt: **Fazer o trabalho pesado por mim**

source: Make complex tasks simple. Make novices feel like experts. Create ways in which your users can naturally feel empowered by your software.
fi: Tee monimutkaisista tehtävistä yksinkertaisia. Saa aloittelijat tuntemaan itsensä asiantuntijoiksi. Luo tapoja, joilla ohjelmasi saa käyttäjän tuntemaan itsensä tehokkaaksi.
ko: 복잡한 작업을 간단하게 만듭니다. 초보자라도 전문가처럼 사용할 수 있습니다. 사용자가 소프트웨어를 사용하면서 자신감을 얻을 수 있도록 합니다.
pt: Torne simples as tarefas complexas. Faça com que os principiantes se sintam especialistas. Crie formas nas quais os utilizadores se sintam naturalmente reforçados pelo seu 'software'.

source: ...Powerful when needed
fi: …tarvittaessa tehokas
ko: ...필요할 때에는 강력하게
pl: ...Potężny w razie potrzeby
pt: ...Poderoso quando necessário

source: *Power and flexibility. KDE software allows users to be effortlessly creative and efficiently productive.*
ko: *강력함과 유연함. KDE 소프트웨어를 사용하여 창의성을 발휘하고 효율성을 최대화합니다.*
pl: *Moc i elastyczność. Oprogramowanie KDE pozwala użytkownikom być twórczymi i wydajnymi bez wysiłku.
pt: *Poder e flexibilidade. As aplicações do KDE permitem aos utilizadores serem criativos sem esforço e produtivos de forma eficiente.

source: **Solve a problem**
fi: **Ratkaise ongelma**
ko: **문제 해결**
pt: **Resolver um problema**

source: Identify and make very clear to the user what need is addressed and how.
ko: 사용자가 해결해야 할 문제점과 해결 방안을 식별하고 명확하게 제시합니다.
pt: Identifique e torne bastante claro ao utilizador a necessidade que é tratada e de que forma é feito.

source: **Always in control**
fi: **Aina hallinnassa**
ko: **항상 통제 하에 있음**
pt: **Sempre no controlo**

source: It should always be clear what can be done, what is currently happening, and what has just happened. The user should never feel at the mercy of the tool. Give the user the final say.
fi: Aina tulisi olla selvää, mitä voi tehdä, mitä paraikaa tapahtuu ja juuri tapahtui. Käyttäjän ei koskaan tulisi tuntea olevansa työkalun armoilla. Anna viimeinen sana hänelle.
ko: 무엇을 할 수 있고, 무엇이 일어나고 있고, 방금 무엇이 일어나는지는 명확해야 합니다. 사용자가 도구에 지배당하고 있다는 느낌을 받으면 안 됩니다. 최종 결정권은 사용자에게 있습니다.
pt: Deverá ser sempre claro o que poderá ser feito, o que está a acontecer no preciso momento e o que acabou de acontecer. O utilizador nunca se deve sentir à mercê da ferramenta. Dê ao utilizador a última palavra.

source: **Be flexible**
fi: **Ole joustava**
ko: **유연하게**
pt: **Ser flexível**

source: Provide sensible defaults but consider optional functionality and customization options that don\'t interfere with the primary task.
fi: Tarjoa tolkulliset oletukset, mutta tarjoa lisätoimintoja ja mukautusmahdollisuuksia, jotka eivät häiritse päätehtävää.
ko: 적당한 기본값을 제시하지만 주 작업과 방해되지 않는 선에서 부가적인 기능과 사용자 정의 옵션을 제공해야 합니다.
pt: Forneça opções predefinidas válidas, mas tenha em consideração as funcionalidades opcionais e as opções de personalização que não interfiram com a tarefa principal.

source: Note
fi: Huomaa
ko: 메모
pl: Uwaga
pt: Nota

source: KDE encourages developing and designing for customization, while providing good default settings. Integrating into other desktop environments is also a virtue, but ultimately we aim for perfection within our own Plasma desktop environment with the default themes and settings. This aim should not be compromised.
ko: KDE는 적당한 기본값을 제공하면서 사용자 정의성을 위해서 개발하고 디자인하기를 권장합니다. 다른 데스크톱 환경으로 통합되는 것도 고려해야 하지만, 우리의 Plasma 데스크톱 환경의 기본 테마와 설정 내에서의 완벽을 추구해야 합니다. 이 목표는 변경될 수 없습니다.
pl: KDE zachęca do rozwijania i projektowania z myślą o dostosowaniu do własnych potrzeb, zapewniając jednocześnie dobre ustawienia domyślne. Integracja z innymi środowiskami jest również zaletą, ale ostatecznie dążymy do perfekcji w naszym własnym środowisku Plasma z domyślnym wyglądem i ustawieniami. Ten cel nie powinien być zagrożony.
pt: O KDE encoraja o desenvolvimento e a concepção de personalizações, fornecendo por outro lado boas opções predefinidas. A integração noutros ambientes de trabalho também é uma virtude mas, em última instância, deve atingir a perfeição dentro do nosso ambiente de trabalho Plasma com os temas e opções predefinidas. Este objectivo não deverá ser comprometido.

source: The KDE Human Interface Guidelines (HIG) offer designers and developers a set of recommendations for producing beautiful, usable, and consistent user interfaces for convergent desktop and mobile applications and workspace widgets. Their aim is to improve the experience for users by making application and widget interfaces more consistent and hence more intuitive and learnable.
pl: Wytyczne dotyczące Przewodnika po interfejsach ludzkich KDE (HIG) oferują projektantom i programistom zestaw zaleceń dotyczących tworzenia pięknych, użytecznych i spójnych interfejsów użytkownika dla konwergentnych aplikacji biurkowych, przenośnych oraz elementów przestrzeni pracy. Ich celem jest poprawienie wrażeń użytkowników poprzez uczynienie interfejsów aplikacji i elementów interfejsu bardziej spójnymi, a przez to bardziej intuicyjnymi i łatwiejszymi do nauczenia.

source: KDE's design vision focuses on two attributes of KDE software that connect its future to its history:
pl: Wizja projektowa KDE skupia się na dwóch atrybutach oprogramowania KDE, które łączą jego przyszłość z historią:

source: **Make it easy to focus on what matters** --- Remove or minimize elements not crucial to the primary or main task. Use spacing to keep things organized. Use color to draw attention. Reveal additional information or optional functions only when needed.
pl: **Ułatwiaj skupienie się na tym, co ważne** --- Usuń lub zmniejsz elementy, które nie są kluczowe dla głównego zadania. Zastosuj odstępy, aby wszystko było uporządkowane. Używaj kolorów, aby przyciągnąć uwagę. Pokazuj dodatkowe informacje lub opcjonalne funkcje tylko wtedy, gdy są potrzebne.

source: **I know how to do that!** --- Make things easier to learn by reusing design patterns from other applications. Other applications that use good design are a precedent to follow.
pl: **Wiem, jak to zrobić!** --- Ułatwiaj naukę, wykorzystując wzorce projektowe z innych aplikacji. Inne aplikacje, w których zastosowano dobry projekt, stanowią przykład do naśladowania.

source: **Do the heavy lifting for me** --- Make complex tasks simple. Make novices feel like experts. Create ways in which your users can naturally feel empowered by your software.
pl: **Zrób to za mnie** --- Spraw, aby skomplikowane zadania stały się proste. Spraw, aby początkujący czuli się jak specjaliści. Stwórz sposoby, dzięki którym użytkownicy w naturalny sposób poczują się wzmocnieni dzięki twojemu oprogramowaniu.

source: **Solve a problem** --- Identify and make very clear to the user what need is addressed and how.
pl: **Rozwiąż problem** --- Określ i wyjaśnij użytkownikowi, jakie potrzeby są zaspokajane i w jaki sposób.

source: **Always in control** --- It should always be clear what can be done, what is currently happening, and what has just happened. The user should never feel at the mercy of the tool. Give the user the final say.
pl: **Zawsze pod kontrolą** --- Zawsze powinno być jasne, co można zrobić, co się aktualnie dzieje i co się właśnie wydarzyło. Użytkownik nigdy nie powinien czuć się zdany na łaskę narzędzia. Użytkownik powinien mieć ostatnie słowo.

source: **Be flexible** --- Provide sensible defaults but consider optional functionality and customization options that don\'t interfere with the primary task.
pl: **Bądź elastyczny** --- Zapewnij rozsądne ustawienia domyślne, ale uwzględnij opcjonalną funkcjonalność i opcje dostosowywania, które nie przeszkadzają w wykonywaniu podstawowego zadania.

source: Welcome to the KDE Human Interface Guidelines! Following them will help you build a beautiful and powerful app that feels at home when run in [KDE Plasma](https://kde.org/plasma-desktop), and works well outside of it. Users will learn how to use your app quickly, accomplish their goals with ease, and encounter fewer issues requiring support.
eo: Bonvenon al la Gvidlinioj pri Homa Interfaco de KDE! Sekvi ilin helpos vin konstrui belan kaj potencan aplikaĵon, kiu sentiĝas hejmeca kiam ĝi funkcias en [KDE Plasma](https://kde.org/plasma-desktop) kaj funkcias bone ekster ĝi. Uzantoj lernos kiel uzi vian apon rapide, plenumi siajn celojn facile kaj renkontos malpli da problemoj postulantaj subtenon.
es: ¡Bienvenido a las «Directrices de interfaz humana de KDE»! Seguirlas le ayudará a crear una aplicación bonita y potente que se sentirá como en casa cuando se ejecuta en [KDE Plasma](https://kde.org/plasma-desktop) y funcionará bien fuera de él. Los usuarios aprenderán a usar su aplicación rápidamente, cumpliendo sus objetivos con facilidad, y encontrarán menos problemas que requieran asistencia.
fr: Bienvenu dans les directives de l'interface homme /machine de KDE ! Les suivre vous aidera à créer une application élégante et puissante, s'intégrant parfaitement à un environnement de[KDE Plasma](https://kde.org/plasma-desktop) et fonctionnant bien en dehors de celui-ci. Les personnes utilisatrices apprendront comment utiliser rapidement votre application, atteindre leurs objectifs avec facilité et à rencontrer le moins de problèmes nécessitant une assistance.
it: Benvenuto nelle linee guida per l'interfaccia umana di KDE! Seguirle ti aiuterà a creare un'applicazione bella e potente che si senta a casa in un ambiente [KDE Plasma](https://kde.org/plasma-desktop) e funzioni bene al di fuori di esso. Gli utenti impareranno a usarla rapidamente, raggiungeranno i loro obiettivi con facilità e incontreranno meno problemi che richiedono supporto.
pt_br: Bem-vindo às Diretrizes da Interface Humana do KDE! Segui-las ajudará você a criar um aplicativo bonito e poderoso que se sente em casa quando executado no [KDE Plasma](https://kde.org/plasma-desktop) e funciona bem fora dele. Os usuários aprenderão a usar seu aplicativo rapidamente, atingir seus objetivos com facilidade e encontrarão menos problemas que exigem suporte.
sl: Dobrodošli v smernicah za uporabniški vmesnik KDE! Njihovo upoštevanje vam bo pomagalo zgraditi lepo in zmogljivo aplikacijo, ki se počuti kot doma v okolju [KDE Plasma](https://kde.org/plasma-desktop), in dobro deluje zunaj njega. Uporabniki se bodo naučili, kako ga hitro uporabljati, z lahkoto dosegli svoje cilje in naleteli na manj težav, ki potrebujejo podporo.
tr: KDE İnsan Arayüzü Yönergeleri’ne hoş geldiniz. Bunlara uymak, [KDE Plasma](https://kde.org/plasma-desktop) üzerinde çalıştırırken evinde hissettirecek güzel ve güçlü bir uygulama yapmanıza ve başka platformlarda düzgün bir biçimde çalışmasına yardımcı olacaktır. Kullanıcılar uygulamanızı tez nasıl kullanacağınızı ve kendi çalışma hedeflerini kolaylıkla nasıl gerçekleştireklerini öğrenecekler ve destek gerektiren daha az sorunla karşılaşacaklardır.
uk: Вітаємо на сторінці настанов щодо зручності користування інтерфейсом KDE! Дотримання цих настанов допоможе вам створити красиву та потужну програму, яка почуватиметься як вдома при запуску у [Плазмі KDE](https://kde.org/plasma-desktop) та добре працюватиме поза ним. Користувачі навчаться користуванню вашою програмою швидко, будуть легко досягати своїх цілей і стикатися з меншою кількістю проблем, що вимагають підтримки.

source: This document covers KDE's design philosophy and culture, common workflows and patterns, standard user interface conventions, and recommendations for platform integration.
ca: Aquest document cobreix la filosofia i la cultura de disseny de KDE, els patrons i fluxos de treball habituals, les convencions estàndard de la interfície d'usuari i les recomanacions per a la integració de la plataforma.
eo: Ĉi tiu dokumento kovras la dezajnfilozofion kaj kulturon de KDE, oftajn laborfluojn kaj ŝablonojn, normajn uzantinterfacajn konvenciojn kaj rekomendojn por platform-integriĝo.
es: Este documento cubre la filosofía de diseño y la cultura de KDE, flujos de trabajo y patrones comunes, convenciones estándares de la interfaz de usuario y recomendaciones para la integración con la plataforma.
fr: Ce document couvre la philosophie et la culture concernant la conception de KDE, les flux de travail, les modèles communs, les conventions d'interface utilisateur standard et les recommandations pour l'intégration de la plate-forme.
it: Questo documento tratta la filosofia e la cultura di progettazione di KDE, i flussi di lavoro e i modelli comuni, le convenzioni dell'interfaccia utente standard e i consigli per l'integrazione della piattaforma.
nl: Dit document dekt de ontwerpfilosofie en cultuur van KDE, algemene werkwijzen en patronen, standaard conventies voor gebruikersinterface en aanbevelingen voor platformintegratie.
pt_br: Este documento aborda a filosofia e a cultura de design do KDE, fluxos de trabalho e padrões comuns, convenções de interface de usuário padrão e recomendações para integração de plataformas.
sl: Ta dokument pokriva filozofijo in kulturo oblikovanja KDE, običajne poteke dela in vzorce, standardne konvencije uporabniškega vmesnika in priporočila za integracijo platforme.
sv: Det här dokumentet täcker KDE:s designfilosofi och kultur, vanliga arbetsflöden och mönster, standardkonventioner för användargränssnitt och rekommendationer för plattformsintegration.
tr: Bu belge; KDE’nin tasarım felsefesini ve kültürünü, genel iş akışlarını ve örüntülerini, standart kullanıcı arayüzü konvansiyonlarını ve platform tümleştirmesi konusunda önerileri kapsar.
uk: Цей документ охоплює філософію та культуру проєктування KDE, загальні робочі процеси та шаблони, стандартні правила інтерфейсу користувача та рекомендації щодо інтеграції платформи.

source: Why is good design so important?
ca: Per què és tan important un bon disseny?
eo: Kial tiom gravas bona dezajno?
es: ¿Por qué es tan importante un buen diseño?
fr: Pourquoi une bonne conception est-elle si importante ?
it: Perché la buona progettazione è così importante?
nl: Waarom is een goed ontwerp zo belangrijk?
pt_br: Por que um bom design é tão importante?
sl: Zakaj je dobro oblikovanje tako pomembno?
sv: Varför är bra design så viktigt?
tr: İyi tasarım neden bu kadar önemli?
uk: Чому добрий дизайн є важливим?

source: Design determines how well something fulfills its functional purpose and how enjoyable it is to interact with. If either is lacking, the result will be frustrating. People won't want to use a poorly-designed app, and if forced to, they'll be resentful and spread negativity about it. Avoid this through good design!
eo: Dezajno determinas kiom bone io plenumas sian funkcian celon kaj kiom agrabla estas interagi kun ĝi. Se iu mankas, la rezulto estos frustranta. Homoj ne volos uzi malbone dezajnitan apon, kaj se devigite, ili indignos kaj disvastigos negativecon pri ĝi. Evitu ĉi tion per bona dezajno!
es: El diseño determina lo bien que algo cumple su propósito funcional, así como lo agradable que resulta interactuar con ello. Si algo de esto falla, el resultado será frustrante. Las personas no querrán usar una aplicación mal diseñada y, si se ven obligadas a hacerlo, se resentirán y difundirán negatividad al respecto. ¡Evítelo mediante un buen diseño!
fr: La conception détermine dans quelle mesure quelque chose remplit son objectif fonctionnel, mais aussi dans quelle mesure il est agréable d'interagir avec. Si l'un ou l'autre est absent, le résultat sera frustrant. Les personnes ne voudront pas utiliser une application mal conçue. Si elles y sont obligées, elles produiront du ressentiment et répandront des avis négatifs sur l'application. Veuillez éviter ces situations grâce à une conception élégante !
pt_br: O design determina o quão bem algo cumpre seu propósito funcional e o quão agradável é interagir com ele. Se um dos dois estiver ausente, o resultado será frustrante. As pessoas não vão querer usar um aplicativo mal projetado e, se forçadas a isso, ficarão ressentidas e espalharão negatividade com ele. Evite isso com um bom design!
sl: Oblikovanje ne določa le, kako dobro nekaj izpolnjuje svoj funkcionalni namen, ampak tudi, kako prijetno je komunicirati z njim. Če enega ali drugega manjka, bo rezultat frustrirajoč. Ljudje ne bodo želeli uporabljati slabo zasnovane aplikacije, in če bodo v to prisiljeni, bodo to zamerili in ​​bodo o njej širili negativne govorice. Izognite se temu z dobrim oblikovanjem!
tr: Tasarım, bir şeyin işlevsel amacını ne kadar iyi yerine getirdiğini ve etkileşim kurmanın ne kadar eğlenceli olduğunu belirler. Her ikisi de eksikse sonuç sinir bozucu olacaktır. İnsanlar kötü tasarlanmış bir uygulama kullanmak istemeyeceklerdir ve buna zorlanırlarsa bu konuda hiç iyi şeyler hissetmeyeceklerdir. İyi tasarımla bundan kaçının!
