Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Now, we should be given a new action at the top of the app that brings up a prompt that allows to add a new element to the model, with our own custom data.
ca: Ara, se'ns ha de donar una acció nova a la part superior de l'aplicació que obri un indicador que permeti afegir un element nou al model, amb les nostres pròpies dades personalitzades.
eo: Nun, ni devus ricevi novan agon ĉe la supro de la aplikaĵo, kiu aperigas prompton, kiu permesas aldoni novan elementon al la modelo, kun niaj propraj propraj datumoj.
es: Ahora deberíamos tener una nueva acción en la parte superior de la aplicación que muestra un mensaje que permite añadir un nuevo elemento al modelo con nuestros propios datos personalizados.
nl: Nu zouden een nieuwe actie bovenaan de toepassing moeten geven die een prompt laat verschijnen waarmee een nieuw element aan het model kan worden toegevoegd, met onze eigen aangepaste gegevens.
sl: Zdaj bi morali dobiti novo dejanje na vrhu aplikacije, ki prikaže poziv, ki omogoča dodajanje novega elementa s podatki v model po lastni meri.
sv: Nu bör vi få en ny åtgärd längst upp i programmet som ger en prompt som gör det möjligt att lägga till ett nytt element till modellen, med våra egna anpassade data.
uk: Тепер у нас буде новий пункт дії у верхній частині вікна програми, який викликатиме запит, за допомогою якого можна буде додати до моделі новий елемент із нашими власними нетиповими даними.

source: Removing Rows
ca: Eliminar files
eo: Forigante Vicojn
es: Eliminar filas
nl: Rijen verwijderen
sl: Odstranjevanje vrstic
sv: Ta bort rader
uk: Вилучення рядків

source: The way remove rows is similar to adding rows. Let's create another method that we'll call in QML. This time, we will use an additional parameter, and that is an integer that is the row number. The species name is used to delete the key from the QMap, while the row number will be used to delete the row on the front end.
ca: La manera d'eliminar files és similar a afegir files. Creem un altre mètode que cridarem en el QML. Aquesta vegada, utilitzarem un paràmetre addicional, i és un enter que és el número de fila. El nom de l'espècie s'utilitza per a suprimir la clau del QMap, mentre que el número de fila s'utilitzarà per a suprimir la fila en el frontal.
eo: La maniero forigi vicojn similas al aldoni vicojn. Ni kreu alian metodon, kiun ni nomos en QML. Ĉi-foje, ni uzos plian parametron, kaj tio estas entjero, kiu estas la vico-numero. La specionomo estas uzata por forigi la ŝlosilon de la QMap, dum la vico-numero estos uzata por forigi la vicon ĉe la antaŭa fino.
es: La forma de eliminar filas es similar a la de añadirlas. Vamos a crear otro método que llamaremos en QML. Esta vez, usaremos un parámetro adicional, que es un entero que representa el número de fila. El nombre de la especie se usa para eliminar la clave del QMap, mientras que el número de fila se usa para eliminar la fila en la interfaz.
nl: De manier om rijen te verwijderen is gelijk aan rijen toevoegen. Laten we een andere methode aanmaken die we in QML zullen aanroepen. Deze keer zullen we een extra parameter gebruiken en dat is een geheel getal die het rijnummer is. De naam ervan wordt gebruikt om de sleutel uit de QMap te verwijderen, terwijl het rijnummer gebruikt zal worden om de rij in de frontend te verwijderen.
sl: Način odstranjevanja vrstic je podoben dodajanju vrstic. Ustvarimo drugo metodo, ki jo bomo poklicali v QML. Tokrat bomo uporabili dodaten parameter in to je celo število, ki je številka vrstice. Ime vrste se uporablja za brisanje ključa iz QMap, medtem ko bo številka vrstice uporabljena za brisanjevrstice na začelju.
sv: Sättet att ta bort rader liknar att lägga till rader. Låt oss skapa en annan metod som vi anropar från QML. Den här gången använder vi en extra parameter, och det är ett heltal som anger radnumret. Artnamnet används för att radera nyckeln från QMap, medan radnumret används för att radera raden i gränssnittet.
uk: Спосіб вилучення рядків є подібним до способу додавання рядків. Створімо ще один метод, який ми викликатимемо з QML. Цього разу ми скористаємося додатковим параметром, і це буде ціле число, номер рядка. Назву species буде використано для вилучення ключа з QMap, а номер рядка буде використано для вилучення рядка в оболонці.

source: More Information
ca: Més informació
eo: Pliaj Informoj
es: Más información
nl: Meer informatie
sl: Več informacij
sv: Mer information
uk: Докладніше

source: For more information, see [Using C++ Models with Qt Quick Views](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) and [Model/View Programming](docs:qtquick;model-view-programming.html).
ca: Per a més informació, vegeu [Using C++ Models with Qt Quick Views](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) i [Model/View Programming](docs:qtquick;model-view-programming.html).
eo: Por pliaj informoj, vidu [Uzante C++-Modelojn kun Qt Rapidaj Vidoj](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) kaj [Modelo/Vida Programado](docs:qtquick;model-view-programming.html).
es: Para más información, consulte [Uso de modelos en C++ con vistas de Qt Quick](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) y [Programación modelo/vista](docs:qtquick;model-view-programming.html).
nl: Voor meer informatie, zie [Using C++ Models with Qt Quick Views](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) en [Model/Weergave programmeren](docs:qtquick;model-view-programming.html).
sl: Za več informacij glejte [Uporaba modelov C++ s hitrimi pogledi Qt](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) in [Model/View Programming](docs:qtquick;model-view-programming.html).
sv: För mer information, se [Using C++ Models with Qt Quick Views](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) och [Model/View Programming](docs:qtquick;model-view-programming.html).
uk: Щоб дізнатися більше, ознайомтеся із розділами [Використання моделей C++ на панелях Qt Quick](docs:qtquick;qtquick-modelviewsdata-cppmodels.html) та [Програмування на основі моделі-панелі перегляду](docs:qtquick;model-view-programming.html).

source: Figuring out main.cpp
ca: Descobrir el main.cpp
eo: Eltrovante main.cpp
es: Descubriendo main.cpp
fr: Comprendre le fichier « main.cpp »
nl: Bekijken wat main.cpp doet
pl: Rozumienie main.cpp
pt: Investigar o main.cpp
sl: Preučevanje main.cpp
sv: Förstå sig på main.cpp
uk: Розбираємося у main.cpp

source: Understanding the central file of our backend code
ca: Comprenent el fitxer central del nostre codi de dorsal
eo: Kompreni la centran dosieron de nia backend-kodo
es: Entendiendo el archivo central de nuestro código de motor
fr: Comprendre le fichier principal pour notre code de moteur.
nl: Het centrale bestand van onze backend-code begrijpen
pl: Zrozumienie głównego pliku naszego kodu silnika
pt: Compreender o ficheiro central do nosso código de infra-estrutura
sl: Razumevanje osrednje datoteke naše zaledne kode
sv: Förstå den centrala filen i vår gränssnittskod
uk: Розбираємося із центральним файлом нашого коду модуля обробки

source: The role of main.cpp
ca: El paper de main.cpp
eo: La rolo de main.cpp
es: El papel de main.cpp
fr: Le rôle de « main.cpp »
nl: De rol van main.cpp
pl: Rola main.cpp
pt: O papel do main.cpp
sl: Vloga main.cpp
sv: Rollen som main.cpp har
uk: Роль main.cpp

source: While QML is used for the front-end of Kirigami applications, the backend is usually written in C++ thanks to this language's speed and flexibility. While in previous pages we have covered QML in a lot of depth, we'll need to gain an understanding of our backend C++ code in order to make applications that are more useful than what we can achieve with pure QML.
ca: Si bé el QML s'utilitza per al frontal de les aplicacions escrites amb el Kirigami, el dorsal generalment s'escriu en C++ gràcies a la velocitat i flexibilitat d'aquest llenguatge. Si bé en les pàgines anteriors hem cobert el QML amb molta profunditat, necessitarem comprendre el nostre codi en C++ del dorsal per a crear aplicacions que siguin més útils del que podem aconseguir amb un QML pur.
eo: Dum QML estas uzata por la fronto de Kirigami-aplikoj, la malantaŭo estas kutime skribita en C++ danke al la rapideco kaj fleksebleco de ĉi tiu lingvo. Dum en antaŭaj paĝoj ni multe profunde kovris QML, ni devos akiri komprenon pri nia malantaŭa C++-kodo por fari aplikojn kiuj estas pli utilaj ol tio, kion ni povas atingi per pura QML.
es: Mientras que QML se usa para la interfaz de las aplicaciones de Kirigami, el motor se suele escribir en C++ gracias a la velocidad y flexibilidad de este lenguaje. Si bien en las páginas anteriores hemos cubierto QML con mucha profundidad, necesitaremos comprender nuestro código C++ del motor para crear aplicaciones que sean más útiles de lo que podemos lograr con QML puro.
fr: Alors que QML est utilisé pour l'interface utilisateur des applications avec Kirigami, le moteur est généralement écrit en C++, grâce à sa vitesse et à sa flexibilité. Bien que dans les pages précédentes, nous ayons parcouru QML de manière très approfondie, nous aurons besoin de mieux comprendre le code C++ de notre moteur afin de créer des applications plus utiles que ce que nous pouvons réaliser avec du QML pur.
nl: Terwijl QML gebruikt wordt voor de front-end van Kirigami toepassingen, wordt de backend gewoonlijk in C++ geschreven vanwege de snelheid en flexibiliteit van deze taal. Terwijl in vorige pagina's we QML behoorlijk in de diepte hebben gedekt, moeten we enig begrip krijgen van de C++ code van onze backend om toepassingen te maken die nuttiger zijn dan wat we kunnen bereiken met pure QML.
pl: Podczas gdy QML używa się do front-endu aplikacji Kirigami, to backend zazwyczaj jest napisany w C++ dzięki szybkości i elastyczności tego języka. W poprzednich rozdziałach wyjaśnialiśmy szczegóły QML, a teraz będziemy musieli zrozumieć kod w C++ naszego backendu, aby uczynić nasze aplikacje bardziej użytecznymi, poza to co można osiągną przy użyciu czystego QML.
pt: Embora o QML seja usado para a interface das aplicações do Kirigami, a infra-estrutura normalmente é feita em C++, graças à velocidade e flexibilidade desta linguagem. Embora nas páginas anteriores tenhamos feito uma análise profunda do QML, teremos de ganhar alguma compreensão do nosso código de C++ da infra-estrutura, para criar aplicações que são mais úteis que as que conseguimos com QML puro.
sl: Medtem ko se QML uporablja za vmesnik aplikacij Kirigami, je zaledje običajno napisano v C++ zaradi hitrosti in prilagodljivosti tega jezika. Medtem ko smo na prejšnjih straneh podrobno razložili QML, bomo potrebno pridobiti še razumevanje naše zaledne kode C++, da bi lahko ustvarjali aplikacije, ki so bolj uporabne od tega, kar lahko dosežemo s čistim QML.
sv: Medan QML används för förgrunden i Kirigami-program, är bakgrundskoden oftast skriven i C++ tack vare språkets snabbhet och flexibilitet. Medan vi har täckt QML på djupet på de tidigare sidorna, behöver vi förstå vår C++ bakgrundskod för att kunna skapa program som är användbarare än vad vi kan åstadkomma med ren QML.
uk: Хоча для оболонок програм на основі Kirigami використовується QML, модулі обробки, зазвичай, пишуть мовою C++ через її швидкість та гнучкість. На попередніх сторінках ми доволі докладно розбиралися із кодом QML, а тепер нам треба розібратися із кодом мовою C++ нашого модуля обробки, щоб зробити програми кориснішими за ті, які ми могли б написати, використовуючи лише QML.

source: Here, we'll be going over the `main.cpp` file we created in the [Getting Started](/docs/getting-started/kirigami/introduction-getting_started) page so that we can better understand what is going on in the central C++ file of our application. While this is a basic `main.cpp`, the features we will go over will remain essential no matter what kind of application you decide to create.
ca: Aquí, repassarem el fitxer `main.cpp` que hem creat a la pàgina [Com començar](/docs/getting-started/kirigami/introduction-getting_started) perquè puguem comprendre millor el que està succeint en el fitxer central de C++ de la nostra aplicació. Si bé aquest és un `main.cpp` bàsic, les característiques que repassarem seguiran sent essencials, sense importar la classe d'aplicació que decidiu crear.
eo: Ĉi tie, ni trarigardos la `main.cpp`-dosieron, kiun ni kreis en la paĝo [Getting Started](/docs/getting-started/kirigami/introduction-getting_started) por ke ni povu pli bone kompreni kio okazas en la centra C++-dosiero de nia aplikaĵo. Kvankam ĉi tio estas baza `main.cpp`, la funkcioj, kiujn ni trarigardos, restos esencaj, negrave kian aplikaĵon vi decidas krei.
es: Aquí repasaremos el archivo `main.cpp` que creamos en la página [Primeros pasos](/docs/getting-started/kirigami/introduction-getting_started) para que podamos entender mejor lo que está sucediendo en el archivo central de C++ de nuestra aplicación. Aunque este es un `main.cpp` básico, las características que vamos a repasar seguirán siendo esenciales independientemente del tipo de aplicación que decida crear.
nl: Hier gaan we het hebben over het bestand `main.cpp` dat we hebben gemaakt in de pagina [Beginnen](/docs/getting-started/kirigami/introduction-getting_started) zodat we beter begrijpen wat er gaande is in het centrale C++ bestand van onze toepassing. Terwijl dit een basis `main.cpp` is, blijven de functies die we bespreken essentieel ongeacht het soort toepassing dat u beslist te maken.
sl: Tukaj bomo preučili datoteko `main.cpp`, ki smo jo ustvarili na strani [Getting Started](/docs/getting-started/kirigami/introduction-getting_started), da bomo lahko bolje razumeli, kaj se dogaja v osrednjo datoteko C++ naše aplikacije. Čeprav je to osnovni `main.cpp`, bodo ostale bistvene zmožnosti, ki jih bomo pregledali, ne glede na to, kakšno aplikacijo boste ustvarili.
sv: Här går vi igenom filen `main.cpp` vi skapade på sidan [Komma igång](/docs/getting-started/kirigami/introduction-getting_started) så att vi bättre förstår vad som händer i programmets centrala C++ fil. Även om det är en grundläggande `main.cpp`, förblir funktionerna vi går igenom väsentliga oberoende av vilket sorts program du bestämmer dig för att skapa.
uk: У цьому розділі ми вивчимо файл `main.cpp`, який було створено на сторінці [Вступ](/docs/getting-started/kirigami/introduction-getting_started) з метою удосконалення знань щодо того, що відбувається у центральному файлі мовою C++ нашої програми. Хоча це базовий варіант `main.cpp`, можливості, які ми вивчатимемо, лишатимуться характерними для будь-яких програм, які ви створюватимете.

source: What it does
ca: Què és el que fa
eo: Kion ĝi faras
es: Lo que hace
fr: Ce que cela fait
nl: Wat het doet
pl: Co to robi
pt: O que faz
sl: Kaj počne
sv: Vad den gör
uk: Призначення

source: First we must include a number of Qt [header files](https://www.learncpp.com/cpp-tutorial/header-files/), allowing us to use their functions. In this case, we include a number of Qt headers that handle application logic, and to allow us to read QML files.
ca: Primer hem d'incloure una sèrie de [fitxers de capçalera](https://www.learncpp.com/cpp-tutorial/header-files/) de les Qt, i això ens permetrà utilitzar les seves funcions. En aquest cas, incloem una sèrie de capçaleres de les Qt que manegen la lògica de l'aplicació i ens permet accedir a fitxers QML.
eo: Unue ni devas inkluzivi kelkajn Qt [header files](https://www.learncpp.com/cpp-tutorial/header-files/), permesante al ni uzi iliajn funkciojn. En ĉi tiu kazo, ni inkluzivas kelkajn Qt-kapojn kiuj pritraktas aplikaĵlogikon kaj permesas al ni legi QML-dosierojn.
es: Primero debemos incluir una serie de [archivos de cabecera](https://www.learncpp.com/cpp-tutorial/header-files/) de Qt, lo que nos permite usar sus funciones. En este caso, incluimos una serie de cabeceras Qt que manejan la lógica de la aplicación y que nos permiten leer archivos QML.
nl: Ten eerste moeten we een aantal Qt [header-bestanden](https://www.learncpp.com/cpp-tutorial/header-files/) invoegen, zodat we hun functies kunnen gebruiken. In dit geval voegen we een aantal Qt headers in die toepassingslogica behandelen en ons QML-bestanden te laten lezen.
sl: Najprej moramo vključiti številne datoteke glav Qt [header files](https://www.learncpp.com/cpp-tutorial/header-files/), ki nam omogočajo uporabo njihovih funkcij. V tem primeru vključujemo številne glave Qt, ki obravnavajo logiko aplikacij, branje datotek QML.
sv: Först måste vi inkludera ett antal Qt [deklarationsfiler](https://www.learncpp.com/cpp-tutorial/header-files/), vilket låter oss använda deras funktioner. I detta fall, inkluderade vi ett antal Qt deklarationsfiler som hanterar programlogik, och låter oss läsa QML-filer.
uk: Спочатку нам слід включити декілька [файлів заголовків Qt](https://www.learncpp.com/cpp-tutorial/header-files/), за допомогою яких ми зможемо скористатися відповідними функціями. У нашому випадку ми включимо заголовки Qt, які пов'язано із обробкою логіки програми, і які нададуть нам змогу читати файли QML.

source: We then create a [QApplication](docs:qtwidgets;QApplication) instance which we call `app`. Passing [argc and argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) to the constructor is required for the call.
ca: Després creem una instància [QApplication](docs:qtwidgets;QApplication) a la que anomenarem `app`. La crida requereix passar [argc i argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) al constructor.
eo: Ni tiam kreas instancon de [QApplication](docs:qtwidgets;QApplication), kiun ni nomas `app`. Transdono de [argc kaj argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) al la konstruilo estas postulata por la voko.
es: A continuación creamos una instancia de una [QApplication](docs:qtwidgets;QApplication) que llamaremos `app`. En esta llamada es necesario pasar [argc y argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) al constructor.
nl: Daarna maken we een [QApplication](docs:qtwidgets;QApplication) exemplaar die we `app` noemen. Doorgeven van [argc en argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) door aan de constructor is vereist voor de aanroep.
sl: Nato ustvarimo pojavek [QApplication](docs:qtwidgets;QApplication), ki ga imenujemo aplikacija `app`. Prenos [argc in argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/), konstruktorju je zahtevan za klic.
sv: Därefter skapar vi en instans av [QApplication](docs:qtwidgets;QApplication), som vi kallar `app`. Att skicka [argc och argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) till konstruktorn krävs för anropet.
uk: Далі, ми створюємо екземпляр [QApplication](docs:qtwidgets;QApplication), який ми назвемо `app`. Для цього виклику слід передати [argc і argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) конструктору.
