Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) is the simplest type of card. It's just a rectangle with a shadow, which can contain any [Item](docs:qtquick;QtQuick.Item) in it. It can also have Items assigned to its [header](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) or [footer](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) properties. In this case a [Kirigami.Heading](docs:kirigami;org.kde.kirigami.Heading) is its `header` and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) is the card's [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).
ca: Una [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) és el tipus de targeta més senzilla. Només és un rectangle amb una ombra, el qual podrà contenir qualsevol [Item](docs:qtquick;QtQuick.Item). També podrà tenir Items assignats a les seves propietats [header](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) o [footer](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop). En aquest cas, una [Kirigami.Heading](docs:kirigami;org.kde.kirigami.Heading) és la seva `header` i una [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) és el [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).

source: ![Screenshot of an Abstract Card, a simple rectangular button with left-aligned text](/docs/getting-started/kirigami/components-card/abstract-card.png)
ca: ![Captura de pantalla d'una AbstractCard, un únic botó rectangular amb text alineat a l'esquerra](/docs/getting-started/kirigami/components-card/abstract-card.png)
eo: ![Ekrankopio de Abstrakta Karto, simpla rektangula butono kun maldekstre vicigita teksto](/docs/getting-started/kirigami/components-card/abstract-card.png)
es: ![Captura de pantalla de una tarjeta abstracta, un sencillo botón rectangular con texto alineado a la izquierda](/docs/getting-started/kirigami/components-card/abstract-card.png)
nl: ![Schermafdruk van een abstracte kaart, een eenvoudige rechthoekige knop met links uitgelijnde tekst](/docs/getting-started/kirigami/components-card/abstract-card.png)
pt: ![Imagem de um Cartão Abstracto, um botão rectangular simples com o texto alinhado à esquerda](/docs/getting-started/kirigami/components-card/abstract-card.png)
sl: ![Posnetek zaslona Abstraktne kartice s preprostim pravokotnim gumbom in levo poravnanim besedilom](/docs/use/kirigami/components-card/abstract-card.png)
sv: ![Skärmbild av ett Abstract Card, en enkelt rektangulär knapp med vänsterjusterad text](/docs/getting-started/kirigami/components-card/abstract-card.png)
uk: ![Знімок абстрактної картки, простої прямокутної кнопки з вирівняним ліворуч текстом](/docs/getting-started/kirigami/components-card/abstract-card.png)

source: Card
ca: Targeta (Card)
eo: Karto
fr: Carte
nl: Kaart
pl: Karta
sl: Kartica
uk: Картка

source: A [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) inherits from [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) and provides more features out of the box. Cards inherit the same [header](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) and [footer](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) from an Abstract Card, but you are encouraged to use a [banner](https://api.kde.org/qml-org-kde-kirigami-card.html#banner-prop) and a set of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) in the [actions](https://api.kde.org/qml-org-kde-kirigami-card.html#actions-prop) group instead.
ca: Una [Kirigami.Card](docs:kirigami;Card) hereta des de [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) i proporciona més característiques a punt d'emprar. Les targetes hereten la mateixa [header](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) i [footer](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) des d'una Abstract Card, però en el seu lloc us encoratgem a fer servir un [banner](https://api.kde.org/qml-org-kde-kirigami-card.html#banner-prop) i un conjunt de [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) en el grup [actions](https://api.kde.org/qml-org-kde-kirigami-card.html#actions-prop).

source: The title can be positioned in the banner
ca: El títol es pot col·locar en el bàner
eo: La titolo povas esti poziciigita en la standardon
es: El título se puede situar en el *banner*
fr: Le titre peut être positionné dans l'en-tête.
nl: De titel kan gepositioneerd worden in de banner
pl: Tytuł można umieścić na banerze
pt: O título poderá ser posicionado no separador
sl: Naslov je mogoče umestiti v pasico
sv: Titeln kan placeras i baneret
uk: Заголовок може бути розташовано банері

source: ![Screenshot of a full-fledged Card with a banner background behind its title, white background behind its text, and two actions with icons and a hamburger menu at the bottom](/docs/getting-started/kirigami/components-card/card1.png)
ca: ![Captura de pantalla d'una targeta totalment desenvolupada amb un fons de bàner darrere del títol, fons blanc darrere del text, i dues accions amb icones i un menú d'hamburguesa a la part inferior](/docs/getting-started/kirigami/components-card/card1.png)
eo: ![Ekrankopio de plenrajta Karto kun standarda fono malantaŭ ĝia titolo, blanka fono malantaŭ ĝia teksto, kaj du agoj kun piktogramoj kaj hamburgera menuo malsupre](/docs/getting-started/kirigami/components-card/ karto1.png)
es: ![Captura de pantalla de una tarjeta completa con un fondo de banner detrás del título, un fondo blanco detrás del texto y dos acciones con iconos y un menú de hamburguesa en la parte inferior](/docs/getting-started/kirigami/components-card/card1.png)
nl: ![Schermafdruk van een volwaardige kaart met een bannerachergrond achter zijn titel, witte achtergrond achter zijn tekst en twee acties met pictogrammen en een hamburgermenu onderaan](/docs/getting-started/kirigami/components-card/card1.png)
pt: ![Imagem de um Card completo com um fundo separador debaixo do seu título, um fundo branco atrás do seu texto e duas acções com ícones e um menu em hambúrguer no fundo](/docs/getting-started/kirigami/components-card/card1.png)
sl: ![Posnetek zaslona polno opremljene kartice z naslovom pasice za naslovom, belim ozadjem za besedilom in dvema dejanjema z ikonami in hamburger menijem na dnu](/docs/use/kirigami/components-card/card1.png)
sv: ![Skärmbild av ett fullfjädrat kort med en baner i bakgrunden bakom titeln, vit bakgrund bakom texten och två åtgärder med ikoner och en hamburgermeny längst ner](/docs/getting-started/kirigami/components-card/card1.png)
uk: ![Знімок повноцінної Card із банером-тлом під її заголовком, білим тлом під її текстом та двома кнопками дій із піктограмами та меню-гамбургером внизу](/docs/getting-started/kirigami/components-card/card1.png)

source: A [Kirigami.CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) is most useful when the cards being presented are either not instantiated by a model or are instantiated by a model that always has very few items. They are presented as a grid of two columns which will remain centered if the application is really wide, or become a single column if there is not enough space for two columns, such as a mobile phone screen.
ca: Una [Kirigami.CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) és més útil quan les targetes que es presenten no són instanciades per un model o són instanciades per un model que sempre té molt pocs elements. Es presentaran com una quadrícula de dues columnes que romandran centrades si l'aplicació és realment ampla, o es convertiran en una sola columna si no hi ha prou espai per a dues columnes, com en la pantalla d'un telèfon mòbil.
sl: [Kirigami.CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) je najbolj uporabna, če kartice, ki so predstavljene, niso v opredmetene z modelom ali z modelom, ki ima vedno zelo malo predmetov. Predstavljeni so kot mreža dveh stolpcev, ki bosta ostala usredinjena, če je aplikacija res široka ali pa postaneta en sam stolpec, če ni dovolj prostora za dva stolpca, kot je npr. na zaslonu mobilnega telefona.

source: [`CardsListView`](docs:kirigami;org.kde.kirigami.CardsListView) is better suited for larger models.
ca: [`CardsListView`](docs:kirigami;org.kde.kirigami.CardsListView) és més adequat per als models més grans.
sl: [`CardsListView`](docs:kirigami;org.kde.kirigami.CardsListView) je bolje prilagojen za večje modele.

source: A [CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) should always be contained within a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
ca: Una [CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) sempre hauria d'estar inclosa dins d'una [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
sl: [CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout) morajo biti vedno vsebovani v postavitvi [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).

source: A card can optionally be oriented horizontally. In this case it will be wider than tall, and is better suited to being placed in a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). If you must put it in a [CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout), it will have a [maximumColumns](https://api.kde.org/qml-org-kde-kirigami-cardslayout.html#maximumColumns-prop) of `2` by default.
ca: De manera opcional, una targeta es pot orientar horitzontalment. En aquest cas, serà més ampla que alta i és més adequada per a col·locar-se en una [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Si heu de posar-la en una [CardsLayout](docs:kirigami;org.kde.kirigami.CardsLayout), de manera predeterminada tindrà un [maximumColumns](https://api.kde.org/qml-org-kde-kirigami-cardslayout.html#maximumColumns-prop) de `2`.

source: ![Screenshot of a CardsLayout showing two side by side cards in portrait orientation on top of a card in landscape orientation, all with different components being used](/docs/getting-started/kirigami/components-card/cardslayout.png)
ca: ![Captura de pantalla d'una CardsLayout que mostra dues targetes cara a cara en orientació vertical a la part superior d'una targeta en orientació horitzontal, totes amb components diferents que s'utilitzen](/docs/getting-started/kirigami/components-card/cardslayout.png)
eo: ![Ekrankopio de CardsLayout montranta du kartojn flank-al-flanke en portreta orientiĝo supre de karto en pejzaĝa orientiĝo, ĉiuj kun malsamaj komponentoj uzataj](/docs/getting-started/kirigami/components-card/cardslayout.png)
es: ![Captura de pantalla de un CardsLayout que muestra dos tarjetas una junto la otra con orientación vertical sobre una tarjeta con orientación horizontal, todas con diferentes componentes en uso](/docs/getting-started/kirigami/components-card/cardslayout.png)
nl: ![Schermafdruk van een CardsLayout die twee kaarten naast elkaar in oriëntatie portret bovenaan een kaart in oriëntatie landschap toont, allen met verschillende in gebruik zijnde componenten](/docs/getting-started/kirigami/components-card/cardslayout.png)
pt: ![Imagem de um CardsLayout a mostrar dois cartões lado-a-lado no formato de retrato, sobre um cartão no formato paisagem, todos com diferentes componentes usados](/docs/getting-started/kirigami/components-card/cardslayout.png)
sl: ![Zajem zaslona postavitve kartic, ki prikazuje dve pokončni kartici strani ob strani na vrhu ležeče kartice, vse z uporabljenimi različnimi komponentami](/docs/use/kirigami/components-card/cardslayout.png)
sv: ![Skärmbild av en CardsLayout som visar två kort sida vid sida i stående orientering ovanpå ett kort i liggande orientering, alla med olika komponenter använda](/docs/getting-started/kirigami/components-card/cardslayout.png)
uk: ![Знімок CardsLayout, де показано картки, які розташовано поруч, у книжковій орієнтації над карткою у альбомній орієнтації; усі з різними використаними компонентами](/docs/getting-started/kirigami/components-card/cardslayout.png)

source: A [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) is a list view that can be used with [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) components.
ca: Una [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) és una vista de llista que es pot utilitzar amb els components d'[AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard).
sl: [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) je pogled seznama, ki ga lahko uporabljate s komponentami [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard).

source: A [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) will stretch child cards to its own width. This component should therefore only be used with cards which will look good at any horizontal size. Use of a [Card](docs:kirigami;org.kde.kirigami.Card) component inside it is discouraged, unless it has [Qt.Horizontal](docs:qtcore;Qt::Orientation) as its [headerOrientation](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#headerOrientation-prop) property.
ca: Una [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) estendrà les targetes filles a la seva pròpia amplada. Per tant, aquest component només s'ha d'utilitzar amb les targetes que es vegin bé en qualsevol mida horitzontal. Es desaconsella l'ús del component [Card](docs:kirigami;org.kde.kirigami.Card), llevat que tingueu Qt.Horizontal](docs:qtcore;Qt::Orientation) com la seva propietat [headerOrientation](https://api.kde.org/qml-org-kde-kirigami-abstractcard.html#headerOrientation-prop).

source: NOTE: never put a Layout as contentItem as it will cause binding loops
ca: NOTA: No poseu mai una disposició com a contentItem, ja que provocarà bucles de vincle
eo: NOTO: neniam metu Aranĝon kiel enhavItem ĉar ĝi kaŭzos ligajn buklojn
es: NOTA: no usar nunca un Layout como contentItem, ya que puede provocar bucles de enlace.
fr: REMARQUE : ne jamais mettre un objet « Layout » comme « contentItem » car cela provoquerait des boucles imbriquées.
nl: OPMERKING: zet nooit een Layout als contentItem omdat het bindinglussen zal veroorzaken
pl: UWAGA: nigdy nie umieszczaj Layout jako contentItem, bo spowoduje to pętle powiązań
pt: NOTA: nunca colocar um Layout como 'contentItem', porque irá criar associações em ciclo
sl: OPOMBA: nikoli ne postavite postavitve Layout kot vsebino v contentItem, saj bo povzročil zavezujoče zanke
sv: Observera: använd aldrig Layout som contentItem eftersom det orsakar bindningssnurror
uk: УВАГА! Ніколи не робіть Layout contentItem, оскільки це призведе до циклічної прив'язки

source: IMPORTANT: never put the bottom margin
ca: IMPORTANT: no posar mai el marge inferior
eo: GRAVA: neniam metu la malsupran marĝenon
es: IMPORTANTE: no colocar nunca el margen inferior
fr: IMPORTANT : ne jamais installer de marge en bas
nl: BELANGRIJK: zet nooit de ondermarge
pl: WAŻNE: nigdy nie umieszczaj dolnego marginesu
pt: IMPORTANTE: nunca coloque a margem inferior
sl: POMEMBNO: nikoli ne nastavite spodnjega roba
sv: Viktigt: ange aldrig undre marginal
uk: ВАЖЛИВО! Ніколи не встановлюйте нижнє поле

source: ![Screenshot of a CardsListView, which is a simple vertical list of cards in landscape mode](/docs/getting-started/kirigami/components-card/cardslistview.png)
ca: ![Captura de pantalla d'una CardsListView, que és una llista vertical senzilla de targetes en mode apaïsat](/docs/getting-started/kirigami/components-card/cardslistview.png)
eo: ![Ekrankopio de CardsListView, kiu estas simpla vertikala listo de kartoj en pejzaĝa reĝimo](/docs/getting-started/kirigami/components-card/cardslistview.png)
es: ![Captura de pantalla de una CardsListView, que es una sencilla lista vertical de tarjetas en modo apaisado](/docs/getting-started/kirigami/components-card/cardslistview.png)
nl: ![Schermafdruk van een CardsListView, wat een eenvoudige lijst met cards is in modus landschap](/docs/getting-started/kirigami/components-card/cardslistview.png)
pt: ![Imagem de uma CardsListView, que é uma lista vertical simples de cartões no modo de paisagem](/docs/getting-started/kirigami/components-card/cardslistview.png)
sl: ![Posnetek zaslona CardsListView, ki je enostavni navpični seznam kartic v ležečem načinu](/docs/use/kirigami/components-card/cardslistview.png)
sv: ![Skärmbild av en CardsListView, som är en enkel vertikal lista med kort i liggande orientering](/docs/getting-started/kirigami/components-card/cardslistview.png)
uk: ![Знімок CardsListView, який є простим вертикальним списком карток у режимі альбому](/docs/getting-started/kirigami/components-card/cardslistview.png)

source: Chips are small elements typically used to list out related properties.
ca: Els chips són elements petits que s'utilitzen normalment per a llistar les propietats relacionades.
eo: Blatoj estas malgrandaj elementoj kutime uzataj por listigi rilatajn ecojn.
es: Los chips son pequeños elementos que se suelen usar para listar las propiedades relacionadas.
nl: Chips zijn kleine elementen standaard gebruikt om een lijst te maken van gerelateerde eigenschappen.
sl: Čipi so majhni elementi, ki se običajno uporabljajo za navajanje povezanih lastnosti.
sv: Chips är små element som vanligtvis används för att lista relaterade egenskaper.
uk: Чіпси — малі елементи, які типово використовують для зберігання списків пов'язаних властивостей.

source: [Kirigami.Chip](docs:kirigami;org.kde.kirigami.Chip) components are small elements inherited from [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) used for displaying common properties or filters of something. These are typically text elements, which is also interactable and comes with an optional delete button.
ca: Els components [Kirigami.Chip](docs:kirigami;org.kde.kirigami.Chip) són elements petits heretats del [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) utilitzats per a mostrar propietats comunes o filtres d'alguna cosa. Aquests són normalment elements de text, que també es pot interaccionar amb ells i venen amb un botó opcional de supressió.
sl: Komponente [Kirigami.Chip](docs:kirigami;org.kde.kirigami.Chip) so podedovani majhni elementiiz [AbstractButton](https://doc.qt.io/qt-5/qml-qtquick-controls2-abstractbutton.html), ki se uporabljajo za prikaz skupnih lastnosti ali filtrov nečesa. To so tipično besedilni elementi, ki so tudi interaktivni in imajo izbirni gumb za brisanje.

source: ![Example Chips in Kirigami Gallery](chips_kirigami_gallery.png)
ca: ![Chips d'exemple a la Galeria del Kirigami](chips_kirigami_gallery.png)
eo: ![Ekzemplaj Blatoj en Kirigami Galerio](chips_kirigami_gallery.png)
es: ![Ejemplo de Chips en la galería de Kirigami](chips_kirigami_gallery.png)
nl: ![Voorbeeld Chips in Kirigami galerij](chips_kirigami_gallery.png)
sl: ![Primer čipov v galeriji Kirigami](chips_kirigami_gallery.png)
sv: ![Exempel på Chips i Kirigami galleri](chips_kirigami_gallery.png)
uk: ![Приклад чіпсів у галереї Kirigami](chips_kirigami_gallery.png)

source: Quick Start
ca: Inici ràpid
eo: Rapida Komenco
es: Inicio rápido
nl: Snelstart
sl: Hitri zagon
sv: Snabbstart
uk: Початкові зауваження

source: Chips can easily be added using the [Kirigami.Chip](https://api.kde.org/qml-org-kde-kirigami-chip.html) component. By assigning a string to its inherited [AbstractButton.text](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#text-prop) field, we give chips their name.
ca: Els chips es poden afegir fàcilment utilitzant el component [Kirigami.Chip](https://api.kde.org/qml-org-kde-kirigami-chip.html). En assignar una cadena al seu camp [AbstractButton.text](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#text-prop) heretat, li donem el nom als chips.

source: ![Declaring and Displaying Chips](chips_usage.png)
ca: ![Declaració i visualització de chips](chips_usage.png)
eo: ![Deklarante kaj Montrante Blatojn](chips_usage.png)
es: ![Declarar y mostrar Chips](chips_usage.png)
nl: ![Declareren en tonen van Chips](chips_usage.png)
sl: ![Deklaracija in prikaz žetonov](chips_usage.png)
sv: ![Deklarera och visa Chips](chips_usage.png)
uk: ![Оголошення і показ чіпсів](chips_usage.png)

source: With Repeaters (Recommended)
ca: Amb repetidors (recomanat)
eo: Kun Ripetiloj (Rekomendita)
es: Con repetidores (recomendado)
nl: Met herhalers (aanbevolen)
sl: Z repetitorji (priporočeno)
sv: Med Repeaters (rekommenderas)
uk: Із повторювачами (рекомендовано)

source: Since chips are meant to be used more than once, you'll likely want to use some kind of list data structure and iterate over them to display the chips. To do this, we need a [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) and a [Repeater](https://doc.qt.io/qt-6/qml-qtquick-repeater.html) component.
ca: Com que els chips s'han d'utilitzar més d'una vegada, és probable que vulgueu utilitzar algun tipus d'estructura de dades de llista i iterar-los per a mostrar els chips. Per a fer-ho, necessitem un component [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) i un component [Repeater](https://doc.qt.io/qt-6/qml-qtquick-repeater.html).
eo: Ĉar blatoj estas uzataj pli ol unufoje, vi verŝajne volos uzi iun liston de datumstrukturo kaj ripeti ilin por montri la blatojn. Por fari tion, ni bezonas [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) kaj [Ripetilon](https://doc.qt.io /qt-6/qml-qtquick-repeater.html) komponanto.
nl: Omdat chips bedoeld zijn om meer dan eens te worden gebruikt, wilt u waarschijnlijk een vorm van een gegevensstructuur mat een lijst gebruiken en er over itereren om de chips te tonen. Om dat te doen hebben we een [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) nodig en een component [Herhaler](https://doc.qt.io/qt-6/qml-qtquick-repeater.html).
sl: Ker so čipi namenjeni večkratni uporabi, jih boste verjetno želeli uporabiti nekakšno podatkovno strukturo seznama in iteracijo na njih za prikaz čipov. Za to potrebujemo [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) in [Repeater](https://doc.qt.io/qt-6/qml-qtquick-repeater.html).
sv: Eftersom chips är avsedda att användas mer än en gång, vill man förmodligen använda någon form av datastruktur med listor och iterera över den för att visa chipsen. För att göra det behöver vi en [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) och en [Repeater](https://doc.qt.io) /qt-6/qml-qtquick-repeater.html) komponent.
uk: Оскільки чіпси призначено для багаторазового використання, ймовірно, вам потрібна буде певна структура спискових даних та ітерація за ними для показу чіпсів. Для цього нам знадобляться компоненти [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) і [Repeater](https://doc.qt.io/qt-6/qml-qtquick-repeater.html).
