Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A handy feature of [Kirigami.FormLayout](docs:kirigami2;FormLayout) is that you can add checkboxes to its children. This can be useful in settings pages where you might want to let the user enable or disable a setting, and also want the user to provide some extra information in a component such as a textfield.
eo: Praktika funkcio de [Kirigami.FormLayout](docs:kirigami2;FormLayout) estas, ke vi povas aldoni markobutonojn al ĝiaj infanoj. Ĉi tio povas esti utila en agordaj paĝoj, kie vi eble volas lasi la uzanton ebligi aŭ malŝalti agordon, kaj ankaŭ volas, ke la uzanto disponigu kelkajn kromajn informojn en komponanto kiel tekstkampo.
es: Una funcionalidad útil de [Kirigami.FormLayout](docs:kirigami2;FormLayout) es que puede asignar casillas de verificación a sus hijos. Esto puede ser de utilidad en las páginas de preferencias donde quiera permitir que el usuario active o desactive una preferencia y también quiera que el usuario proporcione información adicional en un componente, como un campo de texto.
nl: Een handige functie van [Kirigami.FormLayout](docs:kirigami2;FormLayout) is dat u keuzevakjes aan zijn kinderen kan toevoegen. Dit kan nuttig zijn op instellingspagina's waar u de gebruiker een instelling wilt laten in- of uitschakelen en ook de gebruiker enige extra informatie wilt leveren in een component zoals een tekstveld.
pt: Uma funcionalidade útil do [Kirigami.FormLayout](docs:kirigami2;FormLayout) é que poderá adicionar opções de marcação aos seus filhos. Isto poderá ser útil em páginas de configuração, onde poderá querer que o utilizador active ou desactive uma dada configuração, assim como fornecer mais informações extra sobre essa configuração, como por exemplo num campo de texto.
sv: En praktisk funktion i [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) är att du kan lägga till kryssrutor för dess underliggande objekt. Det kan vara användbart för inställningssidor där du kan vilja att användaren aktiverar eller inaktiverar en inställning, och dessutom vill att användaren tillhandahåller någon extra information i en komponent, såsom ett textfält.
uk: Зручною можливістю [Kirigami.FormLayout](docs:kirigami2;FormLayout) є можливість додавання пунктів позначок до його дочірніх елементів. Нею можна скористатися на сторінках параметрів, де у вас може виникнути потреба у наданні користувачу можливості увімкнути або вимкнути щось, а також наданні користувачу додаткової інформації у компонентах, подібних до поля для введення тексту.

source: A form layout with checkable label.
eo: Form-aranĝo kun markebla etikedo.
es: Un diseño de formulario con una etiqueta que se puede marcar.
nl: Een formulierindeling met te activeren label.
pt: Uma disposição em formulário com uma legenda com opção de marcação.
sl: Postavitev obrazca s potrditveno oznako.
sv: En formulärlayout med markeringsbar beteckning.
uk: Компонування форми з придатною для позначення міткою.

source: If you would rather have your form layout stay consistent regardless of your application's environment, you can use the [wideMode](docs:kirigami2;FormLayout::wideMode) property of the [Kirigami.FormLayout](docs:kirigami2;FormLayout) component:
eo: Se vi preferas ke via formulararanĝo restu konsekvenca sendepende de la medio de via aplikaĵo, vi povas uzi la [wideMode](docs:kirigami2;FormLayout::wideMode) proprecon de la [Kirigami.FormLayout](docs:kirigami2;FormLayout) komponento:
nl: Als u liever hebt dat uw formulierindeling consistent blijft onafhankelijk van de omgeving van uw toepassing, dan kunt u de eigenschap [wideMode](docs:kirigami2;FormLayout::wideMode) van de component [Kirigami.FormLayout](docs:kirigami2;FormLayout) gebruiken.
pt: Se preferir que a disposição do seu formulário fique consistente, independentemente do ambiente da sua aplicação, poderá usar a propriedade [wideMode](docs:kirigami2;FormLayout::wideMode) do componente [Kirigami.FormLayout](docs:kirigami2;FormLayout):
sv: Om du hellre vill att din formulärlayout ska förbli konsekvent oberoende av programmets omgivning, kan du använda egenskapen [wideMode](docs:kirigami2;FormLayout::wideMode) i komponenten [Kirigami.FormLayout](docs:kirigami2;FormLayout):
uk: Якщо ви надаєте перевагу збереженню однорідності вигляду компонування форми, незалежно від середовища програми, ви можете скористатися властивістю [wideMode](docs:kirigami2;FormLayout::wideMode) компонента [Kirigami.FormLayout](docs:kirigami2;FormLayout):

source: There are instances when you want a label to be assigned to components that have more than one line or to a list of components. This can be achieved by putting the [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) in the [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), as you might have noticed in [Sections and Separators](#sections-and-separators). By default the label is positioned in the vertical center of the layout, which is not always desirable. We can change this with help of [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment).
eo: Estas okazoj, kiam vi volas, ke etikedo estu asignita al komponantoj, kiuj havas pli ol unu linion aŭ al listo de komponantoj. Ĉi tio povas esti atingita metante la [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) en la [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts- columnlayout.html), kiel vi eble rimarkis en [Sekcioj kaj Apartigiloj](#sections-and-separators). Defaŭlte la etikedo estas poziciigita en la vertikala centro de la aranĝo, kio ne ĉiam estas dezirinda. Ni povas ŝanĝi ĉi tion helpe de [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment).
nl: Er zijn exemplaren wanneer u een label wilt toekennen aan componenten die meer dan één regel hebben of aan een lijst componenten. Dit kan bereikt worden door de [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) te stoppen in de [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), zoals u zou kunnen hebben opgemerkt in [Secties en scheidingstekens](#sections-and-separators). Standaard is de label gepositioneerd in het verticale centrum van de indeling, wat niet altijd wenselijk is. We kunnen dit met hulp van [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment) wijzigen.
pt: Existem instâncias em que deseja atribuir uma legenda a componentes que tenham mais que uma linha ou a uma lista de componentes. Isto pode ser obtido se colocar a [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) no [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), como poderá ter reparado nas [Secções e Separadores](#sections-and-separators). Por omissão, a legenda está posicionada verticalmente ao centro da disposição, o que nem sempre é desejável. Podemos mudar isto com a ajuda do [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment).
sv: Det finns tillfällen då du vill att en beteckning ska tilldelas till komponenter som har mer än en rad eller till en lista med komponenter. Det kan uppnås genom att placera [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) i [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts- columnlayout.html), som du kanske har märkt i [Sektioner och avskiljare](#sections-and-separators). Normalt är beteckningen placerad vertikalt mitt i layouten, vilket inte alltid är önskvärt. Vi kan ändra det med hjälp av [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment).
uk: Іноді виникає потреба у наданні мітці значення компонентів, які складаються з декількох рядків, або списку компонентів. Досягти бажаного результату можна вставленням [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) до [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), як ви могли помітити у розділі [Розділи і роздільники](#sections-and-separators). Типово, мітку буде розташовано у центрі компонування за вертикаллю, що не завжди є бажаним. Змінити розташування можна за допомогою [Kirigami.FormData.labelAlignment](docs:kirigami2;FormLayoutAttached::labelAlignment).

source: [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) components have two important properties to be mindful of:
eo: [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) komponantoj havas du gravajn ecojn por atenti:
es: Los componentes [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) tienen dos propiedades importantes a tener en cuenta:
nl: [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) componenten hebben twee belangrijke eigenschappen om aan te denken:
pt: Os componentes [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) têm duas propriedades importantes a ter em conta:
sv: [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) komponenter har två viktiga egenskaper att vara medveten om:
uk: У компонентів [Kirigami.InlineMessage](docs:kirigami2;InlineMessage) є дві важливих властивості, про які варто згадати:

source: [text](docs:kirigami2;templates::InlineMessage::text): here is where you set the text of your inline message.
eo: [teksto](docs:kirigami2;templates::InlineMessage::text): jen kie vi agordas la tekston de via enlinia mesaĝo.
es: [text](docs:kirigami2;templates::InlineMessage::text): aquí es donde se define el texto del mensaje en línea.
nl: [text](docs:kirigami2;templates::InlineMessage::text): hier is waar u de tekst van uw inline bericht zet.
pt: [text](docs:kirigami2;templates::InlineMessage::text): aqui é onde poderá definir o texto da sua mensagem incorporada.
sv: [text](docs:kirigami2;templates::InlineMessage::text): Här är platsen där du anger texten för meddelandet på plats
uk: [text](docs:kirigami2;templates::InlineMessage::text): тут можна встановити текст вашого вбудованого повідомлення.

source: Standard inline messages are like the ones above: they have a blue background and a default icon. We can change that with the [type](docs:kirigami2;templates::InlineMessage::type) property, which lets us set our inline message to a different type. There are four types we can choose from:
eo: Normaj enliniaj mesaĝoj estas kiel tiuj supre: ili havas bluan fonon kaj defaŭltan piktogramon. Ni povas ŝanĝi tion per la propreco [type](docs:kirigami2;templates::InlineMessage::type), kiu ebligas al ni agordi nian enlinian mesaĝon al malsama tipo. Estas kvar tipoj, kiujn ni povas elekti:
es: Los mensajes en línea estándares son como los anteriores: tienen un fondo azul y un icono predeterminado. Podemos cambiar esto con la propiedad [type](docs:kirigami2;templates::InlineMessage::type), que nos permite hacer que nuestro mensaje en línea sea de un tipo diferente. Hay cuatro tipos entre los que podemos elegir:
nl: Standaard inline berichten zijn als die hierboven: ze hebben een blauwe achtergrond en een standaard pictogram. We kunnen dat wijzigen met de eigenschap [type](docs:kirigami2;templates::InlineMessage::type), die ons ons inline bericht op een ander type laat zetten. Er zijn vier typen waar we uit kunnen kiezen:
pt: As mensagens-padrão incorporadas são como as que aparecem acima: as mesmas têm um fundo azul e um ícone predefinido. Poderemos alterar isso com a propriedade [type](docs:kirigami2;templates::InlineMessage::type), a qual nos permite configurar a nossa mensagem incorporada com um tipo diferente. Existem quatro tipos que poderemos escolher:
sv: Vanliga meddelande på plats är som de ovan: de har en blå bakgrund och en standardikon. Vi kan ändra det med egenskapen [type](docs:kirigami2;templates::InlineMessage::type), som låter oss ställa in våra meddelande på plats till en annan typ. Det finns fyra typer vi kan välja mellan:
uk: Стандартні вбудовані повідомлення подібні до показано вище: вони мають синє тло і типову піктограму. Змінити це можна за допомогою властивості [type](docs:kirigami2;templates::InlineMessage::type), яка надає нам змогу встановити для нашого вбудованого повідомлення інший тип. Передбачено чотири типи, одним з яких ми можемо скористатися:

source: You can also customise the icon that appears on the top left of your message by providing a system icon name for the [icon.source](docs:kirigami2;templates::InlineMessage::icon) property. These icon names should correspond to icons installed on your system; you can use an application such as Cuttlefish provided by [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) to browse and search the icons available on your system, and see what their names are.
eo: Vi ankaŭ povas agordi la piktogramon kiu aperas supre maldekstre de via mesaĝo provizante sisteman piktogramnomon por la [icon.source](docs:kirigami2;templates::InlineMessage::icon) propreco. Ĉi tiuj piktogramnomoj devus respondi al piktogramoj instalitaj en via sistemo; vi povas uzi aplikaĵon kiel Cuttlefish provizitan de [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) por foliumi kaj serĉi la disponeblajn piktogramojn en via sistemo, kaj vidi kiaj estas iliaj nomoj.
nl: U kunt ook het pictogram dat linksboven van uw melding verschijnt aanpassen door een systeempictogram-naam te leveren voor de eigenschap [icon.source](docs:kirigami2;templates::InlineMessage::icon). Deze pictogramnamen zouden overeen moeten komen met op uw systeem geïnstalleerde pictogrammen; u kunt een toepassing zoals Cuttlefish, geleverd door [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), gebruiken om te bladeren en te zoeken naar de beschikbare pictogrammen op uw systeem en zien wat hun namen zijn.
pt: Também poderá personalizar o ícone que aparece no canto superior-esquerdo da sua mensagem, fornecendo um nome de ícone do sistema na propriedade `icon.source`. Estes nomes de ícones deverão corresponder aos ícones instalados no seu sistema; poderá usar uma aplicação como o Cuttlefish, que vem no pacote [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) para navegar e pesquisar os ícones disponíveis no seu sistema, bem como os seus nomes.
sv: Du kan också anpassa ikonen som visas längst upp till vänster i meddelandet genom att tillhandahålla ett systemikonnamn för egenskapen [icon.source](docs:kirigami2;templates::InlineMessage::icon). Ikonnamnen ska motsvara ikoner installerade på systemet. Du kan använda ett program såsom Cuttlefish som tillhandahålls av [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) för att bläddra och söka efter tillgängliga ikoner på systemet, och vad deras namn är.
uk: Ви також можете налаштувати піктограму, яку буде показано у верхньому лівому куті повідомлення, вказавши назву загальносистемної піктограми у властивості [icon.source](docs:kirigami2;templates::InlineMessage::icon). Ці назви піктограм відповідають піктограмам, які встановлено у системі; ви можете скористатися програмою, подібною до Cuttlefish з [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), для перегляду і пошуку піктограм, які доступні у вашій системі, а також визначення їхніх назв.

source: If your messages need to be interactive, you can attach Kirigami actions to your inline messages. Like with pages, you can do this by setting the [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) property to either a [Kirigami.Action](docs:kirigami2;Action) or an array containing [Kirigami.Action](docs:kirigami2;Action) components.
eo: Se viaj mesaĝoj devas esti interagaj, vi povas kunligi Kirigami-agojn al viaj enliniaj mesaĝoj. Kiel ĉe paĝoj, vi povas fari tion agordante la [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) proprecon al aŭ [Kirigami.Action](docs:kirigami2;Action) aŭ tabelo enhavanta [ Kirigami.Action](docs:kirigami2;Action) komponantoj.
nl: Als uw meldingen interactief moeten zijn, kunt u Kirigami acties toevoegen aan uw inline meldingen. Net als met pagina's kunt u dit doen door het zetten van de eigenschap [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) op ofwel een [Kirigami.Action](docs:kirigami2;Action) of een array dat [Kirigami.Action](docs:kirigami2;Action) componenten bevat.
pt: Se as suas mensagens precisam de ser interactivas, poderá associar acções do Kirigami às suas mensagens incorporadas. Como acontece nas páginas, podê-lo-á fazer se configurar a propriedade [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) da mensagem incorporada com uma [Kirigami.Action](docs:kirigami2;Action) ou com uma lista de componentes [Kirigami.Action](docs:kirigami2;Action).
sv: Om dina meddelanden måste vara interaktiva, kan du koppla Kirigami-åtgärder till dina meddelanden på plats. Liksom med sidor, kan du göra det genom att ställa in meddelandets egenskap [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) antingen en [Kirigami.Action](docs:kirigami2;Action) eller ett fält som innehåller [Kirigami.Action](docs:kirigami2;Action) komponenter.
uk: Якщо ваші повідомлення мають бути інтерактивними, ви можете долучити до ваших вбудованих повідомлень кнопки дій Kirigami. Подібно до сторінок, ви можете зробити це встановленням властивості [InlineMessage.actions](docs:kirigami2;templates::InlineMessage::actions) вбудованого повідомлення у значення [Kirigami.Action](docs:kirigami2;Action) або у значення масиву, що містить компоненти [Kirigami.Action](docs:kirigami2;Action).

source: By default, this close button is hidden, but this can be overridden by setting the [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) property to `true`.
eo: Defaŭlte, ĉi tiu fermbutono estas kaŝita, sed ĉi tio povas esti anstataŭita agordante la proprecon [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) al `true`.
es: De forma predeterminada, este botón de cierre está oculto, pero puede modificar este comportamiento definiendo la propiedad [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) a `true`.
nl: Standaard is deze sluitknop verborgen, maar dit kan overschreven worden door de eigenschap [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) op `true` te zetten.
pt: Por omissão, este botão de fecho está escondido, mas isso pode ser substituído ao configurar a propriedade [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) como verdadeira.
sv: Normalt är stängningsknappen dold, men det kan överskridas genom att ställa in egenskapen [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) till `true`.
uk: Типово, цю кнопку закриття приховано, але таку поведінку можна перевизначити, встановивши для властивості [showCloseButton](docs:kirigami2;templates::InlineMessage::showCloseButton) значення `true`.

source: [Listviews](docs:qtquick;QtQuick.ListView) can help you display objects from a model in an attractive way. To use a list view, you have to keep track of three things:
eo: [Listviews](docs:qtquick;QtQuick.ListView) povas helpi vin montri objektojn de modelo en alloga maniero. Por uzi listvidon, vi devas observi tri aferojn:
es: Las [Listviews](docs:qtquick;QtQuick.ListView) le pueden ayudar a mostrar los objetos de un modelo de una forma atractiva. Para usar una vista de lista, debe seguir la pista de tres cosas:
nl: [Listviews](docs:qtquick;QtQuick.ListView) kan u helpen om objecten uit een model op een attractieve manier te tonen. Om een lijstweergave te gebruiken moet u drie dingen volgen:
pt: Os objectos [Listview](docs:qtquick;QtQuick.ListView) podê-lo-ão ajudar a mostrar os objectos de um modelo de forma atraente. Para usar uma lista, tem de ter em conta três coisas:
sl: Pregledi seznamov [Listviews](docs:qtquick;QtQuick.ListView) vam lahko pomagajo prikazati predmete iz modela na privlačen način. Če želite uporabiti pogled seznama, morate spremljati tri stvari:
sv: [Listvyer](docs:qtquick;QtQuick.ListView) kan hjälpa dig att visa objekt från en modell på ett attraktivt sätt. För att använda en listvy måste du hålla redan på tre saker:
uk: [Панелі списків](docs:qtquick;QtQuick.ListView) можуть допомогти у показі об'єктів на основі моделі у привабливий спосіб. Щоб правильно користуватися панеллю списку, вам слід стежити за трьома речима:

source: Here is an example that contains exactly one list view, one model and one delegate, using a [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate):
eo: Jen ekzemplo kiu enhavas precize unu listvidon, unu modelon kaj unu delegiton, uzante [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate):
es: Este es un ejemplo que contiene exactamente una vista de lista, un modelo y un delegado, usando un [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate):
nl: Hier is een voorbeeld met precies een weergeven lijst, een model en een delegatie, dat een [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate) gebruikt:
sv: Här är ett exempel som innehåller exakt en listvy, en modell och en delegat, med en [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate):
uk: Тут наведено приклад, який містить точно одну панель перегляду списку, одну модель та один делегат, з використанням [Kirigami.SubtitleDelegate](docs:kirigami2;SubtitleDelegate):

source: anchors.fill: parent
eo: ankroj.plenigi: patro
es: anchors.fill: padre
