Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The `above` and `below` properties are rather self-explanatory when it comes to their use: you pass the `id` of the components above and below the separator. When they are set, the separator will swiftly disappear whenever the above or below item is highlighted/hovered. They are most useful, for instance, when you need to generate components dynamically and you can't automatically assume which item will come immediately before or after the separator. That would be the case in the Accounts section of our application once the logic to add new accounts were actually implemented, in which case we could always grab the last item in the model to do so.
eo: La "supraj" kaj "malsupraj" ecoj estas sufiĉe memklarigeblaj kiam temas pri ilia uzo: vi pasas la "id" de la komponantoj super kaj sub la apartigilo. Kiam ili estas fiksitaj, la apartigilo rapide malaperos kiam ajn la supra aŭ malsupra elemento estas elstarigita/ŝvebita. Ili estas plej utilaj, ekzemple, kiam vi bezonas generi komponantojn dinamike kaj vi ne povas aŭtomate supozi, kiu objekto venos tuj antaŭ aŭ post la apartigilo. Tio estus la kazo en la sekcio Kontoj de nia aplikaĵo post kiam la logiko por aldoni novajn kontojn efektive estus efektivigita, en kiu kazo ni ĉiam povus kapti la lastan eron en la modelo por fari tion.
es: Las propiedades `above` y `below` son casi autoexplicativas cuando se trata de su uso: se pasa el `id` de los componentes que hay por encima y por debajo del separador. Cuando se configuran, el separador desaparecerá rápidamente cada vez que se resalte o se coloque el cursor sobre el elemento de encima o de debajo. Son más útiles, por ejemplo, cuando necesita generar componentes dinámicamente y no puede asumir automáticamente el elemento que aparecerá inmediatamente antes o después del separador. Ese sería el caso en la sección «Cuentas» de nuestra aplicación una vez que se implementara la lógica para añadir nuevas cuentas, en cuyo caso siempre podríamos tomar el último elemento del modelo para hacerlo.
nl: De eigenschappen `above` en `below` zijn tamelijk zelf-uitleggend wanneer het hun gebruik betreft: u geeft de `id` van de componenten boven en onder de scheiding. Wanneer ze zijn ingesteld zal de scheiding snel verdwijnen wanneer het item boven of onder is geaccentueerd/er boven worden gezweefd. Ze zijn het meest nuttig, bijvoorbeeld, wanneer u componenten dynamisch moet genereren en u kunt automatisch aannemen welk item onmiddellijk zal komen voor of na de scheiding. Dat zou het geval zijn in de section Accounts van uw toepassing nadat de logica om nieuwe accounts toe te voegen echt zou zijn geïmplementeerd, in welk geval we altijd het laatste item in het model kunnen pakken om dat te doen.
sl: Lastnosti `above` in `below` sta precej samoumevni, ko gre zanje njihovo uporabo: posredujete `id` komponent nad in podločilom. Ko so nastavljeni, bo ločilo kadar koli hitro izginilo, zgornji ali spodnji element pa je označen/lebdi nad njim. Najbolj uporabni so za primer, ko morate dinamično generirati komponente in ne morete samodejno predpostaviti, kateri element bo prišel tik pred ali za ločilom. Tako bi bilo v razdelku Accounts naše aplikacijeko je bila logika za dodajanje novih računov dejansko implementirana, v tem primeruvedno lahko zgrabimo zadnji element v modelu, da to storimo.
sv: Egenskaperna `above` och `below` är ganska självförklarande när det gäller deras användning: man skickar "id" för komponenterna ovanför och under avskiljaren. När de är inställda försvinner avskiljaren snabbt när objektet ovan eller under markeras eller musen hålls över det. De är mest användbara, när komponenter behöver genereras dynamiskt och det inte går att automatiskt anta vilket objekt som kommer omedelbart före eller efter avskiljaren. Det vore fallet i sektionen Accounts i vårt program när logiken för att lägga till nya konton faktiskt implementeras, då vi alltid skulle kunna ta det sista objektet i modellen för att göra det.
uk: Властивості `above` і `below` досить зрозумілі, коли йдеться про їхнє використання: ви передаєте `id` компонентів над і під роздільником. Коли їх установлено, роздільник швидко зникатиме, при підсвічуванні або наведенні вказівника миші на пункт вище або нижче. Вони найбільш корисні, наприклад, коли вам потрібно генерувати компоненти динамічно, а ви не можете автоматично спрогнозувати, який елемент буде безпосередньо перед роздільником або після нього. Так було б у розділі «Облікові записи» нашої програми, де було реалізовано логіку додавання нових облікових записів, коли ми завжди могли б отримати останній елемент у моделі, щоб зробити це.

source: We create our application and use [KAboutData's](docs:kcoreaddons;KAboutData) default constructor to add the metadata of our application, add ourselves as an author, and then use [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) to finish the process. For later, we also set an application icon that comes from the system theme.
eo: Ni kreas nian aplikaĵon kaj uzas [KAboutData's](docs:kcoreaddons;KAboutData) defaŭltan konstrukciilon por aldoni la metadatenojn de nia aplikaĵo, aldonas nin kiel aŭtoron, kaj poste uzas [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) por fini la procezon. Por poste, ni ankaŭ starigis aplikaĵpiktogramon kiu venas de la sistemetoso.
es: Creamos nuestra aplicación y usamos el constructor predeterminado de [KAboutData's](docs:kcoreaddons;KAboutData) para añadir los metadatos de nuestra aplicación, nos añadimos a nosotros mismos como autor y luego usamos [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) para terminar el proceso. Para después, también definimos un icono para la aplicación que proviene del tema del sistema.
nl: We maken onze toepassing en gebruiken de standaard constructor [KAboutData's](docs:kcoreaddons;KAboutData) om de metagegevens van onze toepassing toe te voegen, voegen onszelf toe als een auteur en gebruiken daarna [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) om het proces te beëindigen. Voor later zetten we ook een toepassingspictogram die uit het systeemthema komt.
sl: Ustvarimo svojo aplikacijo in uporabimo [KAboutData's](docs:kcoreaddons;KAboutData) privzeti konstruktor za dodajanje metapodatkov naše aplikacije, dodamo sebe kot avtorja in nato uporabimo [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData), da dokončamo postopek. Za kasneje tudi minastavimo ikono aplikacije, ki prihaja iz sistemske teme.
sv: Vi skapar vårt programmet och använder den vanliga konstruktorn i [KAboutData](docs:kcoreaddons;KAboutData) för att lägga till metadata för vårt program, lägger till oss själva som upphovsmän och använder sedan [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) för att slutföra processen. För senare anger vi också en programikon som kommer från systemets temat.
uk: Ми створюємо нашу програму та використовуємо типовий конструктор [KAboutData](docs:kcoreaddons;KAboutData), щоб додати метадані нашої програми, додаємо себе як автора, а потім використовуємо [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData), щоб завершити процес. Надалі ми також встановлюємо піктограму програми, яка походить із загальносистемної теми.

source: We then use a lambda in [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) to directly send the metadata of our application to the QML side, exposing its properties.
eo: Ni tiam uzas lambda en [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) por rekte sendi la metadatenojn de nia aplikaĵo al la QML-flanko, elmontrante ĝiajn ecojn.
es: A continuación usamos una lambda en [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) para enviar directamente los metadatos a la parte QML de nuestra aplicación, exponiendo sus propiedades.
nl: Daarna gebruiken we een in [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) om direct de metagegevens van onze toepassing naar de QML-kant te verzenden, waarmee eigenschappen worden getoond.
sl: Nato uporabimo lambda v [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) za neposredno pošiljanje metapodatkov naše aplikacijena stran QML in razkrivamo njene lastnosti.
sv: Vi använder sedan ett lambdauttryck i [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) för att skicka vårt programs metadata till QML-sidan, och exponera dess egenskaper.
uk: Далі ми використаємо лямбду у [qmlRegisterSingletonType](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) для безпосереднього надсилання метаданих вашої програми на бік QML, відкриваючи її властивості.

source: We use our handy [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) to set the initial page to a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
eo: Ni uzas nian oportunan [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) por agordi la komencan paĝon al [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
es: Usamos nuestra útil [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) para definir la página inicial a una [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
nl: We gebruiken onze handige [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) om de initiële pagina in te stellen in een [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
sl: Uporabljamo naš priročen [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack), da nastavimo začetno stran na [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
sv: Vi använder vår praktiska [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) för att ställa in originalsidan till en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
uk: Ми скористаємося нашим зручним [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) для встановлення для початкової сторінки варіанта [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).

source: While we could use a [FormLayout](/docs/getting-started/kirigami/components-formlayouts) together with [QtQuick Controls components](components-controls) to achieve our goal, here you will be introduced to [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
eo: Dum ni povus uzi [FormLayout](/docs/getting-started/kirigami/components-formlayouts) kune kun [QtQuick Controls components](components-controls) por atingi nian celon, ĉi tie vi estos prezentita al [FormCard](https ://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
es: Aunque podríamos usar un [FormLayout](/docs/getting-started/kirigami/components-formlayouts) junto con [componentes de controles de QtQuick](components-controls) para conseguir nuestro objetivo, aquí se usará una [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
nl: Terwijl we een [FormLayout](/docs/getting-started/kirigami/components-formlayouts) zouden kunnen gebruiken samen met [QtQuick Controls componenten](components-controls) om ons doel te bereiken, hier zult u geïntroduceerd worden tot [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
sl: Čeprav bi lahko uporabili [FormLayout](/docs/getting-started/kirigami/components-formlayouts) skupaj s [komponentami QtQuick Controls](components-controls) doseči naš cilj, tukaj se boste predstavili [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
sv: Även om vi kunde använda en [FormLayout](/docs/getting-started/kirigami/components-formlayouts) tillsammans med [QtQuick Controls components](components-controls) för att uppnå vårt mål, här introducerar vi [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).
uk: Хоча ми могли б використовувати [FormLayout](/docs/getting-started/kirigami/components-formlayouts) разом із [компонентами QtQuick Controls](components-controls) для досягнення нашої мети, тут ви познайомитеся з [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html).

source: The main purpose of a FormCard is to serve as a container for other components while following a color different from the background, in a similar manner to a [Kirigami.Card](docs:kirigami2;Card), but for settings windows. You can have multiple FormCards in your application to indicate different sections. Your FormCard is also expected to be a direct child of a ColumnLayout.
eo: La ĉefa celo de FormCard estas servi kiel ujo por aliaj komponantoj sekvante diferencan koloron de la fono, en simila maniero al [Kirigami.Card](docs:kirigami2;Karto), sed por agordaj fenestroj. Vi povas havi plurajn FormCards en via aplikaĵo por indiki malsamajn sekciojn. Via FormCard ankaŭ estas atendita esti rekta infano de ColumnLayout.
es: El propósito principal de una FormCard es de servir como contenedor para otros componentes con un color distinto para el fondo, de un modo similar a [Kirigami.Card](docs:kirigami2;Card), pero para ventanas de preferencias. Puede tener varias FormCards en una aplicación para indicar distintas secciones. También se espera que la FormCard sea descendiente directa de una ColumnLayout.
nl: Het hoofddoel van een FormCard is om te dienen als een container voor andere componenten terwijl een kleur verschillend van de achtergrond wordt gevolgd, op een manier gelijk aan een [Kirigami.Card](docs:kirigami2;Card), maar voor instellingenvensters. U kunt meerdere FormCards in uw toepassing hebben om verschillende secties aan te geven. Van uw FormCard wordt verwacht dat het een direct kind is van een ColumnLayout.
sl: Glavni namen kartice FormCard je, da služi kot vsebnik za druge komponente, medtem ko sledi barvi, ki se razlikuje od ozadja, na podoben način kot [Kirigami.Card](docs:kirigami2;Card), vendar za nastavitve okna. V svoji aplikaciji lahko imate več kartic FormCard različne razdelke. Pričakuje se tudi, da bo vaš FormCard neposredni podrejeni element ColumnLayout.
sv: Huvudsyftet med FormCard är att fungera som en behållare för andra komponenter samtidigt som det använder en färg som skiljer sig från bakgrunden, på ett liknande sätt som [Kirigami.Card](docs:kirigami2;Card), men för inställningsfönster. Man kan ha flera FormCards i programmet för att indikera olika sektioner. Ett FormCard förväntas också vara direkt underordnat en ColumnLayout.
uk: Основне призначення FormCard — слугувати контейнером для інших компонентів, використовуючи колір, відмінний від фону, подібно до [Kirigami.Card](docs:kirigami2;Card), але для вікон налаштувань. Ви можете мати кілька FormCards у своїй програмі для позначення різних розділів. Очікується, що ваша FormCard буде прямою дочірньою формою ColumnLayout.

source: Informations about your application
eo: Informoj pri via aplikaĵo
es: Información sobre su aplicación
fr: Informations concernant votre application
nl: Informatie over uw toepassing
pl: Szczegóły o twojej aplikacji
pt: Informações sobre a sua aplicação
sl: Informacije o vaši aplikaciji
sv: Information om ditt program
uk: Відомості щодо вашої програми

source: [Kirigami.AboutPage](docs:kirigami2;AboutPage) allows you to have a page that shows the copyright notice of the application together with the list of contributors and some information of which platform it's running on.
eo: [Kirigami.AboutPage](docs:kirigami2;AboutPage) ebligas al vi havi paĝon, kiu montras la kopirajtan avizon de la aplikaĵo kune kun la listo de kontribuantoj kaj iuj informoj pri kiu platformo ĝi funkcias.
es: [Kirigami.AboutPage](docs:kirigami2;AboutPage) le permite tener una página que muestra información sobre el copyright de la aplicación junto a la lista de colaboradores y cierta información sobre la plataforma en la que se está ejecutando.
nl: [Kirigami.AboutPage](docs:kirigami2;AboutPage) biedt u een pagina die de melding over copyright van de toepassing toont samen met hen die bijdroegen en enige informatie over op welk platform het draait.
pt: A página [Kirigami.AboutPage](docs:kirigami2;AboutPage) permite-lhe ter uma página que mostra as notas de direitos de cópia da aplicação, em conjunto com os colaboradores e algumas informações sobre a plataforma em que está a ser executado.
sv: [Kirigami.AboutPage](docs:kirigami2;AboutPage) låter dig ha en sida som visar programmets copyrightmeddelande tillsammans med listan över bidragsgivare och en del information om vilken plattform det kör på.
uk: [Kirigami.AboutPage](docs:kirigami2;AboutPage) надає вам змогу показувати дані щодо авторських прав на програму, список учасників розробки та деякі відомості щодо того, на якій платформі запущено програму.

source: main.cpp
eo: ĉefa.cpp

source: After all the required information has been set, we call [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) to initialize the properties of the [QApplication ](docs:qtwidgets;QApplication) object.
eo: Post kiam ĉiuj bezonataj informoj estas fiksitaj, ni vokas [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) por pravalorigi la ecojn de la [QApplication ](docs:qtwidgets;QApplication) objekto.
es: Tras haber definido toda la información necesaria, llamamos a [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) para inicializar las propiedades del objeto [QApplication](docs:qtwidgets;QApplication).
nl: Nadat alle vereiste informatie is gezet, roepen we [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) aan om de eigenschappen van het object [QApplication ](docs:qtwidgets;QApplication).
pt: Depois de ter sido definida toda a informação necessária, invocamos o [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) para inicializar as propriedades do objecto [QApplication ](docs:qtwidgets;qapplication).
sl: Ko so vsi zahtevani podatki nastavljeni, pokličemo [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) za inicializacijo lastnosti predmeta [QApplication](https://doc.qt.io/qt-5/qapplication.html).
sv: Efter all nödvändig information har angetts, anropar vi [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) för att initiera egenskaperna i objektet [QApplication ](docs:qtwidgets;QApplication).
uk: Після встановлення усіх потрібних відомостей ми викликаємо [KAboutData::setApplicationData](docs:kcoreaddons;KAboutData::setApplicationData) для ініціалізації властивостей об'єкта [QApplication ](docs:qtwidgets;QApplication).

source: main.qml
eo: ĉefa.qml

source: First, we use the import we defined in the `main.cpp` file, namely `org.kde.example`. We then add a [Kirigami.Action](docs:kirigami2;Action) to our [global drawer](docs:kirigami2;GlobalDrawer) that will send us to the About page, and create a component with a [Kirigami.AboutPage](docs:kirigami2;AboutPage) in it, which expects a [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData) object. We exposed precisely that in our `main.cpp` and called it `About`, so we can pass it here.
eo: Unue, ni uzas la importon, kiun ni difinis en la dosiero `main.cpp`, nome `org.kde.example`. Ni tiam aldonas [Kirigami.Action](docs:kirigami2;Action) al nia [globa tirkesto](docs:kirigami2;GlobalDrawer) kiu sendos nin al la paĝo Pri, kaj kreos komponanton kun [Kirigami.AboutPage]( docs:kirigami2;AboutPage) en ĝi, kiu atendas [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData) objekton. Ni elmontris ĝuste tion en nia `main.cpp` kaj nomis ĝin `Pri`, do ni povas pasi ĝin ĉi tie.
es: En primer lugar, usamos la importación que definimos en el archivo `main.cpp`; es decir, `org.kde.example`. A continuación añadimos una [Kirigami.Action](docs:kirigami2;Action) a nuestro [cajón global](docs:kirigami2;GlobalDrawer), que nos enviará a la página «Acerca de», y creamos un componente con una [Kirigami.AboutPage]( docs:kirigami2;AboutPage) en él, que espera un objeto [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData). Ya expusimos precisamente eso en nuestro `main.cpp` y lo llamamos `About`, para poder pasarlo aquí.
nl: Ten eerste gebruiken we het geïmporteerde dat we definiëren in het bestand `main.cpp`, namelijk `org.kde.example`. Daarna voegen we een [Kirigami.Action](docs:kirigami2;Action) toe aan onze [global drawer](docs:kirigami2;GlobalDrawer) die ons naar de pagina About (Info over) zendt en een component met een [Kirigami.AboutPage](docs:kirigami2;AboutPage) erin aanmaakt, die een object [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData) verwacht. We stellen precies dat zichtbaar in onze `main.cpp` en noemen het `About`, zodat we het hier kunnen doorgeven.
pt: Primeiro, usamos a importação que definimos no ficheiro `main.cpp`, nomeadamente a `org.kde.example`. Depois adicionamos uma [Kirigami.Action](docs:kirigami2;Action) à nossa [área global](docs:kirigami2;GlobalDrawer), que nos enviará para a página Acerca, e criamos um componente com uma [Kirigami.AboutPage](docs:kirigami2;AboutPage) nele, a qual está à espera de um objecto [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData). Nós expomos precisamente isso no nosso `main.cpp` e chamámos-lhe `About`, pelo que o podemos passar aqui.
sv: Först använder vi den import som vi definierade i filen `main.cpp`, nämligen `org.kde.example`. Vi lägger sedan till en [Kirigami.Action](docs:kirigami2;Action) i vår [globala låda](docs:kirigami2;GlobalDrawer) som tar oss till sidan Om, och skapar en komponent med en [Kirigami.AboutPage]( docs:kirigami2;AboutPage) i den, som förväntar sig ett [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData) objekt. Vi exponerade just det i vår `main.cpp` och kallade det `About`, så vi kan använda det här.
uk: Спершу ми використовуємо імпортування, яке ми визначити у файлі `main.cpp`, а саме `org.kde.example`. Потім додаємо [Kirigami.Action](docs:kirigami2;Action) на нашу [загальну висувну панель](docs:kirigami2;GlobalDrawer). Відповідна кнопка надаватиме нам змогу переходити на сторінку «Про програму». Створюємо на загальній панелі компонент з [Kirigami.AboutPage](docs:kirigami2;AboutPage) на ньому, яка очікуватиме об'єкт [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData). Сторінка «Про програму» матиме лише одну властивість — `aboutData`. Ми відкрили саме це у нашому `main.cpp` і назвали його `About`, тому тут можемо це пропустити.
