Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: While the FormTextDelegate had the [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#leading-prop) and [trailing](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#trailing-prop) properties to show an item before and after the main content, the FormButtonDelegate only has the [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html#leading-prop) property, because the right side is occupied by the arrow.
ca: Mentre que el FormTextDelegate tenia les propietats [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#leading-prop) i [trailing](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#trailing-prop) per a mostrar un element abans i després del contingut principal, el FormButtonDelegate només té la propietat [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html#leading-prop), perquè el costat dret està ocupat per la fletxa.

source: We use its [icon.name](https://doc.qt.io/Qt-6/qml-qtquick-controls-abstractbutton.html#icon.name-prop) property to set a plus (+) icon to appear after the space where the [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html#leading-prop) would appear, and before the main content. This is a common pattern to indicate your button will add something to a list.
ca: Utilitzem la seva propietat [icon.name](https://doc.qt.io/Qt-6/qml-qtquick-controls-abstractbutton.html#icon.name-prop) per a establir una icona de més (+) que apareixerà després de l'espai on apareixerà el [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html#leading-prop), i abans del contingut principal. Aquest és un patró comú per a indicar que el botó afegirà alguna cosa a una llista.

source: Since this example is for simple illustrative purposes, we don't delve deep into what would be done once the button is clicked: it just prints "Clicked!" to the terminal. We _could_ make a new page for account creation that adds another user to a model, then push the page into view, similarly to what we did in `Main.qml`.
ca: Com que aquest exemple és per a propòsits il·lustratius senzills, no aprofundim en el que es faria una vegada que es clica el botó: només imprimeix «Clicked!» al terminal. _Podríem_ crear una pàgina nova per a la creació de comptes que afegeixi un altre usuari a un model i després empenyi la pàgina a la vista, de manera similar al que vam fer a `Main.qml`.
eo: Ĉar ĉi tiu ekzemplo estas por simplaj ilustraj celoj, ni ne enprofundiĝas pri tio, kio estus farita post kiam la butono estas klakita: ĝi nur presas "Klakita!" al la terminalo. Ni _povus_ fari novan paĝon por kreado de konto kiu aldonas alian uzanton al modelo, tiam puŝi la paĝon en vido, simile al tio, kion ni faris en `Main.qml`.
es: Dado que este ejemplo tiene fines ilustrativos sencillos, no profundizamos en lo que se haría tras pulsar el botón: solo muestra «¡Pulsado!» en la terminal. _Podríamos_ crear una nueva página para crear una cuenta que añada otro usuario a un modelo y luego mostrar la página en la vista, de forma similar a lo que hicimos en `Main.qml`.
nl: Omdat dit voorbeeld een eenvoudig illustratief doel heeft, gaan we niet dieper in wat zou gedaan worden nadat op de knop is geklikt: het print eenvoudig "Geklikt!" op de terminal. We _zouden_ een nieuwe pagina kunnen maken voor aanmaken van een account die een andere gebruiker toevoegt aan een model, daarna de pagina laat zien, gelijk aan wat we deden in `Main.qml`.
sl: Ker je ta primer preproste ilustrativne narave, se ne bomo poglabljali v to, kaj bi bilo storjeno, ko bi kliknili gumb: samo natisne »Kliknjeno!" na terminal. _Lahko_ bi naredili novo stran za ustvarjanje računa, ki modelu doda drugega uporabnika, nato stran potisne v pogled, podobno kot kar smo naredili v `Main.qml`.
uk: Оскільки цей приклад наведено для простої ілюстрації, ми не заглиблюємось у те, що буде зроблено після натискання кнопки: він просто друкує "Clicked!" до терміналу. Ми _можемо_ створити нову сторінку для створення облікового запису, яка додає іншого користувача до моделі, а потім розмістимо сторінку в полі зору, подібно до того, що ми зробили в `Main.qml`.

source: FormRadioDelegate, FormCheckDelegate and FormSwitchDelegate
ca: FormRadioDelegate, FormCheckDelegate i FormSwitchDelegate
eo: FormRadioDelegate, FormCheckDelegate kaj FormSwitchDelegate
es: FormRadioDelegate, FormCheckDelegate y FormSwitchDelegate
nl: FormRadioDelegate, FormCheckDelegate en FormSwitchDelegate
sl: FormRadioDelegate, FormCheckDelegate in FormSwitchDelegate
sv: FormRadioDelegate, FormCheckDelegate och FormSwitchDelegate
uk: FormRadioDelegate, FormCheckDelegate і FormSwitchDelegate

source: The RadioButton, CheckBox and Switch are very commonly used components in any user interface. Kirigami Addons provides them as [FormRadioDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formradiodelegate.html), [FormCheckDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcheckdelegate.html) and [FormSwitchDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formswitchdelegate.html).
ca: El RadioButton, el CheckBox i el Switch són components molt utilitzats en qualsevol interfície d'usuari. Els complements del Kirigami els proporcionen com a [FormRadioDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formradiodelegate.html), [FormCheckDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcheckdelegate.html) i [FormSwitchDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formswitchdelegate.html).

source: Their only main properties are `text` and `description`. They are different in usage because they all inherit [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), and so you are expected to use its signals and handlers: checked and onChecked, toggled and onToggled, clicked and onClicked.
ca: Les seves úniques propietats principals són `text` i `description`. Són diferents en ús perquè tots hereten [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), i per tant s'espera que utilitzin els seus senyals i controladors: «checked» i «onChecked», «toggled» i «onToggled», «clicked» i «onClicked».
eo: Iliaj nuraj ĉefaj trajtoj estas `teksto` kaj `priskribo`. Ili estas malsamaj laŭ uzo ĉar ili ĉiuj heredas [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), kaj do oni atendas, ke oni uzu ĝiajn signalojn kaj prizorgilojn: checked kaj onChecked, toggled kaj onToggled, clicked kaj onClicked.
es: Sus únicas propiedades principales son `text` y `description`. Se usan de forma diferente porque heredan de [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), por lo que se espera que use sus señales y manejadores: «checked» y «onChecked», «toggled» y «onToggled», «clicked» y «onClicked».
nl: Hun enige hoofdeigenschappen zijn `tekst` en `beschrijving`. Ze zijn anders in gebruik omdat ze allemaal [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton)erven en dus van u wordt verwacht hun signalen en hendels te gebruiken: geactiveerd en niet-geactiveerd, omgeschakeld en niet-omgeschakeld, geklikt en niet-geklikt.
sl: Njihovi glavni lastnosti sta `text` in `description`. So drugačni v uporabi, ker vsi podedujejo [AbstractButton](docs:qtquickcontrols; QtQuick.Controls.AbstractButton), zato se pričakuje, da boste uporabili njegove signalein obdelovalci: checked in onChecked, preklopno in onToggled, kliknjeno in onClicked.
sv: Deras enda huvudegenskaper är `text` och `description`. De är olika vid användning eftersom de alla ärver [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), och därför förväntas man använda dess signaler och hanterare: checked och onChecked, toggled och onToggled, clicked och onClicked.
uk: Їх єдиними основними властивостями є `text` і `description`. Вони відрізняються у використанні, тому що всі вони успадковують [AbstractButton](docs:qtquickcontrols;QtQuick.Controls.AbstractButton), і тому ви повинні використовувати його сигнали та обробники: checked і onChecked, toggled і onToggled, clicked і onClicked.

source: We want to create some autosave functionality in our application, and we want to only show its settings if the user has enabled this functionality. Create a new section using a [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html) and a [FormHeader](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formheader.html), then add a [FormSwitchDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formswitchdelegate.html) and a [FormRadioDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formradiodelegate.html).
ca: Volem crear alguna funcionalitat de desament automàtic a la nostra aplicació, i només volem mostrar la seva configuració si l'usuari ha habilitat aquesta funcionalitat. Creeu una secció nova utilitzant un [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html) i un [FormHeader](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formheader.html), després afegiu un [FormSwitchDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formswitchdelegate.html) i un [FormRadioDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formradiodelegate.html).

source: We bind the visibility of each radio button to a switch, so they only appear when the switch is enabled.
ca: Vinculem la visibilitat de cada botó d'opció a un commutador, de manera que només apareixeran quan el commutador estigui habilitat.
eo: Ni ligas la videblecon de ĉiu radiobutono al ŝaltilo, do ili aperas nur kiam la ŝaltilo estas ebligita.
es: Vinculamos la visibilidad de cada botón de opción a un interruptor, por lo que solo aparecen cuando el interruptor está activado.
nl: We verbinden de zichtbaarheid van elk keuzerondje aan een schakelaar, ze verschijnen dus alleen wanneer de schakelaar is ingeschakeld.
sl: Vidnost vsakega izbirnega gumba povežemo s stikalom, tako da se le prikažejoko je stikalo omogočeno.
sv: Vi kopplar synligheten för varje alternativknapp till en omkopplare, så de bara visas när omkopplaren är aktiverad.
uk: Ми пов'яжемо видимість кожного пункту варіанта із перемикачем, тому їх буде показано, лише якщо увімкнено перемикач.

source: Best Practices
ca: Millors pràctiques
eo: Plej bonaj Praktikoj
es: Mejores prácticas
nl: Beste praktijk
sl: Najboljše prakse
sv: Bästa metoder
uk: Найкращі підходи

source: <details><summary>Click here to read more</summary>
ca: <details><summary>Feu clic aquí per a llegir-ne més</summary>
eo: <details><summary>Alklaku ĉi tie por legi pli</summary>
es: <details><summary>Pulse aquí para leer más</summary>
nl: <details><summary>Klik hier om meer te lezen</summary>
sl: <details><summary>Kliknite sem, da bi prebrali več</summary>
sv: <details><summary>Klicka här för att läsa mer</summary>
uk: <details><summary>Натисніть тут, щоб дізнатися більше</summary>

source: If you have some programming background in imperative languages such as C++, you might be tempted to set the [checked](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#checked-prop) property of the switch to turn the visibility of the radio buttons to `true` with a JavaScript assignment such as:
ca: Si teniu algun coneixement de programació en llenguatges imperatius com C++, és possible que tingueu la temptació d'establir la propietat [checked](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#checked-prop) del commutador per a activar la visibilitat dels botons d'opció a `true` amb una assignació de JavaScript com:

source: This is not very efficient for QML's declarative language and its signals and slots. Try to use QML bindings like in the case of `visible: autosave.checked` as much as possible instead of JavaScript expressions.
ca: Això no és molt eficient per al llenguatge declaratiu del QML i els seus senyals i ranures. Intenteu utilitzar les vinculacions del QML com en el cas de `visible: autosave.checked` tant com sigui possible en lloc d'expressions JavaScript.
eo: Ĉi tio ne estas tre efika por la deklara lingvo de QML kaj ĝiaj signaloj kaj fendoj. Provu uzi QML-ligojn kiel en la kazo de `visible: autosave.checked` kiel eble plej multe anstataŭ JavaScript-esprimoj.
es: Esto no es muy eficiente para el lenguaje declarativo de QML y sus señales y ranuras. Trate de usar enlaces QML, como en el caso de `visible: autosave.checked`, tanto como sea posible en lugar de expresiones JavaScript.
nl: Dit is niet erg efficiënt voor de declaratie taal QML en zijn signalen en slots. Probeer de binding aan QML zo veel mogelijk te gebruiken zoals in het geval van `visible: autosave.checked` in plaats van JavaScript expressies.
sl: To ni zelo učinkovito za deklarativni jezik QML in njegove signale in reže. Poskusite uporabiti vezave QML kot v primeru `visible: autosave.checked` namesto izrazov JavaScript.
sv: Det är inte särskilt effektivt med QML:s deklarativa språk och dess signaler och slots. Försök att använda QML-bindningar som i fallet med `visible: autosave.checked` så mycket som möjligt istället för uttryck i JavaScript.
uk: Це не дуже ефективно для декларативної мови QML та її сигналів і слотів. Намагайтеся якомога більше використовувати прив'язки QML, як у випадку `visible: autosave.checked` замість виразів JavaScript.

source: See [this page](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) for details.
ca: Vegeu [aquesta pàgina](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) per als detalls.
eo: Vidu [ĉi tiun paĝon](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) por detaloj.
es: Consulte [esta paǵina](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) para más detalles.
nl: Zie [deze pagina](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) voor details.
sl: Poglejte [this page](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) za podrobnosti.
sv: Se [den här sidan](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments) för detaljinformation.
uk: Див. [цю сторінку](https://doc.qt.io/qt-6/qtquick-bestpractices.html#prefer-declarative-bindings-over-imperative-assignments), щоб дізнатися більше.

source: To test our checkbox, we can add a new [FormCheckDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcheckdelegate.html) to our General section.
ca: Per a provar la nostra casella de selecció, podem afegir un [FormCheckDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcheckdelegate.html) nou a la nostra secció General.

source: Here we use the [signal handler](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) called [onToggled](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#toggled-signal) to show some dummy text to simulate a tray icon appearing in the system. If you really wanted to, you could easily implement a tray icon using KDE's [KStatusNotifierItem](https://api.kde.org/kstatusnotifieritem-index.html) or Qt's [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
ca: Aquí utilitzem el [manipulador de senyals](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) anomenat [onToggled](https://doc.qt.io/qt-6/qml-qtquick-controls-abstractbutton.html#toggled-signal) per a mostrar text fictici per a simular una icona de safata que apareix en el sistema. Si realment voleu, podeu implementar fàcilment una icona de la safata utilitzant [KStatusNotifierItem](https://api.kde.org/kstatusnotifieritem-index.html) de KDE o [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html) de les Qt.

source: So far our application should look like this:
ca: Finalment, la nostra aplicació s'hauria de veure així:
eo: Ĝis nun nia aplikaĵo devus aspekti jene:
es: Hasta ahora, nuestra aplicación debería parecerse a esto:
nl: Tot zover zal onze toepassing er uitzien zoals deze:
sl: Do sem bi morala naša aplikacija videti takole:
sv: Hittills ska programmet se ut så här:
uk: На цьому кроці вікно нашої програми має виглядати так:

source: The common ComboBox component can be created using a [FormComboBoxDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html).
ca: El component ComboBox comú es pot crear utilitzant un [FormComboBoxDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html).

source: This combobox has several useful properties we can make use of: [editable](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#editable-prop), [displayText](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayText-prop) and [displayMode](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayMode-prop).
ca: Aquest quadre combinat té diverses propietats útils que podem fer servir: [editable](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#editable-prop), [displayText](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayText-prop) i [displayMode](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayMode-prop).

source: Setting `editable: true` allows the user to edit the text of the combobox, which is useful in case adding new combobox options is needed:
ca: Establir `editable: true` permet a l'usuari editar el text del quadre combinat, el qual és útil en cas que es necessitin opcions noves del quadre combinat:
eo: Agordo `redaktebla: vera` permesas al la uzanto redakti la tekston de la kombokesto, kio estas utila se aldoni novajn kombokest-elekteblojn necesas:
es: Defina `editable: true` para permitir que el usuario pueda modificar el texto de la lista desplegable, que será de utilidad si necesita añadir nuevas opciones de la lista desplegable.
nl: Instellen van `editable: true` biedt de gebruiker het bewerken van de tekst van het keuzevak, wat nuttig is in geval dat toevoegen van nieuwe opties in het keuzevak nodig is:
sl: Nastavitev `editable: true` omogoča uporabniku urejanje besedila v kombiniranem polju,kar je uporabno, če je potrebno dodati nove možnosti kombiniranega polja:
sv: Att ställa in `editable: true` låter användaren redigera text i kombinationsrutan, vilket är användbart om tillägg av nya alternativ i kombinationsrutan behövs:
uk: Налаштування `editable: true` надає змогу користувачеві редагувати текст спадного списку, що корисно, якщо потрібно додати нові пункти до спадного списку:

source: Whenever you need to show additional text before each option, you can use something like `displayText: "Profile: " + currentText`:
ca: Sempre que necessiteu mostrar text addicional abans de cada opció, podeu utilitzar alguna cosa com `displayText: "Profile: " + currentText`:
eo: Kiam ajn vi bezonas montri plian tekston antaŭ ĉiu opcio, vi povas uzi ion kiel `displayText: "Profile: " + currentText`:
es: Siempre que necesite mostrar texto adicional antes de cada opción, puede usar algo semejante a `displayText: "Perfil: " + textoActual`:
nl: Wanneer u het tonen van extra tekst voor elke optie nodig hebt, kunt u zoiets als `displayText: "Profile: " + currentText` gebruiken:
sl: Kadarkoli morate prikazati dodatno besedilo pred vsako možnostjo, lahko uporabitenekaj takega kot `displayText: "Profil: " + currentText`:
sv: När du behöver visa ytterligare text före varje alternativ kan du använda något som liknar `displayText: "Profile: " + currentText`:
uk: Щоразу, коли вам потрібно показати додатковий текст перед кожним пунктом, ви можете використати щось подібне до `displayText: "Profile: " + currentText`:

source: And the most interesting one, which we will be using in our example, is [displayMode](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayMode-prop). It can have three options:
ca: I el més interessant, que utilitzarem en el nostre exemple, és [displayMode](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcomboboxdelegate.html#displayMode-prop). Pot tenir tres opcions:

source: **FormComboBoxDelegate.ComboBox**: the standard small box showing a list of options.
ca: **FormComboBoxDelegate.ComboBox**: el quadre petit estàndard que mostra una llista d'opcions.
eo: **FormComboBoxDelegate.ComboBox**: la norma malgranda skatolo montranta liston de elektebloj.
es: **FormComboBoxDelegate.ComboBox**: el pequeño cuadro estándar que muestra una lista de opciones.
nl: **FormComboBoxDelegate.ComboBox**: het standaard kleine vak die een lijst met opties toont.
sl: **FormComboBoxDelegate.ComboBox**: standardno majhno polje, ki prikazuje seznam možnosti.
sv: **FormComboBoxDelegate.ComboBox**: Den lilla standardrutan som visar en lista med alternativ.
uk: **FormComboBoxDelegate.ComboBox**: стандартна мала панель зі списком пунктів.

source: **FormComboBoxDelegate.Dialog**: a dialog showing a list of options in the middle of the window, like a [Kirigami.OverlaySheet](docs:kirigami;org.kde.kirigami.OverlaySheet).
ca: **FormComboBoxDelegate.Dialog**: un diàleg que mostra una llista d'opcions al mig de la finestra, com un [Kirigami.OverlaySheet](docs:kirigami;org.kde.kirigami.OverlaySheet).

source: **FormComboBoxDelegate.Page**: a new page containing a list of options shown in a separate window.
ca: **FormComboBoxDelegate.Page**: una pàgina nova que conté una llista d'opcions mostrades en una finestra separada.
eo: **FormComboBoxDelegate.Page**: nova paĝo enhavanta liston de elektebloj montritaj en aparta fenestro.
es: **FormComboBoxDelegate.Page**: una nueva página que contiene una lista de opciones que se muestran en una ventana separada.
nl: **FormComboBoxDelegate.Page**: een nieuwe pagina die een lijst met opties bevat in een apart venster.
sl: **FormComboBoxDelegate.Page**: nova stran s seznamom prikazanih možnosti v ločenem oknu.
sv: **FormComboBoxDelegate.Page**: En ny sida som innehåller en lista med alternativ som visas i ett separat fönster.
uk: **FormComboBoxDelegate.Page**: нова сторінка, що містить список пунктів, які показано в окремому вікні.

source: Add the following between the "Current Color Scheme" and "Show Tray Icon" delegates in your "General" form card.
ca: Afegiu el següent entre els delegats de «Current Color Scheme» i «Show Tray Icon» a la targeta del formulari «General».
eo: Aldonu la jenon inter la delegitoj "Nuna Kolorskemo" kaj "Montri Pleto-piktogramon" en via "Ĝenerala" formularkarto.
es: Añada lo siguiente entre los delegados "Esquema de color actual" y "Mostrar bandeja del sistema" de la tarjeta "General".
nl: Voeg het volgende toe tussen het "Huidige kleurenschema" en "Pictogram in systeemvak tonen" gedelegeerden in uw formulierkaart "Algemeen".
sl: Dodajte naslednje med "Current Color Scheme" in "Show Tray Icon" delegatov na vaši kartici obrazca "General".
sv: Lägg till följande mellan delegaterna "Current Color Scheme" och "Show Tray Icon" på formulärkortet "General".
uk: Додайте таке між делегатами "Current Color Scheme" і "Show Tray Icon" у картці форми "General".
