Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Recap
ca: Recapitulació
eo: Resumo
es: Resumen
fr: Récapitulatif
nl: Samenvattend
pl: Powtórka
pt: Recapitulação
sl: Povzetek
sv: Sammanfattning
uk: Коротке повторення

source: So far, we built a simple app that can display cards. However, there is currently no way for the user to add new cards to the card view.
ca: Fins ara, hem construït una aplicació senzilla que pot mostrar targetes. No obstant això, encara no hi ha cap manera que l'usuari afegeixi targetes noves a la vista de targetes.
eo: Ĝis nun, ni konstruis simplan apon kiu povas montri kartojn. Tamen, nuntempe ne ekzistas maniero por la uzanto aldoni novajn kartojn al la kartvido.
nl: Tot nu toe hebben we een eenvoudige toepassing gemaakt die kaarten kan tonen. We hebben echter nog geen manier om door de gebruiker nieuwe kaarten aan de kaartweergave toe te voegen.
sl: Doslej smo zgradili preprosto aplikacijo, ki lahko prikazuje kartice. Vendar uporabnik trenutno ne more dodati novih kartic v pogled kartic.
sv: Hittills har vi lyckats bygga ett enkelt program som kan visa kort. Vi har dock inte ännu något sätt att lägga till nya kort i kortvyn.
uk: Досі, нами побудовано просту програму, яка показує картки. Втім, у ній ще не передбачено способу додавання нових карток до панелі перегляду карток.

source: In this tutorial, we'll be looking at Kirigami actions. These will help us add interactivity to our app in a consistent, fast, and accessible way.
ca: En aquesta guia d'aprenentatge, veurem les accions de Kirigami. Aquestes ens ajudaran a afegir interactivitat a la nostra aplicació d'una manera coherent, ràpida i accessible.
eo: En ĉi tiu lernilo, ni rigardos Kirigami-agojn. Ĉi tiuj helpos nin aldoni interagadon al nia aplikaĵo en konsekvenca, rapida kaj alirebla maniero.
es: En este tutorial, veremos las acciones de Kirigami. Estas nos ayudarán a añadir interactividad a nuestra aplicación de una manera consistente, rápida y accesible.
fr: Dans ce tutoriel, nous allons étudier les actions de Kirigami. Celles-ci nous aideront à ajouter de l'interactivité à notre application d'une manière cohérente, rapide et accessible.
nl: In deze inleiding zullen we kijken naar acties van Kirigami. Deze zullen ons helpen interactiviteit toe te voegen aan onze toepassing op een consistente, snelle en toegankelijke manier.
pl: W tym samouczku, spojrzymy na działania Kirigami. Pomoże nam to dodawać interaktywnie do naszej aplikacji w spójny, szybki i przystępny sposób.
pt: Neste tutorial, iremos ver as acções do Kirigami. Estas ajudá-lo-ão a adicionar interactividade à nossa aplicação de uma forma consistente, rápida e acessível.
sl: V tem učbeniku, bomo videli akcije Kirigami. Te nam bodo pomagale dodati interaktivnost v našo aplikacijo na dosleden, hiter in dostopen način.
sv: I den här handledningen tar vi en titt på åtgärder i Kirigami. De hjälper oss att lägga till interaktivitet i vårt program på ett konsekvent, snabbt och tillgängligt sätt.
uk: У цій частині підручника ми розглянемо дії Kirigami. Ці дії допоможуть нам додати інтерактивності нашій програмі у сумісний, швидкий і доступний спосіб.

source: A [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) encapsulates a user interface action. We can use these to provide our applications with easy-to-reach actions that are essential to their functionality.
ca: Una [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) encapsula una acció de la interfície d'usuari. Podem utilitzar-les per a proporcionar a les nostres aplicacions accions de fàcil accés que són essencials per a la seva funcionalitat.

source: If you have used Kirigami apps before, you have certainly interacted with Kirigami actions. In this image, we can see actions to the right of the page title with various icons. Kirigami actions can be displayed in several ways and can do a wide variety of things.
ca: Si heu emprat abans les aplicacions escrites en Kirigami, certament heu interactuat amb les accions del Kirigami. En aquesta imatge, podem veure les accions a la dreta del títol de la pàgina amb diverses icones. Les accions del Kirigami es poden mostrar de diverses maneres i poden realitzar una àmplia varietat de coses.
eo: Se vi antaŭe uzis Kirigami-apojn, vi certe interagis kun Kirigami-agoj. En ĉi tiu bildo, ni povas vidi agojn dekstre de la paĝotitolo kun diversaj piktogramoj. Kirigami-agoj povas esti montrataj en pluraj manieroj kaj povas fari diversajn aferojn.
es: Si ha usado aplicaciones de Kirigami con anterioridad, ya habrá interactuado con las acciones de Kirigami. En esta imagen podemos ver acciones a la derecha del título de la página con diversos iconos. Las acciones de Kirigami se pueden mostrar de varias formas y pueden hacer una amplia variedad de cosas.
nl: Als u Kirigami toepassingen eerder hebt gebruikt, hebt u zeker samengewerkt met acties van Kirigami. In deze afbeelding kunnen we acties rechts van de paginatitel zien met verschillende pictogrammen. Acties van Kirigami kunnen op verschillende manieren getoond worden en kunnen een brede variëteit van dingen doen.
sl: Če ste že prej uporabljali aplikacije Kirigami, ste zagotovo že spoznali interakcijo z Kirigami Actions. Na tej sliki lahko vidimo dejanja na desni strani naslova z različnimi ikonami. Kirigami Actions lahko prikažemo na več načinov in lahko naredijo veliko različnih stvari.
sv: Om du har använt Kirigami-program tidigare, har du med säkerhet interagerat med Kirigiami åtgärder. På den här bilden kan vi se åtgärder till höger om sidans titel med olika ikoner. Åtgärder i Kirigami kan visas på flera olika sätt och kan göra ett stort antal saker.
uk: Якщо ви раніше користувалися програмами Kirigami, ви напевне взаємодіяли із діями Kirigami. На цьому зображенні ми можемо бачити кнопки дій праворуч від заголовка сторінки із різноманітними піктограмами. Дії Kirigami може бути показано у декілька способів. Вони можуть виконувати широкий діапазон завдань.

source: Adding countdowns
ca: Afegir comptes enrere
eo: Aldonante retronombradojn
es: Añadir cuentas regresivas
fr: Ajout de compteurs
nl: Aftellingen toevoegen
pl: Dodawanie odliczań
pt: Adicionar contagens decrescentes
sl: Dodajanje odštevanj
sv: Lägga till nedräknare
uk: Додавання відліків

source: A countdown app is pretty useless without the ability to add countdowns. Let's create an action that'll let us do this.
ca: Una aplicació de compte enrere és força inútil sense la capacitat d'afegir-ne. Crearem una acció que ens permeti fer-ho.
eo: Retronombrada programo estas sufiĉe senutila sen la kapablo aldoni retronombradojn. Ni kreu agon, kiu permesos al ni fari ĉi tion.
es: Una aplicación de cuenta regresiva es bastante inútil sin la capacidad de añadir cuentas regresivas. Vamos a crear una acción que nos permita hacer esto.
fr: Une application de compte à rebours est plutôt inutile sans la possibilité d'ajouter des comptes à rebours. Créons une action nous permettant de le faire.
nl: Een aftel toepassing is tamelijk nutteloos zonder de mogelijkheid om aftellingen toe te voegen. Laten we een actie aanmaken die ons dat laat doen.
pl: Aplikacja odliczająca jest całkowicie bezużyteczna bez możliwości dodawania odliczań. Stwórzmy działanie, które nam to umożliwi.
pt: Uma aplicação de contagens decrescentes sem a capacidade de adicionar contagens é bastante inútil. Iremos criar uma acção que nos permite fazer isso.
sl: Aplikacija za odštevanje je precej neuporabna brez možnosti dodajanja odštevanja. Ustvarimo akcijo, ki nam bo to dovolila.
sv: Ett nedräkningsprogram är ganska oanvändbart utan möjlighet att lägga till nedräknare. Låt oss skapa en åtgärd som låter oss göra det.
uk: Програма із зворотним відліком буде непотрібною без можливості додавання зворотних відліків. Давайте створимо дію, яка надасть нам змогу додавати зворотні відліки.

source: Other page properties...
ca: Altres propietats de la pàgina...
eo: Aliaj paĝaj trajtoj...
es: Otras propiedades de la página...
nl: Andere paginaeigenschappen...
sl: Druge lastnosti strani...
sv: Andra sidegenskaper...
uk: Інші властивості сторінки…

source: We are placing our [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) within our main page from the previous tutorials. If we wanted to, we could add more actions to our page (and even nest actions within actions!).
ca: Estem col·locant la nostra [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) dins de la nostra pàgina principal a partir de les guies d'aprenentatge anteriors. Si volguéssim, podríem afegir més accions a la nostra pàgina (i fins i tot niar accions dins d'accions!).

source: The brackets `[]` used above are similar to [JavaScript arrays](https://www.w3schools.com/js/js_arrays.asp), which means you can pass one or more things to them, separated by comma:
ca: Els claudàtors `[]`, que s'han utilitzat anteriorment són similars a les [matrius de JavaScript](https://www.w3schools.com/js/js_arrays.asp), el qual vol dir que podeu passar-hi una o més coses, separades per comes:
eo: La krampoj `[]` uzataj supre estas similaj al [JavaScript arrays](https://www.w3schools.com/js/js_arrays.asp), kio signifas, ke vi povas transdoni unu aŭ plurajn aferojn al ili, apartigitaj per komo:
nl: De haakjes `[]` hierboven gebruikt zijn vergelijkbaar met [JavaScript arrays](https://www.w3schools.com/js/js_arrays.asp), wat inhoud dat u een of meer argumenten aan ze kan doorgeven, gescheiden door komma's:
sl: Zgoraj uporabljeni oklepaji `[]` so podobni [poljem JavaScript](https://www.w3schools.com/js/js_arrays.asp), kar pomeni, da jim lahko posredujete eno ali več stvari, ločenih z vejico:
sv: De parenteser "[]" som används ovan liknar [Javascript-fält](https://www.w3schools.com/js/js_arrays.asp), vilket innebär att man kan skicka en eller flera saker till dem, separerade med kommatecken:
uk: Дужки `[]`, які використано вище, є подібними до дужок [масивів JavaScript](https://www.w3schools.com/js/js_arrays.asp), що означає, що ви можете передати їм одну або декілька речей, відокремлених комами:

source: General JavaScript array of components:
ca: Matriu general de components JavaScript:
eo: Ĝenerala JavaScript aro de komponantoj:
nl: Algemeen JavaScript array met componenten:
sl: Splošno polje komponent JavaScript:
sv: Allmänt Javascript-fält med komponenter:
uk: Загальний масив компонентів JavaScript:

source: Passing an array of Kirigami actions to QML:
ca: Passar una matriu d'accions del Kirigami al QML:
eo: Transdonante aron de Kirigami-agoj al QML:
nl: Het doorgeven van een array met Kirigami acties naar QML:
sl: Posredovanje niza dejanj Kirigami v QML:
sv: Skicka ett fält med Kirigami-åtgärder till QML:
uk: Передавання масиву дій Kirigami до QML:

source: The `id` and `text` properties should be familiar from previous tutorials. However, the inherited [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) property should be interesting: it is an object with several properties letting you display certain icons for your actions. Fortunately, to use KDE icons all we need to do is provide the name property for the icon property, `icon.name`.
ca: Les propietats `id` i `text` haurien de ser familiars de guies d'aprenentatge anteriors. No obstant això, la propietat nova heretada [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) hauria de ser interessant: és un objecte amb diverses propietats que permet mostrar certes icones per a les vostres accions. Afortunadament, per a utilitzar les icones del KDE, tot el que hem de fer és proporcionar el nom de la propietat per a la propietat d'icona, `icon.name`.
eo: La ecoj `id` kaj `text` devus esti konataj de antaŭaj lerniloj. Tamen, la heredita [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) devus esti interesa: ĝi estas objekto kun pluraj ecoj. lasante vin montri certajn piktogramojn por viaj agoj. Feliĉe, por uzi KDE-piktogramojn, ĉio, kion ni devas fari, estas provizi la nomproprecon por la piktograma propreco, `icon.name`.
es: Las propiedades `id` y `text` deberían resultarle familiares de los tutoriales anteriores. Sin embargo, la propiedad [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) heredada debería ser interesante: es un objeto con varias propiedades que le permiten mostrar ciertos iconos para las acciones. Afortunadamente, para usar los iconos de KDE, todo lo que tenemos que hacer es proporcionar la propiedad del nombre para la propiedad del icono, `icon.name`.
nl: De eigenschappen `id` en `text` zouden bekend moeten zijn uit eerdere instructies. De geërfde eigenschap [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) zou interessant moeten zijn: het is een object met verschillende eigenschappen die u bepaalde pictogrammen voor uw acties laat tonen. Gelukkig alles wat we nodig hebben, bij gebruik van KDE pictogrammen, het leveren van de naameigenschap voor de pictogrameigenschap, `icon.name`.
sl: Lastnosti `id` in `text` morate poznati iz prejšnjih vadnic. Vendar bi morala biti podedovana lastnost [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) zanimiva: gre za objekt z več lastnostmi omogoča prikaz določenih ikon za vaša dejanja. Na srečo moramo za uporabo ikon KDE zagotoviti samo lastnost imena za lastnost ikone, `icon.name`.
sv: Egenskaperna `id` och `text` bör vara välkända från tidigare handledningar. Dock kan den ärvda egenskapen [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop) vara intressant: det är ett objekt med flera egenskaper som låter dig visa vissa ikoner för dina åtgärder. Lyckligtvis är allt vi behöver göra för att använda KDE-ikoner att tillhandahålla namnegenskapen i icon-egenskapen, `icon.name`.
uk: Із властивостями `id` і `text` ми вже познайомилися у попередніх розділах підручника. Втім, нас має зацікавити нова властивість [Action.icon](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon-prop): це об'єкт із декількома властивостями, за допомогою якого можна показувати певні піктограми для наших дій. На щастя, щоб скористатися піктограмами KDE достатньо надати назву для властивості піктограми, `icon.name`.

source: Viewing the available icons
ca: Visualització de les icones disponibles
eo: Vidante la disponeblajn piktogramojn
nl: De beschikbare pictogrammen weergeven
sl: Ogled razpoložljivih ikon
sv: Visa tillgängliga ikoner
uk: Перегляд доступних піктограм

source: <details> <summary>Click here to see how to check the available icons on your system</summary> <br> Icon Explorer is a KDE application that lets you view all the icons that you can use for your application. It offers a number of useful features such as previews of their appearance across different installed themes, previews at different sizes, and more. You might find it a useful tool when deciding on which icons to use in your application.<br><br>
ca: <details> <summary>Feu clic aquí per a veure com comprovar les icones disponibles al sistema</summary> <br> L'Explorador d'icones és una aplicació KDE que permet veure totes les icones que podreu utilitzar per a la vostra aplicació. Ofereix una sèrie de característiques útils: com vistes prèvies de la seva aparença en els diferents temes instal·lats, vistes prèvies en mides diferents i més. Potser us resultarà una eina útil a l'hora de decidir quines icones emprar en la vostra aplicació.<br><br>

source: Many of KDE's icons follow the FreeDesktop Icon Naming specification. Therefore, you might also find it useful to consult The FreeDesktop project's website, [which lists all cross-desktop compatible icon names](https://specifications.freedesktop.org/icon-naming-spec).
ca: Moltes de les icones del KDE segueixen l'especificació d'anomenat d'icones de FreeDesktop. Per tant, també pot resultar útil consultar el lloc web del projecte FreeDesktop, [el qual llista tots els noms d'icones compatibles amb tots els escriptoris](https://specifications.freedesktop.org/icon-naming-spec).

source: The [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) signal handler is the most important. This is what our action will do when it is used. You'll notice that in our example we're using the method [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) of the `kountdownModel` we created in our previous tutorial. This method lets us append a new element to our list model. We are providing it with an object (indicated by curly braces `{}`) that has the relevant properties for our countdowns (`name`, `description`, and a placeholder `date`).
ca: El controlador de senyals [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) és el més important. És el que farà la nostra acció quan s'utilitzi. Notareu que en el nostre exemple fem servir el mètode [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) del `kountdownModel` que hem creat en la nostra guia d'aprenentatge anterior. Aquest mètode ens permet afegir un element nou al nostre model de llista. Proporcionem un objecte (indicat per les claus `{}`) que té les propietats rellevants per als nostres comptes enrere (`name`, `description` i una `date` de marcador de posició).
eo: La [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) signaltraktilo estas la plej grava. Jen kion faros nia ago kiam ĝi estos uzata. Vi rimarkos, ke en nia ekzemplo ni uzas la metodon [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) de la `kountdownModel` ni kreis en nia antaŭa lernilo. Ĉi tiu metodo permesas al ni aldoni novan elementon al nia listo-modelo. Ni provizas ĝin per objekto (indikita per buklaj krampoj `{}`) kiu havas la koncernajn ecojn por niaj retronombradoj (`nomo`, `priskribo`, kaj lokokupilon `dato`).
nl: De eigenschap [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) is de belangrijkste. Dit is wat onze actie zal doen wanneer het wordt gebruikt. U zult opmerken dat in ons voorbeeld we de methode [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) van het `kountdownModel` gebruiken dat we in onze vorige inleiding hebben aangemaakt. Deze methode laten ons een nieuw element toevoegen aan ons lijstmodel. We leveren het met een object (aangegeven door accolades `{}`) dat de relevante eigenschappen heeft voor ons aftellen (naam, beschrijving en een plaatshouder datum).
pt: A propriedade [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) é a mais importante. É o que a nossa acção irá fazer quando for usada. Irá reparar que, no nosso exemplo, estamos a usar o método [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) que criámos no nosso tutorial anterior. Este método permite-nos adicionar um novo elemento ao nosso modelo de lista. Estamos a passar-lhe um objecto que tem as propriedades relevantes para as nossas contagens decrescentes (nome, descrição e uma data substituta).
sl: Prožilnik [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) je najpomembnejši. To bo naredila naša dejavnost, ko bo uporabljena. Opazili boste, da v našem primeru uporabljamo metodo [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) modela 'kountdownModel', ki smo ga ustvarili v prejšnjih vajah. S to metodo lahko v naš model seznama priložimo nov element. Ponujamo mu predmet, ki ima ustrezne lastnosti za naše odštevanje (ime - `name`, opis - `description` in datum bodoče lokacije - placeholder `date`).
sv: Egenskapen [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered) är den viktigaste. Det är vad vår åtgärd gör när den används. Du märker att i vårt exempel använder vi metoden [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) från `kountdownModel` som vi skapade i vår föregående handledning. Metoden låter oss lägga till ett nytt element i vår listmodell. Vi tillhandahåller den med ett objekt (angivet av klammerparenteser `{}`) som har relevanta egenskaper för våra nedräknare (`name`, `description`, och ett platsmarkerande `date`).
uk: Найважливішою є обробник сигналів [onTriggered](docs:qtquickcontrols;QtQuick.Controls.Action::triggered). Вона визначає те, що буде виконано, коли використовуватиметься наша дія. Ви можете зауважити, що у нашому прикладі ми використовуємо метод `kountdownModel.append` [kountdownModel.append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method), який було створено у попередньому розділі нашого підручника. За допомогою цього методу можна додати новий елемент до нашої моделі списку. Ми надаємо методу об'єкт (позначений фігурними дужками `{}`), який має відповідні властивості для наших відліків (`name`, `description` та замінник `date`).

source: Each time we click our \"Add kountdown\" button on the top right, our custom countdown is added
ca: Cada vegada que fem clic sobre el nostre botó «Add kountdown» que hi ha a la part superior dreta, s'afegirà el nostre compte enrere personalitzat.
eo: Ĉiufoje kiam ni alklakas nian butonon \"Aldoni kountdown\" supre dekstre, nia propra retronombrado estas aldonita
es: Cada vez que hacemos clic en el botón «Añadir kountdown» de la parte superior derecha, se añade una cuenta atrás personalizada.
nl: Elke keer dat we op onze knop \"Aftellen toevoegen\" rechtsboven klikken, wordt onze aangepaste aftelling toegevoegd
pt: De cada vez que carregamos no nosso botão "Adicionar uma contagem" em cima e à direita, é adicionada a nossa contagem decrescente personalizada.
sl: Vsakič, ko kliknemo naš gumb \"Add kountdown\" na zgornjem desnem kotu, je dodano naše odštevanje po meri
sv: Varje gång vi nu klickar på vår knapp "Add Kountdown" längst upp till höger, läggs vår egna nedräknare till
uk: Кожного разу, коли ми натискатимемо кнопку «Add kountdown» у верхній правій частині вікна, додаватиметься наш нетиповий відлік.

source: Mobile version
ca: Versió mòbil
eo: Poŝtelefona versio
es: Versión móvil
nl: Mobiele versie
pt: Versão para dispositivos móveis
sl: Mobilna verzija
sv: Mobilversion
uk: Мобільна версія

source: The next component is a [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer). It shows up as a [hamburger menu](https://en.wikipedia.org/wiki/Hamburger_button). By default it opens a sidebar, which is especially useful on mobile, as the user can just swipe in a side of the screen to open it. Global drawers are useful for global navigation and actions. We are going to create a simple global drawer that includes a "quit" button.
ca: El component següent és un [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer). Es mostra com un [menú d'hamburguesa](https://ca.wikipedia.org/wiki/Hamburger_button). De manera predeterminada obre una barra lateral, que és especialment útil en el mòbil, ja que l'usuari pot lliscar en un costat de la pantalla per a obrir-la. Els calaixos globals són útils per a la navegació i les accions globals. Crearem un calaix global senzill que inclou un botó «quit».

source: Other window properties...
ca: Altres propietats de les finestres...
eo: Aliaj fenestraj proprecoj...
es: Otras propiedades de la ventana...
nl: Andere venstereigenschappen...
sl: Druge lastnosti oken...
sv: Andra fönsteregenskaper...
uk: Інші властивості вікна…
