Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Finally, we include in our page a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) that lets us place text on our page. We use `anchors.centerIn: parent` to center our label horizontally and vertically within our parent element. In this case, the parent component of our label is [Kirigami.Page](docs:kirigami2;Page). The last thing we need to do is set its text: `text: "Hello World!"`.
ca: Finalment, incloem en la nostra pàgina un [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) que ens permetrà inserir text a la nostra pàgina. Utilitzarem `anchors.centerIn: parent` per a centrar la nostra etiqueta horitzontalment i verticalment dins de l'element pare. En aquest cas, el component principal de la nostra etiqueta és [Kirigami.Page](docs:kirigami2;Page). L'últim que hem de fer és configurar el text: `text: "Hello World!"`.

source: You should find the generated executable `kirigami_hello` under `build/debug/kirigami_hello` and you may run it directly or with `cargo run`, but it will lack a Window icon. To address this, we'll install the application first.
ca: Hauríeu de trobar l'executable generat `kirigami_hello` a `build/debug/kirigami_hello` i podeu executar-lo directament o amb `cargo run`, però no tindrà una icona de finestra. Per a solucionar-ho, primer instal·larem l'aplicació.

source: Run the following:
ca: Executeu el següent:

source: With the first command, CMake will search for Kirigami and qqc2-desktop-style.
ca: Amb la primera ordre, el CMake cercarà el Kirigami i el qqc2-desktop-style.

source: With the second command, CMake will build the `kirigami_rust` target, which just calls `cargo build --target-dir build/`. This step will take a while to complete, but the next time you repeat the second CMake command it will be faster or you will not need to compile at all.
ca: Amb la segona ordre, el CMake construirà l'objectiu `kirigami_rust`, que només crida `cargo build --target-dir build/`. Aquest pas trigarà una estona a completar-se, però la propera vegada que repetiu la segona ordre del CMake serà més ràpida o no caldrà de compilar res.

source: In the third step, CMake will install the executable `kirigami_hello` under `~/.local/bin/kirigami_hello` and the desktop file under `~/.local/share/applications`, and a new entry named "Kirigami Tutorial in Rust" will appear on your menu.
ca: En el tercer pas, el CMake instal·larà l'executable `kirigami_hello` a `~/.local/bin/kirigami_hello` i el fitxer d'escriptori a `~/.local/share/applications`, i apareixerà una entrada nova al menú anomenada «Guia d'aprenentatge del Kirigami en Rust».

source: Open the menu entry and voilà! Now you will see your very first Kirigami app appear before your very own eyes.
ca: Obriu l'entrada de menu i heus aquí! Ara veureu aparèixer la vostra primera aplicació escrita amb el Kirigami.

source: Colors and themes in Kirigami
ca: Colors i temes creats amb el Kirigami
eo: Koloroj kaj etosoj en Kirigami
es: Colores y temas en Kirigami
nl: Kleuren en thema's in Kirigami
sl: Barve in teme v Kirigamiju
sv: Färger och teman i Kirigami
uk: Кольори і теми у Kirigami

source: Make your app follow your user color scheme
ca: Fent que la vostra aplicació segueixi l'esquema de color de l'usuari
eo: Faru vian apon sekvi vian uzantan kolorskemon
es: Haga que su aplicación siga el esquema de colores del usuario
fr: Faire que votre application suive le thème de couleurs de l'utilisateur.
nl: Laat uw toepassing uw gebruikerskleurenschema volgen
pl: Spraw, aby twoja aplikacja podążała za zestawem barw użytkownika
pt: Fazer com que a sua aplicação siga o esquema de cores do seu utilizador
sl: Naj vaša aplikacija sledi barvni shemi uporabnika
sv: Få programmet att följa din användarfärguppsättning
uk: Робимо так, щоб у програмі використовувалася ваша схема кольорів користувача

source: Kirigami has a color palette that follows the system colors to better integrate with the platform it is running on (i.e. Plasma Desktop, Plasma Mobile, GNOME, Android, etc.).
ca: El Kirigami té una paleta de colors que segueix els colors del sistema, per a integrar-se millor amb la plataforma en la qual s'executa (és a dir, Escriptori Plasma, Plasma Mobile, GNOME, Android, etc.).
eo: Kirigami havas kolorpaletron, kiu sekvas la sistemajn kolorojn por pli bone integriĝi kun la platformo, sur kiu ĝi funkcias (t.e. Plasma Desktop, Plasma Mobile, GNOME, Android, ktp.).
es: Kirigami tiene una paleta de colores que sigue los colores del sistema para integrarse mejor con la plataforma en la que se ejecuta (es decir, el escritorio Plasma, Plasma Mobile, GNOME, Android, etc.).
nl: Kirigami heeft een kleurenpalet dat de systeemkleuren volgt, om beter te integreren op het platform waarop het actief is (d.w.z. Plasma bureaublad, Plasma mobiel, GNOME, Android, etc.).
pt: O Kirigami tem uma paleta de cores que segue as cores do sistema, para se integrar melhor com a plataforma na qual se está a executar (i.e., Plasma no computador, Plasma Mobile, GNOME, Android, etc.).
sl: Kirigami ima barvno paleto, ki sledi sistemskim barvam, za boljšo integracijo na platformi, kjer se izvaja (npr. Plasma Desktop, Plasma Mobile, GNOME, Android itd.).
sv: Kirigami har en färgpalett som följer systemfärgerna, för att integreras bättre med plattformen det kör på (dvs. Plasma-skrivbord, Plasma-mobil, GNOME, Android, etc.).
uk: У Kirigami передбачено палітру кольорів, яка відповідає загальносистемним кольорам для кращої інтеграції із платформою, на якій запущено програму (тобто стільницею Плазми, Плазмою для мобільних пристроїв, GNOME, Android тощо).

source: All of the QML components of Kirigami and QtQuick Controls should already follow this palette by default, so usually no custom coloring should be needed for these controls.
ca: Tots els components QML del Kirigami i tots els components QML de Qt Quick Controls ja seguiran de manera predeterminada aquesta paleta, de manera que normalment no es necessitaran colors personalitzats per a cap d'aquests controls.
eo: Ĉiuj QML-komponentoj de Kirigami kaj QtQuick Controls jam devus sekvi ĉi tiun paletron defaŭlte, do kutime neniu propra kolorigo devus esti bezonata por ĉi tiuj regiloj.
nl: Alle QML componenten van Kirigami en alle Qt Quick Controls zouden het pallet al standaard moeten volgen, dus zal gewoonlijk helemaal geen aangepaste kleuring nodig zijn voor deze besturingen.
pt: Todos os componentes QML do Kirigami e todos os componentes QML do QtQuick Controls 2 seguem esta paleta por omissão, pelo que normalmente não será necessária mais nenhuma coloração personalizada para todos estes controlos.
sl: Vse QML komponente Kirigamija in vse Qt Quick Controls bodo že privzeto sledile tej paleti, tako da običajno ni treba barvanja po meri za vse kontrolnike.
sv: Alla QML-komponenter i Kirigami och QtQuick ska redan normalt följa paletten, så oftast ska ingen egen färgläggning behövas för kontrollerna.
uk: Усі компоненти QML Kirigami і усі елементи керування QtQuick вже типово використовують цю палітру, тому, зазвичай, немає потреби у додатковому налаштовуванні розфарбування усіх цих елементів керування.

source: Primitive components such as [Rectangle](docs:qtquick;QtQuick.Rectangle) should always be colored with the color palette provided by Kirigami via the [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) attached property.
ca: Els components primitius com [Rectangle](docs:qtquick;QtQuick.Rectangle) sempre s'han d'acolorir amb la paleta de colors proporcionada pel Kirigami a través de la propietat adjunta [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html).

source: Hardcoded colors in QML, such as `#32b2fa` or `red`, should usually be avoided; if it is really necessary to have elements with custom colors, it should be an area where only custom colors are used (usually in the content area of the app, and never in chrome areas such as toolbars or dialogs). For instance, a hardcoded `black` foreground cannot be used over a [Kirigami.Theme.backgroundColor](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html#backgroundColor-attached-prop) background, because if the platform uses a dark color scheme the result will have poor contrast with black over almost black. This is an accessibility issue and should be avoided.
ca: En general, s'han d'evitar els colors codificats en el QML, com `#32b2fa` o `red`. Si realment és necessari tenir elements amb colors personalitzats, haurà de ser una àrea on només s'utilitzin colors personalitzats (generalment a l'àrea de contingut de l'aplicació, i mai en les àrees de cromat com les barres d'eines o els diàlegs), per exemple, un primer pla `black` codificat no es pot utilitzar sobre un fons [Kirigami.Theme.backgroundColor](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html#backgroundColor-attached-prop), perquè si la plataforma empra un esquema de color fosc, el resultat tindrà un contrast pobre del negre sobre gairebé negre. Això és un problema d'accessibilitat i s'hauria d'evitar.

source: If you really need to use custom colors, check out [Kontrast](https://apps.kde.org/kontrast/) to ensure that the colors you choose have good contrast and are [WCAG compliant](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
ca: Si realment necessiteu utilitzar colors personalitzats, reviseu el [Kontrast](https://apps.kde.org/kontrast/) per a assegurar-vos que els colors que trieu tenen un bon contrast i que són [compatibles amb el WCAG](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
eo: Se vi vere bezonas uzi proprajn kolorojn, kontrolu [Kontrast](https://apps.kde.org/kontrast/) por certigi, ke la koloroj, kiujn vi elektas, havas bonan kontraston kaj konformas al [WCAG](https://eo). .wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
nl: Als u echt aangepaste kleuren nodig hebt, kijk dan op [Kontrast](https://apps.kde.org/kontrast/) om er zeker van te zijn dat de kleuren die u kiest een goed contrast hebben en [WCAG compliant](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines) zijn.
pt: Se precisar realmente de usar cores personalizadas, consulte o [Kontrast](https://apps.kde.org/kontrast/) para garantir que as cores que escolher têm bom contraste e são [compatíveis com a WCAG](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
sl: Če že res morate uporabljati barve po meri, si oglejte [Kontrast](https://apps.kde.org/kontrast/), da zagotovite, da izbrane barve ustrezajo priporočilom [WCAG](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
sv: Om du verkligen behöver använda egna färger, titta på [Kontrast](https://apps.kde.org/kontrast/) för att säkerställa att färgerna du väljer har bra kontrast och är [WCAG-kompatibla](https://sv .wikipedia.org/wiki/Web_Content_Accessibility_Guidelines).
uk: Якщо вам дуже потрібне використання нетипових кольорів, скористайтеся [Kontrast](https://apps.kde.org/kontrast/), щоб забезпечити добру контрастність та сумісність із [WCAG](https://en.wikipedia.org/wiki/Web_Content_Accessibility_Guidelines) вибраних кольорів.

source: Theme
ca: Tema
eo: Etoso
es: Tema
fr: Thème
nl: Thema
pl: Wygląd
pt: Tema
sl: Tema
sv: Tema
uk: Тема

source: [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) is an attached property, and therefore it is available to use for any QML item. Its properties include all the colors available in the palette, and what palette to use, such as the [colorSet](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html#colorSet-attached-prop) property.
ca: [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) és una propietat adjunta, per tant, està disponible per a utilitzar-la en qualsevol element QML. Les seves propietats inclouen tots els colors disponibles a la paleta, i quina paleta emprar, així com la propietat [colorSet](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html).

source: [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/) provides a code example showcasing [all colors available for Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) through [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html). This includes all their states: if you click outside the window, the colors change to their inactive state, and if you switch your system to a dark theme, the dark variants of the colors should show up in real time.
ca: La [Galeria del Kirigami](https://apps.kde.org/kirigami2.gallery/) proporciona un exemple de codi que mostra [tots els colors disponibles per al Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) a través del [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html). Això inclou tots els seus estats: si feu clic fora de la finestra, els colors canviaran al seu estat inactiu, i si canvieu el sistema a un tema fosc, les variants fosques dels colors es mostraran en temps real.

source: The Colors component in Kirigami Gallery
ca: El component Colors en la Galeria del Kirigami
eo: La Koloroj-komponento en Kirigami Gallery
es: El componente «Colors» de la Galería de Kirigami
nl: De kleurencomponent in Kirigami galerij
pt: O componente Colors na Galeria do Kirigami
sl: Komponenta barv v Galeriji Kirigami
sv: Färgkomponenterna i Kirigami galleri
uk: Компонент Colors у Галереї Kirigami

source: Color Set
ca: Conjunt de colors
eo: Koloro Aro
es: Conjunto de colores
fr: Palette de couleurs
nl: Kleurenset
pl: Zestaw barw
pt: Conjunto de Cores
sl: Barvni nabor
sv: Färguppsättning
uk: Встановлення кольору

source: Depending on where a control is located, it should use a different color set: for instance, when the Breeze Light color scheme is used in [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html), the normal background is almost white, while in other regions, such as toolbars or dialogs, the normal background color is gray.
ca: Depenent d'on s'ubiqui un control, haureu d'utilitzar un conjunt de colors diferent: per exemple, quan el tema de color Brisa clara es fa servir a les [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html), el fons normal és gairebé blanc, mentre que en altres regions, com les barres d'eines o diàlegs, el color de fons normal és gris.
eo: Depende de kie troviĝas regilo, ĝi devus uzi malsaman koloraron: ekzemple, kiam la kolorskemo de Breeze Light estas uzata en [Vidoj](https://doc.qt.io/qt-6/qtquick-modelviewsdata- modelview.html), la normala fono estas preskaŭ blanka, dum en aliaj regionoj, kiel ilobretoj aŭ dialogoj, la normala fonkoloro estas griza.
nl: Afhankelijk van waar een besturing is gelokaliseerd, zou het een andere kleurset moeten gebruiken: bijvoorbeeld, (met het kleurenthema Breeze light) in [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html), is de normale achtergrond bijna wit, terwijl in andere gebieden, zoals werkbalken of dialogen, de normale achtergrondkleur grijs is.
pt: Dependendo de onde se localiza um dado controlo, deverá usar um conjunto de cores diferente: por exemplo, (com o tema de cores Brisa Claro) nas [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html), o fundo normal é quase branco, enquanto noutras regiões, como as barras de ferramentas ou nas janelas, a cor de fundo normal é o cinzento.
sl: Glede na to, kje se nahaja kontrolnik, bi moral uporabiti drugačen nabor barv. Primer (s temo svetlih barv Breeze/Sapica): v pogledih [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) je navadno ozadje skoraj belo, medtem ko je v drugih območjih kot so orodne vrstice ali pogovorna okna, navadno barva ozadja siva.
sv: Beroende på var en kontroll är placerad, ska den använda olika färguppsättningar: exempelvis när färgtemat Breeze ljus används i [Views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html), är den normala bakgrunden nästan vit, medan i andra områden, såsom verktygsrader och dialogrutor, är den normala bakgrundsfärgen grå.
uk: Залежно від місця розташування елемента керування, він використовуватиме різні набори кольорів. Наприклад, (якщо використано світлу схему кольорів Breeze) на панелях [панелях перегляду](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) звичайне тло майже біле, а в інших областях, зокрема на панелях інструментів, звичайне тло є сірим.

source: If you define a color set for an item, all of its child items will recursively inherit it automatically (unless the property [inherit](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html#inherit-attached-prop) has explicitly been set to `false`, which should always be done when the developer wants to force a specific color set) so it is easy to change colors for an entire hierarchy of items without touching any of the items themselves.
ca: Si establiu un conjunt de colors per a un element, tots els seus elements fills l'heretaran de manera recursiva automàticament (llevat que la propietat [inherit](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html#inherit-attached-prop) s'hagi establert explícitament a `false`, el qual sempre s'ha de fer quan el desenvolupador vol forçar un conjunt de colors específic), de manera que és fàcil canviar els colors de tots una jerarquia d'elements sense tocar cap dels elements en si.

source: [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) supports 5 different color sets:
ca: [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) admet 5 conjunts diferents de colors:

source: View: Color set for item views, usually the lightest of all (in light color themes)
ca: View: conjunt de colors per a les vistes d'elements, generalment el més clar de tots (en els temes de colors clars)
eo: Vido: Koloro aro por eroj-vidoj, kutime la plej malpeza el ĉiuj (en helkoloraj etosoj)
es: View: Conjunto de colores para las vistas de elementos; suele ser el más claro de todos (en los temas de color claros).
fr: Vue : ensemble de couleurs défini pour les vues des éléments, généralement la plus claire de toutes (dans les thèmes de couleurs claires).
nl: Beeld: kleurenset voor item weergaven, gewoonlijk de lichtste van allen (in lichte kleurenthema's)
pl: Widok: Zestaw barw dla widoków rzeczy, zazwyczaj najjaśniejszy (w jasnych trybach barw)
pt: View: Conjunto de cores das janelas de itens; normalmente é o mais claro de todos (em temas de cores claras)
sl: Pogled (View): barvni nabor za poglede elementov, običajno najsvetlejši od vseh (v svetlih barvnih temah)
sv: View: Färguppsättning för objektvyer, ofta de ljusaste av alla (i ljusa teman)
uk: View: набір кольорів для панелей записів, зазвичай, найсвітліший з усіх (у світлих темах кольорів)

source: Window: Color set for windows and chrome areas (this is also the default color set)
ca: Window: conjunt de colors per a les finestres i les àrees «cromades» (aquest és també el conjunt de colors predeterminat)
eo: Fenestro: Koloro aro por fenestroj kaj kromaj areoj (ĉi tio ankaŭ estas la defaŭlta koloraro)
nl: Venster: kleurenset voor vensters en chroom-gebieden (dit is ook de standaard kleurenset)
pt: Window: Conjunto de cores para as janelas e áreas de desenho (este também é o conjunto de cores predefinido)
sl: Okno (Window): Nabor barv za območja oken in krome (to je tudi privzeti nabor barv)
sv: Window: Färguppsättning för fönster och kromområden (det är också förvald färguppsättning)
uk: Window: набір кольорів для вікон і «хромованих» областей (це також типовий набір кольорів)

source: Button: Color set used by buttons
ca: Button: conjunt de colors utilitzat pels botons
eo: Butono: Koloro uzata de butonoj
es: Button: Conjunto de colores usado por los botones.
fr: Bouton : palette de couleurs utilisée par les boutons
nl: Knop: kleurenset gebruikt door knoppen
pl: Przycisk: Zestaw barw używany przez przyciski
pt: Button: Conjunto de cores usado pelos botões
sl: Gumb (Button): nabor barv, ki ga uporabljajo gumbi
sv: Button: Färguppsättning använd av knappar
uk: Button: набір кольорів, який використовують для кнопок

source: Selection: Color set used by selected areas
ca: Selection: conjunt de colors utilitzat per les àrees seleccionades
eo: Elekto: Koloro uzata de elektitaj areoj
es: Selection: Conjunto de colores usado por las áreas seleccionadas.
fr: Sélection : jeu de couleurs utilisé par les zones sélectionnées
nl: Selectie: kleurenset gebruikt door geselecteerde gebieden
pl: Zaznaczenie: Zestaw barw użyty przez zaznaczone obszary
pt: Selection: Conjunto de cores usado pelas áreas seleccionadas
sl: Izbira (Selection): nabor barv, ki ga uporabljajo izbrana območja
sv: Selection: Färguppsättning använd av markerade områden
uk: Selection: набір кольорів, який використовують для позначених областей

source: Tooltip: Color set used by tooltips
ca: Tooltip: conjunt de colors utilitzat per als consells d'eina
eo: Konsileto: Koloro uzata de konsiletoj
es: Tooltip: Conjunto de colores usado por las ayudas emergentes.
fr: Infobulle : palette de couleurs utilisée par les infobulles
nl: Tekstballon: kleurenset gebruikt door tekstballonnen
pl: Wskazówka: Zestaw barw używany przez wskazówki
pt: Tooltip: Conjunto de cores usadas pelas dicas
sl: Namig (Tooltip): nabor barv, ki ga uporabljajo namigi orodij
sv: Tooltip: Färguppsättning använd av verktygstips
uk: Tooltip: набір кольорів, який використовують для підказок

source: Complementary: Color set meant to be complementary to Window: usually dark even in light themes. May be used for emphasis in small areas of the application
ca: Complementary: conjunt de colors destinat a ser complementari a Window: generalment és fosc fins i tot en els temes clars. Pot emprar-se per a emfatitzar en les àrees petites de l'aplicació
eo: Komplementa: Koloro intencita esti komplementa al Fenestro: kutime malhela eĉ en helaj etosoj. Povas esti uzata por emfazo en malgrandaj areoj de la apliko
es: Complementary: Conjunto de colores que se usa como complementario de Window; normalmente es oscuro, incluso en los temas claros. Se puede usar para enfatizar pequeñas áreas de la aplicación.
nl: Complementair: kleurenset bedoeld om complementair te zijn aan venster: gewoonlijk is donker de tegenhanger van lichte thema's. Kan gebruikt worden voor emphasis in kleine gebieden van de toepassing
pt: Complementary: Conjunto de cores complementar ao Window: normalmente é escuro, mesmo em temas claros. Poderá ser usado para enfatizar pequenas áreas da aplicação
sl: Komplementarni (Complementary): nabor barv, ki naj bi bil komplementaren z oknom: ponavadi temno tudi v svetlobnih temah. Se lahko uporablja za poudarek na majhnih območjih aplikacije
sv: Complementary: Färguppsättning avsedd att vara komplementär till Fönster: oftast är den mörk också i ljusa teman. Kan användas för eftertryck på små områden i programmet.
uk: Complementary: набір кольорів, який має доповнювати Window: зазвичай, є темним навіть у світлих темах. Ним можна скористатися для «акцентування» невеликих частин інтерфейсу програми.
