Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Looking at our [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), the first properties we set are [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) and [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). We have set these to the `delegateLayout.implicitWidth` and `delegateLayout.implicitHeight`, i.e. the `implicitWidth` and `implicitHeight` of the `GridLayout` element. Implicit widths and heights are properties that are set as a default, i.e. if there is no explicit width or height set for these components. We have therefore set the `implicitWidth` and `implicitHeight` of our [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) to that of the [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) below to ensure it does not spill out of the card.
pt: Ao olhar para o nosso [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), as primeiras propriedades que definimos são a [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) e a [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). Iremos configurar essas com os valores de `delegateLayout.implicitWidth` e `delegateLayout.implicitHeight`, i.e. a `implicitWidth` e `implicitHeight` do elemento `GridLayout`. As largura e alturas implícitas são propriedades que são definidas como uma espécie de valor predefinido, i.e. se não existir nenhuma largura ou altura explícita para estes componentes. Como tal, configurámos a `implicitWidth` e `implicitHeight` do nosso [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) com os valores respectivos da GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) abaixo, para garantir que a `GridLayout` não descarta o cartão.

source: Next we specify the spacing between the rows and columns within our grid, so that our components don't bunch up. Kirigami provides a number of handy [predefined units](docs:kirigami2;Kirigami::Units) to use for this purpose:
pt: Em seguida definimos o espaço entre as linhas e colunas dentro da nossa grelha, para que os nossos componentes não se amontoem. O Kirigami oferece um conjunto de [unidades predefinidas](docs:kirigami2;Kirigami::Units) a usar para este fim:

source: As you might remember, `root` is the id of our [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). It provides the [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen) property, used to determine whether the current device screen is a widescreen (i.e. a computer monitor or a phone in landscape). We use a ternary conditional here to vary the number of columns in our grid depending on the screen we are using: if it's a widescreen, the grid will have 4 columns, else it will have 2.
pt: Como se poderá recordar, o `root` é o ID da nossa [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Oferece a propriedade [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen), usada para determinar se o dispositivo actual tem um ecrã panorâmico (i.e., um monitor de computador ou um telefone no modo paisagem). Usamos uma condição ternária aqui para variar o número de colunas na nossa grelha, dependendo do ecrã que estamos a usar: se for um ecrã panorâmico, a grelha terá 4 colunas, caso contrário terás 2.

source: ![Screenshot showing how a Card looks like](CardDesign.png)
pt: ![Imagem a mostrar como é a aparência de um Card](CardDesign.png)

source: If you'd like to work on more complex KDE applications such as Dolphin, Kontact, or Kate, you will need to learn more about how to use QtWidgets, which encompass a completely different way of developing user interfaces with Qt. While not interchangeable with QML/Kirigami—they each have a different set of tradeoffs—older and more complex KDE applications tend to be built with QtWidgets.
pt: Se quiser trabalhar em aplicações do KDE mais complexas, como o Dolphin, o Kontact ou o Kate, terá de aprender mais sobre como usar os QtWidgets, que oferece uma forma completamente diferentes de desenvolver interfaces de utilizador com o Qt. Embora não possa ser um substituto do QML/Kirigami - cada um deles tem o seu conjunto de compromissos - as aplicações do KDE mais antigas e mais complexas tendem a ser desenvolvidas com o QtWidgets.

source: QtWidgets are somewhat more daunting to work with than QML (and *much* more C++ intensive!). Luckily, we have [a set of tutorials](/docs/kxmlgui) in the KDE Docs that will help you become more familiar with them.
pt: Os QtWidgets são de certa forma mais difíceis de trabalhar que com o QML (e *muito* mais intensivos a nível de C++). Felizmente, existe um [conjunto de tutoriais](/docs/kxmlgui) na Documentação do KDE que o ajudarão a familiarizar-se com eles.

source: We recommend you also take a look at [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/), an application designed by KDE developers to demonstrate Kirigami's tools and capabilities. It provides both interactive examples of Kirigami components as well as links to the source code of these examples so you can see how they were built. You can read more about Kirigami Gallery in our [specific Kirigami Gallery tutorial](/docs/getting-started/kirigami/introduction-kirigami-gallery).
pt: Recomendamos-lhe que dê uma vista de olhos na [Galeria do Kirigami](https://apps.kde.org/kirigami2.gallery/), uma aplicação desenhada pelos programadores do KDE que demonstra as ferramentas e capacidades do Kirigami. Oferece exemplos interactivos de componentes do Kirigami e referências simples para o código-fonte desses exemplos, para que possa ver como os mesmos foram desenvolvidos. Poderá ler mais sobre a Galeria do Kirigami no nosso [tutorial específico da Galeria do Kirigami](/docs/getting-started/kirigami/introduction-kirigami-gallery).

source: ![Overlay sheet appearing in the middle of the application like a dialog window](addSheet.webp)
pt: ![Camada sobreposta que aparece no meio da aplicação, como se fosse uma janela de diálogo](addSheet.webp)

source: The new component we add is a [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet). Overlay sheets hover above the contents of the window and can be used for a variety of purposes, such as providing extra information relevant to the current content. They are like fancy pop-up windows, except they can't be moved.
pt: O novo componente que vamos adicionar é um [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet). As folhas sobrepostas ficam sobre o conteúdo da janela e poderão ser usadas para uma grande variedade de fins, como fornecer informações extra que sejam relevantes para o conteúdo actual. São uma espécie de janelas instantâneas especiais, com a diferença que não podem ser movidas.

source: We can give overlay sheets a header. These are set with the [header](docs:kirigami2;templates::OverlaySheet::header) property. We have provided ours with a [Kirigami.Heading](docs:kirigami2;Heading) containing a relevant title: "Add Kountdown".
pt: Podemos atribuir às folhas sobrepostas um cabeçalho. O mesmo é atribuído através da propriedade [header](docs:kirigami2;templates::OverlaySheet::header). Passámos o nosso com um [Kirigami.Heading](docs:kirigami2;Heading) que contém um título relevante: 'Add Kountdown' (Adicionar uma Contagem).

source: Then we come to a [Kirigami.FormLayout](docs:kirigami2;FormLayout). This allows us to easily create responsive input forms, which neatly display labels for inputs and the inputs themselves on both widescreen displays and narrower mobile devices. These form layouts are designed to work with a variety of different input types, though we're sticking to simple [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) inputs that give us simple text boxes to write things in.
pt: Depois chegamos ao [Kirigami.FormLayout](docs:kirigami2;FormLayout). Este permite-nos criar facilmente formulários altamente adaptativos, os quais mostra as legendas dos campos e os campos propriamente ditos, tanto em ecrãs panorâmicos como em dispositivos móveis mais estreitos. Estas disposições de formulários estão desenhadas para lidarem com uma grande variedade de tipos de campos, ainda que para já nos foquemos com campos simples do tipo [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), que nos dão campos de texto simples onde poderemos escrever as coisas.

source: Within each of these [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) elements, we are setting a [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) property that lets us define labels for them. The form will present the correct labels to the left of each of these text input fields. We are also setting placeholder text inside the fields with the [TextField.placeholderText](https://doc.qt.io/qt-5/qml-qtquick-controls2-textfield.html#placeholderText-prop) property, which will disappear as soon as the user begins typing in the field. Finally, we are also setting the [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) property to trigger the [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) method of the following field; this will switch the active field once the user hits the ENTER key, improving the usability of our form.
pt: Dentro de cada um destes elementos [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), estamos a configurar uma propriedade [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) que lhe permite definir legendas para eles. O formulário irá apresentar os textos correctos para cada um destes campos de texto. Iremos também definir o texto de substituição dentro dos campos com a propriedade [TextField.placeholderText](https://doc.qt.io/qt-5/qml-qtquick-controls2-textfield.html#placeholderText-prop) -- este texto irá desaparecer assim que o utilizador começar a escrever algo no campo. Finalmente, iremos também configurar a propriedade [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) para invocar o método [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) do campo seguinte; isto irá mudar o campo activo assim que o utilizador carregar na tecla ENTER, melhorando a usabilidade do nosso formulário.

source: We have also set a property called [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) on the text field for our date. Setting this to `"0000-00-00"` prevents users from entering something that might break the functionality of the application (such as text), restricting them to only entering digits which we can then try to parse into a date object.
pt: Também definimos uma propriedade chamada [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) no campo de texto da nossa data. Se configurarmos a mesma como `"0000-00-00"`, impedimos que o utilizador escreva algo que possa quebrar a funcionalidade da aplicação (como por exemplo texto), restringindo-os a indicar apenas números e traços, que poderemos então usar para tentar processar um objecto de data.

source: At the end of our form we are including a [Button](docs:qtquickcontrols;QtQuick.Controls.Button) that adds our new countdown to the list model. We have set its [enabled](https://doc.qt.io/qt-5/qml-qtquick-item.html#enabled-prop) property to a conditional statement that checks whether the name field is empty or not: if it is, the button is disabled, and vice versa. When the button is triggered, it triggers the [append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) method of our `kountdownModel` list model, adding a JavaScript object including the properties we have provided. We also make sure to clear the text fields by setting their [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) properties to an empty string. We finally call a method on our overlay sheet, [close()](docs:kirigami2;templates::OverlaySheet::close), which closes it.
pt: No fim do nosso formulário estamos a incluir um [Button](docs:qtquickcontrols;QtQuick.Controls.Button) que adiciona a nossa nova contagem decrescente ao modelo da lista. Configurámos a propriedade [enabled](https://doc.qt.io/qt-5/qml-qtquick-item.html#enabled-prop) com uma instrução condicional que verifica se o campo do nome está vazio ou não: se estiver, o botão fica desactivado, e vice-versa. Quando o botão for carregado, ele invoca o método [append](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) do nosso modelo de lista `kountdownModel`, adicionando um objecto de JavaScript que inclui as propriedades que fornecemos. Também nos certificamos que limpamos os campos de texto, configurando as suas propriedades [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) respectivas com um texto vazio. Finalmente, podemos invocar um método na nossa folha sobreposta, o [close()](docs:kirigami2;templates::OverlaySheet::close), que a irá fechar.

source: Overlay sheets have two methods, [open()](docs:kirigami2;templates::OverlaySheet::open) and [close()](docs:kirigami2;templates::OverlaySheet::close), which control the opening and closing of this component. In this case, we have set the sheet to be opened when we trigger our action. Once we save our files and build our program, we'll be able to add our own custom countdowns!
pt: As folhas sobrepostas têm dois métodos, o [open()](docs:kirigami2;templates::OverlaySheet::open) e o [close()](docs:kirigami2;templates::OverlaySheet::close), que controlam a abertura e o fecho deste componente. Neste caso, configurámos a folha para ser aberta quando activarmos a nossa acção. Assim que tivermos gravado os nossos ficheiros e compilado o nosso programa, seremos capazes de adicionar as nossas próprias contagens decrescentes personalizadas!

source: These tutorials will focus on creating an application that lets the user see how many days are left until an event of their choice. That doesn't mean you shouldn't deviate and try to create your own thing! Just make sure you pay close attention to how things work *first*, so that you can adjust when things are different in your own code. We also recommend you check out the [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), which provides a number of useful UI examples and easy access to all the code.
pt: Estes tutoriais focar-se-ão na criação de uma aplicação que permite ao utilizador ver quantos dias faltam até à chegada de um evento à sua escolha. Isto não significa que você não se deva desviar e tentar criar as suas próprias coisas! Simplesmente preste atenção à forma como as coisas funcionam *primeiro*, podendo depois ajustar essas coisas de forma diferente no seu próprio código. Também recomendamos que consulte a [Galeria do Kirigami](https://apps.kde.org/en/kirigami2.gallery), que oferece um conjunto de exemplos úteis de interfaces, com acesso fácil a todo o código.

source: Kirigami apps are typically organized in [Pages](docs:kirigami2;Page). Those are the different "screens" of an app. You will want to have a page dedicated to specific aspects of your app's interaction, and to make things easier you can create different QML files, one for each page.
pt: As aplicações do Kirigami normalmente estão organizadas em [Pages](docs:kirigami2;Page) (páginas). Estes são os diferentes "ecrãs" de uma aplicação. Irá querer ter uma página dedicada a aspectos específicos da interacção com a sua aplicação, e poderá criar ficheiros QML diferentes, contendo cada um o código para as páginas separadas.

source: Pages are organized in a [page stack](docs:qtquickcontrols;QtQuick.Controls.StackView) where they can be pushed and popped. On a phone only the top-most page is shown, whereas on a larger screen (desktop or tablet), if desired, multiple pages can be shown next to each other.
pt: As páginas estão organizadas numa [pilha de páginas](docs:qtquickcontrols;QtQuick.Controls.StackView) onde se poderão inserir e retirar páginas. Num telemóvel, só a página de topo é que aparece, enquanto que num ecrã maior (computador ou 'tablet') poderão ser vistas várias páginas umas a seguir às outras.

source: ![A single page on the phone](mobile.webp)
pt: ![Uma única página no telemóvel](mobile.webp)

source: ![Two pages next to each other on the desktop](desktop.webp)
pt: ![Duas páginas, uma a seguir à outra no computador](desktop.webp)

source: KDE has [Human Interface Guidelines (HIG)](/hig/introduction/architecture/) that go into detail about how to best design your application. The guidelines help ensure your application remains usable, consistent, and aesthetic.
pt: O KDE tem uma [página útil com as Linhas-Mestras de Interfaces Humanas (HIG)](/hig/introduction/architecture/) que entra em detalhe sobre como desenhar melhor a sua aplicação. Os guias nela existentes irão ajudar a garantir que a sua aplicação se mantém fácil de usar, consistente e agradável a nível estético.

source: The idea behind our app is that we're going to be able to display a bunch of countdowns to the user. The problem with a normal [Kirigami.Page](docs:kirigami2;Page) is that it has a fixed vertical size, but don't worry: Kirigami also supports scrollable pages. [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) is going to be our main page now.
pt: A ideia por trás da nossa aplicação é que seremos capazes de mostrar um conjunto de contagens decrescentes ao utilizador. O problema com uma [Kirigami.Page](docs:kirigami2;Page) normal é que a mesma tem um tamanho vertical fixo, mas não se preocupe: o Kirigami também suporta páginas com deslocamento. A [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) irá substituir agora a nossa página principal.

source: If you've gone ahead of the tutorial, you might have noticed that there is also such a thing as a [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) that you can use to contain your components. However, do NOT put a `ScrollView` inside a `ScrollablePage` as this can cause problems. Children of a `ScrollablePage` are functionally already in a `ScrollView`.
pt: Se já tiver avançado no tutorial, poderá já ter reparado que existe uma coisa chamada [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView), que poderá usar para conter os seus componentes. Contudo, NÃO ponha uma `ScrollView` dentro de uma `ScrollablePage`, dado que isto poderá causar problemas. Os filhos de uma `ScrollablePage` já estão a nível funcional dentro de uma `ScrollView`.

source: You could also choose to define your page within its own QML document. To do so, you'd create the new QML file, for example "StartPage.qml", add it to your `resources.qrc` file, and set the window's first page to load it, like so:
pt: Também poderá optar por definir a sua página dentro do seu próprio documento QML. Para o fazer, iria criar o novo documento em QML, por exemplo "startPage.qml", adicioná-lo ao seu ficheiro `resources.qrc` e configurar a primeira página para o carregar, como por exemplo:

source: The key changes we have made involve the addition of our component definition `AddEditSheet` (and `KountdownDelegate` further down) and a new function called `openPopulatedSheet()`.
pt: As mudanças-chave que fizemos envolvem a adição da definição do nosso componente `AddEditSheet` (e o `KountdownDelegate` mais abaixo), assim como uma nova função chamada `openPopulateSheet()`.

source: `onAdded` and `onEdited` are signal handlers. Just like `onTriggered` is called when we click an action, we can use handlers that respond to our custom signals.
pt: O `onAdded` e o `onEdited` são rotinas de tratamento de sinais. Assim como o `onTriggered` é invocado quando carregamos numa acção, também iremos usar rotinas que respondem aos nossos sinais personalizados.

source: Looking at our new `AddEditSheet.qml`—our repurposed adding sheet—we can see how these signals work:
pt: Se olhar para o nosso novo `AddEditSheet.qml`— a nossa folha de adição remodelada — podemos ver como funcionarão esses eventos:

source: Signals invoke their handlers when they are called. In this case, we have created two signals, `added` and `edited`, that we can invoke with different outcomes, and to which we can attach information about the countdown we are adding or creating. A neat thing about signals is that they expose the variables defined in them to the functions that are listening to them, which is why we can just call those variable names in our `onEdited` and `onAdded` handlers in `main.qml`. Our signals are invoked by the "Done" button depending on what the `mode` property, defined at the top of our AddEditSheet, is set to.
pt: Os 'signals' (sinais ou eventos) invocam as suas rotinas de tratamento sempre que são invocados. Neste caso, criámos dois sinais, `added` e `edited`, que poderemos invocar com diferentes resultados, e aos quais poderemos associar informações sobre as contagens decrescentes que estamos a criar ou alterar. Uma coisa boa sobre os sinais é que eles expõem as variáveis definidas neles às funções que estão à escuta deles, sendo por isso que podemos invocar esses nomes de variáveis nas nossas rotinas `onEdited` e `onAdded` no `main.qml`. Os nossos sinais são invocados pelo botão "Terminar", dependendo do valor com que está configurada a propriedade `mode`, definida no topo da nossa AddEditSheet.

source: Which brings us back to `main.qml` and our new `openPopulatedSheet()` function. You might have noticed that this is what it is called now when the countdown-adding action is triggered. This function takes in several arguments which have been provided with defaults. This is helpful when we simply want to add a new countdown, because we can have the concise function call `openPopulatedSheet("add")`. More importantly, this function sets all the relevant properties in AddEditSheet.
pt: O que nos traz de volta ao `main.qml` e à nossa nova função `openPopulateSheet()`. Poderá ter reparado que é esta que agora é invocada quando é desencadeada a acção de adição de contagens. Esta função recebe vários argumentos que foram passados com os valores predefinidos. Isto é útil quando simplesmente queremos criar uma nova contagem decrescente, dado que podemos ter a chamada à função mais concisa `openPopulateSheet("add")`. Mais importante, esta função configura todas as propriedades relevantes em AddEditSheet.

source: `index` is needed so that when we save our edited countdown, the correct one is modified
pt: O argumento `index` é necessário para que, quando gravarmos a nossa contagem editada, seja modificada a correcta

source: Of course, to actually use our sheet for anything besides adding countdowns first we need to make the edit button on our cards work. But if you look at our [Kirigami.CardsListView](docs:kirigami2;CardsListView) in `main.qml`...
pt: Obviamente, para usarmos de facto a nossa folha para algo que não seja apenas adicionar contagens, primeiro precisamos de criar o botão de edição no nosso trabalho com os cartões. Porém, se olhar para o nosso [Kirigami.CardsListView](docs:kirigami2;CardsListView) no `main.qml`...

source: We've replaced our [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) with a delegate component definition from `KountdownDelegate.qml`.
pt: Substituímos o nosso [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) pela definição de um componente-delegado de `KountdownDelegate.qml`.
