Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Then we get to a section where we include a number of necessary CMake and KDE settings by using [extra-cmake-modules](https://api.kde.org/ecm/). They provide a set of useful utilities:
ca: Després arribem a una secció on incloem una sèrie de paràmetres necessaris de CMake i del KDE fent servir [extra-cmake-modules](https://api.kde.org/ecm/). Proporcionen un conjunt d'utilitats:
eo: Poste ni atingas sekcion, kie ni inkluzivas kelkajn necesajn agordojn de CMake kaj KDE uzante [extra-cmake-modules](https://api.kde.org/ecm/). Ili provizas aron de valoraj utilaĵoj:
es: Luego llegamos a una sección donde incluimos una serie de preferencias necesarias de CMake y de KDE usando [extra-cmake-modules](https://api.kde.org/ecm/). Estas proporcionan un conjunto de prácticas utilidades:
nl: Daarna krijgen we een sectie waar we een aantal noodzakelijke CMake en KDE-instellingen invoegen met gebruik van [extra-cmake-modules](https://api.kde.org/ecm/). Ze leveren een set van nuttige hulpmiddelen:
sl: Nato pridemo do razdelka, kjer vključimo številne potrebne nastavitve CMake in KDE z uporabo [extra-cmake-modules](https://api.kde.org/ecm/). Zagotavljajo niz uporabnih pripomočkov:
sv: Därefter kommer vi till en sektion där vi inkluderar ett antal nödvändiga CMake- och KDE-inställningar genom att använda [extra-cmake-modules](https://api.kde.org/ecm/). De tillhandahåller en uppsättning användbara verktyg.
uk: Далі, маємо розділ, у якому ми включимо декілька потрібних параметрів CMake і KDE за допомогою [extra-cmake-modules](https://api.kde.org/ecm/). Вони забезпечують роботу корисних допоміжних інструментів:

source: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) provides convenience variables such as `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` and `${KDE_INSTALL_LIBDIR}`.
ca: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) proporciona variables d'utilitat com ara `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` i `${KDE_INSTALL_LIBDIR}`.
eo: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) provizas oportunajn variablojn kiel `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_INSTALL] kaj `${BIND_INS}` `${KDE_INSTALL_LIBDIR}`.
es: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) proporciona variables de conveniencia, como `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` y `${KDE_INSTALL_LIBDIR}`.
nl: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) levert gemaksvariabelen zoals `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` en `${KDE_INSTALL_LIBDIR}`.
sl: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) nudi priročne spremenljivke, kot so `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` in `${KDE_INSTALL_LIBDIR}`.
sv: [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) tillhandahåller bekvämlighetsvariabler såsom `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` and `${KDE_INSTALL_LIBDIR}`.
uk: У [KDEInstallDirs](https://api.kde.org/ecm/kde-module/KDEInstallDirs6.html) передбачено зручні змінні, зокрема `${KDE_INSTALL_TARGETS_DEFAULT_ARGS}`, `${KDE_INSTALL_QMLDIR}`, `${KDE_INSTALL_BINDIR}` та `${KDE_INSTALL_LIBDIR}`.

source: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) provides things like `CMAKE_AUTORCC ON`, an `uninstall` target that can be used with `cmake --build build/ --target uninstall`, and `ENABLE_CLAZY`.
ca: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) proporciona coses com `CMAKE_AUTORCC ON`, un objectiu `uninstall` que es pot fer servir amb `cmake --build build/ --target uninstall`, i `ENABLE_CLAZY`.
eo: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) provizas aferojn kiel `CMAKE_AUTORCC ON`, celon `malinstali` kiu povas esti uzata kun `cmake --build build/ - -target uninstall`, kaj `ENABLE_CLAZY`.
es: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) proporciona cosas como `CMAKE_AUTORCC ON`, un objetivo `uninstall` que se puede usar con `cmake --build build/ --target uninstall`, y `ENABLE_CLAZY`.
nl: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) levert zaken zoals `CMAKE_AUTORCC ON`, een `uninstall` doel dat gebruikt kan worden met `cmake --build build/ --target uninstall` en `ENABLE_CLAZY`.
sl: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) ponuja stvari, kot je `CMAKE_AUTORCC ON`, `uninstall` cilja, ki se lahko uporablja z `cmake --build build/ - -target uninstall` in `ENABLE_CLAZY`.
sv: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) tillhandahåller saker som `CMAKE_AUTORCC ON`, målet `avinstallera` som kan användas med `cmake --build build/ - -target uninstall` och `ENABLE_CLAZY`.
uk: [KDECMakeSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) містить речі, подібні до `CMAKE_AUTORCC ON`, ціль `uninstall`, якою можна скористатися за допомогою `cmake --build build/ --target uninstall`, і `ENABLE_CLAZY`.

source: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) provides a minimum C++ standard, compiler flags such as `-pedantic`, and best practices macros like `-DQT_NO_CAST_FROM_ASCII` to require explicit conversions such as `QStringLiteral()`.
ca: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) proporciona un estàndard C++ mínim, indicadors del compilador com `-pedantic`, i macros de millors pràctiques com `-DQT_NO_CAST_FROM_ASCII` per a necessitar conversions explícites com `QStringLiteral()`.
eo: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) provizas minimuman C++-normon, kompililajn flagojn kiel `-pedantic`, kaj plej bonajn praktikajn makroojn kiel `-DQT_NO_CAST_FROM_ASCII` por postuli eksplicitaj konvertiĝoj kiel `QStringLiteral()`.
es: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) proporciona un estándar de C++ mínimo, indicadores del compilador (como `-pedantic`) y macros de buenas prácticas (como `-DQT_NO_CAST_FROM_ASCII` para exigir conversiones explícitas, como `QStringLiteral()`).
nl: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) levert minimale C++ standaard compilervlaggen zoals `-pedantic`, en beste praktijk-macro's zoals `-DQT_NO_CAST_FROM_ASCII` om expliciete conversies zoals `QStringLiteral()` te vereisen.
sl: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) zagotavlja minimalni standard C++, zastavice prevajalnika, kot je `-pedantic`, in makre najboljših praks, kot je `-DQT_NO_CAST_FROM_ASCII`, ki zahtevajo eksplicitne pretvorbe, kot je `QStringLiteral()`.
sv: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) tillhandahåller den minimala C++ standarden, kompilatorflaggor som "-pedantic" och makron för bästa praxis som "-DQT_NO_CAST_FROM_ASCII" för att kräva explicita konverteringar som `QStringLiteral()`.
uk: [KDECompilerSettings](https://api.kde.org/ecm/kde-module/KDECMakeSettings.html) містить мінімальний стандарт C++, прапорці компіляції, зокрема `-pedantic`, і найкращі стандартні макроси, зокрема `-DQT_NO_CAST_FROM_ASCII` для встановлення вимог щодо явних перетворень, зокрема `QStringLiteral()`.

source: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) provides a way to ensure a runtime QML dependency is found at compile time.
ca: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) proporciona una manera d'assegurar que la dependència de QML en temps d'execució es troba en temps de compilació.
eo: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) provizas manieron certigi rultempan QML-dependecon trovigxas je kompiltempo.
es: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) proporciona un modo para asegurar que al compilar se encuentra una dependencia QML en tiempo de ejecución.
nl: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) levert een manier om een runtime QML afhankelijkheid te verzekeren die gevonden is bij compileren.
sl: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) ponuja način zagotavljanja, da se med odvisnosti med izvajanjem QML najde že med prevajanjem.
sv: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) tillhandahåller ett sätt att säkerställa att ett QML-beroende vid körtid hittas vid kompilering.
uk: [ECMFindQmlModule](https://api.kde.org/ecm/module/ECMFindQmlModule.html) містить спосіб забезпечення виявлення динамічної залежності QML під час компіляції.

source: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) provides CMake commands like `ecm_add_qml_module()` and `ecm_target_qml_sources()`.
ca: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) proporciona ordres del CMake com `ecm_add_qml_module()` i `ecm_target_qml_sources()`.
eo: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) provizas CMake-komandojn kiel `ecm_add_qml_module()` kaj `ecm_target_qml_sources()`.
es: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) proporciona órdenes de CMake como `ecm_add_qml_module()` y `ecm_target_qml_sources()`.
nl: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) levert CMake commando's zoals `ecm_add_qml_module()` en `ecm_target_qml_sources()`.
sl: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) ponuja ukaze CMake, kot sta `ecm_add_qml_module()` in `ecm_target_qml_sources()`.
sv: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) tillhandahåller CMake-kommandon som `ecm_add_qml_module()` och `ecm_target_qml_sources()`.
uk: [ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html) містить команди CMake, зокрема `ecm_add_qml_module()` і `ecm_target_qml_sources()`.

source: The following section is important, because it specifies which dependencies we'll be bringing in at compile time. Let's look at the first:
ca: La secció següent és important, perquè especifica quines dependències portarem en temps de compilació. Vegem el primer:
eo: La sekva sekcio estas grava, ĉar ĝi specifas kiujn dependecojn ni alportos je kompilo. Ni rigardu la unuan:
es: La siguiente sección es importante, ya que especifica las dependencias necesarias durante la compilación. Veamos la primera:
nl: De volgende sectie is belangrijk, omdat het specificeert welke afhankelijkheden we zullen inbrengen bij compileren. Laten we naar de eerste kijken:
sl: Naslednji razdelek je pomemben, ker določa, katere odvisnosti bomo vnesli med prevajanjem. Poglejmo prvega:
sv: Den följande sektionen är viktig, eftersom den anger vilka beroenden vi tar med vid kompileringstillfället. Låt oss titta på den första:
uk: Наступний розділ є важливим, оскільки у ньому визначають, які залежності ми використовуватимемо під час компіляції. Погляньмо на початок:

source: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) finds and loads the external library and its components.
ca: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) cerca i carrega la biblioteca externa i els seus components.
eo: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) trovas kaj ŝargas la eksteran bibliotekon kaj siajn komponantojn.
es: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) encuentra y carga la biblioteca externa y sus componentes.
nl: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) zoekt en laadt de externe bibliotheek en zijn componenten.
sl: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) najde in naloži zunanjo knjižnico in njene komponente.
sv: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) hittar och läser in det externa biblioteket och dess komponenter.
uk: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) знаходить і завантажує зовнішню бібліотеку та її компоненти.

source: `REQUIRED` tells CMake to exit with an error if the package cannot be found.
ca: `REQUIRED` fa saber al CMake que surti amb un error si no s'ha pogut trobar el paquet.
eo: `REQUIRED` diras al CMake eliri kun eraro se la pakaĵo ne troveblas.
es: `REQUIRED` indica a CMake que salga con un error si no se puede encontrar el paquete.
nl: `REQUIRED` vertelt CMake te eindigen met een fout als het pakket niet gevonden kan worden.
sl: `REQUIRED` sporoča CMake, naj konča z napako, če paketa ni mogoče najti.
sv: `REQUIRED` talar om för CMake att avsluta med ett fel om paketet inte kan hittas.
uk: `REQUIRED` повідомляє CMake, що програма має повідомити про помилку, якщо пакунок не буде знайдено.

source: `COMPONENTS` is a parameter that precedes the specific components of the framework we will include.
ca: `COMPONENTS` és un paràmetre que precedeix als components específics del marc de treball que incloem.
eo: `COMPONENTS' estas parametro, kiu antaŭas la specifajn komponantojn de la kadro, kiun ni inkludos.
es: `COMPONENTS` es un parámetro que precede a los componentes específicos de la infraestructura que vamos a incluir.
fr: « COMPONENTS » est un paramètre précédant les composants spécifiques de l'environnement de développement que nous allons inclure.
nl: `COMPONENTS` is een parameter die vooraf gaat aan de specifieke componenten van het framework dat we zullen invoegen.
pl: `COMPONENTS` jest parametrem, który poprzedza dany składnik szkieletu, który dołączymy.
pt: O `COMPONENTS` é um parâmetro que antecede os componentes específicos da plataforma que iremos incluir.
sl: `COMPONENTS` je parameter, ki je pred posebnimi sestavnimi deli ogrodja, ki ga bomo vključili.
sv: `COMPONENTS` är en parameter som föregår de specifika komponenterna för ramverket vi inkluderar.
uk: `COMPONENTS` — параметр, який передує специфічним компонентам бібліотеки, які ми включатимемо.

source: Each word after `COMPONENTS` refers to a specific component of the library.
ca: Cada paraula després de `COMPONENTS` es refereix a un component específic de la biblioteca.
eo: Ĉiu vorto post `COMPONENTS' rilatas al specifa komponanto de la biblioteko.
es: Cada palabra tras `COMPONENTS` hace referencia a un determinado componente de la biblioteca.
nl: Elk woord na `COMPONENTS` refereert naar een specifieke component van de bibliotheek.
sl: Vsaka beseda za `COMPONENTS` se nanaša na določeno komponento knjižnice.
sv: Varje ord efter `COMPONENTS` refererar till en specifik komponent i biblioteket.
uk: Кожне слово після `COMPONENTS` вказує на компонент бібліотеки.

source: If you are looking to add any components listed in the [KDE API documentation](https://api.kde.org/) to your application, you may check the right sidebar for how to add the component with CMake. For instance, for [Kirigami](docs:kirigami;kirigami-index.html), you will find something like `find_package(KF6Kirigami)`, which with the addition of ECM becomes:
ca: Si esteu mirant d'afegir qualsevol component llistat a la [documentació de l'API de KDE](https://api.kde.org/) a la vostra aplicació, podeu comprovar la barra lateral dreta per com afegir el component amb el CMake. Per exemple, per al [Kirigami](docs:kirigami;kirigami-index.html), trobareu quelcom com `find_package(KF6Kirigami)`, el qual amb l'addició de l'ECM es converteix en:
sl: Če želite svoji aplikaciji dodati katero koli komponento, navedeno v [dokumentaciji API-ja za KDE](https://api.kde.org/), lahko v desni stranski vrstici preverite, kako dodate komponento s CMake. Na primer, za [Kirigami](docs:kirigami;kirigami-index.html) boste našli nekaj takega, kot je `find_package(KF6Kirigami)`, ki z dodatkom ECM postane:

source: Pay close attention to your included components, as omitting ones used in our code will stop our application from compiling.
ca: Pareu molta atenció als components inclosos, ja que l'omissió dels utilitzats en el nostre codi aturarà la compilació de l'aplicació.
eo: Atentu viajn inkluzivitajn komponantojn, ĉar preterlasi tiujn uzatajn en nia kodo ĉesos nian aplikaĵon kompili.
es: Preste mucha atención a los componentes incluidos, ya que si omite alguno de ellos en el código se detendrá la compilación de la aplicación.
nl: Let goed op uw ingevoegde componenten, omdat weglaten van die gebruikt worden in onze code onze toepassing niet laten compileren.
pt: Preste bastante atenção aos seus componentes incluídos, dado que omiti-los no nosso código fará com que a aplicação deixe de compilar.
sl: Bodite pozorni na svoje vključene komponente, prav tako kot na izpuščene iz naše kode saj bodo preprečile, da bi se naša aplikacija prevedla.
sv: Var uppmärksam på dina inkluderade komponenter, eftersom att utelämna de som används ivår kod förhindrar vår program från att kompileras.
uk: Значну увагу слід звернути на включення компонентів, оскільки пропускання компонентів, які використано у вашому коді, призведе до неможливості зібрати вашу програму.

source: The install line instructs CMake to install the desktop file in `${KDE_INSTALL_APPDIR}`, which on Linux translates to `$XDG_DATA_DIRS/applications`, usually `/usr/share/applications`, and on Windows translates to `C:/Program Files/${PROJECT_NAME}/bin/data/applications`:
ca: La línia d'instal·lació instrueix al CMake que instal·li el fitxer «desktop» a `${KDE_INSTALL_APPDIR}`, que al Linux es tradueix com `$XDG_DATA_DIRS/applications`, normalment `/usr/share/applications`, i en el Windows es tradueix com `C:/Program Files/${PROJECT_NAME}/bin/data/applications`:
eo: La installinio instrukcias CMake instali la labortablan dosieron en `${KDE_INSTALL_APPDIR}`, kiu en Linukso tradukiĝas al `$XDG_DATA_DIRS/applications`, kutime `/usr/share/applications`, kaj en Vindozo tradukiĝas al `C:/Program Dosieroj/${PROJECT_NAME}/bin/data/applications`:
es: La línea de instalación indica a CMake que instale el archivo de escritorio en `${KDE_INSTALL_APPDIR}`, que en Linux se traduce a `$XDG_DATA_DIRS/applications`, normalmente `/usr/share/applications`, y en Windows se traduce a `C:/Program Files/${PROJECT_NAME}/bin/data/applications`:
nl: De installatieregel instrueert CMake om het desktop-bestand in `${KDE_INSTALL_APPDIR}` te installeren, die onder Linux vertaalt naar `$XDG_DATA_DIRS/applications`, gewoonlijk `/usr/share/applications` en onder Windows vertaalt naar `C:/Program Files/${PROJECT_NAME}/bin/data/applications`:
sl: Namestitvena vrstica naroči CMakeu, naj namesti namizno datoteko v `${KDE_INSTALL_APPDIR}`, kar se v Linuxu prevede v `$XDG_DATA_DIRS/applications`, običajno `/usr/share/applications`, v sistemu Windows pa v `C:/Program` Datoteke/${PROJECT_NAME}/bin/data/applications`:
sv: Installationsraden instruerar CMake att installera skrivbordsfilen i `${KDE_INSTALL_APPDIR}`, som på Linux översätts till `$XDG_DATA_DIRS/applications`, vanligtvis `/usr/share/applications`, och på Windows översätts till `C:/Program Filer/${PROJECT_NAME}/bin/data/applications`:
uk: Рядок встановлення повідомляє CMake, що слід встановити стільничний файл до `${KDE_INSTALL_APPDIR}`, що у Linux буде перенесено як `$XDG_DATA_DIRS/applications`, зазвичай `/usr/share/applications`, а у Windows буде перенесено як `C:/Program Files/${PROJECT_NAME}/bin/data/applications`:

source: The final line lets CMake print out which packages it has found, and it makes compilation fail immediately if it encounters an error:
ca: La línia final permet que el CMake imprimeixi quins paquets ha trobat, i fa que la compilació falli completament si troba un error:
eo: La fina linio lasas CMake presi kiujn pakaĵojn ĝi trovis, kaj ĝi igas kompiladon tuj malsukesi se ĝi renkontas eraron:
es: La última línea permite que CMake liste los paquetes que ha encontrado y que haga que la compilación falle inmediatamente si se produce un error:
nl: De laatste regel laat CMake tonen welke pakketten het heeft gevonden en het laat compileren mislukken onmiddellijk als het een fout ontdekt:
sl: Zadnja vrstica omogoča CMake-u, da natisne, katere pakete je našel, in takoj povzroči neuspeh prevajanja, če naleti na napako:
sv: Den sista raden låter CMake skriva ut vilka paket som har hittats, och gör att kompileringen misslyckas omedelbart om den stöter på ett fel:
uk: Останній рядок дозволяє CMake вивести список пакунків, які було знайдено, і призводить до негайного припинення компіляції, якщо станеться помилка:

source: And above that, `add_subdirectory(src)` points CMake into the `src/` directory, where it finds another `CMakeLists.txt` file.
ca: I a sobre d'això, `add_subdirectory(src)` a punta el CMake en el directori `src/`, a on troba un altre fitxer `CMakeLists.txt`.
eo: Kaj super tio, add_subdirectory(src)` indikas CMake en la dosierujon `src/`, kie ĝi trovas alian `CMakeLists.txt` dosieron.
es: Y sobre ella, `add_subdirectory(src)` hace que CMake se dirija al directorio `src/`, donde encontrará otro archivo `CMakeLists.txt`.
nl: En bovendien dat `add_subdirectory(src)` CMake laat wijzen naar de map 'src/', waar het een ander bestand `CMakeLists.txt` vindt:
sl: In nad tem `add_subdirectory(src)` usmeri CMake v imenik `src/`, kjer najde drugo datoteko `CMakeLists.txt`.
sv: Och ovanför den pekar `add_subdirectory(src)` CMake på katalogen 'src/', där det finns en annan `CMakeLists.txt` fil.
uk: А вище, `add_subdirectory(src)` вказує CMake каталог `src/`, де програма знайде інший файл `CMakeLists.txt`.

source: While the first file handled metadata and finding libraries, this one will consist of handling dependencies and installing the application. It has the following CMake calls:
ca: Mentre que el primer fitxer gestionava metadades i cercava biblioteques, aquest consisteix a gestionar dependències i instal·lar l'aplicació. Té les crides següents del CMake:
eo: Dum la unua dosiero pritraktis metadatenojn kaj trovi bibliotekojn, ĉi tiu konsistos el pritraktado de dependecoj kaj instalo de la aplikaĵo. Ĝi havas la sekvajn CMake-vokojn:
es: Mientras el primer archivo se encargaba de los metadatos y de encontrar bibliotecas, este se encargará de las dependencias y de instalar la aplicación. Contiene las siguientes llamadas de CMake:
nl: Terwijl het eerste bestand metagegevens behandelt en bibliotheken zoekt, zal deze bestaan uit behandeling van afhankelijkheden en de toepassing installeren. Deze heeft de volgende CMake aanroepen:
sl: Medtem ko je prva datoteka obravnavala metapodatke in iskanje knjižnic, bo ta zajemala obdelavo odvisnosti in namestitev aplikacije. Ima naslednje klice CMake:
sv: Medan den första filen hanterade metadata och hittade bibliotek, kommer denna att bestå av att hantera beroenden och installera programmet. Den har följande CMake-anrop:
uk: Перший файл обробляв метадані і пошук бібліотек, цей файл містить команди обробки залежностей та встановлення програми. У ньому містяться такі виклики CMake:
