Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: `CMakeLists.txt` files are needed to use KDE's build system of choice, [CMake](https://cmake.org/). Our `kirigami-tutorial/CMakeLists.txt` file is going to specify some of our application's characteristics. It also includes some of the dependencies we need in order to compile our project.
ca: Els fitxers `CMakeLists.txt` són necessaris per a utilitzar el sistema de compilació triat pel KDE, [CMake](https://cmake.org/). El fitxer `kirigami-tutorial/CMakeLists.txt` especifica algunes característiques de la nostra aplicació. També inclou algunes de les dependències que necessitem per a compilar el projecte.
eo: `CMakeLists.txt` dosieroj estas bezonataj por uzi la elektosistemon de KDE, [CMake](https://cmake.org/). Nia dosiero `kirigami-tutorial/CMakeLists.txt` specifos iujn el la karakterizaĵoj de nia aplikaĵo. Ĝi ankaŭ inkluzivas kelkajn el la dependecoj, kiujn ni bezonas por kompili nian projekton.
nl: `CMakeLists.txt` bestanden zijn nodig om het door KDE gekozen bouwsysteem te gebruiken, [CMake](https://cmake.org/). Ons bestand `kirigami-tutorial/CMakeLists.txt` gaat enige van de karakteristieken van uw toepassing specificeren. Het bevat ook enige van de afhankelijkheden die we nodig hebben om ons project te compileren.
sl: Datoteke `CMakeLists.txt` so potrebne za uporabo izbranega gradbenega sistema KDE, [CMake](https://cmake.org/). Naša datoteka `kirigami-tutorial/CMakeLists.txt` bo določila nekatere značilnosti naše aplikacije. Vključuje tudi nekatere odvisnosti, ki jih potrebujemo za prevajanje našega projekta.
sv: Filerna kallade `CMakeLists.txt` behövs för att använda KDE:s utvalda byggsystem, [CMake](https://cmake.org/). Vår `kirigami-tutorial/CMakeLists.txt` specificerar vissa av programmets egenskaper. Den inkluderar också några av de beroenden vi behöver för att kunna kompilera vårt projekt.
uk: Для використання вибраної системи збирання KDE, [CMake](https://cmake.org/), потрібні файли `CMakeLists.txt`. Наш файл `kirigami-tutorial/CMakeLists.txt` має вказати певні характеристики нашої програми. До цього файла також включено записи певних залежностей, які нам потрібні, щоб зібрати наш проєкт.

source: The `CMakeLists.txt` defines how to build your projects. Most of the content here is just to bootstrap your project. You can read a line-by-line, in-depth explanation of what this CMakeLists file does [here](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).
ca: El `CMakeLists.txt` defineix com construir els vostres projectes. La major part del seu contingut només és per a arrencar el vostre projecte. [Aquí](/docs/getting-started/kirigami/advanced-understanding_cmakelists/) podeu llegir una explicació detallada línia a línia del que fa aquest fitxer CMakeLists.
eo: La `CMakeLists.txt` difinas kiel konstrui viajn projektojn. Plejparto de la enhavo ĉi tie estas nur por komenci vian projekton. Vi povas legi linio-post-linian, profundan klarigon pri tio, kion faras ĉi tiu CMakeLists-dosiero [ĉi tie](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).
es: El `CMakeLists.txt` define cómo se compilan los proyectos. La mayor parte de su contenido es solo para iniciar el proyecto. Puede leer una explicación detallada, línea por línea, de lo que hace este archivo CMakeLists.txt [aquí](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).
nl: De `CMakeLists.txt` definieert onze te bouwen projecten. Het meeste van de inhoud hier is slechts om uw project af te trappen. U kunt een regel-bij-regel, uitgebreide uitleg over wat dit bestand CMakeLists doet [hier](/docs/getting-started/kirigami/advanced-understanding_cmakelists/) lezen.
pt: O `CMakeLists.txt` define como compilar os seus projectos. A maioria do conteúdo aqui serve para configurar inicialmente o seu projecto. Poderá ler uma explicação linha-a-linha e aprofundada do que faz este ficheiro CMakeLists [aqui](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).
sl: Datoteka `CMakeLists.txt` določa, kako zgraditi vaše projekte. Večina vsebine tukaj je samo za postopek postopnega razvoja vašega projekta. Preberite poglobljeno razlago, kaj datoteka CMakeLists počne [tukaj](/docs/use/kirigami/advanced-understanding_cmakelists/).
sv: `CMakeLists.txt` definierar hur dina projekt byggs. Det mesta av innehållet här är bara för att projektet ska komma igång. Du kan läsa en radvis, djupgående, förklaring av vad CMakeLists filen gör [här](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).
uk: CMakeLists.txt визначає, як збирати ваші проєкти. Більшість даних тут призначено лише для збирання з нуля вашого проєкту. Порядкове глибинне пояснення дій, які описано у цьому файлі CMakeLists, наведено [тут](/docs/getting-started/kirigami/advanced-understanding_cmakelists/).

source: The most important thing to keep in mind is that the C++ build dependencies of Qt and KDE Frameworks are managed with [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) and QML runtime dependencies are managed with [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). You will have to modify these lines and include any additional components that you decide to use during the development of your application.
ca: El més important a tenir en compte és que les dependències de construcció C++ de les Qt i dels Frameworks de KDE es gestionen amb [find_ package()](https://cmake.org/cmake/help/latest/command/find_package.html) i les dependències en temps d'execució del QML es gestionen amb [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). Haureu de modificar aquestes línies i incloure qualsevol component addicional que decidiu utilitzar durant el desenvolupament de la vostra aplicació.
eo: La plej grava afero por memori estas, ke la C++-konstruaj dependecoj de Qt kaj KDE Frameworks estas administritaj per [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) kaj QML rultempaj dependecoj estas administritaj per [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). Vi devos modifi ĉi tiujn liniojn kaj inkluzivi iujn ajn kromajn komponantojn, kiujn vi decidas uzi dum la disvolviĝo de via aplikaĵo.
nl: Het belangrijkste om te onthouden is dat de C++-bouwafhankelijkhedenn Qt en KDE Frameworks beheerd worden met [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html)an QML runtime afhankelijkheden worden beheerd met [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). U zult deze regels moeten wijzigen en extra componenten toevoegen die u beslist om te gebruiken tijdens de ontwikkeling van uw toepassing.
sl: Najpomembnejša stvar, ki jo morate upoštevati, je, da se odvisnosti gradnje C++ ogrodij Qt in KDE upravljajo s [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) in QML odvisnosti med izvajanjem se upravljajo z [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). Te vrstice boste morali spremeniti in vključiti vse dodatne komponente, ki se jih boste odločili uporabiti med razvojem vaše aplikacije.
sv: Det viktigaste att komma ihåg är att C++ beroenden av Qt och KDE Ramverk hanteras med [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) och QML körtidsberoenden hanteras med [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). Du måste ändra raderna och inkludera alla ytterligare komponenter som du bestämmer dig för att använda under utvecklingen av programmet.
uk: Найважливішим, про що слід пам'ятати, є те, що залежності збирання для C++ від Qt і KDE Frameworks керуються за допомогою [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) і динамічні залежності QML є керованими за допомогою [ecm_find_qml_module()](https://api.kde.org/ecm/module/ECMFindQmlModule.html). У процесі розробки вашої програми вам слід вносити зміни до цих рядків і включати усі додаткові компоненти, які ви вирішите використовувати.

source: The line with `add_subdirectory(src)` points CMake to the `kirigami-tutorial/src/` directory, where our source code is located.
ca: La línia amb `add_subdirectory(src)` apunta el CMake al directori `kirigami-tutorial/src/` on es troba el nostre codi font.
eo: La linio kun `add_subdirectory(src)` indikas CMake al la dosierujo `kirigami-tutorial/src/`, kie troviĝas nia fontkodo.
nl: De regel met `add_subdirectory(src)`, laat CMake wijzen naar de map `kirigami-tutorial/src/`, waar uw broncode is gelokaliseerd.
sl: Vrstica z `add_subdirectory(src)` usmerja CMake v imenik `kirigami-tutorial/src/`, kjer se nahaja naša izvorna koda.
sv: Raden med `add_subdirectory(src)`, pekar CMake på katalogen 'kirigami-tutorial/src/', där vår källkod finns.
uk: Рядок з `add_subdirectory(src)` вказує CMake каталог `kirigami-tutorial/src/`, де зберігається наш початковий код.

source: The line with `install()` tells CMake where to install the desktop file.
ca: La línia amb `install()` indica al CMake on instal·lar el fitxer «desktop».
eo: La linio kun `install()` diras al CMake kie instali la labortablan dosieron.
nl: De regel met `install()` geeft aan CMake door waar het desktop-bestand geïnstalleerd moet worden.
sl: Vrstica z `install()` pove CMake, kam naj namesti namizno datoteko.
sv: Raden med `install()` talar om för CMake var skrivbordsfilen ska installeras.
uk: Рядок із `install()` повідомляє CMake, куди слід встановити файл desktop.

source: Let's delve into the `kirigami-tutorial/src/CMakeLists.txt` file in there.
ca: Aprofundim en el fitxer `kirigami-tutorial/src/CMakeLists.txt`.
eo: Ni enprofundu en la dosieron `kirigami-tutorial/src/CMakeLists.txt` tie.
nl: Laten we dieper in het bestand `kirigami-tutorial/src/CMakeLists.txt` duiken.
sl: Poglobimo se v tamkajšnjo datoteko `kirigami-tutorial/src/CMakeLists.txt`.
sv: Låt oss fördjupa oss i filen `kirigami-tutorial/src/CMakeLists.txt` där.
uk: Розгляньмо докладніше файл `kirigami-tutorial/src/CMakeLists.txt` у цьому каталозі.

source: This file consists of five steps:
ca: Aquest fitxer consta de cinc passos:
eo: Ĉi tiu dosiero konsistas el kvin paŝoj:
nl: Dit bestand bestaat uit vijf stappen:
sl: Ta datoteka je sestavljena iz petih korakov:
sv: Filen består av fem steg:
uk: Робота цього файла складається з п'яти кроків:

source: create an executable
ca: crea un executable
eo: krei plenumeblan
es: crear un ejecutable
nl: Creëer een uitvoerbaar bestand
sl: ustvari izvršljivo datoteko
sv: skapa en körbar fil
uk: створення виконуваного файла

source: change the executable into a QML module that accepts QML files
ca: canvia l'executable a un mòdul QML que accepta fitxers QML
eo: ŝanĝi la plenumeblan en QML-modulon, kiu akceptas QML-dosierojn
es: cambiar el ejecutable a un módulo de QML que acepte archivos QML
nl: Wijzig het uitvoerbare bestand in een QML module dat QML-bestanden accepteert
sl: spremeni izvršljivo datoteko v modul QML, ki sprejema datoteke QML
sv: ändra den körbara filen till en QML-modul som accepterar QML-filer
uk: заміна виконуваного файла на модуль QML, який прийматиме файли QML

source: add C++ and QML files to the executable
ca: afegeix fitxers C++ i QML a l'executable
eo: aldoni C++ kaj QML-dosierojn al la rulebla
es: añadir archivos C++ y QML al ejecutable
nl: voeg C++ en QML-bestanden toe aan het uitvoerbare bestand
sl: dodaj datoteke C++ in QML k izvršljivi datoteki
sv: lägg till C++ och QML-filer i den körbara filen
uk: додавання файлів C++ і QML до виконуваного файла

source: link the libraries necessary for the executable to run
ca: enllaça les biblioteques necessàries perquè s'executi l'executable
eo: ligi la bibliotekojn necesajn por ke la rulebla rulu
es: enlazar las bibliotecas necesarias para poder lanzar el ejecutable
nl: koppel de bibliotheken die noodzakelijk zijn voor het uitvoerbare bestand om te kunnen werken
sl: poveži knjižnice, ki so potrebne za delovanje izvršljive datoteke
sv: länka biblioteken som krävs för att körbara filen ska köras
uk: компонування з бібліотеками, які потрібні для запуску виконуваного файла

source: install the executable to the right place
ca: instal·la l'executable al lloc correcte
eo: instali la ruleblan en la ĝusta loko
es: instalar el ejecutable en el lugar correcto
nl: Installeer het uitvoerbare bestand op de juiste plaats
sl: namesti izvršljivo datoteko na pravo mesto
sv: installera den körbara filen på rätt plats
uk: встановлення виконуваного файла до належного місця

source: Next time you need to add more QML files, add them to the existing `ecm_target_qml_sources()` call. C++ files that use the [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) keyword which we will see later in the tutorial can be added using `target_sources()`.
ca: La pròxima vegada haureu d'afegir més fitxers en QML, afegir-los a la crida existent `ecm_target_qml_sources()`. Els fitxers C++ que utilitzen la paraula clau [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) que veurem més endavant a la guia d'aprenentatge es poden afegir utilitzant `target_sources()`.
eo: Venontfoje vi devas aldoni pliajn QML-dosierojn, aldonu ilin al la ekzistanta `ecm_target_qml_sources()` alvoko. C++-dosieroj, kiuj uzas la ŝlosilvorton [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), kiun ni vidos poste en la lernilo, povas esti aldonitaj uzante `target_sources()`.
nl: De volgende keer dat u meer QML-bestanden moet toevoegen, voeg ze toe aan de al aanwezige aanroep`ecm_target_qml_sources()`. C++ bestanden die het de aanroep [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) gebruiken die we later in de instructie zullen behandelen kunnen door `target_sources()` te gebruiken worden toegevoegd.
sl: Ko boste naslednjič morali dodati več datotek QML, jih dodajte obstoječemu klicu `ecm_target_qml_sources()`. Datoteke C++, ki uporabljajo ključno besedo [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), ki jo bomo videli kasneje v učbeniku, je mogoče dodati z uporabo `target_sources()`.
sv: Nästa gång fler QML-filer behöver läggas till, gör det i det befintliga anropet `ecm_target_qml_sources()`. C++ filer som använder nyckelordet [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), som vi kommer att se senare i handledningen, kan läggas till med `target_sources()`.
uk: Наступного разу коли ви захочете додати файли QML, додайте їх до наявного виклику `ecm_target_qml_sources()`. Файли C++, у яких використано ключове слово [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), яке ми побачимо пізніше у підручнику, можна додати за допомогою `target_sources()`.

source: Now that CMake has been taken care of, let's look at the files we are going to spend the majority of our time working with.
ca: Ara que ens hem revisat el CMake, vegem els fitxers als quals dedicarem la major part del nostre temps de treball.
eo: Nun kiam CMake estis prizorgita, ni rigardu la dosierojn, kun kiuj ni pasigos la plimulton de nia tempo laborante.
es: Ahora que nos hemos encargado de CMake, veamos los archivos a los que vamos a dedicar la mayor parte de nuestro tiempo de trabajo.
fr: Maintenant que « CMake » a été pris en charge, regardons les fichiers avec lesquels nous allons travailler la majorité de notre temps.
nl: Nu we met CMake klaar zijn, laten we kijken naar de bestanden waarmee we de meeste tijd aan gaan werken.
pl: Teraz zajęliśmy się CMake, więc spójrzmy na pliki, nad którymi będziemy pracować przez większość czasu.
pt: Agora que já tratámos do CMake, vejamos os ficheiros onde iremos gastar a maior parte do tempo a trabalhar.
sl: Zdaj, ko je za CMake poskrbljeno, poglejmo datoteke, s katerimi bomo večino časa preživeli pri delu.
sv: Nu när vi har tagit hand om CMake, låt oss titta på filerna vi ska spendera den största delen av tiden att arbeta med.
uk: Тепер, коли ми подбали про CMake, погляньмо на файли, з якими ми маємо намір працювати переважний час під час розробки програми.

source: The file `kirigami-tutorial/src/main.cpp` handles the "business logic" of our application. C++ is handy because it is flexible and fast, even if it is more involved than other programming languages.
ca: El fitxer `kirigami-tutorial/src/main.cpp` gestiona la «lògica empresarial» de la nostra aplicació. El C++ és útil perquè és flexible i ràpid, encara que és més complicat que altres llenguatges de programació.
eo: La dosiero `kirigami-tutorial/src/main.cpp` pritraktas la "komercan logikon" de nia aplikaĵo. C++ estas oportuna ĉar ĝi estas fleksebla kaj rapida, eĉ se ĝi estas pli engaĝita ol aliaj programlingvoj.
nl: Het bestand `kirigami-tutorial/src/main.cpp` behandelt de "zakelijke logica" van onze toepassing. C++ is handig omdat het flexibel en snel is, zelfs als het moeilijker is dan andere programmeertalen.
sl: Datoteka `kirigami-tutorial/src/main.cpp` obravnava "poslovno logiko" naše aplikacije. C++ je priročen, ker je prilagodljiv in hiter, čeprav je bolj zapleten kot drugi programski jeziki.
sv: Filen `kirigami-tutorial/src/main.cpp` hanterar "uppgiftslogiken" i vårt program. C++ är praktiskt eftersom det är flexibelt och snabbt, även om det är mer omfattande än andra programspråk.
uk: Файл `kirigami-tutorial/src/main.cpp` обробляє «ділову логіку» нашої програми. Мова C++ є зручною для цього, оскільки вона є гнучкою і швидкою, хоча і потребує більше знань, ніж деякі інші мови програмування.

source: It also functions as the entrypoint to our application. The two parts of our project, the backend and the user interface, are both set up and started here.
ca: També funciona com el punt d'entrada a la nostra aplicació. Les dues parts del nostre projecte, el dorsal i la interfície d'usuari, ambdós es configuren i s'inicien aquí.
eo: Ĝi ankaŭ funkcias kiel la enirpunkto al nia aplikaĵo. La du partoj de nia projekto, la backend kaj la uzantinterfaco, estas ambaŭ starigitaj kaj komencitaj ĉi tie.
nl: Het functioneert ook als de ingang naar onze toepassing. De twee delen van ons project, de backend en het gebruikersinterface, worden beiden hier opgezet en gestart.
sl: Deluje tudi kot vstopna točka v našo aplikacijo. Oba dela našega projekta, zaledje in uporabniški vmesnik, sta nastavljena in zagnana tukaj.
sv: Den fungerar också som programmets startpunkt. De två delarna av vårt projekt, bakgrund och användargränssnittet, skapas och startas båda här.
uk: Цей файл є також вхідним пунктом нашої програми. Тут налаштовуються і запускаються обидві частини нашого проєкту — модуль обробки і інтерфейс користувача.

source: For now, we don't need to go into too much detail regarding what our `main.cpp` code does, but its role will grow significantly more important once we decide to add more complex functionality to our application in the future.
ca: Per ara, no necessitem entrar en massa detalls sobre el que fa el nostre codi de `main.cpp`, però la seva funció serà significativament més important una vegada en el futur decidim afegir una funcionalitat més complexa a l'aplicació.
eo: Nuntempe, ni ne bezonas tro multe detalojn pri tio, kion faras nia `main.cpp`-kodo, sed ĝia rolo estos signife pli grava post kiam ni decidos aldoni pli kompleksajn funkciojn al nia aplikaĵo estonte.
nl: Op dit moment hoeven we niet in teveel detail te gaan met betrekking tot wat onze code in `main.cpp` doet, maar zijn rol zal aanzienlijk belangrijker worden nadat we besluiten complexere functionaliteit in de toekomst aan onze toepassing toe te voegen.
sl: Za zdaj se nam ni treba spuščati v preveč podrobnosti o tem, kaj počne naša koda `main.cpp`, vendar bo njena vloga postala bistveno pomembnejša, ko se bomo odločili, da bomo v prihodnosti naši aplikaciji dodali bolj zapleteno funkcionalnost.
sv: För tillfället behöver vi inte gå in på detaljerna rörande vad vår kod i `main.cpp` gör i så stor utsträckning, men dess roll växer signifikant när vi bestämmer oss för att lägga till mer komplicerad funktionalitet i vårt program i framtiden.
uk: До цього моменту у нас не було потреби заглиблюватися у подробиці дій, які виконує код нашого `main.cpp`, але його роль значно зросте, якщо ми вирішимо додати складні функціональні можливості до нашої програми у майбутньому.

source: Theming on Windows
ca: Temes al Windows
eo: Etosado en Vindozo
es: Uso de temas en Windows
nl: Thema's toekennen op Windows
sl: Teme na Windows
sv: Tema på Windows
uk: Теми у Windows

source: <details> <summary>Click here to read more</summary>
ca: <details> <summary>Feu clic aquí per a llegir-ne més</summary>
eo: <detaloj> <summary>Alklaku ĉi tie por legi pli</summary>
es: <details> <summary>Pulse aquí para leer más</summary>
nl: <details> <summary>Klik hier om meer te lezen</summary>
sl: <details> <summary>Kliknite sem, da bi prebrali več</summary>
sv: <details> <summary>Klicka här för att läsa mer</summary>
uk: <details> <summary>Натисніть тут, щоб дізнатися більше</summary>

source: The application needs to set its icon theme, QStyle, and QtQuick Controls style to Breeze in order to show up on Windows. To learn more about it, see [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).
ca: L'aplicació ha d'establir el seu estil de tema d'icones, QStyle i QtQuick Controls a Brisa per tal de mostrar-se al Windows. Per a saber-ne més, vegeu [Descobrir el main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).
eo: La aplikaĵo devas meti sian piktogram-etoson, QStyle, kaj QtQuick-Controls-stilon al Breeze por ke ĝi montriĝu en Vindozo. Por ekscii pli, vidu [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp).
nl: Als wat vooruit wilt lopen dan kunt u meer te lezen over hoe deze `main.cpp` werkt in [Begrip van main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
sl: Aplikacija mora nastaviti temo ikon, QStyle in QtQuick Controls slog na Breeze, da se prikaže v sistemu Windows. Če želite izvedeti več o tem, glejte [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).
sv: Programmet måste ställa in sitt ikontema, QStyle och QtQuick Controls-stil i Breeze för att visas på Windows. För att lära dig mer om det, se [Förstå sig på main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).
uk: Програма має встановити власну тему піктограм, QStyle та стиль засобів керування QtQuick у значення «Breeze», щоб інтерфейс було показано у Windows. Щоб дізнатися більше про це, див. [Розбираємося з main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).

source: If you want to get ahead, you can read more about how this `main.cpp` works in [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp).
ca: Si voleu avançar, podeu llegir més sobre com funciona aquest `main.cpp` a [Descobrir el main.cpp](/docs/getting-started/kirigami/advanced-maincpp/).
eo: Se vi volas antaŭeniri, vi povas legi pli pri kiel ĉi tiu `main.cpp` funkcias en [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp).
nl: Als wat vooruit wilt lopen dan kunt u meer te lezen over hoe deze `main.cpp` werkt in [Begrip van main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
sl: Če želite napredovati, si lahko preberete več o tem, kako ta `main.cpp` deluje v [Ugotavljanje main.cpp](/docs/getting-started/kirigami/advanced-maincpp).
sv: Om du vill komma framåt, kan du läsa mer om hur `main.cpp` fungerar i [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp).
uk: Якщо ви вирішите продовжити, ви можете дізнатися більше щодо того, як працює цей `main.cpp`, з [цієї сторінки](/docs/getting-started/kirigami/advanced-maincpp).
