Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: `KountdownDelegate.qml` becomes `KountdownDelegate {}`:
ca: `KountdownDelegate.qml` esdevé `KountdownDelegate {}`:
eo: `KountdownDelegate.qml` fariĝas `KountdownDelegate {}`:
es: `KountdownDelegate.qml` se convierte en `KountdownDelegate {}`:
nl: `KountdownDelegate.qml` wordt `KountdownDelegate {}`:
sl: `KountdownDelegate.qml` postane `KountdownDelegate {}``:
sv: `KountdownDelegate.qml` blir `KountdownDelegate {}`:
uk: `KountdownDelegate.qml` стає `KountdownDelegate {}`:

source: Most cases you have seen of a component started with uppercase and followed by brackets were instantiations of a QML component. This is why our new QML files need to start with an uppercase letter.
ca: La majoria dels casos que heu vist d'un component començat per majúscules i seguit de parèntesis eren instàncies d'un component QML. Per això els fitxers QML nous han de començar per una lletra en majúscula.
eo: Plej multaj kazoj, kiujn vi vidis de komponanto komencita per majuskla kaj sekvita per krampoj, estis instancoj de QML-komponento. Jen kial niaj novaj QML-dosieroj devas komenci per majuskla litero.
nl: De meeste gevallen die u heeft gezien van een component die startte met een hoofdletter gevolgd door haakjes waren aanroepingen van een QML component. Dit is waarom onze nieuwe QML-bestanden met een hoofdletter moeten beginnen.
sl: Večina primerov, ki ste jih videli, ko se je komponenta začela z velikimi črkami in ji sledijo oklepaji, je bila primerek komponente QML. Zato se morajo naše nove datoteke QML začeti z veliko začetnico.
sv: De flesta fall du har sett av en komponent som inleds med stor bokstav och följs av parenteser var instansieringar av en QML-komponent. Det är därför våra nya QML-filer måste börja med en stor bokstav.
uk: Більшість випадків, які ви бачили, з компонентом, що починається з великої літери і за яким було дописано дужки, були екземплярами компонента QML. Ось чому назви наших нових файлів QML мають починатися з великої літери.

source: Compile the project and run it, and you should have a functional window that behaves exactly the same as before, but with the code split into separate parts, making things much more manageable.
ca: Compileu el projecte i executeu-lo, i hauríeu de tenir una finestra funcional que es comporti exactament igual que abans, però amb el codi dividit en parts separades, fent les coses molt més manejables.
eo: Kompilu la projekton kaj rulu ĝin, kaj vi devus havi funkcian fenestron kiu kondutas ekzakte same kiel antaŭe, sed kun la kodo dividita en apartajn partojn, farante aferojn multe pli regeblaj.
nl: Compileer het project en start het op, en u zou een werkend venster moeten hebben dat zich precies hetzelfde gedraagt als voorheen, maar met de code uitgesplitst in separate stukken, zodat het veel beheersbaar is.
sl: Prevedite projekt in ga zaženite ter morali bi imeti funkcionalno okno, ki se obnaša popolnoma enako kot prej, vendar s kodo, razdeljeno na ločene dele, zaradi česar so stvari veliko bolj obvladljive.
sv: Kompilera projektet och kör det, så bör ett funktionellt fönster som beter sig exakt som tidigare visas, men med koden uppdelad i separata delar, vilket gör saker och ting mycket mer hanterbara.
uk: Скомпілюйте проєкт і запустіть його. Маєте отримати функціональне вікно, які поводитиметься так само, як і раніше, але код буде поділено між окремим частинами, що зробить проєкт простішим у керуванні.

source: Windows Setup
ca: Configuració al Windows

source: Preparing your C++ application for Windows
ca: Preparant la vostra aplicació C++ per al Windows

source: Qt has great Windows support, and so applications making use of Qt and KDE's [extra-cmake-modules](https://api.kde.org/ecm/) will not require many modifications to work properly on Windows.
ca: Les Qt tenen un suport gran del Windows, i per tant les aplicacions que fan ús dels [extra-cmake-modules](https://api.kde.org/ecm/) de les Qt i KDE no requeriran moltes modificacions per a funcionar correctament al Windows.

source: Three things are needed:
ca: Són necessàries 3 coses:

source: [A Craft blueprint](#craft)
ca: [Un esquema de Craft](#craft)

source: [Setting the Breeze style](#breeze)
ca: [Configuració de l'estil Brisa](#breeze)

source: [Icons bundled with the app](#icons)
ca: [Icones empaquetades amb l'aplicació](#icons)

source: The Craft blueprint is needed to bundle all the dependencies together with the application to generate an executable.
ca: L'esquema de Craft és necessari per a empaquetar totes les dependències juntament amb l'aplicació per a generar un executable.

source: The preprocessor directive `#ifdef Q_OS_WIN` can be used to write code that will only apply when the application is built on Windows. This is needed at least once for forcing the Breeze style to the application so that it looks good on Windows, but depending on the application it might require more.
ca: La directiva de preprocessador `#ifdef Q_OS_WIN` es pot utilitzar per a escriure codi que només s'aplicarà quan l'aplicació estigui construïda en el Windows. Això és necessari almenys una vegada per a forçar l'estil Brisa a l'aplicació de manera que es vegi bé en el Windows, però depenent de l'aplicació pot requerir més.

source: Bundling the necessary icons for the app to work on Windows is the most complex step, but both KDE's extra-cmake-modules (ECM) and Qt provide means to make this job easier.
ca: Empaquetar les icones necessàries perquè l'aplicació funcioni en el Windows és el pas més complex, però tant els extra-cmake-modules (ECM) de KDE com les Qt proporcionen mitjans per a fer més fàcil aquesta feina.

source: Craft blueprint
ca: Esquema de Craft

source: To get started you must first follow [Building KDE software on Windows with Craft](/docs/getting-started/building/craft) so that you get a functional Craft blueprint and can at least build your application on Windows.
ca: Per a començar, primer heu de seguir [Construir el programari KDE al Windows amb Craft](/docs/getting-started/building/craft) perquè obtingueu un esquema de Craft funcional i almenys pugueu construir la vostra aplicació al Windows.

source: Once you are able to build the project you will get compilation and runtime errors that will help you fix any Windows compatibility issues.
ca: Un cop pugueu construir el projecte, obtindreu errors de compilació i en temps d'execució que us ajudaran a corregir qualsevol problema de compatibilitat amb el Windows.

source: Breeze style
ca: Estil Brisa

source: The Kirigami tutorial should already be mostly compliant with Windows, but the steps needed to achieve this need to be made explicit.
ca: La guia d'aprenentatge del Kirigami ja hauria de ser majoritàriament compatible amb el Windows, però els passos necessaris per aconseguir-ho han de ser explícits.

source: The two modifications that should be done to ensure the Breeze style is used is to set the QStyle to `breeze` and to set the Qt Quick Controls style to `org.kde.desktop`.
ca: Les dues modificacions que s'han de fer per assegurar que s'utilitza l'estil Brisa és establir el QStyle a `breeze` i establir l'estil dels Qt Quick Controls a `org.kde.desktop`.

source: A [QStyle](https://doc.qt.io/qt-6/qstyle.html) is what controls the majority of the appearance of a QtWidgets application. This is needed in our QtQuick application because we initialize the application with [QApplication](https://doc.qt.io/qt-6/qapplication.html) (traditionally used with QtWidgets).
ca: Un [QStyle](https://doc.qt.io/qt-6/qstyle.html) és el que controla la majoria de l'aparença d'una aplicació QtWidgets. Això és necessari a la nostra aplicació QtQuick perquè inicialitzem l'aplicació amb [QApplication](https://doc.qt.io/qt-6/qapplication.html) (tradicionalment usada amb QtWidgets).

source: A [Qt Quick Controls style](https://doc.qt.io/qt-6/qtquickcontrols-styles.html) on the other hand controls the majority of the appearance of a QtQuick application. This affects how QML controls will look like. KDE's `org.kde.desktop` style (otherwise known as [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style)) is special and attempts to remove duplication by deriving styling elements from the application's QStyle (hence why a QApplication is used). This way, QtWidgets and QtQuick applications can mostly look the same and reuse style components.
ca: D'altra banda, un [estil dels Qt Quick Controls](https://doc.qt.io/qt-6/qtquickcontrols-styles.html) controla la majoria de l'aparença d'una aplicació QtQuick. Això afecta com es veuran els controls QML. L'estil de KDE `org.kde.desktop` (altrament conegut com a [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style)) és especial i intenta eliminar la duplicació derivant elements estilístics del QStyle de l'aplicació (per això s'utilitza una QApplication). D'aquesta manera, les aplicacions QtWidgets i QtQuick poden veure's majoritàriament de la mateixa manera i reutilitzar components d'estil.

source: QtQuick / Kirigami applications need to set both in C++ code. To set the QStyle, it needs to be added in two places.
ca: Les aplicacions QtQuick / Kirigami necessiten establir-ho en el codi C++. Per establir el QStyle, s'ha d'afegir en dos llocs.

source: In Craft:
ca: En Craft:

source: And in C++:
ca: I en C++:

source: This is what is used in the Kirigami tutorial. You may otherwise load the Breeze style only on Windows where this is most relevant using an ifdef:
ca: Això és el que s'utilitza a la guia d'aprenentatge del Kirigami. Altrament, podeu carregar l'estil Brisa només al Windows, on això és més rellevant utilitzant un «ifdef»:

source: The Qt Quick Controls style needs to be added in three places.
ca: L'estil Qt Quick Controls s'ha d'afegir en tres llocs.

source: In C++, where it needs to be conditional:
ca: En C++, on cal que sigui condicional:

source: And optionally in CMake, in one of two ways:
ca: I opcionalment en el CMake, d'una entre dues maneres:

source: Since it is a runtime dependency, it is not required to be set in CMake which is used at compile time. However, this can signal to yourself and to others whether the environment is correct and will be able to run the resulting application, allowing you to find missing packages or misconfigurations more easily.
ca: Com que és una dependència en temps d'execució, no cal establir-la al CMake que s'utilitza en temps de compilació. No obstant això, això pot indicar a si mateix i als altres si l'entorn és correcte i serà capaç d'executar l'aplicació resultant, permetent-vos trobar amb més facilitat els paquets que falten o les configuracions errònies.

source: The command `find_package()` specifically searches for the CMake configuration files for `qqc2-desktop-style`, whereas `ecm_find_qmlmodule()` is less strict and only searches for the QML module. The latter requires that you include ECMFindQmlModule:
ca: L'ordre `find_package()` cerca específicament `qqc2-desktop-style` als fitxers de configuració del CMake, mentre que `ecm_find_qmlmodule()` és menys estricte i només cerca el mòdul QML. Aquest últim requereix que inclogueu ECMFindQmlModule:

source: Shipping icons
ca: Distribució d'icones

source: The first thing that is needed to make the application use Breeze icons is to include [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) in your project.
ca: El primer que cal per a fer que l'aplicació utilitzi les icones Brisa és incloure [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) en el projecte.

source: After this, some CMake commands are needed to bundle your application icon with the app.
ca: Després d'això, es necessiten algunes ordres del CMake per afegir la icona de l'aplicació a l'aplicació.

source: This can be done with the following three steps:
ca: Això es pot fer amb els tres passos següents:

source: Adding it as a dependency in Craft:
ca: Afegir-la com a dependència al Craft:

source: Adding it as a dependency in CMake:
ca: Afegir-la com a dependència al CMake:

source: Using it in C++ code, in the `main.cpp` file:
ca: Usant-la al codi C++, en el fitxer `main.cpp`:

source: Note that although the project name and CMake call uses plural (KIconThemes, KF6IconThemes), the C++ call uses singular (KIconTheme).
ca: Tingueu en compte que encara que el nom del projecte i la crida al CMake fan servir el plural (KIconThemes, KF6IconThemes), la crida C++ fa servir el singular (KIconTheme).

source: KIconThemes needs to be initialized before the application.
ca: Cal inicialitzar KIconThemes abans de l'aplicació.

source: Application icon
ca: Icona de l'aplicació

source: If your application has an icon, it needs to be added to your project both as a [QML resource](https://doc.qt.io/qt-6/resources.html) and as a part of icon installation.
ca: Si l'aplicació té una icona, s'ha d'afegir al vostre projecte tant com un [recurs QML](https://doc.qt.io/qt-6/resources.html) i com a part de la instal·lació d'icones.

source: Ordinarily on Linux the application icon can simply be installed to the correct directory, and the icon will be fetched by the application when needed. Usually the application icon consists of a primary SVG icon, paired with multiple PNG icon sizes.
ca: Habitualment al Linux, la icona de l'aplicació es pot instal·lar al directori correcte, i l'aplicació recuperarà la icona quan sigui necessari. Normalment, la icona de l'aplicació consisteix en una icona SVG primària, aparellada amb diverses mides d'icones PNG.

source: Installing the SVG icon is done like this in CMake:
ca: La instal·lació de la icona SVG es fa així en el CMake:

source: And installing the PNG icons is done like this:
ca: I la instal·lació de les icones PNG es fa així:

source: When the application icon is installed on Linux, a PNG icon such as `48-apps-myapp.png` goes to `${INSTALL_PREFIX}/share/icons/hicolor/48x48/apps/myapp.png`, and an SVG icon goes to `${INSTALL_PREFIX}/share/icons/hicolor/scalable/apps/org.kde.myapp.svg`, where `${INSTALL_PREFIX}` usually stands for `/usr`, `/usr/local` or `~/.local`. Note how in the PNGs' case the icon name translates into the path it will have in the filesystem.
ca: Quan s'instal·la la icona de l'aplicació al Linux, una icona PNG com `48-apps-myapp.png` goes to `${INSTALL_PREFIX}/share/icons/hicolor/48x48/apps/myapp.png`, i una icona SVG va a `${INSTALL_PREFIX}/share/icons/hicolor/scalable/apps/org.kde.myapp.svg`, on `${INSTALL_PREFIX}` normalment significa `/usr`, `/usr/local` o `~/.local`. Tingueu en compte com en el cas dels PNG que el nom de la icona es tradueix al camí que tindrà en el sistema de fitxers.

source: You can read more about installing files in [Building KDE software manually: The install step](/docs/getting-started/building/cmake-build/#install).
ca: Podeu llegir més sobre la instal·lació de fitxers a [Construir manualment el programari de KDE: El pas d'instal·lació](/docs/getting-started/building/cmake-build/#install).

source: Once the icon is installed in this way, in QML code, it can be called simply with `myapp` or `org.kde.myapp`, as would be called from [QIcon::fromTheme()](doc.qt.io/qt-6/qicon.html#fromTheme). This can be used with any QML control that has an [icon.name](https://doc.qt.io/qt-6/qtquickcontrols-icons.html) property.
ca: Una vegada instal·lada la icona d'aquesta manera, en codi QML, es pot cridar simplement amb `myapp` o `org.kde.myapp`, com es cridaria des de [QIcon::fromTheme()](doc.qt.io/qt-6/qicon.html#fromTheme). Això es pot utilitzar amb qualsevol control QML que tingui una propietat [icon.name](https://doc.qt.io/qt-6/qtquickcontrols-icons.html).

source: Windows has no such standard directory, and installing the icon has no effect; it has to be bundled with the application. To do so, the PNG can be sent to its own installation directory using `ecm_add_app_icon()` and a PNG or SVG file can be embedded into the app as a Qt resource file in `ecm_add_qml_module()` or `ecm_target_qml_sources()`.
ca: El Windows no té aquest directori estàndard, i la instal·lació de la icona no té cap efecte; s'ha d'empaquetar amb l'aplicació. Per a fer-ho, el PNG es pot enviar al seu propi directori d'instal·lació utilitzant `ecm_add_app_icon()` i un fitxer PNG o SVG es pot incrustar a l'aplicació com un fitxer de recursos Qt a `ecm_add_qml_module()` o `ecm_target_qml_sources()`.

source: The PNG application icon is installed with:
ca: La icona de l'aplicació PNG s'instal·la amb:

source: And the main application icon is bundled as a Qt resource with:
ca: I la icona principal de l'aplicació s'empaqueta com a recurs Qt amb:

source: This will make the application icon available as a Qt resource under `qrc:/qt/qml/org/kde/myapp/org.kde.myapp.svg`. This can be used with any QML control that has an [icon.source](https://doc.qt.io/qt-6/qtquickcontrols-icons.html) property.
ca: Això farà que la icona de l'aplicació estigui disponible com a recurs Qt a `qrc:/qt/qml/org/kde/myapp/org.kde.myapp.svg`. Això es pot utilitzar amb qualsevol control QML que tingui una propietat [icon.source](https://doc.qt.io/qt-6/qtquickcontrols-icons.html).

source: The `RESOURCES` path depends on the place where the icons are located. Traditionally, an `icons/` folder is created at the root of the project for storing all icons, as they don't really count as source files.
ca: El camí `RESOURCES` depèn del lloc on es trobin les icones. Tradicionalment, es crea una carpeta `icons/` a l'arrel del projecte per a emmagatzemar totes les icones, ja que realment no compten com a fitxers de codi font.

source: After the icons are installed (for Linux) and bundled (for Windows and Android), you can set it in code. In QML code, for compatibility with both Windows and Android, you should use the bundled icon; in C++ code, notably when setting the window icon, you can use the theme icon by default and the bundled icon as a fallback with [QIcon::fromTheme()](https://doc.qt.io/qt-6/qicon.html#fromTheme) in the call to [QGuiApplication::setWindowIcon()](https://doc.qt.io/qt-6/qguiapplication.html#windowIcon-prop):
ca: Després d'instal·lar les icones (per al Linux) i empaquetades (per al Windows i l'Android), podeu definir-les al codi. Al codi QML, per a la compatibilitat amb el Windows i l'Android, hauríeu d'utilitzar la icona empaquetada; en el codi C++, especialment quan establiu la icona de la finestra, podeu utilitzar la icona del tema predeterminat i la icona empaquetada com a alternativa amb [QIcon::fromTheme()](https://doc.qt.io/qt-6/qicon.html#fromTheme) a la crida a [QGuiApplication::setWindowIcon()](https://doc.qt.io/qt-6/qguiapplication.html#windowIcon-prop):

source: Kirigami icons
ca: Icones del Kirigami

source: While Windows does not have a standard directory where to install icons from an icon theme, it is possible to bundle the necessary Breeze icons together with your Windows application.
ca: Tot i que el Windows no té un directori estàndard on instal·lar icones des d'un tema d'icones, és possible afegir les icones Brisa necessàries juntament amb la vostra aplicació Windows.

source: This is performed by Craft automatically when KIconThemes is correctly set up for the project and Breeze icons are included as a dependency in your project.
ca: Això ho fa el Craft automàticament quan KIconThemes està configurat correctament per al projecte i les icones Breeze s'inclouen com a dependència en el projecte.

source: To set up KIconThemes, see the above section [KIconThemes](#kiconthemes).
ca: Per a configurar KIconThemes, vegeu la secció anterior [KIconThemes](#kiconthemes).

source: To add Breeze icons as a dependency for your project, add this to your Craft blueprint:
ca: Per a afegir les icones Brisa com a dependència del vostre projecte, afegiu-ho al vostre esquema de Craft:

source: This way, you won't need to manually bundle any Breeze icons into your application as a resource: you can just use a `QIcon::fromTheme()` name, such as `kde` or `application-exit-symbolic`.
ca: D'aquesta manera, no necessitareu empaquetar manualment cap icona del Brisa a la vostra aplicació com a recurs: podeu utilitzar un nom `QIcon::fromTheme()`, com ara `kde` o `application-exit-symbolic`.

source: Building
ca: Construcció

source: To build your application on Windows, follow [Building KDE software on Windows with Craft: Building your own projects on Windows](/docs/getting-started/building/craft#custom-projects).
ca: Per a construir la vostra aplicació al Windows, seguiu [Construir el programari KDE al Windows amb Craft: Construcció dels projectes propis al Windows](/docs/getting-started/building/craft#custom-projects).

source: CI builds
ca: Construccions de CI

source: If the project has been properly configured to build on Windows and is using KDE infrastructure for its code hosting (KDE Invent), it is possible to configure Windows CI/CD jobs.
ca: Si el projecte s'ha configurat correctament per a construir al Windows i està utilitzant la infraestructura KDE per al seu allotjament de codi (KDE Invent), és possible configurar els treballs CI/CD del Windows.

source: To do this, you will need to add the relevant CI templates for Windows with a `.gitlab-ci.yaml` file and list your dependencies in a `.kde-ci.yaml` file as mentioned in [Continuous Integration System](https://community.kde.org/Infrastructure/Continuous_Integration_System).
ca: Per a fer-ho, haureu d'afegir les plantilles CI rellevants del Windows amb un fitxer `.gitlab-ci.yaml` i llistar les vostres dependències en un fitxer `.kde-ci.yaml` com s'ha esmentat al [Sistema d'integració contínua](https://community.kde.org/Infrastructure/Continuous_Integration_System).

source: Troubleshooting
ca: Solució de problemes

source: If you have problems adapting your application to Windows, you can visit the following rooms on [Matrix](https://community.kde.org/Matrix):
ca: Si teniu problemes per a adaptar la vostra aplicació al Windows, podeu visitar les sales següents a [Matrix](https://community.kde.org/Matrix):

source: Setup with C++
ca: Configuració amb el C++

source: Create your first Kirigami application with C++
ca: Creeu la vostra primera aplicació Kirigami amb C++
sl: Ustvarite svojo prvo aplikacijo Kirigami s C++

source: Installing Kirigami
ca: Instal·lació del Kirigami
eo: Instalado de Kirigami
es: Instalación de Kirigami
nl: Kirigami installeren
sl: Nameščanje Kirigami
sv: Installera Kirigami
uk: Встановлення Kirigami

source: Before getting started, we will need to install Kirigami on our machine. There are three ways to do so:
ca: Abans de començar, haurem d'instal·lar el Kirigami a la nostra màquina. Hi ha tres maneres de fer-ho:
eo: Antaŭ ol komenci, ni devos instali Kirigami sur nia maŝino. Estas tri manieroj fari tion:
es: Antes de empezar, necesitamos instalar Kirigami en nuestra máquina. Existen tres formas de hacerlo:
nl: Alvorens te beginnen moeten we Kirigami op onze machine installeren. Er zijn drie manieren om dat te doen:
sl: Preden začnemo, bomo morali namestiti Kirigami na naš računalnik. To lahko storite na tri načine:
sv: Innan vi börjar måste vi installera Kirigami på datorn. Det finns tre sätt att göra det:
uk: Перш ніж почати, нам потрібно встановити Kirigami у нашій машині. Існує три способи зробити це:
