Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In the tutorial about [how to split your code into separate files](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), a new CMake file was introduced to allow for separate QML modules:
ca: A la guia d'aprenentatge sobre [com dividir el codi en fitxers separats](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), es va introduir un fitxer CMake nou per a permetre mòduls QML separats:
eo: En la lernilo pri [kiel dividi vian kodon en apartajn dosierojn](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), nova CMake-dosiero estis lanĉita por permesi apartaj QML-moduloj:
es: En el tutorial sobre [cómo dividir el código en archivos separados](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), se introdujo un nuevo archivo CMake para permitir módulos QML separados:
nl: In de instructie over [hoe uw code in separate bestanden te splitsen](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), werd een nieuw CMake-bestand geïntroduceerd om separate QML modules mogelijk te maken:
sl: V učbeniku o [kako svojo kodo razdeliti na ločene datoteke](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files) je bila uvedena nova datoteka CMake, ki omogoča ločene module QML:
sv: I handledningen om [hur man delar upp sin kod i separata filer](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files), introducerades en ny CMake-fil för att möjliggöra separata QML-moduler:
uk: У підручнику щодо того, як [поділити ваш код на окремі файли](/docs/getting-started/kirigami/introduction-separatefiles#preparing-cmake-for-the-new-files) було впроваджено новий файл CMake для забезпечення роботи окремих модулів QML:

source: The requirement for this file to be read by CMake is adding a call to `add_subdirectory()` in the `src/CMakeLists.txt` pointing to it.
ca: El requisit perquè aquest fitxer sigui llegit pel CMake és afegir una crida a `add_subdirectory()` en el `src/CMakeLists.txt` apuntant-hi.
eo: La postulo por ke ĉi tiu dosiero estu legita de CMake estas aldoni alvokon al `add_subdirectory()` en la `src/CMakeLists.txt` indikanta ĝin.
es: El requisito para que CMake lea este archivo es añadir una llamada a `add_subdirectory()` en el `src/CMakeLists.txt` que apunte a él.
nl: Om dit bestand door CMake te laten lezen is het aanroepen (call) van `add_subdirectory()` vereist in `src/CMakeLists.txt` dat er naar verwijst.
sl: Zahteva, da CMake prebere to datoteko, je dodajanje klica `add_subdirectory()` v `src/CMakeLists.txt`, ki kaže nanjo.
sv: Kravet för att filen ska läsas av CMake är att lägga till ett anrop till `add_subdirectory()` i `src/CMakeLists.txt` som pekar på den.
uk: Щоб цей файл прочитала CMake слід додати виклик `add_subdirectory()` до `src/CMakeLists.txt`, який вказуватиме сюди.

source: We create a new target called `kirigami-hello-components` and then turn it into a QML module using [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) under the import name `org.kde.tutorial.components` and add the relevant QML files.
ca: Creem un objectiu nou anomenat `kirigami-hello-components` i després el convertim en un mòdul QML utilitzant [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) amb el nom d'importació `org.kde.tutorial.components` i afegim els fitxers QML pertinents.
eo: Ni kreas novan celon nomitan `kirigami-hello-components` kaj poste turnas ĝin en QML-modulon uzante [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) sub la importnomo. `org.kde.tutorial.components` kaj aldonu la koncernajn QML-dosierojn.
es: Creamos un nuevo objetivo llamado `kirigami-hello-components` y luego lo convertimos en un módulo QML usando [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) bajo el nombre de importación `org.kde.tutorial.components` y añadimos los archivos QML relevantes.
nl: We creëren een nieuw doel `kirigami-hello-components` genaamd en zetten het om naar een QML module met de hulp van [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) met de importnaam `org.kde.tutorial.components` en voegen daar de relevante QML-bestanden toe.
sl: Ustvarimo nov cilj z imenom `kirigami-hello-components` in ga nato spremenimo v modul QML z uporabo [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) pod uvoženiim imenom `org.kde.tutorial.components` in dodajte ustrezne datoteke QML.
sv: Vi skapar ett nytt mål som heter `kirigami-hello-components` och gör det sedan till en QML-modul med hjälp av [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) under importnamnet `org.kde.tutorial.components` och lägger till relevanta QML-filer.
uk: Ми створюємо нову ціль із назвою `kirigami-hello-components`, а потім перетворюємо її на модуль QML за допомогою using [ecm_add_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) із назвою імпортування `org.kde.tutorial.components` і додаємо пов'язані файли QML.

source: The call to [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) generates a new target called `kirigami-hello-components`. This target will have its own set of source code files, QML files, link its own libraries and so on, but it needs to be linked to the executable, but once it is compiled it needs to be linked to the executable created in the `src/CMakeLists.txt`. This is done by adding the target name to the list of libraries that will be linked to the executable in `target_link_libraries()`.
ca: La crida a [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) genera un objectiu nou anomenat `kirigami-hello-components`. Aquest objectiu tindrà el seu conjunt propi de fitxers de codi font, fitxers en QML, enllaçarà les seves pròpies biblioteques i així successivament, però necessitarà estar vinculat a l'executable, però una vegada compilat necessitarà estar vinculat a l'executable creat en el `src/CMakeLists.txt`. Això es fa afegint el nom de destinació a la llista de biblioteques que s'enllaçaran a l'executable a `target_link_libraries()`.
eo: La voko al [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) generas novan celon nomitan `kirigami-hello-components`. Ĉi tiu celo havos sian propran aron de fontkodaj dosieroj, QML-dosieroj, ligos siajn proprajn bibliotekojn kaj tiel plu, sed ĝi devas esti ligita al la plenumebla, sed post kiam ĝi estas kompilita ĝi devas esti ligita al la plenumebla kreita en la ` src/CMakeLists.txt`. Ĉi tio estas farita aldonante la celnomon al la listo de bibliotekoj kiuj estos ligitaj al la plenumebla en `target_link_libraries()`.
es: La llamada a [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) genera un nuevo objetivo llamado `kirigami-hello-components`. Este objetivo tendrá su propio conjunto de archivos de código fuente, archivos QML, enlazará sus propias bibliotecas, etc., aunque necesita estar enlazado al ejecutable, pero una vez que se compila, necesita estar enlazado al ejecutable creado en `src/CMakeLists.txt`. Esto se hace añadiendo el nombre del objetivo a la lista de bibliotecas que se enlazarán al ejecutable en `target_link_libraries()`.
nl: De aanroep naar [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) genereert een nieuw doel genaamd `kirigami-hello-components`. Dit doel zal zijn eigen set broncode-bestanden, QML-bestanden, zijn eigen bibliotheken (libraries) aankoppelen enz., maar het moet nog wel gelinkt worden naar de executable, ook moet het nadat het gecompileerd is nog gelinkt worden naar de executable gecreëerd aan de hand van `src/CMakeLists.txt`. Dit wordt gedaan door de doelnaam toe te voegen aan de lijst van bibliotheken (libraries) die gelinkt worden met de executable in `target_link_libraries()`.
sl: Klic [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) ustvari nov cilj, imenovan `kirigami-hello-components`. Ta cilj bo imel lasten nabor datotek izvorne kode, datotek QML, povezal lastne knjižnice in tako naprej, vendar mora biti povezan z izvedljivo datoteko, ko pa je preveden, mora biti povezan z izvedljivo datoteko, ustvarjeno v ` src/CMakeLists.txt`. To storite tako, da ciljno ime dodate na seznam knjižnic, ki bodo povezane z izvršljivo datoteko v `target_link_libraries()`.
sv: Anropet till [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) genererar ett nytt mål som heter `kirigami-hello-components`. Målet har sin egen uppsättning källkodsfiler, QML-filer, länkar sina egna bibliotek och så vidare, men det måste länkas till den körbara filen som skapades i ` src/CMakeLists.txt` när det väl har kompilerats. Det görs genom att lägga till målnamnet i listan över bibliotek som ska länkas till den körbara filen i `target_link_libraries()`.
uk: Виклик [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) створює нову ціль із назвою `kirigami-hello-components`. Ця ціль матиме власний набір файлів початкового коду, файлів QML, компонує власні бібліотеки тощо, але її доведеться скомпонувати з виконуваним файлом, а коли її буде скомпільовано, її слід скомпонувати із виконуваним файлом, який створено у `src/CMakeLists.txt`. Ця мета досягається додаванням назви цілі до списку бібліотек, які буде скомпоновано до виконуваного файла у `target_link_libraries()`.

source: The call to `ecm_add_qml_module()` changes the library to allow it to accept QML files as before, but this time we need to use [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html). When the executable is used as a backing target (like with `kirigami-hello`) it doesn't need to generate plugin code since it's built into the executable; with separate QML modules like `kirigami-hello-components` the plugin code is necessary.
ca: La crida a `ecm_add_qml_module()` canvia la biblioteca per a permetre que accepti fitxers QML com abans, però aquesta vegada cal usar [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html). Quan l'executable es fa servir com a objectiu de reserva (com amb `kirigami-hello`) no cal generar codi del connector ja que està construït dins l'executable; amb mòduls QML separats com `kirigami-hello-components` és necessari el codi del connector.
eo: La alvoko al `ecm_add_qml_module()` ŝanĝas la bibliotekon por permesi al ĝi akcepti QML-dosierojn kiel antaŭe, sed ĉi-foje ni devas uzi [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html) . Kiam la plenumebla estas uzata kiel subtena celo (kiel kun `kirigami-hello`) ĝi ne bezonas generi kromprogramon ĉar ĝi estas enkonstruita en la rulebla; kun apartaj QML-moduloj kiel `kirigami-hello-components` la aldonkodo estas necesa.
es: La llamada a `ecm_add_qml_module()` cambia la biblioteca para permitirle aceptar archivos QML como antes, pero esta vez necesitamos usar [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html). Cuando el ejecutable se usa como un destino de respaldo (como con `kirigami-hello`) no necesita generar el código del complemento, ya que está integrado en el ejecutable; con módulos QML separados, como `kirigami-hello-components`, el código del complemento es necesario.
nl: De aanroep naar `ecm_add_qml_module()` stelt de bibliotheek zodanig in dat het net zoals eerder QML-bestanden accepteert, maar deze keer moeten we [GENERATE_PLUGIN_SOURCE] (https://api.kde.org/ecm/module/ECMQmlModule.html) gebruiken. Als het programma wordt gebruikt als een achtergronddoel (zoals bij `kirigami-hello`) dan hoeft het geen plugin code te generen omdat het in het uitvoerbare bestand is ingebouwd; bij separate QML modules zoals `kirigami-hello-componenten` is de plugin code noodzakelijk.
sl: Klic `ecm_add_qml_module()` spremeni knjižnico, da ji omogoči sprejemanje datotek QML kot prej, toda tokrat moramo uporabiti [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html) . Ko se izvršljiva datoteka uporablja kot podporni cilj (kot pri `kirigami-hello`), ji ni treba generirati kode vtičnika, saj je vgrajena v izvršljivo datoteko; z ločenimi moduli QML, kot je `kirigami-hello-components`, je potrebna koda vtičnika.
sv: Anropet till `ecm_add_qml_module()` ändrar biblioteket så att det kan acceptera QML-filer som tidigare, men den här gången måste vi använda [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html) . När den körbara filen används som ett stödmål (som med `kirigami-hello`) behöver den inte generera insticksprogramkod eftersom det är inbyggt i den körbara filen; med separata QML-moduler som "kirigami-hello-components" är insticksprogramkoden nödvändig.
uk: Виклик `ecm_add_qml_module()` змінює бібліотеку так, щоб дозволити їй приймати файли QML, як і раніше, але цього разу нам слід скористатися [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html). Якщо як резервну ціль використано виконуваний файл (як у `kirigami-hello`), вона не потребує створення коду додатка, оскільки її буде зібрано до виконуваного файла; із окремими модулями QML, зокрема `kirigami-hello-components`, код додатка є обов'язковим.

source: Upstream Qt's [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) by default generates a plugin together with the QML module, but KDE's `ecm_add_qml_module()` by default does not for backwards compatibility.
ca: El [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) de les Qt originals generen de manera predeterminada un connector junt amb el mòdul QML, però l'`ecm_add_qml_module()` de KDE no ho fa per compatibilitat cap enrere.
eo: La [qt_add_qml_module()] de Qt kontraŭflue (https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) defaŭlte generas kromprogramon kune kun la QML-modulo , sed `ecm_add_qml_module()` de KDE defaŭlte ne por malantaŭen kongruo.
es: De manera predeterminada, el [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) de Qt genera un complemento junto al módulo QML, aunque el `ecm_add_qml_module()` de KDE no lo hace de forma predeterminada por compatibilidad con versiones anteriores.
nl: Upstream Qt's [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) genereert standaard samen met de QML module een plugin, maar KDE's `ecm_add_qml_module()` doet dat standaard niet vanwege de backwards compatibility.
sl: Upstream Qt [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) privzeto ustvari vtičnik skupaj z modulom QML , vendar KDE-jev `ecm_add_qml_module()` privzeto ne omogoča združljivosti za nazaj.
sv: Uppströms genererar Qt [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) standardmässigt ett insticksprogram tillsammans med QML-modulen, men KDE:s `ecm_add_qml_module()` är inte standard för bakåtkompatibilitet.
uk: Основна команда Qt [qt_add_qml_module()](https://doc.qt.io/qt-6/qt-add-qml-module.html#targets-and-plugin-targets) типово створює додаток разом із модулем QML, а `ecm_add_qml_module()` KDE типово не робить цього з міркувань зворотної сумісності.

source: Another thing that is necessary for separate QML modules is to finalize the target. This mainly means CMake generates two files, [qmldir and qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), which describe the QML modules we have and exports their symbols for use in the library. They are important when installing your application so that the executable being run is able to find where the QML files for each module are, so they are automatically added to the target.
ca: Una altra cosa que és necessària per als mòduls QML separats és finalitzar l'objectiu. Això significa principalment que el CMake genera dos fitxers, [qmldir i qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), que descriuen els mòduls QML que tenim i exporten els seus símbols per al seu ús a la biblioteca. Són importants quan s'instal·la l'aplicació perquè l'executable que s'està executant pugui trobar on són els fitxers QML per a cada mòdul, de manera que s'afegeixen automàticament a l'objectiu.
eo: Alia afero necesa por apartaj QML-moduloj estas fini la celon. Ĉi tio ĉefe signifas ke CMake generas du dosierojn, [qmldir kaj qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), kiuj priskribas la QML-modulojn kiujn ni havas kaj eksportas iliajn simbolojn por uzo. en la biblioteko. Ili estas gravaj kiam vi instalas vian aplikaĵon, por ke la rulebla programo povu trovi kie estas la QML-dosieroj por ĉiu modulo, do ili estas aŭtomate aldonitaj al la celo.
nl: Daarnaast is het noodzakelijk om de QML modules te scheiden om het doel af te maken. Dit houd hoofdzakelijk is dat CMake twee bestanden genereert, [qmldir en qmltypes] (https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), die de QML modules beschrijven die we hebben en hun symbolen exporteren om in de bibliotheek te gebruiken. Ze zijn belangrijk bij het installeren van uw programma zodat het uitvoerbare bestand voor elke module de QML-bestanden kan vinden, zodat ze automatisch aan het doel kunnen worden toegevoegd.
sl: Druga stvar, ki je potrebna za ločene module QML, je dokončanje cilja. To predvsem pomeni, da CMake ustvari dve datoteki, [qmldir in qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), ki opisujeta module QML, ki jih imamo, in izvozi njihove simbole za uporabo v knjižnici. Pomembni so pri namestitvi vaše aplikacije, tako da lahko izvršljiva datoteka, ki se izvaja, najde, kje so datoteke QML za vsak modul, tako da so samodejno dodane v cilj.
sv: En annan sak som är nödvändig för separata QML-moduler är att slutföra målet. Det innebär huvudsakligen att CMake genererar två filer, [qmldir och qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), som beskriver QML-modulerna vi har och exporterar deras symboler för användning i biblioteket. De är viktiga när programmet installeras så att den körbara filen som körs kan hitta var QML-filerna för varje modul finns, så att de automatiskt läggs till i målet.
uk: Іншою річчю, яка потрібна для окремих модулів QML, є завершення цілі. Це, в основному, означає, що CMake створює два файли, [qmldir і qmltypes](https://doc.qt.io/qt-6/qtqml-modules-qmldir.html), які описують наші модулі QML та експортує їхні символи для використання у бібліотеці. Вони є важливими при встановленні вашої програми, щоб запущений виконуваний файл міг знайти місце, де перебувають файли кожного модуля QML, щоб їх можна було автоматично додати до цілі.

source: You can then just install the target as before.
ca: A continuació, podeu instal·lar l'objectiu com abans.
eo: Vi povas tiam simple instali la celon kiel antaŭe.
es: Después podrá instalar el objetivo como antes.
nl: Het doel kan dan gewoon net zoals vroeger geïnstalleerd worden.
sl: Nato lahko preprosto namestite cilj kot prej.
sv: Därefter kan du bara installera målet som tidigare.
uk: Далі ви можете встановити ціль, як і раніше.

source: Next time you need to add more QML files, remember to include them in this file. C++ files that use the [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) keyword which we will see much later in the tutorial can also be added here using `target_sources()`. You can logically separate your code by creating more QML modules with different imports as needed.
ca: La pròxima vegada que necessiteu afegir més fitxers QML, recordeu d'incloure'ls en aquest fitxer. Els fitxers C++ que utilitzen la paraula clau [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) que veurem més tard a la guia d'aprenentatge també es poden afegir aquí utilitzant `target_sources()`. Podeu separar lògicament el codi creant més mòduls QML amb importacions diferents segons calgui.
eo: Venontfoje vi bezonos aldoni pliajn QML-dosierojn, memoru inkluzivi ilin en ĉi tiu dosiero. C++-dosieroj, kiuj uzas la ŝlosilvorton [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), kiun ni vidos multe pli poste en la lernilo, ankaŭ povas esti aldonitaj ĉi tie uzante `target_sources( )`. Vi povas logike apartigi vian kodon kreante pli da QML-moduloj kun malsamaj enportoj laŭbezone.
nl: De volgende keer dat u meer QML-bestanden moet toevoegen, onthoud om ze in te voegen in dit bestand. C++ bestanden die de [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) sleutelwoorden gebruiken die we veel later zullen zien in de handleiding kunnen hier ook toegevoegd worden met `target_sources()`. U kunt uw code logisch scheiden door meer QML-modulen aan te maken door naar behoefte verschillende zaken te importeren.
sl: Ko boste naslednjič morali dodati več datotek QML, jih ne pozabite vključiti v to datoteko. Datoteke C++, ki uporabljajo ključno besedo [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), ki jo bomo videli veliko kasneje v učbeniku, lahko dodate tudi tukaj z uporabo `target_sources( )`. Svojo kodo lahko logično ločite tako, da po potrebi ustvarite več modulov QML z različnimi uvozi.
sv: Nästa gång du behöver lägga till fler QML-filer, kom ihåg att inkludera dem i den här filen. C++ filer som använder nyckelordet [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) som vi kommer att se mycket senare i handledningen kan också läggas till här med `target_sources( )`. Man kan separera sin kod logiskt genom att skapa fler QML-moduler med olika importer efter behov.
uk: Наступного разу, коли вам буде потрібно додати файли QML, не забудьте включити їх до цього файла. Файли C++, які використовують ключове слово [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html), які ми побачимо набагато пізніше у цьому підручнику, також можна додати саме тут за допомогою `target_sources()`. Якщо потрібно, ви можете логічно розділити ваш код створенням додаткових модулів QML із різними імпортуваннями.

source: This setup will be useful when developing most Kirigami apps.
ca: Aquesta configuració serà útil en desenvolupar la majoria de les aplicacions escrites amb el Kirigami.
eo: Ĉi tiu aranĝo estos utila dum disvolvado de plej multaj Kirigami-aplikoj.
es: Esta configuración será útil para desarrollar la mayoría de las aplicaciones de Kirigami.
fr: Cette configuration sera utile lors du développement de la plupart des applications avec Kirigami.
nl: Deze opzet zal bruikbaar zijn bij ontwikkelen van de meeste Kirigami toepassingen.
pl: To ustawienie będzie użyteczne podczas rozwijania większości aplikacji Kirigami.
pt: Esta configuração será útil quando estiver a desenvolver a maioria das aplicações de Kirigami.
sl: Ta nastavitev bo uporabna pri razvoju večine programov oz. aplikacij Kirigami.
sv: Inställningen är användbar när vi utvecklar de flesta program i Kirigami.
uk: Такими налаштуваннями можна скористатися для створення більшості програм на основі Kirigami.

source: Actions based components
ca: Accions basades en els components
eo: Agoj bazitaj komponantoj
es: Componentes basados en acciones
fr: Composants concernant les actions
nl: Op acties gebaseerde componenten
pl: Składniki oparte na działaniach
pt: Componentes baseados em acções
sl: Komponente, ki temeljijo na dejanjih
sv: Åtgärdsbaserade komponenter
uk: Компоненти на основі дій
