Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In `data()`, we can use a `switch` statement to return the appropriate data and data type depending on the role, which is possible as `data()` returns a [QVariant](docs:qtcore;qvariant.html). We still need to make sure we get the appropriate location of the data, though. In this example below, you can see that a new iterator variable is being declared, which is set from the beginning of the list plus the row of the index and the data that the iterator is pointing to is what is being returned.
eo: En `data()`, ni povas uzi deklaron `switch` por redoni la taŭgajn datumojn kaj datumtipon depende de la rolo, kio eblas ĉar `data()` liveras [QVariant](docs:qtcore;qvariant.html ). Ni ankoraŭ devas certigi, ke ni ricevas la taŭgan lokon de la datumoj, tamen. En ĉi tiu malsupra ekzemplo, vi povas vidi, ke nova iteratora variablo estas deklarita, kiu estas agordita de la komenco de la listo plus la vico de la indekso kaj la datumoj, kiujn la iteratoro montras, estas kio estas resendita.
es: En `data()` podemos usar una sentencia `switch` para devolver los datos apropiados y el tipo de dato según el rol, lo que es posible porque `data()` devuelve una [QVariant](docs:qtcore;qvariant.html). No obstante, todavía tenemos que asegurarnos de que obtenemos la posición apropiada de los datos. En el siguiente ejemplo se puede ver que se declara una nueva variable de iteración, que se establece al principio de la lista más la fila del índice y los datos a los que apunta el iterador son los que se devuelven.
nl: In `data()` kunnen we een `switch` statement gebruiken om de toepasselijke gegevens en gegevenstype terug te geven afhankelijk van de rol, wat mogelijk is als `data()` een [QVariant](docs:qtcore;qvariant.html) teruggeeft. We moeten echter nog steeds zeker maken dat we de toepasselijke locatie van de gegevens krijgen. In dit onderstaande voorbeeld kunt u zien dat een nieuwe iterator-variabele gedeclareerd wordt, die is gezet vanaf het begin van de lijst plus de rij van de index en de gegevens waar de iterator naar wijst is wat wordt teruggegeven.
sl: V `data()` lahko uporabimo stavek `switch`, da vrnemo ustrezne podatke in podatkovne tipe, odvisno od vloge, kar je mogoče, saj `data()` vrne [QVariant](docs:qtcore;qvariant.html). Še vedno se moramo prepričati, da dobimo primerno lokacijo podatkov. V tem primeru spodaj lahko viditeda se deklarira nova spremenljivka iteratorja, ki je nastavljena iz začetka seznama plus vrstica indeksa in podatki, ki jih iterator, na katerega kaže prav tisto, kar je vrnjeno.
sv: I `data()` kan vi använda `switch` för att returnera lämplig data och datatyp beroende på rollen, vilket är möjligt eftersom `data()` returnerar [QVariant](docs:qtcore;qvariant.html ). Vi måste dock se till att vi får rätt plats för data. I exemplet nedan visas att en ny iterationsvariabel deklareras, vilken initieras från början av listan plus indexets rad, och data som variabeln pekar på är det som returneras.
uk: У `data()` ми можемо скористатися інструкцією `switch` для повернення відповідних даних, а тип даних залежатиме від ролі, що є можливим, оскільки `data()` повертає [QVariant](docs:qtcore;qvariant.html). Втім, нам усе ще потрібно переконатися, що ми отримуємо належне місце у даних. У прикладі нижче можна бачити, що оголошено нову змінну-ітератор, значення якої встановлюється на початку списку з додаванням індексу рядка, а дані, на які цей ітератор вказує, — це те, що буде повернуто.

source: We can't just return whatever data we want though. We may be trying to bind data to a property with an incompatible data type, such as a QStringList to a QString. You may have to do data conversion in order for the data to be displayed properly.
eo: Ni ne povas simple redoni kiajn ajn datumojn ni volas tamen. Ni eble provas ligi datumojn al propreco kun nekongrua datumtipo, kiel QStringList al QString. Vi eble devos fari datuman konvertiĝon por ke la datumoj estu montritaj ĝuste.
es: Sin embargo, no podemos simplemente devolver los datos que queramos. Es posible que estemos intentando asociar datos a una propiedad con un tipo de datos incompatible, como una QStringList a una QString. Es posible que tenga que realizar una conversión de datos para que los datos se muestren correctamente.
nl: We kunnen echter niet gewoon teruggeven welke gegevens dan ook die we willen. We kunnen proberen gegevens te binden aan een eigenschap met een niet compatibel type gegeven, zoals een QStringList aan een QString. U moet misschien conversie van gegevens doen om het gegeven juist weer te geven.
sl: Ne moremo pa kar tako vrniti podatkov, ki jih želimo. Morda se poskušamo zavezatipodatkov v lastnost z nezdružljivim tipom podatkov, kot je QStringList vQString. Morda boste morali izvesti pretvorbo podatkov, da bodo podatki lahkoprikazani pravilno.
sv: Vi kan dock inte bara returnera vilken data vi vill. Vi kanske försöker koppla data till en egenskap med en inkompatibel datatyp, till exempel en QStringList till en QString. Man kan behöva göra datakonvertering för att data ska visas korrekt.
uk: Втім, ми не можемо просто повернути будь-які бажані дані. Можлива спроба прив'язування даних до властивості із несумісним типом даних, зокрема QStringList до QString. Можливо, слід виконати перетворення даних, щоб їх можна було показати належним чином.

source: Allow the Class to be Declared in QML
eo: Permesu la Klason esti Deklarita en QML
es: Permitir que la clase se declare en QML
nl: De klasse toestaan gedeclareerd te worden in QML
sl: Dovolite, da se razred deklarira v QML
sv: Tillåt att klassen kan deklareras i QML
uk: Уможливлення оголошення класу у QML

source: Let's not forget to make our class usable in QML.
eo: Ni ne forgesu fari nian klason uzebla en QML.
es: No olvidemos hacer que nuestra clase se pueda usar en QML.
nl: Laten we niet vergeten om onze klasse bruikbaar te maken in QML.
sl: Ne pozabimo narediti našega razreda uporabnega v QML.
sv: Låt oss inte glömma bort att göra klassen användbar i QML.
uk: Не забуваймо уможливити використання нашого класу у QML.

source: The QML file that is used will just contain three [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) components, where the key is the header and the value is the content. These cards are created by delegating an AbstractCard using a Repeater, where the custom model we created acts as the model. The data is accessed using word `model`, followed by the roles we declared in `roleNames()`.
eo: La QML-dosiero uzata nur enhavos tri [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) komponantojn, kie la ŝlosilo estas la kaplinio kaj la valoro estas la enhavo. Ĉi tiuj kartoj estas kreitaj per delegado de Abstrakta Karto uzante Ripetilon, kie la propra modelo, kiun ni kreis, funkcias kiel la modelo. La datumoj estas aliritaj per vorto `modelo`, sekvata de la roloj, kiujn ni deklaris en `roleNames()`.
es: El archivo QML que se usa contendrá solo tres componentes [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), donde la clave es la cabecera y el valor es el contenido. Estas tarjetas se crean delegando una AbstractCard que usa un Repeater, donde el modelo personalizado que hemos creado actúa como modelo. Se accede a los datos usando la palabra `model`, seguida por los roles que hemos declarado en `roleNames()`.
nl: Het QML-bestand dat wordt gebruikt zal slechts drie [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) componenten bevatten, waar de sleutel de kop is en de waarde de inhoud. Deze kaarten worden aangemaakt door het delegeren van AbstractCard met gebruik van een Repeater, waar het aangepaste model dat we aanmaakten als het model acteert. De toegang tot gegevens is via het woord `model`, gevolgd door de rollen gedeclareerd in `roleNames()`.
sv: QML-filen som används innehåller bara tre [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) komponenter, där nyckeln är rubriken och värdet är innehållet. Korten skapas genom att delegera ett AbstractCard med hjälp av en Repeater, där den anpassade modellen vi skapade fungerar som modell. Data nås med hjälp av ordet `model`, följt av de roller vi deklarerade i `roleNames()`.
uk: Використаний файл QML буде містити лише три компоненти [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), де ключем буде заголовок, а значенням — вміст. На цей момент ці картки створено делегуванням AbstractCard з використанням Repeater, де створена нами нетипова модель працює як модель. Доступ до моделі здійснюється за допомогою слова `model`, за яким слід вказати ролі, які ми оголосили у `roleNames()`.

source: ![App Screenshot](app_screenshot.png)
eo: ![Aplika Ekrankopio](app_screenshot.png)
es: ![Captura de pantalla de la aplicación](app_screenshot.png)
sv: ![Skärmbild av programmet](app_screenshot.png)
uk: ![Знімок вікна програми](app_screenshot.png)

source: You may encounter a situation where you want to modify data in the model, and have the changes reflected on the frontend side. Every time we change data in the model, we must emit the `dataChanged()` signal which will apply those changes on the frontend side at the specific cells specified in its arguments. In this tutorial, we can just use the `index` argument of `setData()`.
eo: Vi povas renkonti situacion kie vi volas modifi datumojn en la modelo, kaj havi la ŝanĝojn reflektitaj sur la fasado. Ĉiufoje kiam ni ŝanĝas datumojn en la modelo, ni devas elsendi la signalon `dataChanged()`, kiu aplikos tiujn ŝanĝojn ĉe la fasado ĉe la specifaj ĉeloj specifitaj en ĝiaj argumentoj. En ĉi tiu lernilo, ni povas simple uzi la argumenton `indekso` de `setData()`.
es: Es posible que se encuentre con una situación en la que desee modificar datos en el modelo y que los cambios se reflejen en la interfaz. Cada vez que cambiamos datos en el modelo, debemos emitir la señal `dataChanged()`, que aplicará los cambios en la interfaz en las celdas indicadas específicamente en sus argumentos. En este tutorial, podemos usar el argumento `index` de `setData()`.
nl: U kunt een situatie tegenkomen waar u de gegevens in het model wilt wijzigen en de wijzigingen gereflecteerd wilt zien aan de kant van de frontend. Elke keer dat we gegevens in het model wijzigen, moeten we het signaal `dataChanged()` uitzenden die die wijzigingen toepast aan de kant van het frontend in de specifieke cellen gespecificeerd in zijn argumenten. In deze inleiding, kunnen we gewoon het argument `index` van `setData()` gebruiken.
sl: Lahko se zgodi, da želite spremeniti podatke v modelu, in naj se spremembe odražajo na začelju. Vsakič, ko spremenimo podatke v modelu, moramo oddati signal `dataChanged()`, ki bo uveljavil te spremembe na sprednji strani v posebnih celicah, ki so določene v njegovih argumentih. V tem učbeniku lahko samo uporabimo argument `index` od `setData()`.
sv: Man kan stöta på en situation där man vill ändra data i modellen och få ändringarna att reflekteras på gränssnittssidan. Varje gång vi ändrar data i modellen måste vi skicka signalen `dataChanged()` som verkställer ändringarna på gränssnittssidan för de specifika cellerna som anges i dess argument. I den här handledningen kan vi bara använda argumentet `index` i `setData()`.
uk: Може так статися, що вам потрібно буде змінити дані у моделі та відтворити зміни на боці оболонки. Кожного разу, коли ми змінюємо дані у моделі, нам слід надсилати сигнал `dataChanged()`, який застосує ці зміни на боці оболонки у вказаних у її аргументах комірках. У цьому підручнику ми можемо просто скористатися аргументом `index` у `setData()`.

source: `setData()` is a virtual function you can override so that attempting to modify the data from the frontend side automatically reflects those changes on the backend side. It requires three parameters:
eo: `setData()` estas virtuala funkcio, kiun vi povas superregi, por ke provi modifi la datumojn de la fasa flanko aŭtomate reflektas tiujn ŝanĝojn ĉe la malantaŭa flanko. Ĝi postulas tri parametrojn:
es: `setData()` es una función virtual que se puede sobrescribir para que, al intentar modificar los datos desde el lado de la interfaz, refleje de forma automática dichos cambios en el lado del motor. Requiere tres parámetros:
nl: `setData()` is een virtuele functie die u kunt overschrijven zo dat pogen de gegevens vanuit de kant van de frontend te wijzigen automatisch deze wijzigingen aan de kant van de backend reflecteert. Het vereist drie parameters:
sl: `setData()` je navidezna funkcija, ki jo lahko preglasite, tako da poskus spreminjanja podatkov na začelju samodejno odraža te spremembe na ozadju. Zahteva tri parametre:
sv: `setData()` är en virtuell funktion som går att överskrida så att försök att modifiera data från gränssnittssidan automatiskt återspeglar ändringarna på bakgrundssidan. Det kräver tre parametrar:
uk: `setData()` є віртуальною функцією, яку ви можете перевизначити так, щоб спроба внесення змін до даних з боку оболонки автоматично призводила до внесення цих змін на боці модуля обробки. Функції слід передати три аргументи:

source: `role` - In this context, the role here is used to tell views how they should handle data. The role here should be `Qt::EditRole`.
eo: `rolo` - En ĉi tiu kunteksto, la rolo ĉi tie estas uzata por diri al vidoj kiel ili devas manipuli datumojn. La rolo ĉi tie devus esti `Qt::EditRole`.
es: `role`: En este contexto, el rol se usa para indicar a las vistas cómo deben manejar los datos. Aquí, el rol debe ser `Qt::EditRole`.
nl: `role` - in deze context, de rol hier wordt gebruikt om weergaven te vertellen hoe ze de gegevens zouden moeten behandelen. De rol hier zou moeten zijn `Qt::EditRole`.
sl: `role` – V tem kontekstu se role - vloga tukaj uporablja, da pogledom pove, kako morajo ravnati s podatki. Vloga tukaj bi morala biti `Qt::EditRole`.
sv: `role`: I det här sammanhang används rollen för att tala om för vyer hur de ska hantera data. Rollen ska vara `Qt::EditRole` här.
uk: `role` — у цьому контексті роль використовується для повідомлення панелям перегляду про те, як слід обробляти дані. Роллю тут має бути `Qt::EditRole`.

source: `setData()` does not automatically emit `dataChanged()` and that still has to be done manually.
eo: `setData()` ne aŭtomate elsendas `dataChanged()` kaj tio ankoraŭ devas esti farita permane.
es: `setData()` no emite `dataChanged()` automáticamente, por lo que se tiene que hacer de forma manual.
nl: `setData()` stuurt niet automatisch `dataChanged()` uit en dat moet handmatig gedaan worden.
sl: `setData()` ne odda samodejno `dataChanged()` in to je še vedno treba opraviti ročno.
sv: `setData()` skickar inte automatiskt `dataChanged()` så det måste fortfarande göras manuellt.
uk: `setData()` не надсилає `dataChanged()` автоматично, це слід зробити вручну.

source: Let's update the QML code so that we can open up a prompt that allows us to edit the model using a Controls.Button attached to the cards.
eo: Ni ĝisdatigu la QML-kodon por ke ni povu malfermi promptilon, kiu ebligas al ni redakti la modelon per Controls.Button alkroĉita al la kartoj.
es: Actualicemos el código QML para que podamos abrir un mensaje que nos permita editar el modelo usando un Controls.Button adjunto a las tarjetas.
nl: Laten we de QML-code bijwerken zodat we een prompt kunnen openen die ons biedt het model te bewerken met een Controls.Button aangekoppeld aan de kaarten.
sl: Posodobimo kodo QML, da bomo lahko odprli poziv, ki nam to omogoča urejanje modela z gumbom Controls.Button, ki je pritrjen na kartice.
sv: Låt oss uppdatera QML-koden så att vi kan öppna en prompt som låter oss redigera modellen med hjälp av en Controls.Button kopplad till korten.
uk: Давайте оновимо код QML так, щоб він міг відкривати запит, за допомогою якого ми зможемо редагувати модель з використанням кнопки Controls.Button, яку пов'язано із картками.

source: To make the method visible in QML, we must use the Q_OBJECT macro in the class, and begin the method declaration with the Q_INVOKABLE macro. This method will also include a string parameter, which is intended to be the new key in the QMap.
eo: Por igi la metodon videbla en QML, ni devas uzi la Q_OBJECT-makroon en la klaso, kaj komenci la metododeklaron per la Q_INVOKABLE-makroo. Ĉi tiu metodo ankaŭ inkluzivos ĉenparametron, kiu celas esti la nova ŝlosilo en la QMap.
es: Para hacer que el método sea visible en QML debemos usar la macro Q_OBJECT en la clase, y empezar la declaración del método con la macro Q_INVOKABLE. Este método también incluirá un parámetro de cadena, que está destinado a ser la nueva clave del QMap.
nl: Om de methode zichtbaar te maken in QML moeten we de Q_OBJECT macro gebruiken in de klasse en de declaratie van de methode beginnen met de macro Q_INVOKABLE. Deze methode zal ook een tekenreeksparameter omvatten, die bedoeld is om de nieuwe sleutel in de QMap te zijn.
sl: Da bi bila metoda vidna v QML, moramo uporabiti makro Q_OBJECT v razredu in začeti deklaracijo metode z makrom Q_INVOKABLE. Ta metoda bo vključevala tudi parameter niza, ki naj bi bil novi ključ v QMap.
sv: För att göra metoden synlig i QML måste vi använda makrot Q_OBJECT i klassen och börja metoddeklarationen med makrot Q_INVOKABLE. Metoden inkluderar också en strängparameter, som är avsedd att vara den nya nyckeln i QMap.
uk: Щоб зробити цей метод видимим у QML, нам слід скористатися у класі макросом Q_OBJECT і почати оголошення методу за допомогою макроса Q_INVOKABLE. Цей метод також включатиме рядковий параметр, який має бути новим ключем у QMap.

source: Inside of this method, we need to tell Qt that we want to create more rows in the model. This is done by calling `beginInsertRows()` to begin our row adding operation, followed by inserting whatever we need, then use `endInsertRows()` to end the operation. We still need to emit `dataChanged()` at the end, however. This time, we are going to update all rows, from the first row to the last one as the QMap may alphabetically reorganize itself, and we need to catch that across all rows.
eo: Ene de ĉi tiu metodo, ni devas diri al Qt, ke ni volas krei pli da vicoj en la modelo. Ĉi tio estas farita per vokado `beginInsertRows()` por komenci nian vicon aldonante operacion, sekvita per enmeto kion ajn ni bezonas, tiam uzu `endInsertRows()` por fini la operacion. Ni ankoraŭ bezonas elsendi `dataChanged()` fine, tamen. Ĉi-foje, ni ĝisdatigos ĉiujn vicojn, de la unua vico ĝis la lasta ĉar la QMap povas alfabete reorganizi sin, kaj ni devas kapti tion tra ĉiuj vicoj.
es: Dentro de este método, necesitamos decirle a Qt que queremos crear más filas en el modelo. Esto se hace llamando a `beginInsertRows()` para empezar nuestra operación de añadir filas, seguido por la inserción de lo que necesitemos; termine la operación usando `endInsertRows()`. No obstante, todavía necesitamos emitir `dataChanged()` al final. Esta vez vamos a actualizar todas las filas, desde la primera hasta la última, ya que el QMap puede reorganizarlas alfabéticamente por sí mismo, y necesitamos capturar esto de todas las filas.
nl: Binnen deze methode moeten we aan Qt vertellen dat we meer rijen in het model aan willen maken. Dit wordt gedaan door `beginInsertRows()` aan te roepen om onze rij toevoegen te beginnen, gevolgd door in te voegen wat we nodig hebben, gebruik daarna `endInsertRows()` om de bewerking te beëindigen. We moeten echter nog steeds `dataChanged()` aan het einde uitsturen. Deze keer gaan we alle rijen bijwerken, vanaf de eerste rij tot de laatste omdat de QMap zichzelf alfabetisch zal reorganiseren en we dat over alle rijen moeten vangen.
sl: Znotraj te metode moramo Qt-ju povedati, da želimo ustvariti več vrstic v modelu. To naredimo tako, da pokličemo `beginInsertRows()` za začetek naše vrsticeoperacija dodajanja, ki ji sledi vstavljanje vsega, kar potrebujemo, nato uporaba`endInsertRows()` za končanje operacije. Še vedno moramo oddajati`dataChanged()` na koncu pa. Tokrat bomo posodobili vse vrstice, od prve vrstice do zadnje, kot lahko QMap po abecedi se reorganizira in to moramo ujeti v vseh vrsticah.
sv: Inne i metoden måste vi tala om för Qt att vi vill skapa flera rader i modellen. Det görs genom att anropa `beginInsertRows()` för att påbörja vår operation för att lägga till rader, följt av att infoga det vi behöver, och sedan använda `endInsertRows()` för att avsluta operationen. Vi behöver dock fortfarande skicka `dataChanged()` i slutet. Den här gången uppdaterar vi alla rader, från den första raden till den sista eftersom QMap kan ordna om sig själv alfabetiskt, och vi måste hantera det för alla rader.
uk: Всередині цього методу нам слід повідомити Qt про те, що ми хочемо створити додаткові рядки у моделі. Зробити це можна за допомогою виклику `beginInsertRows()` для започаткування нашої дії з додавання рядка, після чого слід виконати вставляння потрібного пункту, а потім скористатися `endInsertRows()` для завершення дії. Наприкінці, нам, як і раніше, слід надіслати `dataChanged()`. Цього разу ми збираємося оновити усі рядки, від першого до останнього, оскільки QMap може оновлювати список за абеткою, і нам потрібно зробити це для усіх рядків.

source: Clear TextField every time it's done
eo: Klarigi TextField ĉiufoje kiam ĝi estas farita
es: Borrar TextField cada vez que termina
nl: Wis het tekstveld elke keer dat het is gedaan
sl: Počisti TextField vsakič, ko je narejeno
sv: Rensa TextField varje gång det är klart
uk: Спорожнення TextField при кожному завершенні обробки

source: Now, let's update the application so a "Delete" button appears alongside the edit button, and hook it up to our delete method.
eo: Nun ni ĝisdatigu la aplikaĵon, tiel ke butono "Forigi" aperos apud la redaktbutono, kaj ligu ĝin al nia foriga metodo.
es: Ahora, actualicemos la aplicación para que aparezca un botón «Borrar» junto al botón «Editar» y conectémoslo a nuestro método de borrado.
nl: Laten we nu de toepassing bijwerken zodat een knop "Verwijderen" verschijnt naast de knop Bewerken en verbind het met uw methode voor verwijderen.
sl: Zdaj pa posodobimo aplikacijo, da se gumb »Izbriši« prikaže poleg gumba za urejanje in ga povežimo z našo metodo brisanja.
sv: Låt oss nu uppdatera programmet så att knappen "Ta bort" visas bredvid redigeringsknappen och koppla upp den till vår borttagningsmetod.
uk: Тепер оновімо програму так, щоб з'явилася кнопка «Delete» поряд із кнопкою редагування, і пов'яжімо цю кнопку із нашим методом вилучення.

source: Full Code
eo: Plena Kodo
es: Código completo
nl: Volledige code
sl: Celotna koda
sv: Hela koden
uk: Код повністю
