Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: As views are commonly lists of content the user would want to scroll through, when they are added to a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), views become the main content with little padding around them, and there is no need to make it fill the page. When the view is added to a simple [Kirigami.Page](docs:kirigami2;Page), it will require to set its dimensions properly before it will show up. In other words: in the scrollable page above, `anchors.fill: parent` is not required; if a simple page was used, it would be required.
eo: Ĉar vidoj estas ofte listoj de enhavo, la uzanto volus rulumi, kiam ili estas aldonitaj al [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), vidoj iĝas la ĉefa enhavo kun malmulte da kompletigo ĉirkaŭ ili, kaj ne necesas. por ke ĝi plenigu la paĝon. Kiam la vido estas aldonita al simpla [Kirigami.Paĝo](docs:kirigami2;Paĝo), ĝi postulos ĝuste agordi ĝiajn dimensiojn antaŭ ol ĝi aperos. Alivorte: en la rulebla paĝo supre, `anchors.fill: parent` ne estas bezonata; se oni uzus simplan paĝon, ĝi estus postulata.
nl: Omdat weergaven meestal lijsten met inhoud zijn waar de gebruiker doorheen wil scrollen, als ze aan een [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) zijn toegevoegd, dan vormen de weergaven de hoofdinhoud met weinig ruimte daaromheen, en het is daarom niet noodzakelijk dat het de hele pagina vult. Als de weergave wordt toegevoegd aan een eenvoudige [Kirigami.Page](docs:kirigami2;Page), dan is het noodzakelijk dat de afmetingen daarvan correct zijn ingesteld voordat het getoond wordt. Met andere woorden: in de scrollable pagina hierboven, is `anchors.fill: parent` niet nodig; maar als een eenvoudige pagina wordt gebruikt dan is het wel vereist.
sv: Eftersom vyer vanligtvis är listor med innehåll som användaren skulle vilja bläddra igenom, när de läggs till på en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), blir vyerna huvudinnehållet med lite utfyllnad runt dem, och det finns inget behov för att få dem att fylla sidan. När vyn läggs till på en enkel [Kirigami.Page](docs:kirigami2;Page), måste den ställa in sina dimensioner ordentligt innan den dyker upp. Med andra ord: på den rullningsbara sidan ovan krävs inte `anchors.fill: parent`, men om en enkel sida användes skulle den krävas.
uk: Оскільки панелі перегляду є типово списками вмісту, які користувач міг би гортати, при їхньому додаванні до [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), панелі перегляду стають переглядами основних даних із невеличкою фаскою навколо, і немає потреби заповнювати вмістом усю сторінку. Якщо панель перегляду додано до простої [Kirigami.Page](docs:kirigami2;Page), доведеться встановлювати її розмірності належним чином, перш ніж її буде показано. Іншими словами, на панелі із гортанням вище `anchors.fill: parent` є необов'язковим; якщо було б використано просту сторінку, ця інструкція була б обов'язковою.

source: Kirigami's [CardsListView](docs:kirigami2;CardsListView)
eo: [CardsListView] de Kirigami (docs:kirigami2;CardsListView)
es: [CardsListView](docs:kirigami2;CardsListView) de Kirigami
uk: [CardsListView](docs:kirigami2;CardsListView) Kirigami

source: Kirigami's [ColumnView](docs:kirigami2;ColumnView)
eo: [ColumnView] de Kirigami (docs:kirigami2;ColumnView)
es: [ColumnView](docs:kirigami2;ColumnView) de Kirigami
uk: [ColumnView](docs:kirigami2;ColumnView) Kirigami

source: [SubtitleDelegate](docs:kirigami2;SubtitleDelegate)
eo: [SubtitoloDelegito](docs:kirigami2;SubtitoloDelegito)

source: [CheckSubtitleDelegate](docs:kirigami2;CheckSubtitleDelegate)
eo: [CheckSubtitleDelegate](Dokumentoj:kirigami2;KontroluSubtitleDelegate)

source: [RadioSubtitleDelegate](docs:kirigami2;RadioSubtitleDelegate)
eo: [RadioSubtitoloDelegito](docs:kirigami2;RadioSubtitoloDelegito)

source: [SwitchSubtitleDelegate](docs:kirigami2;SwitchSubtitleDelegate)
eo: [SwitchSubtitleDelegate](Dokumentoj:kirigami2;SwitchSubtitleDelegate)

source: We have seen so far that one of the core components of a Kirigami window is a [Kirigami.Page](docs:kirigami2;Page). A single page can envelop the whole screen of the application, or it can be shown together with other pages at the same time, if there is space.
eo: Ni vidis ĝis nun, ke unu el la kernaj komponantoj de Kirigami-fenestro estas [Kirigami.Paĝo](docs:kirigami2;Paĝo). Ununura paĝo povas envolvi la tutan ekranon de la aplikaĵo, aŭ ĝi povas esti montrita kune kun aliaj paĝoj samtempe, se estas spaco.
nl: We hebben tot nu gezien dat een van de kerncomponenten van een Kirigami-venster een [Kirigami.Page](docs:kirigami2;Page) is. Een enkele pagina kan het gehele scherm van de toepassing omgeven of het kan tegelijk getoond worden samen met andere pagina's, als er ruimte is.
pt: Vimos até agora que um dos componentes básicos de uma janela do Kirigami é uma [Kirigami.Page](docs:kirigami2;Page). Uma única página consegue conter o ecrã inteiro da aplicação, ou poderá ser apresentada em conjunto com outras páginas ao mesmo tempo, caso haja espaço.
sv: Hittills har vi sett att en av kärnkomponenterna i ett Kirigami-fönster är en [Kirigami.Page](docs:kirigami2;Page). En enskild sida kan omsluta hela programmets skärm, eller så kan den visas tillsammans med andra sidor samtidigt, om det finns plats.
uk: Досі ми бачили, що одним з основних компонентів вікна Kirigami є [Kirigami.Page](docs:kirigami2;Page). Одна сторінка може включати увесь екран програми, або її може бути показано разом із іншими сторінками, якщо достатньо місця.

source: Whenever a page gets added, or *pushed*, it appears to the right of the existing page(s), forming a row. This row of pages can be managed with the fittingly named [Kirigami.PageRow](docs:kirigami2;PageRow).
eo: Kiam ajn paĝo estas aldonita, aŭ *puŝita*, ĝi aperas dekstre de la ekzistanta(j) paĝo(j), formante vicon. Ĉi tiu vico de paĝoj povas esti administrita per la taŭge nomita [Kirigami.PageRow](docs:kirigami2;PageRow).
nl: Wanneer er een pagina wordt toegevoegd of *pushed*, verschijnt het rechts van de bestaande pagina(s) en vormt een rij. Deze rij pagina's kan beheerd worden met de passing genaamd [Kirigami.PageRow](docs:kirigami2;PageRow).
pt: Sempre que for adicionada uma página, ou *colocada por cima*, aparece à direita das páginas existentes, formando uma fila. Esta fila de páginas pode ser gerida com um [Kirigami.PageRow](docs:kirigami2;PageRow) devidamente atribuído.
sv: Så fort en sida läggs till, visas den till höger om de befintliga sidorna och bildar en rad. Raden med sidor kan hanteras med det passande namngivna [Kirigami.PageRow](docs:kirigami2;PageRow).
uk: Кожного разу, коли додається або «виштовхується» сторінка, вона з'являється праворуч від наявних сторінок, формуючи рядок. Керувати цим рядком сторінок можна за допомогою відповідно названого [Kirigami.PageRow](docs:kirigami2;PageRow).

source: There are two improvements that can be done here. The first is that, with [initialPage](docs:kirigami2;PageRow::initialPage), we can both set `mainPage` to be the first page that appears in the page row, and have its dimensions be managed by the page row instead of via manual [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) or [layouts](https://doc.qt.io/qt-6/layout.html). The second is to have a toolbar, which can be set by defining a toolbar style with [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). There are a few styles we can choose from, but we'll go with [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle) for now.
eo: Estas du plibonigoj kiuj povas esti faritaj ĉi tie. La unua estas ke, kun [initialPage](docs:kirigami2;PageRow::initialPage), ni povas ambaŭ agordi `mainPage` kiel la unua paĝo kiu aperas en la paĝa vico, kaj ke ĝiaj dimensioj estu administritaj de la paĝa vico anstataŭe. de per manlibro [ankroj](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [poziciantoj](https://doc.qt.io/qt-6/qtquick- positioning-layouts.html) aŭ [layouts](https://doc.qt.io/qt-6/layout.html). La dua estas havi ilobreton, kiun oni povas agordi difinante ilobretan stilon per [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). Estas kelkaj stiloj el kiuj ni povas elekti, sed ni iros kun [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle) nuntempe.
nl: Er zijn twee verbeteringen die hier gedaan kunnen worden. De eerste is dat, met [initialPage](docs:kirigami2;PageRow::initialPage), we zowel `mainPage` als de eerste pagina kunnen instellen, die verschijnt in de paginarij, en zijn afmetingen te laten beheren door de paginarij in plaats van via handmatige [ankers](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioneerders](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) of [indelingen](https://doc.qt.io/qt-6/layout.html). De tweede is het hebben van een werkbalk, die ingesteld kan worden door een werkbalkstijl te definiëren met [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). Er zijn een paar stijlen waar we uit kunnen kiezen, maar we gaan voor nu met [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle).
pt: Existem duas melhorias que podem ser feitas aqui. A primeira é que, com o [initialPage](docs:kirigami2;PageRow::initialPage), podemos tanto definir a `mainPage` como sendo a primeira página que aparece na fila de páginas, como ter as suas dimensões a ser geridas pela fila de páginas, através de [âncoras](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) manuais, [posicionamentos](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) ou [disposições](https://doc.qt.io/qt-6/layout.html). A segunda é ter uma barra de ferramentas, que poderá ser configurada ao definir um estilo de barras de ferramentas com o [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). Existem alguns estilos que podemos escolher, mas iremos seguir com o [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle) por agora.
sv: Det finns två förbättringar som kan göras här. Den första är att med [initialPage](docs:kirigami2;PageRow::initialPage) kan vi både ställa in 'mainPage' som den första sidan som visas på sidraden, och låta dess dimensioner hanteras av sidraden istället av via manuella [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioners](https://doc.qt.io/qt-6/qtquick- positioning-layouts.html) eller [layouts](https://doc.qt.io/qt-6/layout.html). Den andra är att ha en verktygsrad, som kan ställas in genom att definiera en stil för verktygsrader med [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). Det finns några stilar vi kan välja mellan, men vi använder [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle) tills vidare.
uk: Тут можна використати два удосконалення. Перше полягає у тому, що за допомогою [initialPage](docs:kirigami2;PageRow::initialPage) ми можемо одразу встановити `mainPage` першою сторінкою, яка з'являтиметься у рядку сторінок, і наказати системі керувати її розмірностями з рядка сторінок, замість ручного встановлення [прив'язок](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [засобів позиціювання](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) або [компонувань](https://doc.qt.io/qt-6/layout.html). Друге полягає у додаванні панелі інструментів, яку можна встановити визначенням стилю панелі інструментів за допомогою [globalToolBar.style](docs:kirigami2;PageRow::globalToolBar). Існує декілька стилів, один з яких можна вибрати, але поки ми скористаємося [Kirigami.ApplicationHeaderStyle.Auto](docs:kirigami2;templates::ApplicationHeader::headerStyle).

source: There are only two ways of adding pages to a page row: by setting its [initialPage](docs:kirigami2;PageRow::initialPage) (which can optionally take an array of pages) or by using [push()](docs:kirigami2;PageRow::push). To delete a page from the page row, you should use [pop()](docs:kirigami2;PageRow::pop), whereas [goBack()](docs:kirigami2;PageRow::goBack) or [goForward()](docs:kirigami2;PageRow::goForward) can be used to navigate between pages.
eo: Estas nur du manieroj aldoni paĝojn al paĝa vico: agordante ĝian [komencanPaĝon](docs:kirigami2;PageRow::initialPage) (kiu povas laŭvole preni tabelon da paĝoj) aŭ uzante [push()](dokumentoj: kirigami2;PageRow::push). Por forigi paĝon de la paĝa vico, vi devus uzi [pop()](docs:kirigami2;PageRow::pop), dum [goBack()](docs:kirigami2;PageRow::goBack) aŭ [goForward()] (docs:kirigami2;PageRow::goForward) povas esti uzata por navigi inter paĝoj.
nl: Er zijn slechts twee manieren voor toevoegen van pagina's aan een paginarij: door zijn [initialPage](docs:kirigami2;PageRow::initialPage) in te stellen (die optioneel een array van pagina's kan nemen) of door [push()](docs:kirigami2;PageRow::push) te gebruiken. Om een pagina te verwijderen uit de paginarij zou u [pop()](docs:kirigami2;PageRow::pop) kunnen gebruiken, terwijl [goBack()](docs:kirigami2;PageRow::goBack) of [goForward()](docs:kirigami2;PageRow::goForward) gebruikt kan worden om tussen pagina's te navigeren.
pt: Existem duas formas de adicionar páginas a uma fila de páginas: configurando a sua [initialPage](docs:kirigami2;PageRow::initialPage) (que pode receber opcionalmente uma lista de páginas) ou usando a operação [push()](docs:kirigami2;PageRow::push). Para apagar uma página da fila de páginas, deverá usar a operação [pop()](docs:kirigami2;PageRow::pop), enquanto o [goBack()](docs:kirigami2;PageRow::goBack) ou [goForward()](docs:kirigami2;PageRow::goForward) podem ser usados para navegar entre páginas.
sv: Det finns bara två sätt att lägga till sidor på en sidrad: genom att ställa in dess [initialPage](docs:kirigami2;PageRow::initialPage) (som valfritt kan använda en uppsättning sidor) eller genom att använda [push()](docs: kirigami2;PageRow::push). För att ta bort en sida från sidraden bör du använda [pop()](docs:kirigami2;PageRow::pop), medan [goBack()](docs:kirigami2;PageRow::goBack) eller [goForward()] (docs:kirigami2;PageRow::goForward) kan användas för att navigera mellan sidor.
uk: Існує лише два способи додавання сторінок до рядка сторінок: встановленням його [initialPage](docs:kirigami2;PageRow::initialPage) (значенням якого, якщо потрібно може бути масив сторінок) або шляхом використання [push()](docs:kirigami2;PageRow::push). Щоб вилучити сторінку з рядка сторінок, вам слід скористатися [pop()](docs:kirigami2;PageRow::pop), а [goBack()](docs:kirigami2;PageRow::goBack) або [goForward()](docs:kirigami2;PageRow::goForward) можна скористатися для навігації сторінками.

source: If a [Kirigami.PageRow](docs:kirigami2;PageRow) with a toolbar looks familiar to you, that is because you have seen it before. An [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) is nothing more than a very convenient, global page row. Every function available to a `PageRow` is also available to the `pageStack`.
eo: Se [Kirigami.PageRow](docs:kirigami2;PageRow) kun ilobreto aspektas konata al vi, tio estas ĉar vi antaŭe vidis ĝin. [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) estas nenio alia ol tre oportuna, ĉiea paĝvico. Ĉiu funkcio disponebla por `PageRow` ankaŭ disponeblas por la `pageStack`.
nl: Als een [Kirigami.PageRow](docs:kirigami2;PageRow) met een werkbalk u bekent voor komt, dan is dat omdat u het eerder hebt gezien. Een [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) is niets meer dan een erg handig, globale paginarij. Elke functie beschikbaar in een `PageRow` is ook beschikbaar in de `pageStack`.
pt: Se um [Kirigami.PageRow](docs:kirigami2;PageRow) com uma barra de ferramentas parecer familiar para si, é porque já o viu anteriormente. Uma [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) não é mais que uma fila de páginas globais realmente conveniente. Todas as funções disponíveis numa `PageRow` também estão disponíveis na `pageStack`.
sv: Om en [Kirigami.PageRow](docs:kirigami2;PageRow) med ett verktygsfält ser bekant ut, beror det på att du har sett det förut. En [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) är inget annat än en mycket bekväm, global sidrad. Varje funktion som är tillgänglig i `PageRow` är också tillgänglig i `pageStack`.
uk: Якщо [Kirigami.PageRow](docs:kirigami2;PageRow) із панеллю інструментів виглядає для вас знайомим, це через те, що ви його вже бачили. [ApplicationWindow.pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) є не більше, ніж дуже зручним загальним рядком сторінок. Усі функції, які є доступними для `PageRow`, також доступні для `pageStack`.

source: In general you'll want to use a `pageStack` rather than implement your own [PageRow](docs:kirigami2;PageRow), especially when your application gets bigger and you need your components living in separate files. If you create your window in your `Main.qml` using a [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), a component residing in another file can still directly invoke the global `pageStack` by means of a call to the [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):
eo: Ĝenerale vi volos uzi `pageStack' anstataŭ efektivigi vian propran [PageRow](docs:kirigami2;PageRow), precipe kiam via aplikaĵo pligrandiĝas kaj vi bezonas viajn komponantojn loĝantajn en apartaj dosieroj. Se vi kreas vian fenestron en via `Main.qml` uzante [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), komponanto loĝanta en alia dosiero ankoraŭ povas rekte alvoki la ĉiean `pageStack' per voko al la [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):
nl: In het algemeen zult u een `pageStack` willen gebruiken in plaats van uw eigen [PageRow](docs:kirigami2;PageRow) te implementeren, speciaal wanneer uw toepassing groter wordt en u hebt het nodig om uw componenten aanwezig te hebben in aparte bestanden. Als u uw venster in uw `Main.qml` aanmaakt met een [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), kan een component, die zich in een ander bestand bevindt, nog steeds direct aangeroepen worden in de globale `pageStack` door middel van een oproep naar het [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):
sv: I allmänhet ska man använda en `pageStack` snarare än att implementera sin egen [PageRow](docs:kirigami2;PageRow), speciellt när programmet blir större och komponenterna måste finnas i separata filer. Om fönstret skapas i `Main.qml` med en [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), kan en komponent som finns i en annan fil fortfarande direkt anropa en global `pageStack` genom ett anrop till [ applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):
uk: Загалом, вам варто користуватися `pageStack`, а не реалізувати ваш власний [PageRow](docs:kirigami2;PageRow), особливо якщо ваша програма зростає і виникає потреба у поділі ваших компонентів між окремими файлами. Якщо ви створюєте ваше вікно у вашому `Main.qml` за допомогою [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), компонент, що зберігається в іншому файлі збереже можливість безпосередньо викликати загальний `pageStack` шляхом виклику [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):

source: value: 50
eo: valoro: 50
nl: waarde: 50
sv: värde: 50
uk: значення: 50

source: A [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) is a page that holds scrollable content, such as a [ListView](docs:qtquick;QtQuick.ListView). Scrolling, as well as scrolling indicators, are automatically managed.
eo: [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) estas paĝo kiu enhavas ruleblan enhavon, kiel [ListView](docs:qtquick;QtQuick.ListView). Rulumado, same kiel movadaj indikiloj, estas aŭtomate administritaj.
nl: Een [`Kirigami.ScrollablePage`](docs:kirigami2;ScrollablePage) is een pagina die schuifbare inhoud bevat, zoals [ListView](docs:qtquick;QtQuick.ListView). Schuiven en schuifindicatoren worden automatisch beheerd.
pt: Uma [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) é uma página que mantém o deslocamento do conteúdo, como as [ListView](docs:qtquick;QtQuick.ListView). . O deslocamento e os respectivos indicadores são geridos de forma automática.
sv: [`Kirigami.ScrollablePage`](docs:kirigami2;ScrollablePage) är en sida som innehåller rullningsbart innehåll, såsom en [ListView](docs:qtquick;QtQuick.ListView). Rullning och rullningsindikering hanteras automatiskt.
uk: [`Kirigami.ScrollablePage`](docs:kirigami2;ScrollablePage) є сторінкою, яка містить дані з можливістю гортання, зокрема [ListView](docs:qtquick;QtQuick.ListView). Гортання і індикатори гортання керуються автоматично.

source: Do not put a [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) inside of a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage); children of a `Kirigami.ScrollablePage` are already inside a `ScrollView`.
eo: Ne metu [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) interne de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage); infanoj de `Kirigami.ScrollablePage` jam estas ene de `ScrollView`.
nl: Stop geen [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) binnen een [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage); kinderen van een `Kirigami.ScrollablePage` zitten al in een `ScrollView`.
pt: Não coloque uma [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) dentro de uma [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage); os filhos de uma `Kirigami.ScrollablePage` já estão dentro de uma `ScrollView`.
sv: Placera inte en [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) inne i en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Underliggande objekt i en `Kirigami.ScrollablePage` är redan inne i en `ScrollView`.
uk: Не вписуйте `ScrollView` всередину [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView); дочірні об'єкти [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) вже перебувають у `ScrollView`.

source: When the direct children of a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) extend vertically beyond the size of the page itself, a scrollbar appears at the right edge of the page and the page will be scrollable.
eo: Kiam la rektaj infanoj de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) etendiĝas vertikale preter la grandeco de la paĝo mem, rulumbreto aperas ĉe la dekstra rando de la paĝo kaj la paĝo estos rulebla.
nl: Wanneer de directe kinderen van een [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) zich verticaal uitbreiden over de grootte van de pagina zelf, zal er een schuifbalk aan de rechter rand van de pagina verschijnen en zal de pagina schuifbaar zijn.
pt: Quando os elementos-filhos directos de um [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) se estenderem na vertical para lá do tamanho da própria página, irá aparecer uma página de deslocamento no extremo direito da página e a página continuará com as funcionalidades de deslocamento.
sv: När direkt underliggande objekt i en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) sträcks ut bortanför sidans egen storlek, visas en rullningslist vid högerkanten på sidan och sidan blir rullningsbar.
uk: Якщо безпосередні дочірні елементи [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) розширюються вертикально за розмір самої сторінки, у правій частині сторінки з'являється смужка гортання, а сторінка стає сторінкою із гортанням.
