Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Another useful property we can use is [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Setting this to a numerical value allows us to create a slider that snaps onto values that are multiples of the specified `stepSize`, with these multiples being indicated by tickmarks. Therefore if we set this property to `2.0`, when the user drags the slider handle, they will only be able to select `0.0`, `2.0`, `4.0`, etc. up to the value specified in the `to` property.
ca: Una altra propietat útil que podem utilitzar és [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Establir-la en un valor numèric ens permet crear un control lliscant que s'ajusta als valors que són múltiples de la `stepSize` especificada, amb aquests múltiples indicats per marques d'escala. Per tant, si establim aquesta propietat a `2.0`, quan l'usuari arrossega el control lliscant, només podrà seleccionar `0.0`, `2.0`, `4.0`, etc. fins al valor especificat a la propietat `to`.
eo: Alia utila propreco, kiun ni povas uzi, estas [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Agordi ĉi tion al nombra valoro ebligas al ni krei glitilon kiu alklakas valorojn kiuj estas multobloj de la specifita `stepSize`, kun ĉi tiuj multobloj indikitaj per tickmarkoj. Tial se ni agordas ĉi tiun proprecon al `2.0`, kiam la uzanto trenas la glitilon, ili nur povos elekti `0.0`, `2.0`, `4.0`, ktp. ĝis la valoro specifita en la `to` propreco.
es: Otra propiedad útil que podemos usar es [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Si le asignamos un valor numérico podremos crear un deslizador que salta en valores que son múltiplos del `stepSize` indicado, estando estos múltiplos indicados mediante marcas visuales. Por lo tanto, si asignamos el valor `2.0` a esta propiedad, al arrastrar el asa del deslizador solo se podrán seleccionar los valores `0.0`, `2.0`, `4.0`, etc. hasta el valor indicado en la propiedad `to`.
nl: Nog een nuttige eigenschap die we kunnen gebruiken is [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Deze op een numerieke waarde zetten biedt ons het maken van een schuifregelaar die klikt op waarden die meervouden zijn van de gespecificeerde `stepSize`, waarbij deze meervouden aangegeven worden met markeringen. Dus als we deze eigenschap op `2,0` zetten, zal de gebruiker bij het slepen van de hendel, alleen in staat zijn om `0,0`, `2,0`, `4,0`, etc. te selecteren tot de waarde gespecificeerd in de eigenschap `to`.
pt: Outra propriedade útil que podemos usar é o [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Se configurarmos esta com um valor numérico, permite-nos criar uma barra deslizante que se ajusta aos valors que sejam múltiplos do `stepSize` indicado, sendo estes múltiplos indicados através de traços. Por isso, se configurarmos esta propriedade como `2.0`, quando o utilizador arrastar a pega da barra, só poderá seleccionar os valores `0.0`, `2.0`, `4.0`, etc., até ao valor indicado na propriedade `to`.
sl: Še ena uporabna lastnost, ki jo lahko uporabimo, je velikost koraka [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Nastavitev velikosti koraka na številsko vrednost nam omogoča, da ustvarimo drsnik, ki se zatakne na vrednosti, ki so večkratniki določene velikosti koraka 'stepSize', pri tem pa so ti večkratniki označeni s črtico. Če bomo to lastnost nastavili na '2.0', bo uporabnik povlekel drsnik in bo lahko izbral le '0.0', '2.0', '4.0' itd. do vrednosti, ki je določena v lastnosti 'to'.
sv: En annan användbar egenskap vi kan använda är [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Att ställa in den till ett numeriskt värde låter oss skapa ett skjutreglage som låser till värden som är multipler av angiven `stepSize`, där multiplerna anges av streckmarkeringar. Om vi därför ställer in egenskapen till `2.0`, när användaren drar skjutreglagets grepp, kan de bara välja `0.0`, `2.0`, `4.0`, etc. upp till värdet angivet i egenskapen `to`.
uk: Ще однією корисною властивістю є [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#stepSize-prop). Встановлення для цієї властивості числового значення надає нам змогу створити повзунок, який прилипатиме до значень, кратних до вказаного значення `stepSize`, а самі ці кратні значення вказуються позначками на лінії руху повзунка. Отже, якщо ми встановимо для властивості значення `2.0`, коли користувач перетягуватиме повзунок, він зможе вибрати лише значення `0.0`, `2.0`, `4.0` тощо, аж до значення, яке вказано за допомогою властивості `to`.

source: ![A window showing a set of tickmarked sliders that are symmetrically divided, with each division being called a step](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
ca: ![Una finestra que mostra un conjunt de controls lliscants amb marques simètricament dividides, anomenant a cada divisió un pas](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
eo: ![Fenestro montranta aron da markitaj glitiloj kiuj estas simetrie dividitaj, kie ĉiu divido estas nomita paŝo](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
nl: ![Een venster dat een set schuifregelaars met markeringen toont die symmetrisch zijn opgedeeld, met elke verdeling genaamd een stap](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
sl: ![Okno, ki prikazuje nabor označenih drsnikov, ki so simetrično razdeljeni, pri čemer se vsak del imenuje korak](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
sv: ![Ett fönster som visar en uppsättning graderade skjutreglage som är symmetriskt uppdelade, där varje gradering kallas ett steg](/docs/getting-started/kirigami/components-controls/controls-slidersteps.webp)
uk: ![Вікно, у якому показано набір повзунків зі шкалою, які поділено симетрично, де кожна поділка називається кроком](/docs/getting-started/kirigami/components-controls/controls-tickmarkedsliders.webp)

source: Range sliders
ca: Controls lliscants amb intervals
eo: Gamaj glitiloj
es: Deslizadores de intervalo
nl: Schuifregelaar met reeks
pt: Barras deslizantes de intervalos
sl: Drsniki obsega
sv: Intervallreglage
uk: Повзунки із діапазоном

source: QtQuick Controls also provides [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). These have two handles, hence allowing you to define a range of numbers between the two handles.
ca: Els QtQuick Controls també proporcionen [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Aquests tenen dues nanses, i això permet definir un interval de nombres entre les dues nanses.
eo: QtQuick Controls ankaŭ provizas [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Ĉi tiuj havas du tenilojn, tial permesante al vi difini gamon da nombroj inter la du teniloj.
es: Los controles de QtQuick también proporcionan [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Estos tienen dos asas, por lo que le permiten definir un intervalo de números entre las dos asas.
nl: QtQuick Controls biedt ook [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Deze hebben twee hendels, waarmee u een reeks getallen tussen de twee hendels definieert.
pt: O QtQuick Controls também fornece [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Estas têm duas pegas, permitindo-lhe definir uma gama de valores entre as duas pegas.
sl: QtQuick Controls zagotavlja tudi drsnike obsega [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Ti imajo dve ročici, zato vam omogočajo, da določite obseg števil med obema ročajema.
sv: QtQuick Controls tillhandahåller också [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). De har två grepp, och låter dig därmed definiera ett talintervall mellan de två greppen.
uk: До складу QtQuick Controls включено також [Controls.RangeSliders](docs:qtquickcontrols;QtQuick.Controls.RangeSlider). Такі повзунки мають два елементи керування, отже надає вам змогу визначити діапазон чисел між цими двома елементами керування.

source: Two new properties are important to keep in mind: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) and [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), which hold the values of the two handles. Like the [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) property of the standard sliders, these can be pre-set.
ca: És important tenir en compte dues propietats noves: `[first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) i [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), les quals mantenen els valors de les dues nanses. Igual que la propietat [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) dels controls lliscants estàndard, aquests es poden preestablir.
eo: Du novaj ecoj estas grave memori: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) kaj [second.value] (https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), kiuj tenas la valorojn de la du teniloj. Kiel la [valoro](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) propreco de la normaj glitiloj, ĉi tiuj povas esti antaŭmetitaj.
es: Es importante tener en cuenta dos nuevas propiedades: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) y [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), que contienen los valores de las dos asas. Al igual que la propiedad [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) de los deslizadores estándares, estas dos propiedades también se pueden establecer previamente.
nl: Twee nieuwe eigenschappen zijn belangrijk om te onthouden: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) en [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), die de waarden van de twee hendels bevatten. Net als de eigenschap [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) van de standaard schuifregelaars, kunnen deze vooraf ingesteld worden.
sl: Pomembno je upoštevati dve novi lastnosti: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) in [second.value] (https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), ki hranijo vrednosti obeh ročajev. Tako kot lastnost [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) standardnih drsnikov je tudi te mogoče vnaprej nastaviti.
sv: Två nya egenskaper är viktiga att hålla i minnet: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) och [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), som innehåller de två greppens värden. Liksom egenskapen [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) i de vanliga skjutreglagen kan de ställas in i förväg.
uk: Слід звернути увагу на дві нові властивості: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) і [second.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#second-prop), у яких зберігаються значення для двох елементів керування. Подібно до властивості [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) стандартних повзунків, ці значення цих властивостей можна вказати наперед.

source: ![A window showing a range slider, followed by a few labels underneath and a button with a checkmark icon](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
ca: ![Una finestra que mostra un control lliscant amb intervals, seguit de diverses etiquetes a sota i un botó amb una icona de marca de selecció](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
eo: ![Fenestro montranta gamo-glitilon, sekvitan de kelkaj etikedoj sube kaj butono kun markpiktogramo](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
nl: ![Een venster dat een schuifregelaar met een reeks toont met een paar labels eronder en een knop met aanvinkpictogram](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
sl: ![Okno, ki prikazuje drsnik obsega, ki mu sledi nekaj oznak pod njim in gumb z ikono kljukice](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
sv: ![Ett fönster som visar ett intervallreglage, följt av några beteckningar under det och en knapp med en bockikon](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)
uk: ![Вікно, у якому показано повзунок діапазону, піда яким розміщено декілька міток і кнопку з піктограмою позначки](/docs/getting-started/kirigami/components-controls/controls-rangeslider.webp)

source: Dialog types
ca: Tipus de diàlegs
eo: Tipoj de dialogoj
es: Tipos de diálogos
nl: Dialoogtypen
sl: Vrste dialogov
sv: Typer av dialogrutor
uk: Типи вікон

source: Various ways to serve and input data.
ca: Diverses maneres de servir i introduir dades.
eo: Diversaj manieroj servi kaj enigi datumojn.
es: Diversos modos de servir e introducir datos.
nl: Verschillende manieren om gegevens te dienen en in te voeren.
sl: Različni načini serviranja in vnosa podatkov.
sv: Diverse sätt att erbjuda och mata in data.
uk: Різноманітні способи обслуговувати і вводити дані.

source: A [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog) is a simple component that you can use to supplement the content being displayed on an application's page. It can display non-interactive content (only text) and interactive content (forms, listviews and buttons).
ca: Un [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.Dialog) és un component individual que es pot utilitzar per a complementar el contingut que es mostra a una pàgina d'aplicació. Poden mostrar contingut no interactiu (només text) i contingut interactiu (formularis, vistes de llistes i botons).
sl: [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog) je preprosta komponenta, ki jo lahko uporabite za dopolnitev vsebine, prikazane na strani aplikacije. Prikazuje lahko neinteraktivno vsebino (samo besedilo) in interaktivno vsebino (obrazci, pogledi seznamov in gumbi).

source: They can be dismissed by clicking or tapping outside of their area or by clicking the close button on the header.
ca: Es poden descartar fent clic o tocant fora de la seva àrea, o fent clic sobre la icona del botó de tancament en la capçalera.
eo: Ili povas esti forigitaj klakante aŭ frapetante ekster sia areo aŭ klakante la fermbutonon sur la kaplinio.
es: Se pueden descartar haciendo clic o tocando fuera de su área o pulsando el botón de cerrar del encabezado.
nl: Ze kunnen afgewezen worden door te klikken of te tikken buiten hun gebied of door op de sluitknop te klikken in de kop.
sl: Lahko jih opustite tako, da kliknete ali tapnete zunaj njihovega območja ali tako, da kliknete gumb za zapiranje v glavi.
sv: De kan avfärdas genom att klicka eller röra utanför deras område, eller genom att klicka på stängningsknappen i namnlisten.
uk: Їх можна закривати клацанням або торканням поза областю накладки, а також натисканням кнопки закриття на панелі заголовка.

source: Dialog
ca: Diàleg
eo: Dialogo
nl: Dialoog
sv: Dialogruta
uk: Діалогове вікно

source: A standard [Kirigami.Dialog](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html) is used to create custom dialogs. They are very easy to extend:
ca: S'utilitza un [Kirigami.Dialog](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html) estàndard per a crear diàlegs personalitzats. Són molt fàcils d'ampliar:

source: ![Simple dialog containing only text](dialog.webp)
ca: ![Diàleg senzill que només conté text](dialog.webp)
eo: ![Simpla dialogo enhavanta nur tekston](dialog.webp)
es: ![Diálogo sencillo que solo contiene texto](dialog.webp)
nl: ![Eenvoudige dialoog met alleen tekst](dialog.webp)
sl: ![Enostavno pogovorno okno, ki vsebuje samo besedilo](dialog.webp)
sv: ![Enkel dialogruta som bara innehåller text](dialog.webp)
uk: ![Просте діалогове вікно, у якому міститься лише текст](dialog.webp)

source: As shown in the [introduction tutorial about dialogs](/docs/getting-started/kirigami/introduction-dialogs), it is also possible to capture a `standardButton(button)` to assign some behavior to it, like a binding to enable it only under certain conditions.
ca: Com es mostra en el [guia d'aprenentatge d'introducció sobre els diàlegs](/docs/getting-started/kirigami/introduction-dialogs), també és possible capturar un `standardButton(button)` per a assignar-li algun comportament, com una vinculació per a habilitar-lo només sota certes condicions.
eo: Kiel montrite en la [enkonduka lernilo pri dialogoj](/docs/getting-started/kirigami/introduction-dialogs), estas ankaŭ eble kapti `standardButton(button)` por atribui iun konduton al ĝi, kiel ligado por ebligi ĝi nur sub certaj kondiĉoj.
nl: Zoals getoond in de [introductie handleiding over dialogen](/docs/getting-started/kirigami/introduction-dialogs) is het ook mogelijk een `standardButton(button)` te vangen om er enig gedrag aan toe te kennen, zoals een binding om het alleen in te schakelen onder bepaalde condities.
sl: Kot je prikazano v [uvodnem učbeniku o pogovornih oknih](/docs/getting-started/kirigami/introduction-dialogs), je mogoče zajeti tudi `standardButton(button)`, da mu dodelite neko vedenje, na primer vezavo za omogočanje le pod določenimi pogoji.
sv: Som visas i [introduktionshandledningen om dialogrutor(/docs/getting-started/kirigami/introduction-dialogs), är det också möjligt att hantera en `standardButton(button)` för att tilldela något beteende till den, som en bindning för att endast aktivera den under vissa förutsättningar.
uk: Як показано у [вступній частині підручника щодо діалогових вікон](/docs/getting-started/kirigami/introduction-dialogs), також можна захопити `standardButton(button)` для пов'язування з нею певної поведінки, зокрема прив'язкою її вмикання до певних умов.

source: This type of dialog is generic and applies to most use cases, and it works well with complex interactive content (especially views):
ca: Aquest tipus de diàleg és genèric i s'aplica a la majoria dels casos d'ús, i funciona bé amb contingut interactiu complex (especialment vistes):
eo: Ĉi tiu speco de dialogo estas ĝenerala kaj validas por plej multaj uzkazoj, kaj ĝi funkcias bone kun kompleksa interaga enhavo (precipe vidoj):
es: Este tipo de diálogo es genérico y se aplica a la mayoría de los casos de uso, y funciona bien con contenido interactivo complejo (especialmente vistas):
nl: Dit type dialoog is generieke en is van toepassing op de meeste gebruiksgevallen en het werkt goed met complexe interactieve inhoud (speciaal weergaven):
sl: Ta vrsta pogovornega okna je splošna in velja za večino primerov uporabe ter dobro deluje s kompleksno interaktivno vsebino (zlasti s pogledi):
sv: Den här typen av dialogrutor är generell och gäller för de flesta användarfall, och den fungerar bra med komplext interaktivt innehåll (särskilt vyer):
uk: Цей тип діалогових вікон є загальним і застосовним у більшості випадків. Він добре працює із складним інтерактивним вмістом (особливо, панелями перегляду):

source: hints for the dialog dimensions
ca: consells per a les dimensions del diàleg
eo: sugestoj por la dialogaj dimensioj
es: sugerencias para las dimensiones del diálogo
nl: tips voor afmetingen van de dialoog
sl: namigi za dimenzije pogovornega okna
sv: tips om dialogrutans dimensioner
uk: підказки щодо розмірів діалогового вікна

source: ![A simple scrollable dialog](scrollabledialog.webp)
ca: ![Un diàleg desplaçable senzill](scrollabledialog.webp)
eo: ![Simpla rulebla dialogo](scrollabledialog.webp)
es: ![Un sencillo diálogo que se puede desplazar](scrollabledialog.webp)
nl: ![Een eenvoudige schuifbare dialoog](scrollabledialog.webp)
sl: ![Preprosto drsno pogovorno okno](scrollabledialog.webp)
sv: ![En enkel rullningsbar dialogruta](scrollabledialog.webp)
uk: ![Просте діалогове вікно з гортанням](scrollabledialog.webp)

source: In most cases however you will likely want to use one of its derived dialog types, [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) or [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog).
ca: Tanmateix, en la majoria dels casos probablement voldreu utilitzar un dels seus tipus de diàleg derivats, [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) o [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog).

source: A [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) is essentially a dialog with a built-in label and default [contentPadding](https://api.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#contentPadding-prop) that is used to prompt the user for some information. This type of dialog is supposed to be used only for simple yes/no prompts or brief requests for user input.
ca: Un [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) és essencialment un diàleg amb una etiqueta integrada i el [contentPadding](https://api.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#contentPadding-prop) predeterminat que s'utilitza per a demanar a l'usuari alguna informació. Se suposa que aquest tipus de diàleg només s'utilitzarà per a indicadors ssenzills sí/no o sol·licituds breus d'entrada de l'usuari.

source: Its main property is [Kirigami.Dialog.subtitle](https://api.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#subtitle-prop), to which you would add text. If any QML component is added as a child of the prompt dialog, that component will take the place of the subtitle instead.
ca: La seva propietat principal és [Kirigami.Dialog.subtitle](https://api.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#subtitle-prop), al qual afegireu text. Si s'afegeix qualsevol component QML com a fill del diàleg de l'indicador, aquest component ocuparà el lloc del subtítol.

source: ![A simple prompt dialog containing only text](promptdialog.webp)
ca: ![Un diàleg senzill d'indicador que només conté text](promptdialog.webp)
eo: ![Simpla prompta dialogo enhavanta nur tekston](promptdialog.webp)
es: ![Un diálogo sencillo de introducción de datos que solo contiene texto](promptdialog.webp)
nl: ![Een eenvoudige promptdialoog die alleen tekst bevat](promptdialog.webp)
sl: ![Preprosto pogovorno okno, ki vsebuje samo besedilo](promptdialog.webp)
sv: ![En enkel frågedialogruta som bara innehåller text](promptdialog.webp)
uk: ![Просте діалогове вікно із запитом, у якому міститься лише текст](promptdialog.webp)

source: ![A PromptDialog with a custom TextField](promptdialogtextfield.webp)
ca: ![Un PromptDialog amb un TextField personalitzat](promptdialogtextfield.webp)
eo: ![PromptDialog kun propra TextField](promptdialogtextfield.webp)
es: ![Un PromptDialog con un TextField personalizado](promptdialogtextfield.webp)
nl: ![Een PromptDialog met een aangepast TextField](promptdialogtextfield.webp)
sl: ![Pogovorno okno z besedilnim poljem po meri](promptdialogtextfield.webp)
sv: ![En PromptDialog med eget TextField](promptdialogtextfield.webp)
uk: ![PromptDialog із нетиповим TextField](promptdialogtextfield.webp)
