Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![Screenshot of a CardsGridView where each card occupies the same amount of space in a grid](/docs/getting-started/kirigami/components-card/cardsgridview.png)
pt: ![Imagem de um CardsGridView, onde cada cartão ocupa a mesma quantidade de espaço numa grelha](/docs/getting-started/kirigami/components-card/cardsgridview.png)

source: ![A window containing a button "Beep" on the upper left side, which when clicked shows a passive notification "Boop" at the bottom of the window](/docs/getting-started/kirigami/components-controls/controls-button.png)
pt: ![Uma janela que contém um botão "Beep" no canto superior esquerdo que, ao ser carregada, mostra uma notificação passiva "Boop" no fundo da janela](/docs/getting-started/kirigami/components-controls/controls-button.png)

source: The behavior of buttons can be changed to make them toggleable: in this mode, they will stay pressed until clicked on once more. This mode can be activated by setting their [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) property to `true`; we can also set buttons to be toggled on by default by setting [checked](https://doc.qt.io/qt-5/qml-qtquick-controls2-abstractbutton.html#checked-prop) to `true`.
pt: O comportamento dos botões poderá ser alterado para os tornar comutáveis: neste modo, os mesmos ficarão carregados até que volte a carregar neles. Este modo poderá ser activado com a propriedade [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) configurada como `true`; poderemos também configurar os botões para ficarem activos por omissão se configurarmos a propriedade [checked](https://doc.qt.io/qt-5/qml-qtquick-controls2-abstractbutton.html#checked-prop) como `true`.

source: We can get the most out of toggleable buttons by using the `onCheckedChanged` signal handler which is [automatically generated](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) from the [checked](https://doc.qt.io/qt-5/qml-qtquick-controls2-abstractbutton.html#checked-prop) signal. It works similarly to `onClicked`, except here the assigned action will be executed when the button's state changes. It is a boolean property, which can come in handy for specific use cases.
pt: Poderemos obter o máximo dos botões comutáveis se usarmos a rotina de evento `onCheckedChanged`, que é [gerada automaticamente](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) a partir do evento [checked](https://doc.qt.io/qt-5/qml-qtquick-controls2-abstractbutton.html#checked-prop). Funciona de forma semelhante ao `onClicked`, excepto que a acção atribuída será executada quando o estado do botão. Esta é uma propriedade booleana, a qual poderá ser útil para alguns casos de uso específicos.

source: ![A window containing a toggleable button "Toggle" which when toggled displays "Peekaboo" in the contentItem area like a status bar](/docs/getting-started/kirigami/components-controls/controls-togglebutton.png)
pt: ![Uma janela que contém um botão comutável "Toggle" que, quando muda de estado apresenta "Peekaboo" na área do 'contentItem', como uma barra de estado](/docs/getting-started/kirigami/components-controls/controls-togglebutton.png)

source: ![A window showing a tool button "Tool beep" which is completely flat](/docs/getting-started/kirigami/components-controls/controls-toolbutton.png)
pt: ![Uma janela que mostra um botão de ferramenta "Tool beep", que é completamente plano](/docs/getting-started/kirigami/components-controls/controls-toolbutton.png)

source: ![A window showing a set of checkboxes where more than one checkbox can be ticked at the same time](/docs/getting-started/kirigami/components-controls/controls-checkbox.png)
pt: ![Uma janela que mostra um conjunto de opções de marcação, onde mais que uma opção poderá ser assinalada ao mesmo tempo](/docs/getting-started/kirigami/components-controls/controls-checkbox.png)

source: ![A window showing a set of radio buttons where only one radio button can be ticked at the same time](/docs/getting-started/kirigami/components-controls/controls-radiobutton.png)
pt: ![Uma janela que mostra um conjunto de botões de opções exclusivas, onde só um destes botões pode estar assinalado ao mesmo tempo](/docs/getting-started/kirigami/components-controls/controls-radiobutton.png)

source: ![A window showing a set of switches that function as toggles](/docs/getting-started/kirigami/components-controls/controls-switch.png)
pt: ![Uma janela que mostra um conjunto de interruptores que funcionam como comutadores](/docs/getting-started/kirigami/components-controls/controls-switch.png)

source: [to](https://doc.qt.io/qt-5/qml-qtquick-controls2-slider.html#to-prop): defines the range of the slider by specifying the maximum value it can go to
pt: [to](https://doc.qt.io/qt-5/qml-qtquick-controls2-slider.html#to-prop): define o intervalo da barra, configurando o valor máximo até onde poderá ir

source: [orientation](https://doc.qt.io/qt-5/qml-qtquick-controls2-slider.html#orientation-prop): allows the slider to be set to a vertical orientation with `Qt.Vertical`
pt: [orientation](https://doc.qt.io/qt-5/qml-qtquick-controls2-slider.html#orientation-prop): permite à barra ser disposta numa posição vertical com o `Qt.Vertical`

source: ![A window showing a set of sliders, one horizontal and one vertical](/docs/getting-started/kirigami/components-controls/controls-sliders.png)
pt: ![Uma janela que mostra um conjunto de barras deslizantes, uma horizontal e uma vertical](/docs/getting-started/kirigami/components-controls/controls-sliders.png)

source: ![A window showing a set of tickmarked sliders that are symmetrically divided, with each division being called a step](/docs/getting-started/kirigami/components-controls/controls-tickmarkedsliders.png)
pt: ![Uma janela que mostra um conjunto de barras deslizantes com traços marcados que estão divididos de forma simétrica, onde cada divisão é chamada de 'passo'](/docs/getting-started/kirigami/components-controls/controls-tickmarkedsliders.png)

source: Two new properties are important to keep in mind: [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) and [second.value](https://doc.qt.io/qt-5/qml-qtquick-controls2-rangeslider.html#second-prop), which hold the values of the two handles. Like the [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) property of the standard sliders, these can be pre-set.
pt: Existem duas propriedades novas a ter em mente: o [first.value](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#first-prop) e o [second.value](https://doc.qt.io/qt-5/qml-qtquick-controls2-rangeslider.html#second-prop), que guardam os valores das duas pegas. Como na propriedade [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop) das barras normais, estas podem ser predefinidas.

source: ![A window showing a set of range sliders with two movable circles used to delimit a certain range](/docs/getting-started/kirigami/components-controls/controls-rangesliders.png)
pt: ![Uma janela que mostra um conjunto de barras deslizantes com intervalos, com dois círculos amovíveis que são usados para delimitar um dado intervalo](/docs/getting-started/kirigami/components-controls/controls-rangesliders.png)

source: We can also make it a tickmarked slider by setting the [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#stepSize-prop) property value to a number, in the exact same way as a standard slider.
pt: Também a poderemos transformar numa barra com traços, configurando o valor da propriedade [stepSize](https://doc.qt.io/qt-6/qml-qtquick-controls2-rangeslider.html#stepSize-prop) com algum número, da mesma forma que faríamos com uma barra deslizante normal.

source: ![Screenshot of a global drawer in desktop mode that looks like a sidebar](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.png)
pt: ![Imagem de uma área global no modo para computador, que se assemelha a uma barra lateral](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.png)

source: By default, banners are only visible on mobile environments. You can change this by setting the global drawer component's [bannerVisible](docs:kirigami2;GlobalDrawer) property to `true`.
pt: Contudo, por omissão, os separadores são ficam visíveis em dispositivos móveis. Poderá alter isto se mudar a propriedade [bannerVisible](docs:kirigami2;GlobalDrawer) do componente da área global como `true` (verdadeiro).

source: Titles, set with the [title](docs:kirigami2;GlobalDrawer::title) property, can be used to pretty up your global drawer and make it seem less sparse. More importantly, it can remind your users that this is a global and app-wide drawer rather than a local drawer.
pt: Os títulos, definidos com a propriedade [title](docs:kirigami2;GlobalDrawer::title), poderão ser usados para embelezar a sua área global e torná-la menos esparsa. De forma mais importante, poderá recordar os seus utilizadores de que esta é uma área da aplicação em vez de ser uma área local.

source: There is also a [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) property, which can be paired with your title to make the global drawer even more aesthetically pleasing. This icon will be placed to the left of the title.
pt: Existe também uma propriedade [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon), a qual poderá ser emparelhada com o seu título para tornar a área global ainda mais agradável a nível estético. Este ícone aparecerá à esquerda do título.

source: Global drawer with title and icon in banner
pt: Área global com um título e um ícone no separador

source: On mobile, the drawer always consists of actions hidden behind a hamburger menu. It can be activated by tapping the hamburger menu or by swiping from the right edge to the middle of the screen in Left to Right mode or from the left edge in Right to Left mode. If you are on a desktop and want to test the mobile interface, you can run your application with the environment variable `QT_QUICK_CONTROLS_MOBILE=1`.
pt: Em dispositivos móveis, a área consiste sempre nas acções escondidas atrás do menu em hambúrguer. Pode ser activado se tocar no menu em hambúrguer ou deslizando o dedo do lado direito para o centro do ecrã, caso esteja no modo da Esquerda para a Direita, ou do lado esquerdo para o centro, se tiver no modo inverso. Se estiver numa computador e quiser experimentar a interface para dispositivos móveis, poderá executar a sua aplicação com a variável de ambiente `QT_QUICK_CONTROLS_MOBILE=1`.

source: Modal drawers darken the rest of the application and, like [overlay sheets](docs:kirigami2;OverlaySheet), will be dismissed when clicking on a darkened area.
pt: As área modais escurecem o resto da aplicação e, como nas [folhas sobrepostas](docs:kirigami2;OverlaySheet), irão desaparecer quando carregar numa área escura.

source: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) controls whether the drawer will be modal or inline depending on a boolean value
pt: O [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) controla se a área será global ou incorporada, dependendo deste valor booleano

source: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) controls which edge of the application window the drawer will appear on; options for this property are part of the [Edge enum](docs:qtcore;Qt::RightEdge), namely `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge`, and `Qt.LeftEdge`
pt: O [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) controla em qual dos extremos da janela da aplicação a área irá aparecer; as opções para esta propriedade são `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` e `Qt.LeftEdge`, fazendo parte do [tipo enumerado Edge](docs:qtcore;Qt::RightEdge)

source: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) contains the component that will form the content of your drawer
pt: O [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) contém o componente que irá formar o conteúdo da sua área

source: Modal drawer on the bottom edge of the screen
pt: Área modal no extremo inferior do ecrã

source: Inline drawer on the bottom edge of the screen
pt: Área incorporada no extremo inferior do ecrã

source: A use case for bottom overlay drawers: NeoChat
pt: Um caso de uso para áreas inferiores sobrepostas: NeoChat

source: NeoChat uses bottom overlay drawers to provide the user with a number of actions they can perform on a message they have long pressed. Here is a simplified example of what that looks like:
pt: O NeoChat usa áreas sobrepostas inferiores para fornecer ao utilizador um conjunto de acções que eles poderão executar sobre uma mensagem na qual tenham carregado de forma prolongada. Este é um exemplo simplificado do que iria aparecer:

source: ![A simple listview](/docs/getting-started/kirigami/components-listview/listview-simple.png)
pt: ![Uma lista simples](/docs/getting-started/kirigami/components-listview/listview-simple.png)

source: In cases where your model data only contain a single piece of data, like in the example above, you can just grab the data in the model by referencing [modelData](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html#models).
pt: Nos casos em que os dados do seu modelo só contêm um dado individual, como exemplo acima, simplesmente poderá capturar os dados do modelo, usando como referência o [modelData](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html#models).

source: Kirigami offers a number of components that have been designed specifically for use in list views, such as [Kirigami.BasicListItem](docs:kirigami2;BasicListItem), [Kirigami.CheckableListItem](docs:kirigami2;CheckableListItem) and [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem), all of which build upon [Kirigami.AbstractListItem](docs:kirigami2;AbstractListItem). There are also [Kirigami.CheckDelegate](docs:kirigami2;CheckDelegate), [Kirigami.RadioDelegate](docs:kirigami2;RadioDelegate), and [Kirigami.SwitchDelegate](docs:kirigami2;SwitchDelegate), which are designed to take advantage of those specific controls.
pt: O Kirigami oferece um conjunto de componentes que foram desenhados de forma específica para serem usados em listas, como o [Kirigami.BasicListItem](docs:kirigami2;BasicListItem), o [Kirigami.CheckableListItem](docs:kirigami2;CheckableListItem) e o [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem), os quais se baseiam no [Kirigami.AbstractListItem](docs:kirigami2;AbstractListItem). Também existem o [Kirigami.CheckDelegate](docs:kirigami2;CheckDelegate), o [Kirigami.RadioDelegate](docs:kirigami2;RadioDelegate) e o [Kirigami.SwitchDelegate](docs:kirigami2;SwitchDelegate), que estão desenhados para tirar partido destes controlos específicos.

source: However, you are not limited to using these components and you can choose whichever ones you wish. This may require some tweaking of your layout.
pt: Contudo, não está limitado a usar estes componentes e poderá escolher os que deseja. Contudo, isto pode significar algumas afinações na sua disposição.

source: In some cases, you might want to use a list view that is empty until the user does something. In these situations, using a [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) can be an attractive way of telling your user that the list is empty and that they can do something about it.
pt: Em alguns casos, poderá querer usar uma lista que está vazia até que o utilizador faça algo. Nesses casos, o uso de uma [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) pode ser uma forma atraente de dizer ao seu utilizador que a lista está vazia e que poderão fazer algo quanto a isso.

source: You will generally want to place a placeholder message in the center of the ListView and you will likely not want it to span the entire width of the ListView. You will obviously also want it to be hidden once the ListView's model becomes populated with data. Thankfully, ListViews have a property named [count](https://doc.qt.io/qt-6/qml-qtquick-listview.html#count-prop) that makes doing this quite easy.
pt: Irá querer geralmente colocar uma PlaceholderMessage no centro da ListView e também irá querer que a mesma não ocupe a largura total da ListView. Também irá querer que não apareça visível assim que o modelo da ListView comece a ser preenchido com dados: felizmente, as ListViews têm uma propriedade chamada [count](https://doc.qt.io/qt-6/qml-qtquick-listview.html#count-prop) que facilita isto em grande medida.

source: You might also want to add a helpful action to your placeholder message. This can be done by attaching an action to the [PlaceholderMessage.helpfulAction](docs:kirigami2;PlaceholderMessage::helpfulAction) property.
pt: Também poderá querer adicionar uma acção útil à sua mensagem de substituição. Isto poderá ser feito se adicionar uma acção à propriedade [PlaceholderMessage.helpfulAction](docs:kirigami2;PlaceholderMessage::helpfulAction).

source: ![An empty list view which displays a placeholder message in the middle of the application together with an action to add new data to the model](/docs/getting-started/kirigami/components-listview/listview-placeholdermessage.png)
pt: ![Uma lista com uma mensagem de substituição no meio da aplicação, em conjunto com uma acção para adicionar dados novos ao modelo](/docs/getting-started/kirigami/components-listview/listview-placeholdermessage.png)

source: A [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet) is a simple component that you can use to supplement the content being displayed on an application's page. They are designed to display long, vertical content and can accommodate content longer than the application window itself.
pt: Os objectos [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet) fornecem um componente simples que poderá usar para complementar o conteúdo que aparece na página de uma aplicação. As mesmas são usadas para mostrar conteúdos extensos e verticais, podendo englobar conteúdos maiores que a janela da aplicação propriamente dita.

source: ![Simple overlay sheet containing only text](/docs/getting-started/kirigami/components-overlaysheets/sheet_simple.png)
pt: ![Folha sobreposta simples, que contém apenas texto](/docs/getting-started/kirigami/components-overlaysheets/sheet_simple.png)

source: Overlay sheets come with methods we can use to [open()](docs:kirigami2;templates::OverlaySheet::open) or [close()](docs:kirigami2;templates::OverlaySheet::close) them as we see fit. By default overlay sheets are hidden, so at the very least we will need to use the `open()` method.
pt: As folhas sobrepostas vêm com métodos que podemos usar para abrir [open()](docs:kirigami2;templates::OverlaySheet::open) ou fechar [close()](docs:kirigami2;templates::OverlaySheet::close) de acordo com as nossas necessidades. Por omissão, as folhas sobrepostas ficam escondidas, por isso no mínimo iremos necessitar de usar o método `open()`.

source: When opened, this overlay sheet will appear centered vertically and horizontally within its parent page. Horizontally it will be bounded by its parent even if the width of its contents exceeds its parent's. If the sheet's vertical length exceeds its parent's, then the sheet will be displayed starting from its top position, and will be scrollable.
pt: Quando for aberta, esta folha sobreposta irá aparecer centrada na horizontal e na vertical dentro da sua página-mãe. A nível horizontal, ficará limitada pelo seu elemento-pai, mesmo que a largura do seu conteúdo ultrapasse o do seu pai. Se a altura vertical da folha ultrapassar a do seu elemento-pai, a folha será então apresentada na sua posição de topo, tendo uma barra de deslocamento.

source: If you want to display the sheet as a global sheet—one that spans across the entire width of the application, regardless of the page it is a child to—we have to reparent our overlay sheet to our application window's overlay property. We can do this with the [parent](https://doc.qt.io/qt-6/qml-qtquick-item.html#parent-prop) property.
pt: Se quiser apresentar a folha como global — uma que apareça em toda a largura da aplicação, independentemente da página de quem é filha — teremos de alterar o pai para a propriedade de folha sobreposta da janela da nossa aplicação. Poderemos fazer isso com a propriedade [parent](https://doc.qt.io/qt-6/qml-qtquick-item.html#parent-prop) .

source: A sheet is greedy and will take the maximum amount of available width in a page if needed. We can avoid this by specifying an [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) or a [Layout.preferredWidth](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html#preferredWidth-attached-prop) for its child elements, which will limit how much the sheet will grow width wise.
pt: Uma folha é "egoísta" e irá tentar apanhar a quantidade máxima de largura disponível numa página se necessário. Podemos evitar este comportamento se definirmos uma [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) ou uma [Layout.preferredWidth](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html#preferredWidth-attached-prop) para os seus elementos-filhos, o que irá limitar quanto é que a folha irá crescer a nível de largura.

source: Overlay sheets come by default with a [header](docs:kirigami2;templates::OverlaySheet::header) that only contains a button for closing our overlay sheet. We can add a [Kirigami.Heading](docs:kirigami2;Heading) as a title in our [header](docs:kirigami2;templates::OverlaySheet::header) to make it easy for users to understand what the sheet is for. This is done by setting `header` to contain our heading component.
pt: As folhas sobrepostas vêm por omissão com um cabeçalho que só contém um botão para fechar a nossa folha sobreposta. Poderemos adicionar um [Kirigami.Heading](docs:kirigami2;Heading) como título para o nosso [header](docs:kirigami2;templates::OverlaySheet::header), de forma a facilitar aos utilizadores compreender para que serve a folha. Isto é feito se configurar a propriedade `header` de forma a conter o nosso componente de cabeçalho do Kirigami.

source: ![Overlay sheet with title text in its header area](/docs/getting-started/kirigami/components-overlaysheets/sheet_header.png)
pt: ![Folha sobreposta com o texto do título na sua área de cabeçalho](/docs/getting-started/kirigami/components-overlaysheets/sheet_header.png)

source: We can also provide our overlay sheet with a [footer](docs:kirigami2;templates::OverlaySheet::footer). Footers in overlay sheets are quite flexible, but most often they are used to provide overlay sheets with some sort of quick interactive input similar to that provided by modal dialogs (e.g. buttons for "Apply", "Ok", "Cancel", "Close", etc.)
pt: Também poderemos providenciar um [footer](docs:kirigami2;templates::OverlaySheet::footer) à nossa folha sobreposta. Os rodapés nas folhas sobrepostas são bastante flexíveis, mas normalmente são usados para fornecer folhas sobrepostas com algum tipo de interacção semelhante ao fornecido pelas janelas modais (p.ex., botões para "Aplicar", "OK", "Cancelar", "Fechar", etc.)

source: ![Overlay sheet with a button in its footer area](/docs/getting-started/kirigami/components-overlaysheets/sheet_footer.png)
pt: ![Folha sobreposta com um botão na sua área de rodapé](/docs/getting-started/kirigami/components-overlaysheets/sheet_footer.png)
