Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Next time you want to create the files and folders needed, you can use [KAppTemplate](https://apps.kde.org/kapptemplate) or [KDevelop](https://apps.kde.org/kdevelop/) to automatically generate a suitable project to start from. They are available from each major distribution's repositories. These applications will also generate files containing [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) metadata and a `.desktop` file that contains information about how the application should be displayed in a linux application launcher.
ca: La pròxima vegada que vulgueu crear els fitxers i carpetes necessaris, podreu fer servir [KAppTemplate](https://apps.kde.org/kapptemplate) o el [KDevelop](https://apps.kde.org/kdevelop/) per a generar automàticament un projecte adequat per a començar. Estan disponibles en els repositoris de cada distribució. Aquestes aplicacions també generaran els fitxers que contenen les metadades d'[AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) i un fitxer `.desktop` que conté la informació sobre com s'ha de mostrar l'aplicació en un llançador d'aplicacions del Linux.
eo: Venontfoje kiam vi volas krei la necesajn dosierojn kaj dosierujojn, vi povas uzi [KAppTemplate](https://apps.kde.org/kapptemplate) aŭ [KDevelop](https://apps.kde.org/kdevelop/) por aŭtomate generi taŭgan projekton por komenci. Ili estas haveblaj de la deponejoj de ĉiu grava distribuo. Ĉi tiuj aplikoj ankaŭ generos dosierojn enhavantajn [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) metadatenojn kaj `.desktop` dosieron kiu enhavas informojn pri kiel la aplikaĵo. devus esti montrita en linuksa aplika lanĉilo.
es: La próxima vez que quiera crear los archivos y las carpetas necesarios, puede usar [KAppTemplate](https://apps.kde.org/kapptemplate) o [KDevelop](https://apps.kde.org/kdevelop/) para generar automáticamente un proyecto adecuado con el que empezar. Están disponibles en los repositorios de las principales distribuciones. Estas aplicaciones también generarán archivos que contienen metadatos de [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) y un archivo `.desktop` que contiene información sobre cómo se debe mostrar la aplicación en un lanzador de aplicaciones de Linux.
nl: De volgende keer dat u de benodigde bestanden en mappen aanmaakt, kunt u [KAppTemplate](https://apps.kde.org/kapptemplate) of [KDevelop](https://apps.kde.org/kdevelop/) gebruiken om automatisch een geschikt project te beginnen. Ze zijn beschikbaar vanuit elke belangrijke opslagruimte van distributies. Deze toepassingen zullen ook bestanden genereren met metagegevens [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) en een bestand `.desktop` die informatie over hoe de toepassing getoond zou moeten worden in een toepassingenstarter van linux.
pt: Da próxima vez que quiser criar os ficheiros e pastas necessários, poderá usar o [KAppTemplate](https://apps.kde.org/kapptemplate) ou o [KDevelop](https://apps.kde.org/kdevelop/) para gerar automaticamente um projecto adequado para servir de ponto de partida. Os mesmos estão disponíveis nos repositórios das várias distribuições principais. Estas aplicações irão também gerar ficheiros que contêm meta-dados de [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) e um ficheiro `.desktop` que contém informações sobre como a aplicação deverá ser apresentada num lançador de aplicações em Linux.
sl: Ko želite naslednjič ustvariti potrebne datoteke in mape, lahko uporabite [KAppTemplate](https://apps.kde.org/kapptemplate) ali KDevelop](https://apps.kde.org/kdevelop/) za samodejno ustvarjanje primernega projekta za začetek. Na voljo so v skladiščih vsake večje distribucije. Te aplikacije bodo ustvarile tudi datoteke, ki vsebujejo metapodatke [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) in datoteko '.desktop', ki vsebuje informacije o tem, kako naj se aplikacija prikaže v zaganjalniku linux aplikacij.
sv: Nästa gång du vill skapa filerna och katalogerna som behövs, kan du använda [KAppTemplate](https://apps.kde.org/kapptemplate) eller [KDevelop](https://apps.kde.org/kdevelop/) för att automatiskt generera ett lämpligt projekt att starta med. De är tillgängliga från alla större distributioners arkiv. Programmen genererar också filer som innehåller [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) metadata och en `.desktop`-fil som innehåller information om hur programmet ska visas i en Linux programstart.
uk: Наступного разу, коли створюватимете потрібні файли і теки, можете скористатися [KAppTemplate](https://apps.kde.org/kapptemplate) або [KDevelop](https://apps.kde.org/kdevelop/) для автоматичного створення відповідної початкової версії проєкту. Ці програми є у сховищах усіх основних дистрибутивів. Крім того, ці програми створюють файли, що містять метадані [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) і файл `.desktop`, який містить дані щодо того, як слід показувати пункт програми у засобах запуску програм Linux.

source: Thanks to the magic of CMakeLists, you can also use IDEs such as KDevelop or [QtCreator](https://www.qt.io/product/development-tools) to develop this application within a comfortable environment with minimal effort.
ca: Gràcies a la màgia de CMakeLists, també podreu utilitzar un IDE com el KDevelop o el [QtCreator](https://www.qt.io/product/development-tools) per a desenvolupar aquesta aplicació dins d'un entorn còmode, amb un esforç mínim.
eo: Danke al la magio de CMakeLists, vi ankaŭ povas uzi IDEojn kiel KDevelop aŭ [QtCreator](https://www.qt.io/product/development-tools) por disvolvi ĉi tiun aplikaĵon en komforta medio kun minimuma penado.
es: Gracias a la magia de CMakeLists, también puede usar un IDE, como KDevelop o [QtCreator](https://www.qt.io/product/development-tools), para desarrollar esta aplicación dentro de un entorno confortable con el mínimo esfuerzo.
nl: Dankzij de magie van CMakeLists kunt u ook IDE's zoals KDevelop of [QtCreator](https://www.qt.io/product/development-tools) gebruiken om deze toepassing in een comfortabele omgeving met minimale inspanning te ontwikkelen.
pt: Graças à magia do CMakeLists, também poderá usar os IDE's como o KDevelop ou o [QtCreator](https://www.qt.io/product/development-tools) para desenvolver esta aplicação dentro de um ambiente confortável e com o mínimo esforço.
sl: Zahvaljujoč čarovniji CMakeLists lahko uporabite tudi razvojna okolja, kot sta KDevelop ali [QtCreator](https://www.qt.io/product/development-tools), da razvijete to aplikacijo v udobnem okolju z minimalnim naporom.
sv: Tack vare magin i CMakeLists, kan du också använda integrerade utvecklingsmiljöer såsom KDevelop eller [QtCreator](https://www.qt.io/product/development-tools) för att utveckla programmet i en bekväm miljö med minimal ansträngning.
uk: Завдяки магії CMakeLists, ви також можете скористатися комплексними середовищами розробки, зокрема KDevelop або [QtCreator](https://www.qt.io/product/development-tools) для подальшого написання програми у комфортному середовищі із мінімальними зусиллями.

source: Setup with Python
ca: Configuració amb el Python

source: Create your first Kirigami application with PySide
ca: Creeu la vostra primera aplicació Kirigami amb PySide
sl: Ustvarite svojo prvo aplikacijo Kirigami s PySide

source: Prerequisites
ca: Prerequisits
sl: Predpogoji

source: Before getting started, we will need to install Kirigami and PySide on our machine.
ca: Abans de començar, haurem d'instal·lar el Kirigami i el PySide a la nostra màquina.
sl: Preden začnemo, bomo morali namestiti Kirigami in PySide na naš računalnik.

source: If you are on a distribution with old PySide6 or PyQt6 packages, this tutorial works with [Building software with distrobox](/docs/getting-started/building/containers-distrobox).
ca: Si teniu en una distribució amb paquets antics de PySide6 o PyQt6, aquesta guia d'aprenentatge funciona amb [Construir programari amb distrobox](/docs/getting-started/building/containers-distrobox).
sl: Če uporabljate distribucijo s starimi paketi PySide6 ali PyQt6, ta vadnica deluje z [Building software with distrobox](/docs/getting-started/building/containers-distrobox).

source: First we create our project folder (you can use the commands below). We are going to call ours `kirigami_python/`.
ca: Primer crearem la nostra carpeta de projecte (podeu utilitzar les ordres de sota). L'anomenarem `kirigami_python/`.
sl: Najprej ustvarimo našo projektno mapo (uporabite lahko spodnje ukaze). Našo vadnico bomo imenovali `kirigami_python/`.

source: To add our QML files
ca: Per a afegir els nostres fitxers QML
sl: Za dodajanje naših datotek QML

source: The main file to manage the project
ca: El fitxer principal per a gestionar el projecte
sl: Glavna datoteka za upravljanje projekta

source: To import the src/ directory as a package
ca: Per a importar el directori src/ com a paquet
sl: Za uvoz imenika src/ kot paket

source: To signal app as the entrypoint
ca: Per a assenyalar l'aplicació com a punt d'entrada
sl: Za signalizacijo aplikacije kot vstopne točke

source: The package name is going to be `kirigami_python`, the "executable" (console script) will be called `kirigami_hello`, and the entrypoint will be `app`.
ca: El nom del paquet serà `kirigami_python`, l'«executable» (script de consola) s'anomenarà `kirigami_hello` i el punt d'entrada serà `app`.
sl: Ime paketa bo `kirigami_python`, "izvršljiva datoteka" (konzolni skript) se bo imenovala `kirigami_hello`, in vstopna točka bo `app`.

source: To quickly generate this folder structure, just run: `mkdir -p kirigami_python/src/qml/`.
ca: Per a generar ràpidament aquesta estructura de carpetes, simplement executeu: `mkdir -p kirigami_python/src/qml/`.
sl: Če želite hitro ustvariti to strukturo map, kar zaženite: `mkdir -p kirigami_python/src/qml/`.

source: For a more comprehensive project that goes into further detail about this file structure, see [Full project in Python + Kirigami](/docs/getting-started/python/python-app).
ca: Per a un projecte més complet que entri en més detalls sobre aquesta estructura de fitxers, vegeu [Projecte complet en Python + Kirigami](/docs/getting-started/python/python-app).
sl: Za bolj obsežen projekt, ki gre v nadaljnje podrobnosti s to strukturo datoteke, glejte [Celoten projekt v Python + Kirigami](/docs/getting-started/python/python-app).

source: Modern Python applications need only a single TOML file to specify all metadata, package information and dependencies as of [PEP 621](https://peps.python.org/pep-0621/). The following serves as a good starter for an application and can be extended later.
ca: Les aplicacions Python modernes només necessiten un sol fitxer TOML per a especificar totes les metadades, la informació del paquet i les dependències a partir del [PEP 621](https://peps.python.org/pep-0621/). El següent serveix com un bon iniciador per a una aplicació i es pot ampliar més tard.
sl: Sodobne aplikacije Python potrebujejo samo eno datoteko TOML, da določijo vsemetapodatke, informacije o paketu in odvisnosti od [PEP 621](https://peps.python.org/pep-0621/). Naslednje služi kot dober začetek za aplikacijo in se lahko kasneje podaljša.

source: Most of the contents in this file are boilerplate, and a more complete version of it can be seen in [Python with Kirigami: General Structure](/docs/getting-started/python/python-package#general-structure).
ca: La major part del contingut d'aquest fitxer és estàndard, i es pot veure una versió més completa d'ell a [Python amb el Kirigami: Estructura general](/docs/getting-started/python/python-package#general-structure).
sl: Večina vsebine v tej datoteki je okvirna in njeno bolj popolno različico si lahko ogledate v [Python with Kirigami: General Structure](/docs/getting-started/python/python-package#general-structure).

source: Note the highlighted lines. As mentioned under [Project structure](#project-structure), the name of the package is `kirigami_python`, the name of the executable is `kirigami_hello`, and the name of the entrypoint is `app`. In particular, the following should be noted:
ca: Tingueu en compte les línies ressaltades. Com s'esmenta a [estructura del projecte](#project-structure), el nom del paquet és `kirigami_python`, el nom de l'executable és `kirigami_hello`, i el nom del punt d'entrada és `app`. En particular, cal destacar el següent:
sl: Upoštevajte osvetljene vrstice. Kot je navedeno pod [Project structure](#project-structure), je ime paketa je `kirigami_python`,ime izvršljive datoteke je `kirigami_hello`, ime vstopne točke je `app`. Zlasti je treba opozoriti na naslednje:

source: The project script consists of an entrypoint script that will be generated by setuptools for the application to run, in this case `kirigami_hello`.
ca: L'script del projecte consisteix en un script de punt d'entrada que serà generat per «setuptools» de l'aplicació a executar, en aquest cas `kirigami_hello`.
sl: Projektni skript je sestavljen iz skripta vstopne točke, ki bo ustvarjens setuptools za zagon aplikacije, v tem primeru `kirigami_hello`.

source: The generated project script `kirigami_hello` runs the `main()` function in the `app.py` script in the `kirigami_python` package.
ca: L'script de projecte generat `kirigami_hello` executa la funció `main()` a l'script `app.py` al paquet `kirigami_python`.
sl: Ustvarjeni projektni skript `kirigami_hello` zažene funkcijo `main()` v skriptu `app.py` v paketu `kirigami_python`.

source: The default `package-dir` for Python projects is usually the root directory. In this case, this is overridden with the `src/` subdirectory so it acts like it is the root directory of the package.
ca: El `package-dir` predeterminat dels projectes Python és normalment el directori arrel. En aquest cas, això se substitueix pel subdirectori `src/`, de manera que actua com si fos el directori arrel del paquet.
sl: Privzeti `package-dir` za projekte v Pythonu je običajno korenski imenik.V tem primeru je to preglašeno s podimenikom `src/`, tako da deluje, kot da je korenski imenik paketa.

source: The `package-dir` is why the generated project script does `kirigami_python → app` instead of `kirigami_python → src → app`.
ca: El `package-dir` és per què l'script generat del projecte fa `kirigami_python → app` en lloc de `kirigami_python → src → app`.
sl: `package-dir` je razlog, zakaj ustvarjeni skript projekta deluje kot `kirigami_python→ app` namesto `kirigami_python → src → app`.

source: The `package-dir` is also why the `importlib.resources.files()` call in [app.py](#app-py) does `kirigami_python → qml → Main.qml` instead of `kirigami_python → src → qml → Main.qml`.
ca: El `package-dir` també és per què la crida `importlib.resources.files()` a [app.py](#app-py) fa `kirigami_python → qml → Main.qml` en lloc de `kirigami_python → src → qml → Main.qml`.
sl: `package-dir` je tudi razlog, zakaj klic `importlib.resources.files()` v [app.py](#app-py) deluje kot `kirigami_python → qml → Main.qml` namesto kot `kirigami_python → src → qml → Main.qml`.

source: See [Running directly, as a module, and as a console script](/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script) for details.
ca: Vegeu els detalls a [Executar directament, com a mòdul i com a script de consola](/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script).
sl: Glejte [Running directly, as a module, and as a console script](/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script) za podrobnosti.

source: It must follow a [reverse-DNS naming scheme](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) followed by the `.desktop` extension such as `org.kde.kirigami_python.desktop`:
ca: Ha de seguir un [esquema de noms DNS invers](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) seguit de l'extensió `.desktop` com ara `org.kde.kirigami_python.desktop`:
sl: Slediti mora [shemi poimenovanja obratne DNS - reverse-DNS naming scheme](https://en.wikipedia.org/wiki/Reverse_domain_name_notation), ki mu sledi končnica `.desktop`, kot je npr.`org.kde.kirigami_python.desktop`:

source: Window and taskbar icons will work in a Wayland session only if apps' desktop files are placed in `~/.local/share/applications` or `/usr/share/applications`. To get icons working in this tutorial, copy the app's desktop file there.
ca: Les icones de les finestres i de la barra de tasques només funcionaran en una sessió del Wayland si els fitxers «desktop» de les aplicacions es col·loquen a `~/.local/share/applications` o `/usr/share/applications`. Per a aconseguir icones que funcionin en aquesta guia d'aprenentatge, copieu aquí el fitxer «desktop» de l'aplicació.
sl: Ikone oken in opravilne vrstice bodo delovale v seji Wayland samo, če so aplikacijenamizne datoteke nameščene v `~/.local/share/applications` ali `/usr/share/applications`. Če želite, da bodo ikone delovale v tej vadnici, kopirajte namizje aplikacijedatoteko tja.

source: This file is simply a declaration of additional source code files that should be present in the package when the application runs. Python by default doesn't include QML files in packages, and they need to be available in order for the application to run.
ca: Aquest fitxer és senzillament una declaració de fitxers de codi font addicionals que haurien d'estar presents en el paquet quan s'executi l'aplicació. El Python no inclou fitxers QML als paquets de manera predeterminada, i han d'estar disponibles perquè l'aplicació s'executi.
sl: Ta datoteka je preprosto deklaracija dodatnih datotek izvorne kode, kimora biti prisoten v paketu, ko se aplikacija izvaja. Privzeto Python ne vključuje datotek QML v paketih in morajo biti na voljo da se aplikacija izvaja.

source: Since this is a GUI application, we want the main function to only run when the script is run, not when it's imported, so we need the `if __name__ == "__main__"` condition at the end of the file. See [Running directly, as a module, and as a console script](/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script) for details.
ca: Com que aquesta és una aplicació IGU, volem que la funció principal només s'executi quan s'executa l'script, no quan s'importa, de manera que necessitem la condició `if __name__ == "__main__"` al final del fitxer. Vegeu els detalls a [Executar directament, com a mòdul i com a script de consola](/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script).
sl: Ker je to aplikacija GUI, želimo, da se glavna funkcija izvaja samo, ko se izvaja skript in ne, ko je uvožen, zato potrebujemo pogoj `if __name__ == "__main__"` na koncu datoteke. Glejte [Tek neposredno kot modul in kot konzolni skript - Running directly, as a module, and as a console script(/docs/getting-started/python/python-package#running-directly-as-a-module-and-as-a-console-script) za podrobnosti.

source: We create a QGuiApplication and initialize the QML engine, and with `QGuiApplication.exec()` the application will keep running until closed. Then `importlib.resources.files()` grabs the path to a file that is present in the package, namely our `Main.qml`. With that path, we load the QML file into the QML engine as the main entrypoint for the application interface.
ca: Creem una QGuiApplication i iniciem el motor QML, i amb `QGuiApplication.exec()` l'aplicació seguirà funcionant fins que es tanqui. Llavors `importlib.resources.files()` agafa el camí cap a un fitxer que està present en el paquet, és a dir, al nostre `Main.qml`. Amb aquest camí, carreguem el fitxer QML al motor QML com a punt d'entrada principal per a la interfície de l'aplicació.
sl: Ustvarimo aplikacijo QGuiApplication in inicializiramo stroj QML ter z`QGuiApplication.exec()` aplikacija bo delovala, dokler se ne zapre.Nato `importlib.resources.files()` zagrabi pot do datoteke, ki je prisotnav paketu namreč našo `Main.qml`. S to potjo naložimo datoteko QMLv stroj QML kot glavno vstopno točko za aplikacijski vmesnik.

source: Create an empty `kirigami_python/src/__init__.py` file. This file just needs to be present in order to import a directory as a package.
ca: Creeu un fitxer `kirigami_python/src/__init__.py` buit. Aquest fitxer només ha d'estar present per importar un directori com a paquet.
sl: Ustvarite prazno datoteko `kirigami_python/src/__init__.py`. Ta datoteka mora biti samo prisotna, da lahko uvozite imenik kot paket.

source: Create a `kirigami_python/src/__main__.py` with the following contents:
ca: Creeu un `kirigami_python/src/__main__.py` amb el contingut següent:
sl: Ustvarite `kirigami_python/src/__main__.py` z naslednjo vsebino:

source: This simply adds the contents of the current directory (`src/`) and imports it as a module named `app`, then immediately runs the `main()` function of the application.
ca: Això simplement afegeix el contingut del directori actual (`src/`) i l'importa com un mòdul anomenat `app`, després immediatament executa la funció `main()` de l'aplicació.
sl: To preprosto doda vsebino trenutnega imenika (`src/`) in jo uvozikot modul z imenom `app`, nato takoj zažene funkcijo `main()` aplikacije.

source: We also set the window `title` property to "Hello World".
ca: També establim la propietat `title` de la finestra a "Hola món".
sl: Nastavili smo tudi lastnost okna `title` na "Hello World".

source: Finally, we include in our page a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) that lets us place text on our page. We use `anchors.centerIn: parent` to center our label horizontally and vertically within our parent element. In this case, the parent component of our label is [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). The last thing we need to do is set its text: `text: "Hello World!"`.
ca: Finalment, incloem en la nostra pàgina un [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) que ens permetrà inserir text a la nostra pàgina. Utilitzarem `anchors.centerIn: parent` per a centrar la nostra etiqueta horitzontalment i verticalment dins de l'element pare. En aquest cas, el component principal de la nostra etiqueta és [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). L'últim que hem de fer és configurar el text: `text: "Hello World!"`.

source: You can run the `kirigami_hello` console script without needing to install it first:
ca: Podeu executar l'script de consola `kirigami_hello` sense necessitat d'instal·lar-lo abans:
sl: Konzolni skript `kirigami_hello` lahko zaženete, ne da bi vam ga bilo treba najprej namestiti:

source: The flag `--system-site-packages` is needed to make Python have access to the Python packages from your distribution. This is required because Kirigami and PySide need to have been built against the same Qt version to work, which is the case when both of them come from the distribution.
ca: Es necessita l'indicador `--system-site-packages` per a fer que el Python tingui accés als paquets Python de la vostra distribució. Això és necessari perquè el Kirigami i el PySide han d'haver estat construïts amb la mateixa versió de les Qt per a funcionar, que és el cas quan tots dos provenen de la distribució.
sl: Zastavica `--system-site-packages` je potrebna, da ima Python dostop do paketov Pythona iz vaše distribucije. To je potrebno, ker morata biti Kirigami in PySide zgrajena na isti različici Qt, da bi delovalo, kar oboje velja takrat, ko oba prihajata iz distribucije.
