Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: We can create our own [models](docs:qtcore;qabstractlistmodel.html) from the C++ side, and declare how the data from that model should be represented on the QML frontend.
ca: Podem crear els nostres propis [models](docs:qtcore;qabstractlistmodel.html) des de la banda del C++, i declarar com s'han de representar les dades d'aquest model en el frontal QML.
eo: Ni povas krei niajn proprajn [modelojn](docs:qtcore;qabstractlistmodel.html) de la C++-flanko, kaj deklari kiel la datumoj de tiu modelo devus esti reprezentitaj sur la QML-fasado.
es: Podemos crear nuestros propios [modelos](docs:qtcore;qabstractlistmodel.html) desde el lado C++ y declarar cómo se deben representar los datos de este modelo en la interfaz QML.
nl: We kunnen onze eigen [modellen](docs:qtcore;qabstractlistmodel.html) aanmaken vanaf de C++ kant en declareren hoe de gegevens uit dat model gerepresenteerd moeten worden op de QML-frontend.
sl: Ustvarimo lahko lastne [modele](docs:qtcore;qabstractlistmodel.html) s strani C++ in navedite, kako naj bodo podatki iz tega modela predstavljeni na vmesniku QML.
sv: Vi kan skapa våra egna [modeller](docs:qtcore;qabstractlistmodel.html) från C++ sidan, och deklarera hur data från modellen ska representeras i QML-gränssnittet.
uk: Ми можемо створювати власні [моделі](docs:qtcore;qabstractlistmodel.html) на боці C++ і оголошувати, як дані з відповідної моделі має бути представлено в оболонці QML.

source: Preparing the Class
ca: Preparant la classe
eo: Preparante la Klason
es: Preparación de la clase
nl: De klasse voorbereiden
sl: Priprava razreda
sv: Förbereda klassen
uk: Приготування класу

source: Note
ca: Nota
eo: Noto
es: Nota
nl: Notitie
pl: Uwaga
pt: Nota
sl: Opomba
sv: Anmärkning
uk: Нотатка

source: The custom role names created by `roleNames()` are only usable when a model is being delegated, and are not usable outside of it. See [Models and Views](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
ca: Els noms de rol personalitzats creats per `roleNames()` només es poden utilitzar quan s'està delegant un model, i no es poden utilitzar fora d'ell. Vegeu [Models i vistes](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
eo: La propraj rolnomoj kreitaj de `roleNames()` estas nur uzeblaj kiam modelo estas delegita, kaj ne estas uzeblaj ekster ĝi. Vidu [Modeloj kaj Vidoj](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
es: Los nombres de roles personalizados creados por `roleNames()` solo se pueden usar cuando un modelo está delegado, y no se pueden usar fuera del mismo. Consulte [Modelos y vistas](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
nl: De aangepaste rolnamen aangemaakt met `roleNames()` zijn alleen te gebruiken wanneer een model wordt gedelegeerd en zijn daar buiten niet bruikbaar. Zie [Modellen en weergaven](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
sl: Imena vlog po meri, ustvarjena z `roleNames()`, so uporabna samo, ko je model delegiran in jih ni mogoče uporabiti zunaj njega. Glejte [Modeli in pogledi](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
sv: De anpassade rollnamnen som skapats av `roleNames()` är endast användbara när en modell delegeras och är inte användbara utanför den. Se [Modeller och vyer](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).
uk: Нетипові назви ролей, які створено `roleNames()`, можна використовувати, лише якщо модель було делеговано, і не можна використовувати поза нею. Див. [Моделі і перегляди](docs:qtquick;qtquick-modelviewsdata-modelview.html#models).

source: Technically, models in Qt are represented as tables, with rows and columns. So, what overriding `rowCount()` does is tell Qt how many rows are in a model. Since we are just dealing with a one-dimensional array in this tutorial, you can just think of "rows" as "number of elements."
ca: Tècnicament, els models en Qt es representen com a taules, amb files i columnes. Per tant, el que fa `rowCount()` és dir a les Qt quantes files hi ha en un model. Com que només estem tractant amb una matriu unidimensional en aquesta guia d'aprenentatge, només podeu pensar en «files» com a «nombre d'elements».
eo: Teknike, modeloj en Qt estas reprezentitaj kiel tabeloj, kun vicoj kaj kolumnoj. Do, kio superreganta `rowCount()` faras estas diri al Qt kiom da vicoj estas en modelo. Ĉar ni nur traktas unudimensian tabelon en ĉi tiu lernilo, vi povas simple pensi pri "vicoj" kiel "nombro da elementoj."
es: Técnicamente, los modelos de Qt se representan como tablas, con filas y columnas. Así, lo que la sobrescritura de `rowCount()` hace es decirle a Qt cuántas filas hay en un modelo. Como solo estamos tratando con una matriz de una única dimensión en este tutorial, podemos pensar en las «filas» como «número de elementos».
nl: Technisch worden modellen in Qt gerepresenteerd als tabellen, met rijen en kolommen. Dus, wat overschrijven van `rowCount()` doet aan Qt vertellen hoeveel rijen er in een model zitten. Omdat we van doen hebben met met een een-dimensionaal array in deze inleiding, kunt u gewoon denken aan "rijen" als "aantal elementen."
sl: Tehnično so modeli v Qt predstavljeni kot tabele z vrsticami in stolpci. Torej preglasitev `rowCount()` pove Qt-u, koliko vrstic je v modelu. Ker imamo v tem primeru opravka samo z enodimenzionalnim nizomučbenika, si lahko "vrstice" preprosto predstavljate kot "število elementov."
sv: Tekniskt sett representeras modeller i Qt som tabeller, med rader och kolumner. Så vad att överskrida `rowCount()` gör är att tala om för Qt hur många rader som finns i en modell. Eftersom vi bara har att göra med ett endimensionellt fält i handledning, kan man bara föreställa sig "rader" som "antal element".
uk: З технічної точки зору, моделі у Qt представляються як таблиці з рядками і стовпчиками. Отже, перевизначення `rowCount()` повідомляє Qt про кількість рядків у моделі. Оскільки у цьому підручнику ми маємо справу лише із одновимірним масивом, можна собі це уявляти яка «рядки» як «кількість елементів».

source: Overriding and Implementing `rowCount()`
ca: Sobreescriure i implementar `rowCount()`
eo: Anstataŭigi kaj Efektivigi `rowCount()`
es: Sobrescritura e implementación de `rowCount()`
nl: Overschrijven en implementeren `rowCount()`
sl: Preglasitev in implementacija `rowCount()`
sv: Överskrida och implementera `rowCount()`
uk: Перевизначення і реалізація `rowCount()`

source: Overriding and Implementing `roleNames()`
ca: Sobreescriure i implementar `roleNames()`
eo: Anstataŭigi kaj Efektivigi `roleNames()`
es: Sobrescritura e implementación de `roleNames()`
nl: Overschrijven en implementeren `roleNames()`
sl: Preglasitev in implementacija `roleNames()`
sv: Överskrida och implementera `roleNames()`
uk: Перевизначення і реалізація `roleNames()`

source: In our example model, the role "species" can be used to retrieve the QString key "Feline", "Fox", "Goat", each in a separate delegate. The same can be done with the QStringList values for the character names list.
ca: En el nostre model d'exemple, el rol «espècies» es pot utilitzar per a recuperar la clau del QString «Feline», «Fox», «Goat», cadascuna en un delegat separat. El mateix es pot fer amb els valors de QStringList per a la llista de noms de caràcters.
eo: En nia ekzempla modelo, la rolo "specio" povas esti uzata por preni la QString-ŝlosilon "Feline", "Vulpo", "Kaprino", ĉiu en aparta delegito. La sama povas esti farita kun la QStringList-valoroj por la listo de signonomoj.
es: En el modelo de nuestro ejemplo, el rol «especies» se puede usar para obtener la clave QString «Felino», «Zorro», «Cabra», cada una en un delegado separado. Se puede hacer lo mismo con los valores QStringList para la lista de nombres de caracteres.
nl: In ons voorbeeldmodel kan de rol "soorten" gebruikt worden om de QString-sleutel "Feline", "Fox", "Goat" op te halen, elk in een gescheiden gedelegeerde. Hetzelfde kan gedaan worden met de QStringList waarden voor de karakternamenlijst.
sl: V našem vzorčnem modelu lahko vlogo "species" uporabite za pridobitevQString ključ "Feline", "Fox", "Goat", v vsakem ločenem delegatu. Enako lahko storite z vrednostmi QStringList za seznam imen znakov.
sv: I vår exempelmodell kan rollen "species" användas för att hämta QString-nyckeln "Feline", "Fox", "Goat", var och en i en separat delegat. Detsamma kan göras med QStringList-värdena i teckennamnlistan.
uk: У нашому прикладі моделі роллю «species» можна скористатися для отримання ключа QString «Feline», «Fox», «Goat», кожного в окремому делегаті. Те саме можна зробити за допомогою значень QStringList для списку назв персонажів.

source: Overriding and Implementing `data()`
ca: Sobreescriure i implementar `data()`
eo: Anstataŭigi kaj Efektivigi `data()`
es: Sobrescritura e implementación de `data()`
nl: Overschrijven en implementeren `data()`
sl: Preglasitev in implementacija `data()`
sv: Överskrida och implementera `data()`
uk: Перевизначення і реалізація `data()`

source: Class Usage in QML
ca: Ús de la classe en el QML
eo: Klasa Uzado en QML
es: Uso de clases en QML
nl: Gebruik van klasse in QML
sl: Uporaba razreda v QML
sv: Klassanvändning i QML
uk: Використання класів у QML

source: The QML file that is used will just contain three [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) components, where the key is the header and the value is the content. These cards are created by delegating an AbstractCard using a Repeater, where the custom model we created acts as the model. The data is accessed using word `model`, followed by the roles we declared in `roleNames()`.
ca: El fitxer QML que s'utilitza només contindrà tres components [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard), on la clau és la capçalera i el valor és el contingut. Aquestes targetes es creen delegant una AbstractCard utilitzant un repetidor, on el model personalitzat que hem creat actua com a model. S'accedeix a les dades utilitzant la paraula `model`, seguida dels rols que hem declarat a `roleNames()`.
sl: Uporabljena datoteka QML bo vsebovala samo tri komponente [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard)) , kjer je ključ glava in vrednost vsebina. Te kartice so ustvarjene z delegiranjem AbstractCard z uporabo Repeaterja, kjer model po meri, ki smo ga ustvarili, deluje kot model. Do podatkov dostopamo z besedo `model`, ki ji sledijo vloge deklarirane v `roleNames()`.

source: Data Modification
ca: Modificació de dades
eo: Modifo de Datumoj
es: Modificación de datos
nl: Modificatie van gegevens
sl: Spreminjanje podatkov
sv: Datamodifikation
uk: Внесення змін до даних

source: Editing Data Using `dataChanged()` and `setData()`
ca: Edició de dades utilitzant `dataChanged()` i `setData()`
eo: Redaktante Datumojn Uzante `dataChanged()` kaj `setData()`
es: Edición de datos con `dataChanged()` y `setData()`
nl: Gegevens bewerken met gebruik van `dataChanged()` en `setData()`
sl: Urejanje podatkov z uporabo `dataChanged()` in `setData()`
sv: Redigera genom att använda `dataChanged()` och `setData()`
uk: Редагування даних за допомогою `dataChanged()` і `setData()`

source: `index` - The location of the data.
ca: `index` - La ubicació de les dades.
eo: `index` - La loko de la datumoj.
es: `index`: La posición de los datos.
nl: `index` - de locatie van de gegevens.
sl: `index` – Lokacija podatkov.
sv: `index`: Platsen för data.
uk: `index` — місце даних.

source: `value` - The contents of the new data.
ca: `value` - El contingut de les dades noves.
eo: `valoro` - La enhavo de la novaj datumoj.
es: `value`: El contenido de los datos nuevos.
nl: `waarde` - de inhoud van de nieuwe gegevens.
sl: `value` – Vsebina novih podatkov.
sv: `value`: Det nya datainnehållet.
uk: `value` — вміст нових даних.

source: The `role` parameter in this case is used to ensure `setData()` can be edited via user input (Qt::EditRole). Using `index`, we can use that to determine the location of where the data should be edited with the contents of `value`.
ca: El paràmetre `role` en aquest cas s'utilitza per a assegurar que `setData()` es pot editar mitjançant l'entrada de l'usuari (Qt::EditRole). Utilitzant `index`, podem utilitzar això per a determinar la ubicació d'on s'han d'editar les dades amb el contingut de `value`.
eo: La parametro `role` ĉi-kaze estas uzata por certigi ke `setData()` povas esti redaktita per uzanta enigo (Qt::EditRole). Uzante `indekso', ni povas uzi tion por determini la lokon de kie la datumoj devas esti redaktitaj kun la enhavo de `valoro`.
es: En este caso, el parámetro `role` se usa para garantizar que `setData()` se pueda editar mediante la entrada del usuario (Qt::EditRole). Mediante `index`, podemos usarlo para determinar la ubicación donde se deben editar los datos con el contenido de `value`.
nl: De parameter `role` in dit geval wordt gebruikt om te verzekeren dat `setData()` kan worden bewerkt via invoer van de gebruiker (Qt::EditRole). Door `index` te gebruiken kunnen we dat gebruiken om de locatie te bepalen waar de gegevens zouden worden bewerkt met de inhoud van `value`.
sl: Parameter `role` se v tem primeru uporablja za zagotovitev, da je `setData()` lahkourejana z uporabniškim vnosom (Qt::EditRole). Z uporabo `indexa` lahko to uporabimo zadoločanje lokacije, kjer naj bodo podatki urejani z vsebino `value`.
sv: Parametern `role` används i detta fall för att säkerställa att `setData()` kan redigeras via användarinmatning (Qt::EditRole). Genom att använda `index`, kan vi bestämma platsen där data ska redigeras med innehållet i `value`.
uk: Параметр `role` у цьому випадку використано для того, щоб забезпечити можливість редагувати `setData()` за введеними користувачем даних (Qt::EditRole). За допомогою `index` ми можемо скористатися цим для визначення місця, де має бути змінено дані за вмістом `value`.

source: Now, whenever the values of the model change in the frontend, the changes should automatically update on the backend.
ca: Ara, sempre que els valors del model canviïn al frontal, els canvis s'hauran d'actualitzar automàticament al dorsal.
eo: Nun, kiam ajn la valoroj de la modelo ŝanĝiĝas en la fasado, la ŝanĝoj aŭtomate devas ĝisdatigi en la backend.
es: Ahora, cada vez que los valores del modelo cambian en la interfaz, los cambios deberían actualizarse automáticamente en el motor.
nl: Nu, wanneer de waarden van het model in de frontend wijzigen, zouden de automatisch in de backend moeten worden bijgewerkt.
sl: Zdaj, ko se vrednosti modela spremenijo v sprednjem delu, se morajo spremembe samodejno posodobiti v zadnjem delu.
sv: Nu, när värdena för modellen än ändras i gränssnittet, ska ändringarna automatiskt uppdateras i bakgrundsprogrammet.
uk: Тепер, кожного разу, коли значення моделі буде змінено в оболонці, зміни мають автоматично оновити дані модуля обробки.

source: Adding Rows
ca: Afegir files
eo: Aldonante Vicoj
es: Añadir filas
nl: Het toevoegen van rijen
sl: Dodajanje vrstic
sv: Lägga till rader
uk: Додавання рядків

source: We added a way to modify the data in existing keys of the QMap, and in the front end, this is reflected as modifying the contents inside the AbstractCards. But what if we need to add a new key entry in the QMap and have that reflected on the QML side? Let's do this by creating a new method that is callable on the QML side to perform this task.
ca: S'ha afegit una manera de modificar les dades a les claus existents del QMap, i al frontal, això es reflecteix com modificar el contingut dins de les AbstractCards. Però, i si necessitem afegir una entrada nova de clau al QMap i tenir això reflectit a la banda del QML? Fem-ho creant un mètode nou que es pot cridar a la banda del QML per a realitzar aquesta tasca.
eo: Ni aldonis manieron modifi la datumojn en ekzistantaj ŝlosiloj de la QMap, kaj en la antaŭa fino, ĉi tio estas reflektita kiel modifado de la enhavo ene de la AbstractCards. Sed kio se ni bezonas aldoni novan ŝlosilan eniron en la QMap kaj tion reflektas sur la QML-flanko? Ni faru tion kreante novan metodon, kiu estas vokebla ĉe la QML-flanko por plenumi ĉi tiun taskon.
es: Hemos añadido una forma de modificar los datos en las claves de QMap existentes y, en la interfaz, esto se refleja como una modificación del contenido dentro de AbstractCards. Pero, ¿qué pasa si necesitamos añadir una nueva entrada de clave en el QMap y reflejarla en el lado QML? Hagamos esto creando un nuevo método que se pueda llamar en el lado QML para realizar esta tarea.
nl: We hebben een manier toegevoegd om de gegevens te wijzigen in bestaande sleutels van de QMap en in de frontend, dit wordt gereflecteerd als wijzigen van de inhoud in de AbstractCards. Maar wat als we een nieuwe sleutelitem in de QMap willen toevoegen en dat gereflecteerd moet worden aan the QML-kant? Laten we dat doen door een nieuwe methode aan te maken die op te roepen is aan the QML-kant om deze taak uit te voeren.
sl: Dodali smo način za spreminjanje podatkov v obstoječih ključih QMap in v začelju, se to odraža kot spreminjanje vsebine znotraj AbstractCards. Kaj pa, če moramo dodati nov ključni vnos v QMap inse je to odraža na strani QML? Naredimo to tako, da ustvarimo novo metodo, ki jo je mogoče priklicati na strani QML za izvedbo te naloge.
sv: Vi har lagt till ett sätt att modifiera data i befintliga nycklar i QMap, och i gränssnittet återspeglas det som att modifiera innehållet inne i AbstractCards. Men vad händer om vi behöver lägga till en ny nyckelpost i QMap och få den att återspeglas på QML-sidan? Låt oss göra det genom att skapa en ny metod som kan anropas på QML-sidan för att utföra uppgiften.
uk: Нами додано спосіб внесення змін до даних у наявних ключах QMap і в оболонці — це відповідає зміні вмісту в AbstractCards. Але що, якщо нам потрібно додати новий запис ключа до QMap і відтворити дані на боці QML? Давайте зробимо це шляхом створення нового методу, який можна буде викликати на боці QML для виконання цього завдання.

source: When calling `beginInsertRows()`, we need to first pass in a QModelIndex class to specify the location of where the new rows should be added, followed by what the new first and last row numbers are going to be. In this tutorial, the first argument will just be `QModelIndex()` as there is no need to use the parameter here. We can just use the current row size for the first and last row number, as we'll just be adding one row at the end of the model.
ca: En cridar `beginInsertRows()`, primer hem de passar en una classe QModelIndex per a especificar la ubicació d'on s'han d'afegir les files noves, seguit de quins seran els números nous de primera i última fila. En aquesta guia d'aprenentatge, el primer argument serà `QModelIndex()`, ja que no cal utilitzar el paràmetre aquí. Només podem utilitzar la mida de fila actual per al primer i últim número de fila, ja que només afegirem una fila al final del model.
eo: Kiam vi vokas `beginInsertRows()`, ni unue devas eniri QModelIndex-klason por specifi la lokon de kie la novaj vicoj devas esti aldonitaj, sekvitaj de kio la novaj unua kaj lasta vico-numeroj estos. En ĉi tiu lernilo, la unua argumento estos nur `QModelIndex()` ĉar ne necesas uzi la parametron ĉi tie. Ni povas simple uzi la nunan vicon por la unua kaj lasta vico-numero, ĉar ni nur aldonos unu vicon ĉe la fino de la modelo.
es: Al llamar a `beginInsertRows()` debemos pasar primero una clase QModelIndex para indicar la posición donde se deben añadir las nuevas filas, seguido de los números de la primera y última fila. En este tutorial, el primer argumento será `QModelIndex()`, puesto que no hay necesidad de usar el parámetro aquí. Podemos usar el tamaño de la fila actual para los números de la primera y de la última filas, ya que solo vamos a añadir una fila al final del modelo.
nl: Bij aanroepen van `beginInsertRows()` moeten we eerst een QModelIndex klasse doorgeven om te de locatie te specificeren waar de nieuwe rijen toegevoegd zouden moeten worden, gevolgd door wat de nieuwe eerste en laatste rijnummers gaan worden. In deze inleiding zal het eerste argument gewoon `QModelIndex()` zijn omdat er geen noodzaak is de parameter hier te gebruiken. We kunnen gewoon de huidige rijgrootte voor het eerste en laatste rijnummer gebruiken, omdat we eenvoudig één rij aan het eind van het model zullen toevoegen.
sl: Ko kličemo `beginInsertRows()`, moramo najprej posredovati razred QModelIndex, da določite lokacijo, kamor naj bodo dodane nove vrstice, ki ji sledijo nove številke prve in zadnje vrstice. V tem učbeniku, bo prvi argument samo `QModelIndex()`, ker ne ni potrebe uporabiti parametra. Uporabimo lahko samo trenutno velikost vrstice za številko prve in zadnje vrstice, saj bomo dodali samo eno vrstico na koncumodela.
sv: När vi anropar `beginInsertRows()` måste vi först skicka in en QModelIndex-klass för att ange platsen där de nya raderna ska läggas till, följt av vad de nya första och sista radnumren blir. I handledning är det första argumentet bara att `QModelIndex()` eftersom det inte finns något behov av att använda parametern här. Vi kan bara använda den aktuella radstorleken för första och sista radnumret, eftersom vi bara lägger till en rad i slutet av modellen.
uk: При виклику `beginInsertRows()` нам спочатку слід передати клас QModelIndex для визначення місця, куди слід додавати нові рядки, а потім вказати, якими будуть номери першого і останнього рядка. У цьому підручнику першим аргументом буде просто `QModelIndex()`, оскільки тут немає потреби у використанні параметра. Ми можемо просто скористатися розміром поточного рядка для номерів першого і останнього рядка, оскільки ми просто додаємо один рядок наприкінці моделі.

source: The `dataChanged()` function uses QModelIndex as the data type for its parameters. However, we can convert integers in QModelIndex data types using the `index()` function.
ca: La funció `dataChanged()` utilitza QModelIndex com a tipus de dades per als seus paràmetres. No obstant això, podem convertir enters en tipus de dades QModelIndex utilitzant la funció `index()`.
eo: La funkcio `dataChanged()` uzas QModelIndex kiel la datumtipo por siaj parametroj. Tamen, ni povas konverti entjerojn en QModelIndex datumtipoj uzante la funkcion `index()`.
es: La función `dataChanged()` usa QModelIndex como el tipo de dato para sus parámetros. No obstante, podemos convertir enteros en QModelIndex usando la función `index()`.
nl: De functie `dataChanged()` gebruikt QModelIndex als het type gegeven voor zijn parameters. We kunnen echter gehele getallen in QModelIndex typengegevens converteren met de functie `index()`.
sl: Funkcija `dataChanged()` uporablja QModelIndex kot podatkovni tip za svoje parametre. Vendar pa lahko pretvorimo cela števila v podatkovne vrste QModelIndex z uporabo funkcije `index()`.
sv: Funktionen `dataChanged()` använder QModelIndex som datatyp för sina parametrar. Dock kan vi konvertera heltal i QModelIndex datatyper med användning av funktionen `index()`.
uk: У функції `dataChanged()` використано як тип даних для параметрів QModelIndex. Втім, ми можемо перетворити цілі числа у типах даних QModelIndex за допомогою функції `index()`.

source: Let's update the QML code so we are given the ability to add a new key to the QMap.
ca: Actualitzem el codi en QML, de manera que se'ns dona la possibilitat d'afegir una clau nova al QMap.
eo: Ni ĝisdatigu la QML-kodon, por ke ni ricevu la eblon aldoni novan ŝlosilon al la QMap.
es: Actualicemos el código QML para tener la capacidad de añadir una nueva clave al QMap.
nl: Laten we de QML code bijwerken zodat we de mogelijkheid geven om een nieuwe sleutel aan de QMap toe te voegen.
sl: Posodobimo kodo QML, da bomo lahko dodali nov ključ v QMap.
sv: Låt oss uppdatera QML-koden så att vi får möjlighet att lägga till en ny nyckel till QMap.
uk: Оновімо код QML так, щоб надати йому можливість додавати новий ключ до QMap.
