Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The ListModel is used as storage for the chips. To populate the ListModel (and therefore chips), we declare a couple of ListElement components, which contains a field known as `text`. We can use this string assigned from here to the `text` field for each repeated chip.
ca: El ListModel s'utilitza com a emmagatzematge per als chips. Per a poblar el ListModel (i per tant, els chips), declarem un parell de components de ListElement, que conté un camp conegut com a `text`. Podem utilitzar aquesta cadena assignada des d'aquí al camp `text` per a cada xip repetit.
eo: La ListModel estas uzata kiel konservado por la blatoj. Por plenigi la ListModel (kaj tial blatojn), ni deklaras kelkajn ListElement-komponentojn, kiuj enhavas kampon konatan kiel `teksto`. Ni povas uzi ĉi tiun ĉenon asignitan de ĉi tie al la kampo `teksto` por ĉiu ripeta blato.
nl: Het ListModel wordt gebruikt als opslag voor de chips. Om het ListModel te bevolken (en daarom chips), declareren we een aantal componenten ListElement, die een veld bevatten bekend als `text`. We kunnen deze van hier aan het `text`-veld toegekende tekenreeks gebruiken voor elke herhaalde chip.
sl: ListModel se uporablja kot shramba za čipe. Za zapolnitev ListModel (in s tem čipov), deklariramo nekaj komponent ListElement, ki vsebuje polje, znano kot `besedilo`. Ta niz, ki je dodeljen od tukaj, lahko uporabimo v polju `text` za vsak ponovljeni čip.
sv: ListModel används som lagring för chips. För att fylla i ListModel (och därmed chips), deklarerar vi ett par ListElement-komponenter, som innehåller ett fält som kallas `text`. Vi kan tilldela strängen härifrån till fältet `text` för varje upprepat chips.
uk: ListModel буле використано як сховище для чіпсів. Для заповнення ListModel (і отже, чіпсів), ми оголошуємо двійко компонентів ListElement, які містять поле, відоме як `text`. Ми можемо скористатися цим рядком, який тут пов'язано із полем `text`, для кожного повторюваного чіпса.

source: The Repeater is used for displaying the chips. First, we need to set the `model` field of the Repeater to our ListModel, or create the ListModel inside of repeater. Then, we declare the `Kirigami.Chip` component inside of the Repeater, and assign its `text` field with the element's data using the `modelData` property.
ca: El repetidor s'utilitza per a mostrar els chips. Primer, hem d'establir el camp `model` del Repeater al nostre ListModel, o crear el ListModel dins del repetidor. Després, declarem el component `Kirigami.Chip` dins del Repeater, i assigneu el seu camp `text` amb les dades de l'element utilitzant la propietat `modelData`.
eo: La Ripetilo estas uzata por montri la blatojn. Unue, ni devas agordi la kampon "modelo" de la Ripetilo al nia ListModelo, aŭ krei la ListModel ene de ripetilo. Poste, ni deklaras la komponanton `Kirigami.Chip` ene de la Ripetilo, kaj atribuas ĝian kampon `text` kun la datumoj de la elemento uzante la proprecon `modelData`.
nl: De Herhaler wordt gebruikt voor het tonen van de chips. Eerst moeten we het `model`-veld van de Herhaler aan ons ListModel instellen of het ListModel aanmaken binnen de herhaler. Daarna declareren we de component `Kirigami.Chip` binnen de Herhaler en kennen zijn `text`-veld toe met de gegevens van het element met gebruik van de eigenschap `modelData`.
sl: Repetitor se uporablja za prikaz čipov. Najprej moramo nastaviti`model` Repetitorja v naš ListModel ali ustvarite ListModelznotraj repetitorja. Nato deklariramo komponento `Kirigami.Chip` znotrajrepetitorja in dodeli njegovo besedilno polje s podatki elementa z uporabolastnosti `modelData`.
sv: En Repeater används för att visa chips. Först måste vi ange Repeater-fältet `model` i vår ListModel, eller skapa en ListModel inuti en Repeater. Därefter deklarerar vi komponenten `Kirigami.Chip` inne i vår Repeater och tilldelar elementens data i fältet `text` med hjälp av egenskapen `modelData`.
uk: Repeater буде використано для показу чіпсів. Спочатку, для поля `model` Repeater встановлюємо нашу ListModel або створюємо ListModel у повторювачі. Далі, ми оголошуємо компонент `Kirigami.Chip` всередині Repeater і пов'язуємо його поле `text` із даними елемента за допомогою властивості `modelData`.

source: You can dynamically append and remove data from the ListModel, and the Repeater will automatically make those changes. However, simply changing a specific item from either the Repeater or ListModel does not affect the other, and requires the changing of both, unless something like [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) is used. See [Example Application](#example-application) for more information.
ca: Podeu afegir i eliminar dinàmicament dades del ListModel, i el Repeater farà automàticament aquests canvis. No obstant això, canviant un element específic del Repeater o del ListModel no afecta l'altre, i requereix el canvi de tots dos, a menys que s'utilitzi alguna cosa com [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html). Vegeu [Aplicació d'exemple](#example-application) per a més informació.
eo: Vi povas dinamike almeti kaj forigi datumojn de la ListModel, kaj la Ripetilo aŭtomate faros tiujn ŝanĝojn. Tamen, simple ŝanĝi specifan objekton de aŭ la Ripetilo aŭ ListModel ne influas la alian, kaj postulas la ŝanĝon de ambaŭ, krom se io kiel [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html ) estas uzata. Vidu [Ekzempla Apliko](#example-application) por pliaj informoj.
nl: U kunt dynamisch gegevens achtervoegen en verwijderen uit het ListModel en de Herhaler zal automatisch deze wijzigingen doen. Echter, eenvoudig wijzigen van een specifiek item uit ofwel de Herhaler of ListModel heeft geen effect op de anderen en vereist het wijzigen van beiden, tenzij zoiets als [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) wordt gebruikt. Zie [Voorbeeldtoepassing](#example-application) voor meer informatie.
sl: Podatke lahko dinamično dodajate in odstranjujete iz ListModel inrepetitor bo samodejno naredil te spremembe. Vendar preprosto spreminjanje določenega elementa iz repetitorja ali ListModela ne vpliva na drugo, in zahteva menjavo obeh, razen če je kaj uporabljeno podobnega [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html). Za več informacij glejte [Primer aplikacije](#example-application).
sv: Man kan lägga till och ta bort data från en ListModel dynamiskt, så gör motsvarande Repeater ändringarna automatiskt. Men att helt enkelt ändra ett specifikt objekt antingen i en Repeater eller en ListModel påverkar dock inte den andra, utan kräver att båda ändras, såvida inte något som en [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html ) används. Se [exempelprogrammet](#example-applikation) för mer information.
uk: Ви можете у динамічному режимі додавати дані до ListModel або вилучати дані з неї, а Repeater вноситиме зміни автоматично. Втім, проста зміна певного запису з Repeater або ListModel не вплине на інший компонент і потребує внесення змін до обох, якщо не використано щось подібне до [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html). Див. [приклад програми](#example-application), щоб дізнатися більше.

source: Example Application
ca: Aplicació d'exemple
eo: Ekzempla Apliko
es: Aplicación de ejemplo
nl: Voorbeeldtoepassing
sl: Primer aplikacije
sv: Exempelprogram
uk: Приклад програми

source: The example application below showcases how chips can be used in programs such as to-do lists.
ca: L'aplicació d'exemple següent mostra com es poden utilitzar els chips en programes com llistes de tasques pendents.
eo: La ekzempla aplikaĵo malsupre montras kiel blatoj povas esti uzataj en programoj kiel farendaj listoj.
es: La aplicación de ejemplo siguiente muestra cómo se pueden usar chips en programas como listas de tareas pendientes.
nl: De onderstaande voorbeeldtoepassing laat zien hoe chips gebruikt kunnen worden in programma's zoals te-doenlijsten.
sl: Spodnji primer aplikacije prikazuje, kako je mogoče čipe uporabiti v programih kot so seznami opravil.
sv: Exempelprogrammet nedan visar hur chips kan användas i program såsom uppgiftslistor.
uk: У прикладі програми, який наведено нижче, висвітлено можливість використання чіпсів у програмах, зокрема у списках завдань.

source: ![Chips Example Application](chips_example_app.png)
ca: ![Aplicació d'exemple de chips](chips_example_app.png)
es: ![Aplicación de ejemplo de chips](chips_example_app.png)
nl: ![Chips Voorbeeldtoepassing](chips_example_app.png)
sl: ![Primer aplikacije čipov](chips_example_app.png)
sv: ![Chips exempelprogram](chips_example_app.png)
uk: ![Приклад програми з чіпсами](chips_example_app.png)

source: Controls and interactive elements
ca: Controls i elements interactius
eo: Kontroloj kaj interagaj elementoj
es: Controles y elementos interactivos
fr: Contrôle et éléments interactifs
nl: Besturingen en interactieve elementen
pl: Rzeczy sterujące i z którym można oddziaływać
pt: Controlos e elementos interactivos
sl: Kontrolniki in interaktivni elementi
sv: Kontroller och interaktiva element
uk: Керування і інтерактивні елементи

source: Make your apps more interactive by using buttons, selection controls, sliders, and text fields.
ca: Fent que les vostres aplicacions siguin més interactives mitjançant l'ús de botons, controls de selecció, controls lliscants i camps de text.
eo: Faru viajn apojn pli interagaj per butonoj, elektaj regiloj, glitiloj kaj tekstaj kampoj.
es: Hacen que las aplicaciones sean más interactivas mediante el uso de botones, controles de selección, deslizadores y campos de texto.
fr: Rendez vos applications plus interactives en utilisant des boutons, des contrôles de sélection, des curseurs et des champs de texte.
nl: Uw toepassingen interactiever maken door knoppen, selectiebesturingen, schuifregelaars en tekstvelden te gebruiken.
pl: Ułatw oddziaływanie ze swoją aplikacją poprzez użycie przycisków, pól zaznaczeń, suwaków i pól tekstowych.
pt: Torne as suas aplicações mais interactivas graças aos botões, controlos de selecção, barras deslizantes e campos de texto.
sl: Naredite aplikacije bolj interaktivne z gumbi, kontrolniki izbire, drsniki in besedilnimi polji.
sv: Gör dina program mer interaktiva genom att använda knappar, urvalskontroller, skjutreglage och textfält.
uk: Надання вашими програмам додаткової інтерактивності за допомогою кнопок, елементів керування вибором, повзунками та полями для введення тексту.

source: Kirigami makes use of a wide selection of different interactive elements from Qt that you can use in your applications. Each different type has slightly different interaction styles, visual styles, and functionality. Using the right type of control in your application can help make your user interface more responsive and intuitive.
ca: El Kirigami fa ús d'una àmplia selecció de diferents elements interactius de les Qt que podeu utilitzar en les aplicacions. Cada tipus diferent té estils d'interacció, estils visuals i funcionalitats lleugerament diferents. Emprant el tipus de control correcte a la vostra aplicació ajudareu a fer que la interfície d'usuari sigui més sensible i intuïtiva.
eo: Kirigami uzas ampleksan elekton de malsamaj interagaj elementoj de Qt, kiujn vi povas uzi en viaj aplikoj. Ĉiu malsama tipo havas iomete malsamajn interagajn stilojn, vidajn stilojn kaj funkciojn. Uzi la ĝustan tipon de mastrumo en via aplikaĵo povas helpi igi vian uzantinterfacon pli respondema kaj intuicia.
es: Kirigami hace uso de una amplia selección de distintos elementos interactivos de Qt que puede usar en sus aplicaciones. Cada tipo diferente tiene estilos de interacción, estilos visuales y funcionalidades ligeramente diferentes. El uso del tipo de control correcto en su aplicación puede ayudar a que su interfaz de usuario sea más receptiva e intuitiva.
nl: Kirigami maakt gebruik van een brede selectie van verschillende interactieve elementen die u kunt gebruiken in uw toepassingen. Elk verschillend type heeft iets verschillende interactiestijlen, visuele stijlen en functionaliteit. Door het juiste type besturing in uw toepassing te gebruiken kan helpen om uw gebruikersinterface responsiever en intuïtiever te maken.
sl: Kirigami uporablja širok izbor različnih interaktivnih elementov iz Qt, ki jih lahko uporabite v svojih aplikacijah. Vsaka drugačna vrsta ima nekoliko drugačne sloge interakcije, vizualne sloge in funkcionalnost. Uporaba prave vrste nadzora v vaši aplikaciji lahko pomaga narediti vaš uporabniški vmesnik bolj odziven in intuitiven.
sv: Kirigami erbjuder ett stort urval av olika interaktiva element från Qt som du kan använda i dina program. Varje olika typ har något olika interaktionsstilar, visuella stilar och funktionalitet. Att använda rätt typ av kontroll i programmet hjälper till att göra ditt användargränssnitt mer mottagligt och intuitivt.
uk: Kirigami використовує широкий діапазон різних інтерактивних елементів Qt, якими ви можете скористатися у ваших програмах. Різні типи мають дещо різні стилі взаємодії, візуальні стилі та функціональні можливості. Використання належного типу засобу керування у вашій програмі може допомогти зробити інтерфейс користувача зручнішим та інтуїтивно зрозумілішим.

source: Buttons
ca: Botons
eo: Butonoj
es: Botones
fr: Boutons
nl: Knoppen
pl: Przyciski
pt: Botões
sl: Gumbi
sv: Knappar
uk: Кнопки

source: In Kirigami apps, we use the QtQuick Controls [Button](https://doc.qt.io/qt-6/qml-qtquick-controls-button.html). Using them is pretty straightforward: we set the [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) property and any action we want it to perform is set to the [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked) property.
ca: En les aplicacions Kirigami, utilitzem el [Button](https://doc.qt.io/qt-6/qml-qtquick-controls-button.html) dels QtQuick Controls. Emprar-los és força senzill: establim la propietat [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) i qualsevol acció que volem que realitzi s'estableix a la propietat [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).

source: ![A window containing a button "Beep" in the center, which when clicked shows a passive notification "Boop" at the bottom of the window](/docs/getting-started/kirigami/components-controls/controls-button.webp)
ca: ![Una finestra que conté un botó «Beep» en el centre, que quan s'hi fa clic mostra una notificació passiva «Boop» a la part inferior de la finestra](/docs/getting-started/kirigami/components-controls/controls-button.webp)
eo: ![Fenestro enhavanta butonon "Beep" en la centro, kiu, kiam oni alklakas, montras pasivan sciigon "Boop" malsupre de la fenestro](/docs/getting-started/kirigami/components-controls/controls -butono.webp)
nl: ![Een venster met een knop "Piep" in het centrum, die wanneer er op wordt geklikt een passieve melding "Boop" onderaan het venster toont](/docs/getting-started/kirigami/components-controls/controls-button.webp)
sl: ![Okno z gumbom »Beep« v sredini, ki ob kliku prikaže pasivno obvestilo »Boop« na dnu okna](/docs/getting-started/kirigami/components-controls/controls-button.webp )
sv: ![Ett fönster som innehåller knappen "Beep" i mitten, som visar ett passivt meddelande "Boop" längst ner i fönstret när du klickar på den](/docs/getting-started/kirigami/components-controls/controls-button.webp)
uk: ![Вікно, що містить кнопку «Beep» у центрі. Натискання цієї кнопки призводить до показу пасивного сповіщення «Boop» у нижній частині вікна](/docs/getting-started/kirigami/components-controls/controls-button.webp)

source: Toggleable buttons
ca: Botons commutables
eo: Ŝanĝeblaj butonoj
es: Botones conmutables
fr: Boutons de basculement
nl: Omschakelbare knoppen
pl: Przestawialne przyciski
pt: Botões comutáveis
sl: Preklopni gumbi
sv: Ändringsbara knappar
uk: Кнопки-перемикачі

source: The behavior of buttons can be changed to make them toggleable: in this mode, they will stay pressed until clicked on once more. This mode can be activated by setting their [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) property to `true`; we can also set buttons to be toggled on by default by setting [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) to `true`.
ca: El comportament dels botons es pot canviar perquè es puguin commutar: en aquest mode, romandran premuts fins que s'hi faci clic una vegada més. Aquest mode es pot activar establint la propietat [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) a `true`. També podem establir els botons perquè es commutin de manera predeterminada establint la propietat [checked](https://doc.qt.io/qt-6 /qml-qtquick-controls2-abstractbutton.html#checked-prop) a `true`.
eo: La konduto de butonoj povas esti ŝanĝita por igi ilin ŝalteblaj: en ĉi tiu reĝimo, ili restos premitaj ĝis alklako denove. Ĉi tiu reĝimo povas esti aktivigita agordante ilian [markeblan](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) proprecon al `vera`; ni ankaŭ povas agordi butonojn por esti ŝaltitaj defaŭlte agordante [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) al `true`.
nl: Het gedrag van knoppen kan gewijzigd worden om ze omschakelbaar te maken: in deze modus zullen ze ingedrukt blijven totdat er nog een keer op wordt geklikt. Deze modus kan geactiveerd worden door de eigenschap [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) op `true` te zetten; we kunnen knoppen ook standaard zetten op aan door de eigenschap [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) op `true` te zetten.
sl: Obnašanje gumbov je mogoče spremeniti, da jih je mogoče preklapljati: v tem načinu bodo ostali pritisnjeni, dokler jih znova ne kliknete. Ta način lahko aktivirate tako, da njihovo lastnost [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) nastavite na `true`; lahko tudi nastavimo, da so gumbi privzeto vklopljeni, tako da [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) nastavimo na `true`.
sv: Knapparnas beteende kan ändras för att göra dem ändringsbara: i det läget förblir de nedtryckta tills de klickas en gång till. Läget kan aktiveras genom att ställa in egenskapen [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) till `true`. Vi kan också ställa in knappar till att vara på från början genom att ställa in egenskapen [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) till `true`.
uk: Змінити поведінку кнопок можна зробивши їх кнопками-перемикачами: у цьому режимі вони лишатимуться натиснутими, аж доки їх не буде натиснуто ще раз. Цей режим можна активувати встановленням для властивості [checkable](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checkable-prop) значення `true`; ми можемо також зробити кнопки типово перемкнутими встановленням для властивості [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) значення `true`.

source: We can get the most out of toggleable buttons by using the `onCheckedChanged` signal handler which is [automatically generated](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) from the [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) signal. It works similarly to `onClicked`, except here the assigned action will be executed when the button's state changes. It is a boolean property, which can come in handy for specific use cases.
ca: Podem aprofitar al màxim els botons commutables utilitzant el controlador de la propietat `onCheckedChanged` que es [genera automàticament](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) a partir del senyal [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop). Funciona de manera similar a `onClicked`, excepte que aquí l'acció assignada s'executarà quan es canviï l'estat del botó. És una propietat booleana, el qual pot ser útil per a casos específics d'ús.
eo: Ni povas eltiri la plej grandan profiton de ŝanĝeblaj butonoj uzante la signal-traktilon `onCheckedChanged' kiu estas [aŭtomate generita](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change- signal-traktantoj) de la [markita](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) signalo. Ĝi funkcias simile al `onClicked`, krom ĉi tie la asignita ago estos efektivigita kiam la stato de la butono ŝanĝiĝos. Ĝi estas bulea propreco, kiu povas esti utila por specifaj uzkazoj.
nl: We kunnen het meeste uit omschakelbare knoppen halen door de signaalbehandelaar `onCheckedChanged` te gebruiken die [automatisch is gegenerateerd](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) uit het signaal [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop). Het werkt net als `onClicked`, behalve dat hier de toegekende actie uitgevoerd zal worden wanneer de status van de knop wijzigt. Het is een booleaanse eigenschap, die handig kan worden voor specifieke gebruiksgevallen.
sl: Gumbe, ki jih je mogoče preklapljati, lahko kar najbolje izkoristimo z uporabo upravljalnika signalov `onCheckedChanged`, ki je [samodejno ustvarjen](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change- signal-handlers) iz signala [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop). Deluje podobno kot `onClicked`, le da se bo tukaj dodeljeno dejanje izvedlo, ko se spremeni stanje gumba. To je logična lastnost, ki je lahko uporabna za posebne primere uporabe.
sv: Vi kan få ut så mycket som möjligt av ändringsbara knappar genom att använda signalhanteraren `onCheckedChanged` som [automatiskt genereras](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) från signalen [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop). Den fungerar på liknande sätt som `onClicked`, utom att den tilldelade åtgärden utförs när knappens tillstånd ändras. Den är en Boolesk egenskap, som kan vara praktiskt i specifika användarfall.
uk: Отримати максимум від кнопок-перемикачів можна за допомогою обробника сигналу `onCheckedChanged`, який буде [автоматично створено](https://doc.qt.io/qt-6/qtqml-syntax-signals.html#property-change-signal-handlers) з сигналу [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop). Вона працює подібно до `onClicked`, але тут пов'язану дію буде виконано, коли змінюється стан кнопки. Це булева властивість, яка може бути надзвичайно зручною у певних випадках.
