Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: These form layouts are designed to work with a variety of different input types, though we're sticking to simple [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) inputs that give us simple text boxes to write things in.
ca: Aquestes disposicions de formulari estan dissenyades per a funcionar amb diversos tipus d'entrada diferents, encara que ens cenyim a entrades senzilles [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) que ens brinden quadres de text senzills per a escriure-hi.
eo: Ĉi tiuj formularaj aranĝoj estas dezajnitaj por funkcii kun diversaj malsamaj enigspecoj, kvankam ni restas al simplaj [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) enigaĵoj, kiuj donas al ni simplajn tekstskatolojn por skribi aferojn.
es: Estos formularios están diseñados para que funcionen con diversos tipos de entrada, aunque nos ceñimos a entradas simples de [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), que nos proporcionan cuadros de texto sencillos en los que escribir.
nl: Deze formulierindelingen zijn ontworpen om te werken met een variëteit van verschillende invoertypen, maar nu blijven we bij eenvoudige [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) invoer die ons eenvoudige tekstvelden geeft om dingen in te schrijven.
sl: Te postavitve obrazcev so zasnovane tako, da delujejo z različnimi vrstami vnosa, čeprav se držimo preprostih vnosov [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), ki nam dajejo preprosta besedilna polja, v katera lahko pišemo stvari.
sv: Formulärlayouter är konstruerade för att arbeta med ett stort antal typer av inmatning, även om vi håller oss till enkla [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), som ger oss enkla textrutor att skriva in saker i.
uk: Ці компонування форм розроблено для роботи із різними типами полів введення, хоча тут ми використовуємо прості поля [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField), якщо відповідають простим текстовим блоками для вписування простих текстових фрагментів.

source: We have created Textfield elements that act as:
ca: Hem creat elements Textfield que actuen com:
eo: Ni kreis Textfield-elementojn kiuj funkcias kiel:
es: Hemos creado elementos Textfield que actúan como:
nl: We hebben Textfield-elementen gemaakt die acteren als:
pt: Criámos os elementos Textfield que funcionam como:
sl: Ustvarili smo elemente Textfield, ki delujejo kot:
sv: Vi har skapat elementet Textfield som fungerar som:
uk: Нами створено елементи Textfield, які працюють як:

source: Input for the name of our countdown
ca: Entrada per al nom del nostre compte enrere
eo: Enigo por la nomo de nia retronombrado
es: Entrada para el nombre de nuestra cuenta atrás
fr: Entrée pour le nom de notre compteur
nl: Invoer voor de naam van onze aftelling
pl: Pole do wpisywania nazwy naszego odliczania
pt: Introdução do nome da nossa contagem
sl: Vnos za ime našega odštevanja
sv: Indata för namnet på vår nedräkning
uk: Поле для введення назви нашого відліку

source: Input for the description of our countdown
ca: Entrada per a la descripció del nostre compte enrere
eo: Enigo por la priskribo de nia retronombrado
es: Entrada para la descripción de nuestra cuenta atrás
fr: Entrée pour la description de notre compteur
nl: Invoer voor de beschrijving van onze aftelling
pl: Pole do wpisywania opisu naszego odliczania
pt: Introdução da descrição da nossa contagem
sl: Vnos za opis našega odštevanja
sv: Indata för beskrivningen av vår nedräkning
uk: Поле для введення опису нашого відліку

source: Input for the date we are counting down towards, which must be provided in a `YYYY-MM-DD` format
ca: Entrada per a la data cap a la qual estem comptant cap enrere, la qual s'ha de proporcionar en el format `YYYY-MM-DD`
eo: Enigo por la dato al kiu ni kalkulas malsupren, kiu devas esti provizita en formato `YYYY-MM-DD`
es: Entrada para la fecha que vamos a contar hacia atrás, que se debe indicar con el formato `YYYY-MM-DD`
nl: Invoer voor de datum waar we naar aftellen, die geleverd moet worden in een formaat `JJJJ-MM-DD`
sl: Vnos za datum, ki ga odštevamo proti vrednosti, ki jo je treba navesti v formatu 'YYYY-MM-DD'
sv: Indata för datumet vi räknar ner till, som måste anges på formatet `ÅÅÅÅ-MM-DD`.
uk: Поле для введення дати, до якої ми ведемо відлік і яка надається у форматі `YYYY-MM-DD`

source: Within each of these [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) elements, we are setting a [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) property that lets us define labels for them. The form will present the correct labels to the left of each of these text input fields.
ca: Dins de cadascun d'aquests elements [Controls.TextField](docs:qtquickcontrols;QtQuick.Controls.TextField), estem establint una propietat [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) que permet definir etiquetes per a ells. El formulari presentarà les etiquetes correctes a l'esquerra de cadascun d'aquests camps d'entrada de text.

source: Finally, we are also setting the [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) property to trigger the [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) method of the following field; this will switch the active field once the user hits the ENTER key, improving the usability of the form.
ca: Finalment, també estem establint la propietat [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) per a activar el mètode [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) del camp següent; això canviarà el camp actiu una vegada que l'usuari prem la tecla Retorn, millorant la usabilitat del formulari.
eo: Fine, ni ankaŭ fiksas la [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) proprecon por ekigi la [forceActiveFocus()](https:/ /doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) metodo de la sekva kampo; ĉi tio ŝanĝos la aktivan kampon post kiam la uzanto trafos la ENTER-klavon, plibonigante la uzeblecon de la formo.
nl: En tenslotte voegen we de [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal)-eigenschap toe om het startsignaal te geven voor [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method)-methode voor het volgende veld; dit zal het veld dat actief is omschakelen naar het volgende veld nadat de gebruiker de ENTER-toets heeft ingedrukt, wat de bruikbaarheid van het formulier verbetert.
sl: Nazadnje nastavimo tudi lastnost [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal), da sproži [forceActiveFocus()](https:/ /doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) metodo naslednjega polja; to bo preklopilo aktivno polje, ko uporabnik pritisne tipko ENTER, kar izboljša uporabnost obrazca.
sv: Slutligen ställer vi också in egenskapen [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) för att använda metoden [forceActiveFocus()](https:/ /doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) för följande fält. Det byter det aktiva fältet när användaren trycker på returtangenten, vilket förbättrar formulärets användbarhet.
uk: Нарешті, ми також встановлюємо властивість [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#accepted-signal) для вмикання методу [forceActiveFocus()](https://doc.qt.io/qt-6/qml-qtquick-item.html#forceActiveFocus-method) наступного поля; це призведе до перемикання активного поля, щойно користувач натисне клавішу ENTER, удосконалюючи зручність форми.

source: We have also set a property called [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) on the text field for our date. Setting this to `D999-99-99` prevents users from entering something that might break the functionality of the application (such as text), restricting them to only entering digits which we can then try to parse into a date object.
ca: També hem establert una propietat anomenada [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) en el camp de text per a la nostra data. Establint això a `D999-99-9` evitarà que els usuaris introdueixin alguna cosa que pugui trencar la funcionalitat de l'aplicació (com ara text), restringint-lo a només la introducció de dígits, després podrem intentar analitzar-ho en un objecte de data.
eo: Ni ankaŭ starigis proprecon nomitan [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) sur la teksta kampo por nia dato. Agordi ĉi tion al `D999-99-99` malhelpas uzantojn enigi ion, kio povus rompi la funkciecon de la aplikaĵo (kiel teksto), limigante ilin nur enigi ciferojn, kiujn ni tiam povas provi analizi en datan objekton.
nl: We hebben ook een eigenschap genaamd [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) ingesteld op het tekstveld voor onze datum. Dit instellen op `D999-99-99"` voorkomt dat gebruikers iets invoeren dat de functionaliteit van de toepassing laat breken (zoals tekst), die hen beperkt tot het alleen invoeren van cijfers die we daarna kunnen proberen te ontleden in een datum object.
sl: Prav tako smo nastavili lastnost z imenom [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) v besedilnem polju za naš datum. Če to nastavite na `D999-99-99`, preprečite uporabnikom, da bi vnesli nekaj, kar bi lahko pokvarilo funkcionalnost aplikacije (kot je besedilo), in jih omejite na vnos samo številk, ki jih lahko nato poskusimo razčleniti v objekt datuma.
sv: Vi har också ställt in en egenskap som kallas [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop) i textfältet för vårt datum. Att ställa in den till `D999-99-99" förhindrar oss från att mata in någonting som kan förstöra programmets funktion (såsom text), och begränsar dem att bara mata in siffror som vi sedan kan försöka tolka som ett datumobjekt.
uk: Ми також встановлюємо для текстового поля для нашої дати властивість із назвою [inputMask](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#inputMask-prop). Встановлення значення `D999-99-99` забороняє користувачеві вводити будь-що, що може зашкодити нормальній роботі програми (наприклад, звичайний текст). Користувач зможе вводити лише цифри, які згодом може бути перетворено на об'єкт дати.

source: Once the user interface for the dialog is done, we need to change how it behaves. For this we need three things:
ca: Un cop feta la interfície d'usuari del diàleg, hem de canviar com es comporta. Per a això necessitem tres coses:
eo: Post kiam la uzantinterfaco por la dialogo estas farita, ni devas ŝanĝi kiel ĝi kondutas. Por tio ni bezonas tri aferojn:
nl: Nadat de gebruikersinterface voor het dialoogvenster klaar is, moeten we het het gedrag ervan wijzigen. Daarvoor hebben we drie dingen nodig:
sl: Ko je uporabniški vmesnik za pogovorno okno končan, moramo spremeniti njegovo obnašanje. Za to potrebujemo tri stvari:
sv: När användargränssnittet för dialogrutan är klart måste vi ändra hur det beter sig. För att göra det behöver vi tre saker:
uk: Щойно роботу над інтерфейсом користувача діалогового вікна завершено, нам потрібно змінити поведінку вікна. Для цього нам потрібно три речі:

source: Show the Ok button only when the required fields are filled
ca: Mostrar el botó Ok només quan s'omplin els camps requerits
eo: Montri la Ok-butonon nur kiam la postulataj kampoj estas plenigitaj
nl: De OK-knop is alleen zichtbaar als de vereiste velden ingevuld zijn
sl: Pokaži gumb V redu samo, ko so izpolnjena zahtevana polja
sv: Visa bara knappen Ok när de obligatoriska fälten är ifyllda
uk: Показ кнопки «Гаразд», лише якщо заповнено обов'язкові поля

source: Add the input information to the model
ca: Afegir la informació d'entrada al model
eo: Aldoni la enigajn informojn al la modelo
nl: Voeg de invoerinformatie toe aan het model
sl: Dodajte vhodne informacije v model
sv: Lägga till den inmatade informationen i modellen
uk: Додавання вхідних даних до моделі

source: Clear the input form
ca: Netejar el formulari d'entrada
eo: Forigi la enigformularon
nl: Formulier wissen
sl: Počistite obrazec za vnos
sv: Rensa inmatningsformuläret
uk: Очищення форми введення даних

source: ... Once the Kirigami.Dialog is initialized, we want to create a custom binding to only make the Ok button visible if the required text fields are filled. For this we use Kirigami.Dialog.standardButton(button):
ca: ...Un cop el Kirigami.Dialog està inicialitzat, volem crear una vinculació personalitzada per a només fer visible el botó Ok si s'omplen els camps de text requerits. Per a això utilitzem el Kirigami.Dialog.standardButton(button):
eo: ... Post kiam la Kirigami.Dialogo estas pravalorizita, ni volas krei propran ligadon por nur videbligi la Ok-butonon se la bezonataj tekstkampoj estas plenigitaj. Por tio ni uzas Kirigami.Dialog.standardButton(butono):
nl: ... Nadat het Kirigami.Dialog is geïnitialiseerd, willen we een aangepaste binding creëren om ervoor te zorgen dat de Ok-knop pas zichtbaar word als de vereiste tekstvelden zijn ingevuld. Hiervoor gebruiken we Kirigami.Dialog.standardButton(button):
sl: ... Ko je Kirigami.Dialog inicializiran, želimo ustvariti vezavo po meri, da bo gumb V redu viden le, če so izpolnjena zahtevana besedilna polja. Za to uporabljamo Kirigami.Dialog.standardButton(button):
sv: ... När Kirigami.Dialog väl har initierats vill vi skapa en egen bindning för att endast göra Ok-knappen synlig om de obligatoriska textfälten är ifyllda. För att göra det använder vi Kirigami.Dialog.standardButton(button):
uk: …Щойно Kirigami.Dialog буде ініціалізовано, нам потрібно буде створити нетипову прив'язку такого різновиду, що кнопка «Гаразд» стала видимою, лише якщо буде заповнено обов'язкові текстові поля. Для цього ми скористаємося Kirigami.Dialog.standardButton(button):

source: () => is a JavaScript arrow function
ca: () => és una funció de fletxa del JavaScript
eo: () => estas JavaScript-sago-funkcio
es: () => es una función flecha de JavaScript
nl: () => is een JavaScript pijl-functie
sl: () => je funkcija JavaScript puščice
sv: () => är en pilfunktion i Javascript
uk: () => є функцією стрілочки JavaScript

source: The binding is created, but we still need to make it unclickable unless the fields are filled
ca: Es crea el vincle, però encara cal fer-lo no clicable a menys que s'omplin els camps
eo: La ligado estas kreita, sed ni ankoraŭ devas igi ĝin neklakebla krom se la kampoj estas plenigitaj
nl: De binding is gecreëerd, maar we moeten het niet klikbaar maken tenzij de velden ingevuld zijn
sl: Vezava je ustvarjena, vendar moramo še vedno onemogočiti klikanje, razen če so polja izpolnjena
sv: Bindningen är skapad, men vi måste fortfarande göra den oklickbar om fälten inte är ifyllda
uk: Прив'язку створено, але нам усе ще потрібно зробити її непридатною до клацання, якщо не заповнено поля

source: The first thing that needs to be done is create a binding between the OK button's [enabled](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) property and a check on whether the fields are filled, which in this case needs to be done with [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating-property-bindings-from-javascript) in JavaScript. In effect, the line:
ca: El primer que s'ha de fer és crear una vinculació entre la propietat [activada](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) del botó OK i una comprovació de si els camps s'omplen, que en aquest cas s'ha de fer amb [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating-property-bindings-from-javascript) en JavaScript. En efecte, la línia:
eo: La unua afero, kiu devas esti farita, estas krei ligon inter la [enabled] de la OK butono (https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) propreco kaj kontrolo ĉu la kampoj estas plenigitaj, kio ĉi-kaze devas esti farita per [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating- property-bindings-from-javascript) en JavaScript. Efektive, la linio:
nl: Wat als eerste gedaan moet worden is de creatie van een binding tussen de eigenschap [enabled](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) van de OK-knop en een controle of de velden zijn ingevuld, wat in dit geval gedaan moet worden met [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating-property-bindings-from-javascript) in JavaScript. In feite, is de regel:
sl: Prva stvar, ki jo je treba narediti, je ustvariti povezavo med lastnostjo [enabled](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) gumba OK in preverjanje, ali so polja izpolnjena, kar je v tem primeru treba narediti s [Qt.binding()][Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating-property-bindings-from-javascript) v JavaScript. Dejansko je vrstica:
sv: Det första som behöver göras är att skapa en bindning mellan Ok-knappens egenskap [enabled](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) och en kontroll av om fälten är ifyllda, vilket i detta fall måste göras med [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating- egenskapsbindningar-från-javascript) i JavaScript. I själva verket är raden:
uk: Першим, що слід зробити, є створення зв'язку між властивістю [enabled](https://doc.qt.io/qt-6/qml-qtquick-controls-popup.html#enabled-prop) кнопки «Гаразд» і перевіркою того, чи заповнено поля, що у цьому випадку слід зробити за допомогою [Qt.binding()](https://doc.qt.io/qt-6/qtqml-syntax-propertybinding.html#creating-property-bindings-from-javascript) у JavaScript. У результаті рядок:

source: is similar to the QML bindings we have seen so far, like in the following pseudo-code:
ca: és similar a les vinculacions en QML que hem vist fins ara, com en el pseudocodi següent:
eo: estas simila al la QML-ligoj, kiujn ni vidis ĝis nun, kiel en la sekva pseŭdokodo:
nl: vergelijkbaar met de QML bindings die we tot nog toe hebben gezien, zoals in de volgende voorbeeld-code:
sl: podobna vezavam QML, ki smo jih videli do sedaj, kot v naslednji psevdo kodi:
sv: som liknar de QML-bindningar vi har sett hittills, liksom i följande pseudokod:
uk: є подібним до прив'язок QML, які ми досі мали, як у такому псевдокоді:

source: The signal handler that triggers the Ok button is [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). It remains empty and without doing anything if the required fields are filled; otherwise, it will add the input to the model and clear the dialog for the next time it is opened.
ca: El gestor de senyal que activa el botó Ok és [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Es manté buit i sense fer res si s'omplen els camps requerits; en cas contrari, afegirà l'entrada al model i netejarà el diàleg per a la pròxima vegada que s'obri.
eo: La signala prizorganto, kiu ekigas la Ok-butonon, estas [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Ĝi restas malplena kaj sen fari ion se la postulataj kampoj estas plenigitaj; alie, ĝi aldonos la enigon al la modelo kaj malplenigos la dialogon por la venonta fojo, kiam ĝi estos malfermita.
nl: De signal handler dat de Ok-knop vrijgeeft is [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Het blijft leeg en zonder dat het iets doet als de vereiste velden zijn gevuld; als dat niet het geval is dan voert het de invoer naar het model en maakt het dialoogvenster leeg voor de volgende keer dat het wordt geopend.
sl: Upravljalnik signalov, ki sproži gumb V redu, je [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Če so zahtevana polja izpolnjena, ostane prazen in ne naredi ničesar; v nasprotnem primeru bo dodal vnos v model in počistil pogovorno okno za naslednje odprtje.
sv: Signalhanteraren som aktiverar Ok-knappen är [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Den förblir tom och utan att göra någonting om de obligatoriska fälten är ifyllda. Annars lägger den till indata i modellen och rensar dialogrutan till nästa gång den öppnas.
uk: Обробником сигналів, який вмикатиме кнопку «Гаразд», є [onAccepted](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#accepted-signal). Він лишається порожнім і таким, що не виконуватиме ніяких дій, якщо обов'язкові поля заповнено; у інших випадках він додаватиме поле введення до моделі і спорожнятиме діалогове вікно для наступного моменту, коли його буде відкрито.

source: ... We check that the nameField is not empty and that the dateField (which has an inputMask) is completely filled
ca: ...Comprovem que el «nameField» no estigui buit i que el «dateField» (que té una «inputMask») estigui completament omplert
eo: ... Ni kontrolas, ke la nomKampo ne estas malplena kaj ke la datKampo (kiu havas enigMaskon) estas tute plenigita
nl: ... We controleren dat de nameField niet leeg is en dat de dateField (wat een inputMask heeft) compleet is ingevuld
sl: ... Preverimo, da nameField ni prazno in da je dateField (ki ima inputMask) v celoti izpolnjeno
sv: ... Vi kontrollerar att namnfältet inte är tomt och att datumfältet (som har en inputMask) är helt ifyllt
uk: …Ми перевіряємо, чи є непорожнім nameField, і що dateField (для якого визначено inputMask) є повністю заповненим
