Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In most cases however you will likely want to use one of its derived dialog types, [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) or [Kirigami.MenuDialog](docs:;org.kde.kirigami.dialogs.MenuDialog).
sl: Vendar pa boste v večini primerov verjetno želeli uporabiti eno od njegovih izpeljanih vrst pogovornih oken, [Kirigami.PromptDialog]docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) ali [Kirigami.MenuDialog](docs:;org.kde.kirigami.dialogs.MenuDialog).

source: A [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) is essentially a dialog with a built-in label and default [contentPadding](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#contentPadding-prop) that is used to prompt the user for some information. This type of dialog is supposed to be used only for simple yes/no prompts or brief requests for user input.
sl: [Kirigami.PromptDialog](docs:kirigami;org.kde.kirigami.dialogs.PromptDialog) je v bistvu pogovorno okno z vgrajeno oznako in privzeto [contentPadding](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#contentPadding-prop), ki se uporablja za poziv uporabniku za nekatere informacije. Ta vrsta pogovornega okna naj bi se uporabljala samo za preproste pozive z da/ne ali kratke zahteve za uporabniški vnos.

source: Its main property is [Kirigami.Dialog.subtitle](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#subtitle-prop), to which you would add text. If any QML component is added as a child of the prompt dialog, that component will take the place of the subtitle instead.
sl: Njegova glavna lastnost je [Kirigami.Dialog.subtitle](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-promptdialog.html#subtitle-prop), v katero bi dodali besedilo. Če je katera koli komponenta QML dodana kot podrejena komponenta pogovornega okna poziva, bo ta komponenta namesto podnaslova.

source: The [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog) is a specialized dialog that is used to list a selection of clickable options for the user using its [actions](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-menudialog.html#actions-prop) property.
sl: [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog) je specializirano pogovorno okno, ki se uporablja za seznam izbire možnosti, ki jih lahko uporabnik klikne, z uporabo lastnosti [actions](https://api-staging.kde.org/qml-org-kde-kirigami-dialogs-menudialog.html#actions-prop).

source: [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) components are what we use to create such drawers. These are set to the [globalDrawer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#globalDrawer-prop) property of the [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow) that forms the basis of our Kirigami application.
sl: Komponente [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) so tisto, kar uporabljamo za ustvarjanje takšnih predalov. Ti so določeni v predalu [globalDrawer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#globalDrawer-prop) kar je lastnost okna '[Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), ki tvorijo osnove naše aplikacije Kirigami.

source: The [titleIcon](https://api-staging.kde.org/qml-org-kde-kirigami-globaldrawer.html#titleIcon-prop) property takes names for system-wide icons according to the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application which comes with [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
sl: Lastnost [titleIcon](https://api-staging.kde.org/qml-org-kde-kirigami-globaldrawer.html#titleIcon-prop) pobere imena za sistemske ikone po specifikaciji FreeDesktop. Te ikone in imena ikon si lahko ogledate s KDE-jevo aplikacijo CuttleFish, ki pride z orodjem [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), ali z obiskom specifikacije [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-imenovanje-spec/icon-naming-spec-latest.html).

source: Thankfully, Kirigami global drawers provide an [isMenu](https://api-staging.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop) property. When set to `true`, they turn into more traditional menus only on the desktop.
sl: K sreči Kirigami globalni predali zagotavljajo lastnost [isMenu](https://api-staging.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop). Ko je nastavljena na 'true', se naši globalni predali spremenijo v bolj tradicionalne menije samo na namizju.

source: Children of a [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) have a property named [Kirigami.FormData.label](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop). This property lets you set the label that will be provided for the child component in question.
sl: Odvisne komponente [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) imajo nastanitev z imenom [Kirigami.FormData.label](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop). S to lastnostjo lahko nastavite oznako, ki bo zagotovljena za zadevno odvisno komponento.

source: FormLayouts can also be divided into sections. Setting where a section starts is as easy as setting a child component's [Kirigami.FormData.isSection](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) to true. This will provide the component with some extra margin at the top to demarcate the start of the new section.
sl: FormLayouts lahko razdelite tudi na odseke. Nastavitev, kjer se začne odsek, je tako preprosta, kot je nastavitev dela podrejene komponente [Kirigami.FormData.isSection]((https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) na true. To bo komponenti zagotovilo nekaj dodatnega roba na vrhu, da razmeji začetek novega odseka.

source: [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) components are best suited for starting new sections. Separators are used to draw a thin horizontal line, demarcating the end of a section. If you would rather not have a line drawn between sections, you can use a standard QML [Item](docs:qtquick;QtQuick.Item) property. Alternatively you could use the [Kirigami.FormData.isSection](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) property on any other component.
sl: Komponente [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) so najprimernejše za začetek novih odsekov. Ločila so uporabljena za risanje tanke črte, ki označuje konec sekcije. Če raje nimate narisanih črt med sekcijami, lahko uporabite lastnost standardne QML postavke [Item](docs:qtquick;QtQuick.Item). Alternativno lahko uporabite lastnost [Kirigami.FormData.isSection](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) na katerikoli drugi komponenti.

source: However, this is not recommended. On components where [Kirigami.FormData.isSection](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) is set to `true`, the label text provided for this component's [Kirigami.FormData.label](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) property will be displayed as the section's header text.
sl: Vendar to ni priporočljivo. Na komponentah kjer je [Kirigami.FormData.isSection](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) postavljeno na `true`, bo dano besedilo oznake za to komponento [Kirigami.FormData.label](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) prikazano kot besedilo glave te sekcije.

source: A handy feature of [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) is that you can add checkboxes to its children. This can be useful in settings pages where you might want to let the user enable or disable a setting, and also want the user to provide some extra information in a component such as a textfield.
sl: Priročna zmožnost [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) je, da lahko dodate potrditvena polja svojim odvisnim delom. To je lahko uporabno na straneh z nastavitvami, na katerih boste morda želeli dovoliti uporabniku omogočiti ali onemogočiti nastavitev, poleg tega pa želite, da uporabnik v komponenti, kot je polje z besedilom, zagotovi nekaj dodatnih informacij.

source: If you would rather have your form layout stay consistent regardless of your application's environment, you can use the [wideMode](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formlayout.html#wideMode-prop) property of the [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) component:
sl: Če želite, da postavitev obrazca ostane skladna ne glede na okolje aplikacije, lahko uporabite lastnost [wideMode](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formlayout.html#wideMode-prop) komponente [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout):

source: There are instances when you want a label to be assigned to components that have more than one line or to a list of components. This can be achieved by putting the [Kirigami.FormData.label](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) in the [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), as you might have noticed in [Sections and Separators](#sections-and-separators). By default the label is positioned in the vertical center of the layout, which is not always desirable. We can change this with help of [Kirigami.FormData.labelAlignment](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#labelAlignment-attached-prop).
sl: Obstajajo primeri, ko želite, da je oznaka dodeljena komponentam, ki imajo več vrstic ali na seznam komponent. To je mogoče doseči z dajanjem [Kirigami.FormData.label]((https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) v [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), kar ste lahko opazili v [Sections and Separators](#sections-and-separators). Oznaka je privzeto nameščena v navpičnem središču postavitve, kar ni vedno zaželeno. To lahko spremenimo s pomočjo [Kirigami.FormData.labelAlignment](https://api-staging.kde.org/qml-org-kde-kirigami-layouts-formdata.html#labelAlignment-attached-prop).

source: [text](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#text-prop): here is where you set the text of your inline message.
sl: [text](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#text-prop): tukaj nastavite besedilo vašega znotrajvrstičnega sporočila.

source: Standard inline messages are like the ones above: they have a blue background and a default icon. We can change that with the [type](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#type-prop) property, which lets us set our inline message to a different type. There are four types we can choose from:
sl: Standardna znotrajvrstična sporočila so podobna zgornjim: imajo modro ozadje in privzeto ikono. To lahko spremenimo z lastnostjo [type]https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#type-prop), kar nam dovoli, da naše vneseno sporočilo nastavimo na drugo vrsto. Izbiramo lahko med štirimi vrstami:

source: You can also customise the icon that appears on the top left of your message by providing a system icon name for the [icon.source](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#icon.source-prop) property. These icon names should correspond to icons installed on your system; you can use an application such as Cuttlefish provided by [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) to browse and search the icons available on your system, and see what their names are.
sl: Ikono, ki je prikazana zgoraj levo od sporočila, lahko prilagodite tudi tako, da zagotovite ime sistemske ikone za lastnost [icon.source](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#icon.source-prop). Ta imena ikon bi morala ustrezati ikonam, nameščenim v vašem sistemu; lahko uporabite aplikacijo, kot je Cuttlefish, ki jo nudi provided by [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) za brskanje in iskanje ikon, ki so na voljo v vašem sistemu, in ugotavljanje kakšna so njihova imena.

source: If your messages need to be interactive, you can attach Kirigami actions to your inline messages. Like with pages, you can do this by setting the [InlineMessage.actions](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#actions-prop) property to either a [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) or an array containing [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) components.
sl: Če morajo biti vaša sporočila interaktivna, lahko svojim znotrajvrstičnim sporočilom priložite dejanja Kirigami. Tako kot pri straneh lahko to storite tako, da lastnost [InlineMessage.actions](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#actions-prop) nastavite na [Kirigami.Action](docs:kirigami2;Action) ali na vektor, ki vsebuje komponente [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action).

source: By default, this close button is hidden, but this can be overridden by setting the [showCloseButton](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#showCloseButton-prop) property to `true`.
sl: Privzeto je ta gumb za zapiranje skrit, vendar je to lastnost mogoče preglasiti z nastavitvijo lastnosti [showCloseButton](https://api-staging.kde.org/qml-org-kde-kirigami-inlinemessage.html#showCloseButton-prop) na 'true'.

source: There are two improvements that can be done here. The first is that, with [initialPage](https://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop), we can both set `mainPage` to be the first page that appears in the page row, and have its dimensions be managed by the page row instead of via manual [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) or [layouts](https://doc.qt.io/qt-6/layout.html). The second is to have a toolbar, which can be set by defining a toolbar style with [globalToolBar.style](https://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#globalToolBar-prop). There are a few styles we can choose from, but we'll go with `Kirigami.ApplicationHeaderStyle.Auto` for now.
sl: Tu lahko naredimo dve izboljšavi. Prva je, da lahko z začetno stranjo [initialPage](https://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop), nastavimo dve lastnosti glavne strani, da je `mainPage` prva stran, ki se pokaže v vrstici strani in njene dimenzije upravlja vrstica strani namesto ročni [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) ali [layouts](https://doc.qt.io/qt-6/layout.html). Druga izboljšava je, da imamo orodno vrstico, ki jo lahko določimo s slogom orodne vrstice z [globalToolBar.style](dhttps://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#globalToolBar-prop). Obstaja na izbiro nekaj slogov, za zdaj bomo uporabili 'Kirigami.ApplicationHeaderStyle.Auto'.

source: There are only two ways of adding pages to a page row: by setting its [initialPage](https://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop) (which can optionally take an array of pages) or by using [push()](docs:kirigami;org.kde.kirigami.PageRow::push). To delete a page from the page row, you should use [pop()](docs:kirigami;org.kde.kirigami.PageRow::pop), whereas [goBack()](docs:kirigami;org.kde.kirigami.PageRow::goBack) or [goForward()](docs:kirigami;org.kde.kirigami.PageRow::goForward) can be used to navigate between pages.
sl: V vrstici strani obstajata samo dva načina dodajanja strani: z nastavitvijo njene začetne strani [initialPage](https://api-staging.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop) (ki neobvezno lahko prevzame vektor strani) ali z uporabo funkcije [push()](docs:kirigami;org.kde.kirigami.PageRow::push). Za brisanje strani iz vrstice strani , uporabite funkcijo [pop()](docs:kirigami;org.kde.kirigami.PageRow::pop), kjer lahko uporabite še [goBack()](docs:kirigami;org.kde.kirigami.PageRow::goBack) ali [goForward()](docs:kirigami;org.kde.kirigami.PageRow::goForward) za navigacijo med stranmi.

source: Kirigami with C++
sl: Kirigami s C++

source: This will take a long while to finish on first run. If you close your terminal, you can simply run the environment setup file again to compile your app.
sl: To bo trajalo dolgo časa, da se konča pri prvem teku. Če zaprete terminal, lahko preprosto znova zaženete namestitveno datoteko okolja, da prevedete svojo aplikacijo.

source: Kirigami with Python
sl: Kirigami s Pytonom

source: FormHeader
nl: Formulierkop

source: In case you want to automatically build the project with kde-builder, custom module name should be the same as the project root folder (in our case it will be "kirigami-tutorial"), otherwise you would need to customize the `source-dir` or `dest-dir` for the module. We will assume the path to your `main.cpp` will be `$HOME/kde/src/kirigami-tutorial/src/main.cpp`.
nl: In het geval dat u automatisch het project met kde-builder wilt bouwen, dan moet de naam van de eigen module hetzelfde zijn als de basismap van het project (in ons geval zal dit zijn "kirigami-tutorial"), anders moet u de `source-dir` of `dest-dir` voor de module aanpassen. We nemen aan dat het pad naar uw hoofd `main.cpp` zal zijn `$HOME/kde/src/kirigami-tutorial/src/main.cpp`.

source: The program will be installed to `$HOME/.local/bin` and its desktop entry to `$HOME/.local/share/applications`.
nl: Het programma zal geïnstalleerd worden in `$HOME/.local/bin` en zijn desktop-item in `$HOME/.local/share/applications`.

source: This tutorial will guide you through the process of creating your own convergent application using the [Kirigami framework](/frameworks/kirigami). A *convergent application*, in this context, means people can use the program easily regardless of the device it is running on. If it is on a desktop computer, it will adapt to a large screen and a mouse and keyboard; if it is being used on a mobile, it will accept input from a touchscreen and adapt to a smaller portrait screen. And so on.
fr: Ce tutoriel vous guidera tout au long du processus de création de votre propre application convergente en utilisant [l'environnement de développement Kirigami](/frameworks/kirigami). Dans ce contexte, une *application convergente* signifie que les utilisateurs peuvent utiliser le programme facilement, quel que soit le périphérique sur lequel il est exécuté. Si elle s'exécute sur un ordinateur de bureau, elle s'adaptera à un grand écran, à une souris et un clavier. Si elle est exécuté sur un téléphone portable, elle acceptera les entrées provenant d'un écran tactile et s'adaptera à un écran plus petit en mode portrait. Et ainsi de suite.
pl: Samouczek ten poprowadzi cię przez tworzenie własnej, spójnej aplikacji przy użyciu [szkieletów Kirigami](/frameworks/kirigami). *Spójna aplikacja*, w tym znaczeniu, oznacza, że ludzie mogą jej używać niezależnie od urządzenia, na którym jej używają. Jeśli zostanie uruchomiona na komputerze, to dostosuje się do dużego ekranu, a także myszy i klawiatury; jeśli zostanie uruchomiona na urządzeniu przenośnym, to będzie przyjmować wszystkie naciśnięcia ekranu i dostosuje się do mniejszego pionowego ekranu. I tak dalej.

source: While you will use QML to create the visual part of your application, the business logic -- the code that does the heavy lifting for your application's functionality -- is usually created in C++ for performance reasons. We will also explore how to integrate our business logic with our UI in the tutorials below.
fr: Alors que vous utiliserez QML pour créer la partie visuelle de votre application, la logique métier - le code faisant le gros du travail pour la fonctionnalité de votre application - est généralement créée en C++ pour des raisons de performance. Nous allons également explorer comment intégrer notre logique métier à notre interface utilisateur dans les tutoriels ci-dessous.
pl: Widoczną część aplikacji stworzysz w QML, podczas gdy niewidoczną, odpowiedzialną za logikę -- kod który najbardziej przyczynia się do możliwości jakie daje twoja aplikacja -- jest zazwyczaj tworzony w C++ ze względu na wydajność. Dowiemy się także jak połączyć część logiczną naszego programu z jego częścią obsługi w poniższym samouczku.

source: The About Page allows you to have a page that shows the copyright notice of the application together with the contributors and some information of which platform it's running on.
fr: La page « À propos » vous permet d'avoir une page affichant la déclaration de droit d'auteur de l'application ainsi que les contributeurs et quelques informations sur la plate-forme sur laquelle elle fonctionne.
pl: Strona o programie daje stronę, która pokazuje uwagę o prawach autorskich aplikacji wraz z jej twórcami oraz pewne szczegóły nt. platformy, na której jest uruchomiona.

source: First, we are going to create two files in the `src/` directory called `about.cpp` and `about.h`.
fr: Tout d'abord, nous allons créer deux fichiers dans le dossier « src/ », nommés « about.cpp » et « about.h ».
pl: Najpierw w katalogu `src/` utworzymy dwa pliki o nazwie `about.cpp` oraz `about.h`.

source: In the `.h` file we create this class `AboutType` which is inherited from [QObject](https://doc.qt.io/qt-5/qobject.html).
fr: Dans le fichier « .h », nous créons cette classe « AboutType » héritant de l'objet [QObject](https://doc.qt.io/qt-5/qobject.html).
pl: W pliku `.h` tworzymy klasę `AboutType`, która dziedziczy z [QObject](https://doc.qt.io/qt-5/qobject.html).

source: The `Q_OBJECT` macro tells the compiler that this class uses own signals and slots, the `Q_PROPERTY` macro behaves like a class data member, but it has additional features, it will allow our QML code to have access to this class.
fr: La macro « Q_OBJECT » indique au compilateur que cette classe utilise ses propres signaux et connexions. La macro « Q_PROPERTY » se comporte comme un membre de données de classe, mais elle a des caractéristiques supplémentaires. Elle permettra à notre code QML d'avoir accès à cette classe.
pl: Makro `Q_OBJECT` mówi kompilatorowi, że tak klasa używa własnych sygnałów i slotów, makro `Q_PROPERTY` zachowuje się jak zmienna danowa danej klasy, lecz zawiera dodatkowe możliwości, a mianowicie umożliwi kodowi QML na dostęp do tej klasy.

source: The `aboutData` method will return the application data from `KAboutData`.
fr: La méthode « aboutData » retournera les données d'application concernant l'objet « KAboutData ».
pl: Metoda `aboutData` zwróci dane aplikacji z `KAboutData`.

source: In the `.cpp` file we just include the `.h` file.
fr: Dans le fichier « cpp », seul le fichier « .h » est inclus.
pl: W pliku `.cpp` dołączamy tylko plik `.h`.

source: The program name used internally.
fr: Le nom du programme utilisé en interne.
