Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: We also set some metadata relating to the application. These include the organisation that created the application, the organisation's website, and the name of the application. We set these properties by calling [QApplication](docs:qtwidgets;QApplication), instantiating an object that comes from [QCoreApplication](docs:qtcore;QCoreApplication) and provides the [event loop](docs:qtcore;QCoreApplication::exec) for applications regardless of whether they have a GUI or not (so if we ran our program without the GUI, this metadata would still be set).
ca: També establim algunes metadades relacionades amb l'aplicació. Aquestes inclouen l'organització que va crear l'aplicació, el lloc web de l'organització i el nom de l'aplicació. Configurem aquestes propietats en el [QApplication](docs:qtwidgets;QApplication), un objecte que ve de [QCoreApplication](docs:qtcore;QCoreApplication) i proporciona el [bucle d'esdeveniments](docs:qtcore;QCoreApplication::exec) per a les aplicacions, independentment de si tenen una IGU o no (pel que si executem el nostre programa sense la IGU, aquestes metadades encara s'establiran).
eo: Ni ankaŭ fiksas kelkajn metadatumojn rilate al la aplikaĵo. Ĉi tiuj inkluzivas la organizon kiu kreis la aplikaĵon, la retejon de la organizo kaj la nomon de la aplikaĵo. Ni agordas ĉi tiujn trajtojn vokante [QApplication](docs:qtwidgets;QApplication), instantiigante objekton kiu venas de [QCoreApplication](docs:qtcore;QCoreApplication) kaj provizas la [okazaĵbuklon](docs:qtcore;QCoreApplication::exec) por aplikoj sendepende de ĉu ili havas GUI aŭ ne (do se ni ruligus nian programon sen la GUI, ĉi tiuj metadatenoj ankoraŭ estus fiksitaj).
es: También definimos varios metadatos relacionados con la aplicación. Entre ellos, la organización que ha creado la aplicación, la página web de esta organización y el nombre de la aplicación. Definimos estas propiedades llamando a [QApplication](docs:qtwidgets;QApplication), creando una instancia de un objeto que viene de [QCoreApplication](docs:qtcore;QCoreApplication) y que proporciona el [bucle de eventos](docs:qtcore;QCoreApplication::exec) de las aplicaciones, sin importar si disponen de una interfaz gráfica de usuario o no (de modo que si ejecutamos nuestro programa sin interfaz de usuario, estos metadatos también se definirían).
nl: We stellen ook enige metagegevens in gerelateerd aan de toepassing. Dit omvat de organisatie die de toepassing maakt, de website van de organisatie en de naam van de toepassing. We stellen deze eigenschappen in door [QCoreApplication](docs:qtwidgets;QApplication) aan te roepen, waarmee een object wordt gemaakt dat komt van [QCoreApplication](docs:qtcore;QCoreApplication::exec) en de [event loop](docs:qtcore;QCoreApplication::exec) levert voor toepassingen ongeacht of ze een GUI hebben of niet (dus als we ons programma zonder GUI uitvoeren, dan zouden deze metagegevens nog steeds zijn ingesteld).
pt: Também definimos alguns meta-dados relacionados com a aplicação. Estes incluem a organização que criou a aplicação, a página Web da organização e o nome da aplicação. Definimos estas propriedades no [QApplication](docs:qtwidgets;QApplication), um objecto que herda do [QCoreApplication](docs:qtcore;QCoreApplication) e que fornece o [ciclo de eventos](docs:qtcore;QCoreApplication::exec) das aplicações, independentemente se têm uma interface gráfica ou não (por isso, se executarmos o nosso programa sem essa interface, estes meta-dados ficarão definidos à mesma).
sl: Nastavili smo tudi nekaj metapodatkov, ki se nanašajo na aplikacijo. Ti vključujejo organizacijo, ki je ustvarila aplikacijo, spletno stran organizacije in ime aplikacije. Te lastnosti nastavimo tako, da pokličemo [QApplication](docs:qtwidgets;QApplication), instanciramo objekt, ki prihaja iz [QCoreApplication](docs:qtcore;QCoreApplication) in zagotovimo [dogodkovno zanko](docs:qtcore;QCoreApplication::exec) za aplikacije ne glede na to, ali imajo GUI ali ne (torej, če bi izvajali naš program brez GUI, bi bili ti metapodatki še vedno nastavljeni).
sv: Vi anger också in en del metadata för programmet. De inkluderar organisationen som skapade programmet, organisationens webbplats och namnet på programmet. Vi anger egenskaperna genom att anropa [QApplication](docs:qtwidgets;QApplication), för att instansiera ett objekt som kommer från [QCoreApplication](docs:qtcore;QCoreApplication) och som tillhandahåller [händelseslingan](docs:qtcore;QCoreApplication::exec) för program oavsett om de har ett grafiskt användargränssnitt eller inte (så om vi körde vårt program utan grafiskt användargränssnitt, skulle metadata fortfarande användas).
uk: Ми також встановимо значення деяких метаданих, пов'язаних із програмою. Серед цих даних організація, якою створено програму, сайт організації та назва програми. Ми встановлюємо значення цих властивостей викликом [QApplication](docs:qtwidgets;QApplication), створенням екземпляра об'єкта, який походить від [QCoreApplication](docs:qtcore;QCoreApplication) і забезпечує роботу [циклу обробки подій](docs:qtcore;QCoreApplication::exec) для програм, незалежно від того, мають ці програми графічний інтерфейс чи ні (отже, якщо ми запустимо нашу програму без графічного інтерфейсу, значення для цих метаданих все одно буде встановлено).

source: To make our app look good with KDE's [Breeze icons](https://invent.kde.org/frameworks/breeze-icons) and [Breeze style](https://invent.kde.org/plasma/breeze) on non-Plasma environments such as Windows or GNOME, we need to do three things:
ca: Per a fer que la nostra aplicació es vegi bé amb les [icones Brisa](https://invent.kde.org/frameworks/breeze-icons) i l'[estil Brisa](https://invent.kde.org/plasma/breeze) de KDE en entorns no Plasma com el Windows o el GNOME, hem de fer tres coses:
eo: Por ke nia aplikaĵo aspektu bone kun la [Breeze-piktogramoj](https://invent.kde.org/frameworks/breeze-icons) kaj [Breeze-stilo](https://invent.kde.org/plasma/breeze) de KDE sur ne-Plasmaj medioj kiel Vindozo aŭ GNOME, ni devas fari tri aferojn:
es: Para que nuestra aplicación se vea bien con los [iconos Brisa](https://invent.kde.org/frameworks/breeze-icons) y con el [estilo Brisa](https://invent.kde.org/plasma/breeze) de KDE en entornos distintos a Plasma, como Windows o GNOME, necesitamos hacer tres cosas:
nl: Om ons programma er goed uit te laten zien met KDE's [Breeze pictogrammen](https://invent.kde.org/frameworks/breeze-icons) en [Breeze stijl](https://invent.kde.org/plasma/breeze) in een niet-Plasma omgeving zoals Windows of GNOME, moeten we drie dingen doen:
sl: Da bo naša aplikacija videti dobro z [ikonami Sapice](https://invent.kde.org/frameworks/breeze-icons) in [slogom Sapice](https://invent.kde.org/plasma/breeze) KDE na okoljih, ki niso Plasma, kot sta Windows ali GNOME, moramo narediti tri stvari:
sv: För att få vårt program att se bra ut med KDE:s [Breeze-ikoner](https://invent.kde.org/frameworks/breeze-icons) och [Breeze-stil](https://invent.kde.org/plasma/breeze) på andra miljöer än Plasma, såsom Windows eller GNOME måste vi göra tre saker:
uk: Щоб наша програма виглядала добре з [піктограмами Breeze](https://invent.kde.org/frameworks/breeze-icons) та [стилем Breeze](https://invent.kde.org/plasma/breeze) KDE у середовищах, відмінних від Плазми, зокрема у Windows або GNOME, нам потрібно виконати три дії:

source: initialize the theming facilities of [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) on platforms where icon themes aren't part of the system (like Windows or MacOS) with [KIconTheme::initTheme()](https://api.kde.org/kicontheme.html#initTheme)
ca: inicialitzar les funcions de tematització dels [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) a les plataformes on els temes d'icones no formen part del sistema (com el Windows o el MacOS) amb [KIconTheme::initTheme()](https://api.kde.org/kicontheme.html#initTheme)

source: set the QStyle with [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) to force Breeze instead of the native platform style
ca: definir el QStyle amb [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) per a forçar el Brisa en lloc de l'estil natiu de la plataforma
eo: agordi la QStyle per [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) por devigi Breeze anstataŭ la denaska platformstilo
es: definir el QStyle con [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) para forzar el estilo Brisa en lugar del estilo nativo de la plataforma,
nl: De QStyle met [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) zo instellen om te forceren dat Breeze word gebruikt in plaats van de eigen platform stijl
sl: nastaviti QStyle z [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle), da vsilite Sapico namesto izvornega sloga platforme
sv: ställa in QStyle med [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) för att tvinga användning av Breeze istället för den inbyggda plattformsstilen
uk: встановити QStyle за допомогою [QApplication::setStyle()](docs:qtwidgets;QApplication::setStyle) для примусового використання Breeze замість природного стилю платформи

source: set the QtQuick Controls style with [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) to force Breeze with KDE's [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style)
ca: definir l'estil del QtQuick Controls amb [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) per a forçar el Brisa amb el [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style) de KDE
eo: meti la QtQuick-Regilan stilon per [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle()) por devigi Breeze kun [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style) de KDE
es: definir el estilo de los controles de QtQuick con [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) para forzar el uso de Brisa con [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style) de KDE.
nl: Met [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) QtQuick Controle instellen om met [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style) het gebruik van Breeze af te dwingen.
sl: nastavite slog QtQuick Controls z [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle), da prisilite Breeze s KDE-jevim [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style)
sv: ställa in stilen QtQuick Controls med [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) för att tvinga användning av Breeze med KDE:s [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style)
uk: встановити стиль QtQuick Controls за допомогою [QQuickStyle::setStyle()](docs:qtquickcontrols;QQuickStyle::setStyle) для примусового встановлення Breeze за допомогою [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style) KDE

source: The call to [KIconTheme::initTheme()](https://api.kde.org/kicontheme.html#initTheme) needs to be done before creating the QApplication and lets the app find Breeze icons to use. Setting the QStyle to Breeze is needed because we used QApplication for our app instead of [QGuiApplication](docs:qtgui;QGuiApplication). Actual interface controls in the window like buttons and checkboxes will follow Breeze by using `qqc2-desktop-style`.
ca: La crida a [KIconTheme::initTheme()](https://api.kde.org/kicontheme.html#initTheme) cal fer-la abans de crear la QApplication i permetre que l'aplicació trobi les icones Brisa a usar. Cal establir el QStyle a Brisa perquè usem QApplication per a la nostra aplicació en lloc de [QGuiApplication](docs:qtgui;QGuiApplication). Els controls reals de la interfície de la finestra com botons i caselles de selecció seguiran el Brisa utilitzant `qqc2-desktop-style`.

source: The [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) lets us load an application from a QML file, which we do in the next line. In `engine.loadFromModule("org.kde.tutorial", "Main");` we load our QML from the URI import defined in CMake.
ca: El [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) permet carregar una aplicació des d'un fitxer QML, el qual fem en la línia següent. A `engine.loadFromModule("org.kde.tutorial", "Main");` carreguem el nostre QML des de l'URI d'importació definit al CMake.
eo: La [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) permesas al ni ŝargi aplikaĵon el QML-dosiero, kion ni faras en la sekva linio. En `engine.load(QUrl(QStringLiteral("qrc:/main.qml")));` ni ŝargas nian QML de URL en nia [Qt Resource File](https://doc.qt.io/ qt-6/resources.html) (`resources.qrc`).
es: El [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) nos permite cargar una aplicación desde un archivo QML, lo que haremos en la siguiente línea. En `engine.loadFromModule("org.kde.tutorial", "Main");` cargamos nuestro QML de la importación de URI definida en CMake.
nl: De [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine)) laat ons een toepassing laden uit een QML-bestand, wat we in de volgende regel doen. In `engine.loadFromModule("org.kde.tutorial", "Main");` laden we onze QML uit het importeren van de URI gedefinieerd in CMake.
sl: [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) nam omogoča nalaganje aplikacije iz datoteke QML, kar storimo v naslednji vrstici. V `engine.loadFromModule("org.kde.tutorial", "Main");` naložimo naš QML iz uvoza URI, definiranega v CMake.
sv: [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) låter oss ladda ett program från en QML-fil, vilket vi gör på nästa rad. Med `engine.loadFromModule("org.kde.tutorial", "Main");` laddar vi vår QML från webbadressen import definierad i CMake.
uk: [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) надає нам можливість завантажувати програму з файла QML, що ми і робимо у наступному рядку. У `engine.loadFromModule("org.kde.tutorial", "Main");` ми завантажуємо наш QML з імпорту адрес, який визначено у CMake.

source: Next, we check if our engine correctly loaded the QML file by checking that the engine's [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) list is not empty. We can then run our application with [app.exec()](docs:qtcore;QCoreApplication::exec).
ca: A continuació, comprovem si el nostre motor ha carregat correctament el fitxer QML comprovant que la llista [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) del motor no està buida. Després podem executar la nostra aplicació amb [app.exec()](docs:qtcore;QCoreApplication::exec).
eo: Poste, ni kontrolas ĉu nia motoro ĝuste ŝargis la QML-dosieron kontrolante ke la listo de [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) de la motoro ne estas malplena. Ni povas tiam ruli nian aplikaĵon per [app.exec()](docs:qtcore;QCoreApplication::exec).
es: Seguidamente, nos aseguramos de que nuestro motor ha cargado correctamente el archivo QML comprobando que la lista [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) del motor no está vacía. En tal caso podemos ejecutar nuestra aplicación con [app.exec()](docs:qtcore;QCoreApplication::exec).
nl: Vervolgens controleren we of onze engine juist het QML-bestand geladen heeft door te controleren dat de [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects)-lijst van de engine niet leeg is. Daarna kunnen we onze toepassing uitvoeren met [app.exec()](docs:qtcore;QCoreApplication::exec).
pt: De seguida iremos verificar se o nosso motor carregou correctamente o ficheiro QML, verificando se a lista [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) do motor não está vazia. Nesse caso, poderemos executar a nossa aplicação com o [app.exec()](docs:qtcore;QCoreApplication::exec).
sl: Nato preverimo, ali je naš mehanizem pravilno naložil datoteko QML, tako da preverimo, da [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) ni prazen. Nato lahko zaženemo aplikacijo z [app.exec()](docs:qtcore;QCoreApplication::exec).
sv: Därefter kontrollerar vi om vårt gränssnitt har läst in QML-filen riktigt genom att kontrollera att gränssnittets lista [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) inte är tom. Vi kan därefter köra vårt program med [app.exec()](docs:qtcore;QCoreApplication::exec).
uk: Далі, ми перевіримо, чи наш рушій належним чином завантажив файл QML, перевіривши, чи список [rootObjects()](docs:qtqml;QQmlApplicationEngine::rootObjects) рушія є порожнім. Далі, ми можемо запустити нашу програму за допомогою [app.exec()](docs:qtcore;QCoreApplication::exec).

source: Understanding CMakeLists
ca: Entendre les CMakeLists
eo: Kompreni CMakeLists
es: Entendiendo CMakeLists
fr: Compréhension de « CMakeLists »
nl: CMakeLists begrijpen
pl: Rozumienie CMakeLists
pt: Compreender o CMakeLists
sl: Razumevanje CMakeLists
sv: Förstå CMakeLists
uk: Розбираємося із CMakeLists

source: Getting to grips with how CMakeLists.txt files work
ca: Familiaritzant-nos amb com funcionen els fitxers CMakeLists.txt
eo: Ekkompreni kiel funkcias CMakeLists.txt dosieroj
es: Familiarizarse con el funcionamiento de los archivos CMakeLists.txt
fr: Prendre en main le fonctionnement des fichiers « CMakeLists.txt ».
nl: Grip krijgen op hoe bestanden CMakeLists.txt werken
pl: Poznanie tego jak działają pliki CMakeLists.txt
pt: Tentar compreender como funcionam os ficheiros CMakeLists.txt
sl: Kako se spoprijeti z delovanjem datotek CMakeLists.txt
sv: Att begripa hur CMakeLists.txt-filer fungerar
uk: Ознайомлюємося із тим, як працюють файли CMakeLists.txt

source: In our introductory tutorial, we used [CMake](https://cmake.org/) as the build system for our application, but we only really paid close attention to one of our `CMakeLists.txt` files. Here, we're going to go over how it works in a bit more detail.
ca: En la nostra guia d'aprenentatge introductòria, emprem el [CMake](https://cmake.org/) com el sistema de compilació per a la nostra aplicació, però només parem molta atenció a un dels nostres fitxers `CMakeLists.txt`. Aquí, repassarem com funcionen amb una mica més de detall.
eo: En nia enkonduka lernilo, ni uzis [CMake](https://cmake.org/) kiel la konstrusistemon por nia aplikaĵo, sed ni nur tre atentis unu el niaj `CMakeLists.txt` dosieroj. Ĉi tie, ni iom pli detale trarigardos kiel ĝi funkcias.
es: En nuestro tutorial de introducción hemos usado [CMake](https://cmake.org/) como sistema de compilación para nuestra aplicación, aunque solo hemos prestado más atención a uno de nuestros archivos `CMakeLists.txt`. Aquí vamos a profundizar un poco más sobre cómo funciona.
nl: In ons inleidende handboek gebruiken we [CMake](https://cmake.org/) als het bouwsysteem voor onze toepassing, maar we hebben slechts alleen wat meer aandacht besteed aan een van onze bestanden `CMakeLists.txt`. Hier gaan we het in meer detail hebben over dit werkt.
pt: No nosso tutorial introdutório, usámos o [CMake](https://cmake.org/) como sistema de compilação para a nossa aplicação, mas só prestámos atenção a um dos nossos ficheiros `CMakeLists.txt`. Aqui, vamos ver como funcionam os CMakeLists com um pouco mais de detalhe.
sl: V naši uvodni vaji smo uporabili CMake](https://cmake.org/) kot sistem gradnje za našo aplikacijo, vendar smo bili le resnično pozorni na eno od naših datotek `CMakeLists.txt`. Tukaj bomo podrobneje preučili, kako to deluje.
sv: I vår inledande handledning, använde vi [CMake](https://cmake.org/) som byggsystem för vårt program, men vi har egentligen bara uppmärksammat en av våra `CMakeLists.txt`. Här går vi igenom hur det fungerar lite mer detaljerat.
uk: У нашому вступному підручнику ми використали [CMake](https://cmake.org/) як систему збирання для нашої програми, але приділили увагу лише одному з файлів `CMakeLists.txt`. Цей розділ ми присвятимо докладнішому вивченню принципів його роботи.

source: CMake is useful because it allows us to automate much of the stuff that needs to be done before compilation.
ca: El CMake és útil perquè ens permet automatitzar gran part de les coses que s'han de fer abans de la compilació.
eo: CMake estas utila ĉar ĝi permesas al ni aŭtomatigi grandan parton de la aĵoj kiuj devas esti faritaj antaŭ kompilo.
es: CMake es útil porque nos permite automatizar la mayoría de las cosas necesarias que hay que hacer antes de compilar.
fr: « CMake » est utile car il nous permet d'automatiser la plupart des choses devant être faites avant la compilation.
nl: CMake is nuttig omdat het ons is staat stelt om veel van de zaken die gedaan moeten worden alvorens te compileren te automatiseren.
pl: CMake jest użyteczny, bo umożliwia zautomatyzowanie większości rzeczy, które muszą się wydarzyć przez zbudowaniem programu.
pt: O CMake é útil porque nos permite automatizar muitas das coisas que precisam de ser feitas antes da compilação.
sl: CMake je uporaben, ker nam omogoča avtomatizacijo veliko stvari, ki jih je treba storiti pred prevajanjem.
sv: CMake är användbart eftersom det låter oss automatisera mycket av grejorna som måste göras innan kompilering.
uk: CMake є корисним, оскільки за його допомогою ми можемо автоматизувати більшу частину роботи, яку слід виконати до компіляції.

source: The root CMakeLists.txt
ca: El CMakeLists.txt arrel
eo: La radika CMakeLists.txt
es: El CMakeLists.txt raíz
nl: De basis CMakeLists.txt
sl: Korenska CMakeLists.txt
sv: CMakeLists.txt i rotkatalogen
uk: Кореневий CMakeLists.txt

source: You might remember this `CMakeLists.txt` file from the first tutorial:
ca: És possible que recordeu aquest fitxer `CMakeLists.txt` de la primera guia d'aprenentatge:
eo: Vi eble memoras ĉi tiun `CMakeLists.txt` dosieron de la unua lernilo:
es: Es posible que recuerde este archivo `CMakeLists.txt` del primer tutorial:
nl: Misschien herinnert u zich dit bestand `CMakeLists.txt` uit de eerste handleiding:
pt: Poderá recordar este ficheiro `CMakeLists.txt` do primeiro tutorial:
sl: Morda se spomnite datoteke `CMakeLists.txt` iz prve vaje:
sv: Du kanske kommer ihåg filen `CMakeLists.txt` från den första handledningen:
uk: Можливо, ви пам'ятаєте цей файл `CMakeLists.txt` з першого підручника:

source: The first line, `cmake_minimum_required()` sets the version of CMake we will be calling.
ca: La primera línia, `cmake_minimum_required()` estableix la versió del CMake que es cridarà.
eo: La unua linio, `cmake_minimum_required()` fiksas la version de CMake, kiun ni vokos.
es: La primera línea, `cmake_minimum_required()` define la versión de CMake que se va a utilizar.
nl: De eerste regel, `cmake_minimum_required()` stelt de versie van CMake in die we willen aanroepen.
sl: Prva vrstica, `cmake_minimum_required()`, nastavi različico CMake, ki jo bomo klicali.
sv: Första raden, `cmake_minimum_required()` ställer in version av CMake som vi anropar.
uk: Перший рядок, `cmake_minimum_required()`, встановлює версію CMake, яку буде викликано.

source: After that, `project(kirigami-tutorial)` defines the name of the project.
ca: Després d'això, `project(kirigami-tutorial)` defineix el nom del projecte.
eo: Post tio, `project(kirigami-tutorial)` difinas la nomon de la projekto.
es: A continuación, `project(kirigami-tutorial)` define el nombre del proyecto.
nl: Daarna, definieert `project(kirigami-tutorial)` de naam van het project.
sl: Nato `project(kirigami-tutorial)` definira ime projekta.
sv: Därefter definierar `project(kirigami-tutorial)` projektets namn.
uk: Після цього `project(kirigami-tutorial)` визначає назву проєкту.
