Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![A window showing two radio buttons where only one radio button can be ticked at the same time](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
ca: ![Una finestra que mostra dos botons d'opció a on només es pot marcar un botó d'acció a la vegada](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
eo: ![Fenestro montranta du radiobutonojn kie nur unu radiobutono povas esti markita samtempe](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
es: ![Una ventana que muestra dos botones de opción donde solo uno de ellos se puede marcar](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
nl: ![Een venster dat twee keuzerondjes toont waar één keuzerondje tegelijk geactiveerd kan worden](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
sl: ![Okno, ki prikazuje dva izbirna gumba, kjer je hkrati mogoče označiti samo en izbirni gumb](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
sv: ![Ett fönster som visar en uppsättning alternativknappar där endast en alternativknapp kan markeras samtidigt](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)
uk: ![Вікно, у якому показано дві кнопки-перемикачі, де одночасно можна позначати лише один пункт](/docs/getting-started/kirigami/components-controls/controls-radiobutton.webp)

source: Switches
ca: Commutadors (Switches)
eo: Ŝaltiloj
es: Interruptores
fr: Commutateurs
nl: Schakelaars
pl: Przełączniki
pt: Comutadores
sl: Stikala
sv: Omkopplare
uk: Перемикачі

source: On the desktop, changing settings usually involves changing the setting and then applying it by clicking on an "Apply" or "OK" button. On mobile, we can use a [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch) instead.
ca: A l'escriptori, canviar les opcions de configuració generalment implica canviar la configuració i després aplicar-la fent clic a un botó «Aplica» o «D'acord». Al mòbil, en el seu lloc podem utilitzar un [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch).
eo: Sur la labortablo, ŝanĝi agordojn kutime implicas ŝanĝi la agordojn kaj poste apliki ĝin alklakante butonon "Apliki" aŭ "Bone". Ĉe poŝtelefono, ni povas uzi [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch) anstataŭe.
nl: Op het bureaublad betekent instellingen wijzigen gewoonlijk de instelling wijzigen en daarna de instelling toepassen door op een knop 'Toepassen' of 'OK' te klikken. Op een mobiel kunnen we in plaats daarvan [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch) gebruiken.
pt: No computador, a alteração da configuração normalmente envolve a alteração de uma opção e depois aplicar essa alteração com um botão "Aplicar" ou "OK". Em dispositivos móveis, podemos usar os objectos [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch) para esse fim.
sl: Na namizju spreminjanje nastavitev običajno vključuje spreminjanje nastavitve in nato uporabo nastavitve s klikom gumba »Uveljavi« ali »V redu«. Na mobilnih napravah lahko namesto tega uporabimo stikala [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch).
sv: På skrivbordet gäller ändring av inställningar att ändra inställningen och sedan verkställa den genom att klicka på knapparna 'Verkställ' eller 'Ok'. På en mobil kan vi använda en [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch) istället.
uk: На звичайному комп'ютері зміна параметрів, зазвичай, включає зміну параметра, а потім застосування параметра натисканням кнопки «Застосувати» або «Гаразд». На мобільному пристрої ми можемо замість цих кнопок можна скористатися [Controls.Switch](docs:qtquickcontrols;QtQuick.Controls.Switch).

source: Switches can be toggled between an on and off state. They can be toggled by clicking or tapping on them, or they can be dragged towards the on or off position. Once again, switches can be set to be on or off by default with the [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) property.
ca: Els commutadors es poden alternar entre un estat activat i desactivat. Es poden alternar fent-hi clic o tocar-los, o es poden arrossegar cap a la posició activada o desactivada. Un cop més, els commutadors es poden establir perquè estiguin activats o desactivats de manera predeterminada amb la propietat [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
eo: Ŝaltiloj povas esti ŝanĝitaj inter ŝaltita kaj malŝaltita stato. Ili povas esti ŝanĝitaj alklakante aŭ frapetante ilin, aŭ ili povas esti trenitaj al la enŝaltita aŭ malŝaltita pozicio. Denove, ŝaltiloj povas esti ŝaltitaj aŭ malŝaltitaj defaŭlte kun la propreco [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
nl: Schakelaars kunnen omgeschakeld worden tussen aan en uit. Er kan op geklikt of getikt worden om ze om te schakelen of ze kunnen versleept worden naar de aan of uit positie. Nog eens, schakelaars kunnen standaard aan of uit gezet worden met de eigenschap [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
pt: Os comutadores poderão alternar entre um estado ligado e desligado. Poderá carregar ou tocar nos mesmos para os comutar, e os mesmos poderão ser arrastados para a posição 'ligado' ou 'desligado'. Mais uma vez, os comutadores poderão ser configurados para estar ligados ou desligados por omissão com a propriedade [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
sl: Stikala je mogoče preklopiti med vklopljenim in izklopljenim stanjem. Lahko jih kliknete ali tapnete, da jih preklopite, ali pa jih povlečete proti položaju »vključeno« ali »izključeno«. Stikala lahko privzeto nastavite tako, da so vklopljena ali izklopljena z lastnostjo potrjeno [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
sv: Omkopplare kan ändras mellan tillstånden på och av. De kan klickas eller beröras för att ändra dem, eller kan dras mot positionen på eller av. Återigen kan omkopplare ställas in att vara på eller av som förval med egenskapen [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
uk: Перемикачі можна перемикати між увімкненим і вимкненим станами. Їх можна натискати або торкатися їх, їх можна також перетягувати між позиціями «увімкнено» і «вимкнено». Знову ж таки, типово для перемикачів можна встановлювати стани «увімкнено» і «вимкнено» за допомогою властивості [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).

source: ![A window showing two evenly-spaced switches that function as toggles](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
ca: ![Una finestra que mostra dos interruptors separats uniformement que funcionen com a commutadors](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
eo: ![Fenestro montranta du egale interspacigitajn ŝaltilojn kiuj funkcias kiel baskuliloj](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
nl: ![Een venster dat twee gelijk verdeelde schakelaars toont die functioneren als omschakelaars](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
sl: ![Okno, ki prikazuje dve enakomerno razporejeni stikali, ki delujeta kot stikala](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
sv: ![Ett fönster som visar en uppsättning omkopplare som fungerar som alternativ](/docs/getting-started/kirigami/components-controls/controls-switch.webp)
uk: ![Вікно, у якому показано два рівномірно розташовані перемикачі](/docs/getting-started/kirigami/components-controls/controls-switch.webp)

source: Sliders
ca: Controls lliscants
eo: Ŝoviloj
es: Deslizadores
fr: Curseurs
nl: Schuifknoppen
pl: Suwaki
pt: Barras
sl: Drsniki
sv: Skjutreglage
uk: Повзунки

source: Sliders allow users to select certain values by sliding a handle along a track. There are several types that you can choose from depending on the values you'd like your users to choose in your application.
ca: Els controls lliscants permeten als usuaris seleccionar certs valors fent lliscar un control al llarg d'una pista. Hi ha diversos tipus entre els quals podreu triar segons els valors que us agradaria que triessin els usuaris a la vostra aplicació.
eo: Glitiloj permesas al uzantoj elekti certajn valorojn glitante tenilon laŭ trako. Estas pluraj tipoj, kiujn vi povas elekti laŭ la valoroj, kiujn vi ŝatus, ke viaj uzantoj elektu en via aplikaĵo.
es: Los deslizadores permiten a los usuarios seleccionar ciertos valores deslizando un asa a lo largo de una pista. Existen varios tipos entre los que puede elegir, según los valores que desea que los usuarios elijan en su aplicación.
nl: Schuifregelaars bieden gebruikers het selecteren van bepaalde waarden door een hendel te verschuiven langs een lijn. Er zijn verschillende typen waaruit u kunt kiezen afhankelijk van de waarden waaruit u uw gebruikers wilt laten kiezen in uw toepassing.
pt: As barras deslizantes permitem aos utilizadores seleccionarem determinados valores se deslizar uma pega ao longo de um risco. Graças aos QtQuick Controls, existem vários tipos que poderá escolher, dependendo dos valores que gostaria que os seus utilizadores escolhessem na sua aplicação.
sl: Drsniki omogočajo uporabnikom, da izberejo določene vrednosti, tako da drsijo ročico vzdolž steze. Obstaja več vrst, ki jih lahko izberete, odvisno od vrednosti, za naj bi jih uporabniki izbrali v aplikaciji.
sv: Skjutreglage tillåter användare att välja ett visst värde genom att flytta ett grepp längs ett spår. Det finns flera typer som du kan välja bland, beroende på värdena du vill att användarna ska välja i ditt program.
uk: За допомогою повзунків користувачі можуть вибрати певні значення перетягуванням елемента керування уздовж доріжки. Маємо декілька типів, один з яких ви можете вибрати, залежно від значень, які користувачі мають вибирати у вашій програмі.

source: Standard and tickmarked sliders
ca: Controls lliscants estàndard i amb marques
eo: Normaj kaj markitaj glitiloj
es: Deslizadores estándares y con marcas
fr: Curseurs standards et gradués
nl: Standaard en vaste posities schuifregelaars
pl: Suwaki zwyczajne i z naniesionymi kresami
pt: Barras normais e com marcações
sl: Standardni drsniki in drsniki s kljukico
sv: Vanliga och streckmarkerade skjutreglage
uk: Стандартні повзунки і повзунки із позначками

source: A standard [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) provides the user with very fine control over the selection they wish to make.
ca: Un [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) estàndard proporciona a l'usuari un control molt precís sobre la selecció que voleu realitzar.
eo: Norma [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) provizas la uzanton per tre bona rego pri la elekto kiun ili volas fari.
es: Un [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) estándar proporciona al usuario un control muy preciso sobre la selección que desee realizar.
nl: Een standaard [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) biedt de gebruiker een erg fijne controle over de selectie die deze wil maken.
pt: Um [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) normal fornece ao utilizador algum controlo fino na selecção que pretendem fazer.
sl: Standardni drsnik [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) omogoča uporabniku zelo dober nadzor nad izborom, ki ga želi opraviti.
sv: En vanligt [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) ger användaren mycket fin kontroll över valet de vill göra.
uk: За допомогою стандартного [Controls.Slider](docs:qtquickcontrols;QtQuick.Controls.Slider) користувач може точно вказати вибране значення.

source: In Left to Right mode, sliders go left to right to increase when in horizontal orientation, while in Right to Left mode they go in the reverse direction. In both modes, sliders in vertical orientation go from the bottom up.
ca: En el mode d'esquerra a dreta, els controls lliscants van d'esquerra a dreta per a augmentar en l'orientació horitzontal, mentre que en el mode de dreta a esquerra van en la direcció inversa. En ambdós modes, els controls lliscants en orientació vertical van des de baix cap a dalt.
eo: En Dekstre al Dekstre reĝimo, glitiloj iras maldekstren dekstren por pliiĝi kiam en horizontala orientiĝo, dum en Dekstre al Maldekstren reĝimo ili iras en la inversa direkto. En ambaŭ reĝimoj, glitiloj en vertikala orientiĝo iras de malsupre supren.
es: En el modo de izquierda a derecha, los controles deslizantes se mueven de izquierda a derecha para aumentar cuando están en orientación horizontal, mientras que en el modo de derecha a izquierda se mueven en la dirección inversa. En ambos modos, los controles deslizantes con orientación vertical se mueven de abajo hacia arriba.
nl: In modus Links-naar-rechts, gaan schuifregelaar van links naar rechts om toe te nemen indien in horizontale oriëntatie, terwijl in modus Rechts-naar-links ze in de omgekeerde richting gaan. In beide modi gaan schuifregelaars in verticale oriëntatie van onder omhoog.
pt: No modo da Esquerda para a Direita, as barras aumentam o seu valor quando as desloca da esquerda para a direita, enquanto que no modo da Direita para a Esquerda, as mesmas funcionam na direcção inversa. Em ambos os modos, as barras com orientação vertical são incrementadas de baixo para cima.
sl: V načinu od leve proti desni drsniki od levo proti desni večajo, ko so v horizontalni orientaciji, medtem ko v načinu desno proti levi v obratni smeri. V obeh načinih drsniki v navpični orientaciji gredo od spodaj navzgor.
sv: I vänster till höger-läge ökar reglagen från vänster till höger i horisontell orientering, medan de i höger till vänster-läge går i motsatt riktning. I båda lägena går reglagen i vertikal orientering nerifrån och upp.
uk: У режимі зліва праворуч повзунки рухаються зліва праворуч для збільшення при горизонтальній орієнтації, а у режимі справа ліворуч вони рухаються в оберненому напрямку. В обох режимах повзунки у вертикальній орієнтації рухаються знизу вгору.

source: The coloration provides a visual indicator of how large the value you are selecting is.
ca: La coloració proporciona un indicador visual de com és de gran el valor que s'està seleccionant.
eo: La kolorigo provizas vidan indikilon pri kiom granda estas la valoro, kiun vi elektas.
es: La coloración proporciona un indicador visual de la magnitud del valor seleccionado.
nl: De kleuring biedt een visuele indicator over hoe groot de waarde is, die u selecteert.
pt: A coloração dá uma reacção visual de quão grande é o valor que está a escolher.
sl: Barvanje nudi vizualni prikaz, kako velika je vrednost, ki jo izbirate.
sv: Färgläggningen tillhandahåller en visuell indikering av hur stort värdet du väljer är.
uk: Розфарбовування є візуальним індикатором того, наскільки великим є вибране значення.

source: Sliders have a few important properties we must pay attention to:
ca: Els controls lliscants tenen algunes propietats importants a les quals hem de parar atenció:
eo: Glitiloj havas kelkajn gravajn ecojn, pri kiuj ni devas atenti:
es: Los deslizadores tienen algunas propiedades importantes a las que debemos prestar atención:
fr: Les curseurs ont quelques propriétés importantes auxquelles nous devons prêter attention :
nl: Schuifregelaars hebben een paar belangrijke eigenschappen waar we aandacht aan moeten besteden:
pl: Suwaki mają kilka istotnych właściwości, na które musimy zwrócić uwagę:
pt: As barras deslizantes têm algumas propriedades interessantes às quais devemos prestar atenção:
sl: Drsniki imajo nekaj pomembnih lastnosti, na katere moramo biti pozorni:
sv: Skjutreglage har några viktiga egenskaper som vi måste ta hänsyn till:
uk: У повзунків декілька важливих властивостей, на які слід звернути увагу:

source: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): contains the value at which the handle is placed, and can also be set manually to provide a default starting value
ca: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): conté el valor en el qual es col·loca la nansa i també es pot establir manualment per a proporcionar un valor inicial predeterminat
eo: [valoro](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): enhavas la valoron ĉe kiu la tenilo estas metita, kaj ankaŭ povas esti agordita mane al provizi defaŭltan komencan valoron
es: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): contiene el valor en el que se coloca el asa; también se puede definir manualmente para proporcionar un valor inicial predeterminado
nl: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): bevat de waarde waarop de hendel geplaatst wordt en kan ook handmatig ingesteld worden, gewoonlijk om een standaard startwaarde te leveren
pt: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): contém o valor onde se encontra a pega, podendo ser definido manualmente para oferecer um valor predefinido válido
sl: vrednost [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): vsebuje vrednost, na katero je pritrjen ročaj, in ga je mogoče nastaviti tudi ročno, da se zagotovi privzeta začetno vrednost
sv: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): Innehåller värdet där greppet är placerat, och kan också ställas in manuellt för att tillhandahålla ett förvald startvärde
uk: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#value-prop): містить значення, на якому розташовано повзунок, і яке може бути встановлено вручну для надання типового початкового значення

source: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): defines the range of the slider by specifying the maximum value it can go to
ca: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): defineix l'interval del control lliscant, especificant el valor màxim fins al qual pot anar
eo: [al](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): difinas la gamon de la glitilo specifante la maksimuman valoron al kiu ĝi povas iri
es: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): define el intervalo del deslizador indicando el valor máximo hasta el que puede llegar
nl: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): definieert de reeks van de schuifregelaar door de maximale waarde te specificeren waar deze naar toe kan gaan
sl: [do](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): definira obseg drsnika tako, da poda največjo vrednost, do katere lahko gre
sv: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): Definierar skjutreglagets intervall genom att ange det maximala värdet den kan gå till
uk: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#to-prop): визначає діапазон повзунка, вказуючи максимальне значення, до якого його можна пересунути

source: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): allows the slider to be set to a vertical orientation with [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
ca: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): permet que el control lliscant s'estableixi en una orientació vertical amb [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
eo: [orientiĝo](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): permesas la glitilon esti agordita al vertikala orientiĝo kun [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
es: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): permite situar el deslizador verticalmente si se usa el valor [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
nl: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.hientation-prop): biedt de schuifregelaar om in een verticale oriëntatie gezet te worden met [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
sl: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): omogoča nastavitev drsnika na navpično orientacijo z [Qt.Vertical]( https://doc.qt.io/qt-6/qt.html#Orientation-enum)
sv: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): Låter skjutreglaget ställas in till en vertikal orientering med [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)
uk: [orientation](https://doc.qt.io/qt-6/qml-qtquick-controls2-slider.html#orientation-prop): надає змогу встановлювати вертикальну орієнтацію повзунка за допомогою [Qt.Vertical](https://doc.qt.io/qt-6/qt.html#Orientation-enum)

source: ![A window showing a vertical slider with its current value underneath it](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
ca: ![Una finestra que mostra un control lliscant amb el seu valor actual a sota](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
eo: ![Fenestro montranta vertikalan glitilon kun ĝia nuna valoro sub ĝi](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
es: ![Una ventana que muestra un deslizador vertical con su valor actual debajo](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
nl: ![Een venster dat een verticale schuifregelaars toont met zijn huidige waarde eronder](/docs/getting-started/kirigami/components-controls/controls-sliders.webp)
sl: ![Okno, ki prikazuje navpični drsnik s trenutno vrednostjo pod njim](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
sv: ![Ett fönster som visar en uppsättning reglage, en horisontell och en vertikal](/docs/getting-started/kirigami/components-controls/controls-sliders.webp)
uk: ![Вікно із показаним вертикальним повзунком з поточним значенням під повзунком](/docs/getting-started/kirigami/components-controls/controls-slider.webp)
