Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) is the simplest type of card. It's just a rectangle with a shadow, which can contain any [Item](docs:qtquick;QtQuick.Item) in it. It can also have Items assigned to its [header](docs:kirigami2;templates::AbstractCard::header) or [footer](docs:kirigami2;templates::AbstractCard::footer) properties. In this case a [Kirigami.Heading](docs:kirigami2;Heading) is its `header` and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) is the card's [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).
eo: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) estas la plej simpla tipo de karto. Ĝi estas nur rektangulo kun ombro, kiu povas enhavi ajnan [Item](docs:qtquick;QtQuick.Item) en ĝi. Ĝi ankaŭ povas havi Erojn asignitajn al siaj [header](docs:kirigami2;ŝablonoj::AbstractCard::header) aŭ [footer](docs:kirigami2;templates::AbstractCard::footer). En ĉi tiu kazo [Kirigami.Heading](docs:kirigami2;Heading) estas ĝia `kapo` kaj [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) estas la [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).
nl: Een [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) is het eenvoudigste type kaart. Het is gewoon een rechthoek met een schaduw, die elk [Item](docs:qtquick;QtQuick.Item) erin kan bevatten. Het kan ook items aan zijn eigenschappen [header](docs:kirigami2;templates::AbstractCard::header) of [footer](docs:kirigami2;templates::AbstractCard::footer) toekennen. In dat geval is een [Kirigami.Heading](docs:kirigami2;Heading) zijn`header`en een [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) is het [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop) van de kaart.
sv: Ett [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) är den enklaste sortens kort. Det är bara en rektangel med en skugga, som kan innehålla vilket [objekt](docs:qtquick;QtQuick.Item) som helst. Det kan också ha objekt tilldelade till dess [header](docs:kirigami2;templates::AbstractCard::header) eller [footer](docs:kirigami2;templates::AbstractCard::footer) egenskaper. I detta fall är [Kirigami.Heading](docs:kirigami2;Heading) dess sidhuvud och [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) är kortets [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).
uk: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) є найпростішим типом картки. Це лише прямокутник з тінню, який може містити у собі будь-який [Item](docs:qtquick;QtQuick.Item). На ній також можуть міститися пункти, які пов'язано із його властивостями [header](docs:kirigami2;templates::AbstractCard::header) або [footer](docs:kirigami2;templates::AbstractCard::footer). У цьому випадку [`Kirigami.Heading`](docs:kirigami2;Heading) є його шапкою, а [`Controls.Label`](docs:qtquickcontrols;QtQuick.Controls.Label), є [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).

source: A [Kirigami.Card](docs:kirigami2;Card) inherits from [AbstractCard](docs:kirigami2;AbstractCard) and provides more features out of the box. Cards inherit the same [header](docs:kirigami2;templates::AbstractCard::header) and [footer](docs:kirigami2;templates::AbstractCard::footer) from an Abstract Card, but you are encouraged to use a [banner](docs:kirigami2;Card::banner) and a set of [Kirigami.Action](docs:kirigami2;Action) in the `actions` group instead.
eo: [Kirigami.Karto](docs:kirigami2;Karto) heredas de [AbstractCard](docs:kirigami2;AbstractCard) kaj disponigas pliajn funkciojn el la skatolo. Kartoj heredas la saman [header](docs:kirigami2;ŝablonoj::AbstractCard::header) kaj [footer](docs:kirigami2;templates::AbstractCard::footer) de Abstrakta Karto, sed vi estas kuraĝigitaj uzi [ standardo](docs:kirigami2;Karto::standardo) kaj aro de [Kirigami.Action](docs:kirigami2;Ago) en la grupo `agoj` anstataŭe.
nl: Een [Kirigami.Card](docs:kirigami2;Card) erft van [AbstractCard](docs:kirigami2;AbstractCard) en levert standaard meer mogelijkheden. Cards erven dezelfde [header](docs:kirigami2;templates::AbstractCard::header) en [footer](docs:kirigami2;templates::AbstractCard::footer) uit een Abstract Card, maar u wordt aangemoedigd om een [banner](docs:kirigami2;Card::banner) te gebruiken en in plaats daarvan een set [Kirigami.Action](docs:kirigami2;Action) in de groep `actions`.
pt: Um [Kirigami.Card](docs:kirigami2;Card) herda de [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) e oferece mais funcionalidades de base. Estes cartões herdam os mesmos atributos [header](docs:kirigami2;templates::AbstractCard::header) e [footer](docs:kirigami2;templates::AbstractCard::footer) de um cartão abstracto, mas aconselha-se a utilização de um [banner](docs:kirigami2;Card::banner) e um conjunto de objectos [`Kirigami.Action`](docs:kirigami2;Action) no grupo `actions` em alternativa.
sv: Ett [Kirigami.Card](docs:kirigami2;Card) ärver från [AbstractCard](docs:kirigami2;AbstractCard) och tillhandahåller fler funktioner från början. Ett kort ärver samma [header](docs:kirigami2;templates::AbstractCard::header) and [footer](docs:kirigami2;templates::AbstractCard::footer) från ett abstrakt kort, men du uppmuntras att använda en [banner](docs:kirigami2;Card::banner) och en uppsättning [Kirigami.Action](docs:kirigami2;Action) i gruppen `actions` istället.
uk: [Kirigami.Card](docs:kirigami2;Card) є нащадком [`Kirigami.AbstractCard`](docs:kirigami2;AbstractCard) і від початку надає більше можливостей. Картки успадковують [заголовок](docs:kirigami2;templates::AbstractCard::header) і [підвал](docs:kirigami2;templates::AbstractCard::footer) від абстрактної картки, але вам варто замість них скористатися [банером](docs:kirigami2;Card::banner) і набором [Kirigami.Action](docs:kirigami2;Action) у групі `actions`.

source: A [Kirigami.CardsLayout](docs:kirigami2;CardsLayout) is most useful when the cards being presented are either not instantiated by a model or are instantiated by a model that always has very few items. They are presented as a grid of two columns which will remain centered if the application is really wide, or become a single column if there is not enough space for two columns, such as a mobile phone screen.
eo: [Kirigami.CardsLayout](docs:kirigami2;CardsLayout) estas plej utila kiam la prezentitaj kartoj estas aŭ ne instancigitaj de modelo aŭ estas instancigitaj de modelo kiu ĉiam havas tre malmultajn erojn. Ili estas prezentitaj kiel krado de du kolumnoj, kiuj restos centritaj se la aplikaĵo estas vere larĝa, aŭ fariĝos ununura kolumno se ne estas sufiĉe da spaco por du kolumnoj, kiel ekrano de poŝtelefono.
nl: Een [Kirigami.CardsLayout](docs:kirigami2;CardsLayout) is het meest nuttig wanneer de gepresenteerde kaarten ofwel niet door een model worden gemaakt of door een model dat altijd erg weinig items heeft. Ze worden gepresenteerd als een raster met twee kolommen die gecentreerd zullen blijven als de toepassing echt breed is of een enkele kolom wordt als er niet genoeg ruimte is voor twee kolommen, zoals het scherm van een mobiele telefoon.
pt: Um [Kirigami.CardsLayout](docs:kirigami2;CardsLayout) é mais útil quando os cartões apresentados não estão representados por um modelo ou estão por um modelo que tem sempre poucos itens. Os mesmos são dispostos como uma grelha de duas colunas que ficarão centradas, caso a aplicação seja realmente ampla, ou ficarão numa única coluna se não existir espaço suficiente para duas colunas, como acontece no ecrã de um telemóvel.
sv: En [`Kirigami.CardsLayout`](docs:kirigami2;CardsLayout) är användbarast när korten som presenteras antingen inte instansieras av en modell eller instansieras av en modell som alltid har mycket få objekt. De presenteras som ett rutnät med två kolumner som förblir centrerade om programmet är mycket brett, eller blir en enda kolumn om det inte finns tillräckligt med utrymme för två kolumner, såsom på en mobiltelefonskärm.
uk: [`Kirigami.CardsLayout`](docs:kirigami2;CardsLayout) є найкориснішим, коли екземпляри представлених карток створюються моделлю або моделлю, яка завжди складається із дуже малої кількості елементів. Вони представляються як таблиця з двох стовпчиків, які залишаються центрованими, якщо вікно програми є досить широким, і стає одностовпчиковою, якщо для двох стовпчиків недостатньо місця, зокрема на екрані мобільного телефону.

source: [`CardsListView`](docs:kirigami2;CardsListView) is better suited for larger models.
eo: [`CardsListView`](docs:kirigami2;CardsListView) estas pli taŭga por pli grandaj modeloj.
es: [`CardsListView`](docs:kirigami2;CardsListView) es más apropiada para modelos grandes.
nl: [`CardsListView`](docs:kirigami2;CardsListView) is meer geschikt voor grotere modellen.
sv: [`CardsListView`](docs:kirigami2;CardsListView) är bättre lämpade för stora modeller.
uk: [`CardsListView`](docs:kirigami2;CardsListView) краще пасує для більших моделей.

source: Important
eo: Grava
es: Importante
nl: Belangrijk
pt: Importante
sl: Pomembno
sv: Viktigt
uk: Важливе

source: A [CardsLayout](docs:kirigami2;CardsLayout) should always be contained within a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
eo: [CardsLayout](docs:kirigami2;CardsLayout) ĉiam estu enhavita ene de [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
es: Un [CardsLayout](docs:kirigami2;CardsLayout) siempre debe estar contenido dentro de un [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
nl: Een [CardsLayout](docs:kirigami2;CardsLayout) zou zich altijd binnen een [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) moeten bevinden.).
pt: Um [CardsLayout](docs:kirigami2;CardsLayout) deverá estar contido dentro de um [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
sv: En [CardsLayout](docs:kirigami2;CardsLayout) ska alltid finnas inne i en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
uk: [CardsLayout](docs:kirigami2;CardsLayout) має завжди міститися у [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).

source: A card can optionally be oriented horizontally. In this case it will be wider than tall, and is better suited to being placed in a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). If you must put it in a [CardsLayout](docs:kirigami2;CardsLayout), it will have a [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) of `2` by default.
eo: Karto povas laŭvole esti orientita horizontale. En ĉi tiu kazo ĝi estos pli larĝa ol alta, kaj pli taŭgas por esti metita en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Se vi devas meti ĝin en [CardsLayout](docs:kirigami2;CardsLayout), ĝi havos [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) de `2` defaŭlte.
nl: Een kaart kan optioneel horizontaal georiënteerd zijn. In dat geval zal het breder zijn dan hoog en is het beter geschikt om geplaatst te worden in een [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Als u het in een [CardsLayout](docs:kirigami2;CardsLayout) moet plaatsen, zal het standaard een [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) van `2` hebben.
pt: Um cartão poderá opcionalmente ser disposto na horizontal. Nesse caso, será mais larga que alta, pelo que será mais adequada para estar disposta num [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Se precisar de a colocar num [CardsLayout](docs:kirigami2;CardsLayout), terá um [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) de 2 por omissão.
sv: Ett kort kan valfritt orienteras horisontellt. I så fall är det bredare än högt, och är bättre ämnat att placeras i en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Om du måste placera det i en [CardsLayout](docs:kirigami2;CardsLayout) har det förvald [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) av 2.
uk: Якщо потрібно, картку може бути зорієнтовано горизонтально. У цьому випадку вікно буде ширшим, ніж вищим — його краще пристосовано до розташування у [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html). Якщо вам потрібно вписати його у [CardsLayout](docs:kirigami2;CardsLayout), його типовим значенням [maximumColumns](docs:kirigami2;CardsLayout::maximumColumns) буде 2.

source: CardsListView
eo: KartojListView

source: A [Kirigami.CardsListView](docs:kirigami2;CardsListView) is a list view that can be used with [AbstractCard](docs:kirigami2;AbstractCard) components.
eo: [Kirigami.CardsListView](docs:kirigami2;CardsListView) estas listvido uzebla kun [AbstractCard](docs:kirigami2;AbstractCard) komponantoj.
es: Una [Kirigami.CardsListView](docs:kirigami2;CardsListView) es una vista de lista que se puede usar con componentes [AbstractCard](docs:kirigami2;AbstractCard).
nl: Een [Kirigami.CardsListView](docs:kirigami2;CardsListView) is een lijstweergave die gebruikt kan worden met componenten [AbstractCard](docs:kirigami2;AbstractCard) .
pt: Um [Kirigami.CardsListView](docs:kirigami2;CardsListView) é uma lista que poderá ser usada com componentes [AbstractCard](docs:kirigami2;AbstractCard).
sv: En [Kirigami.CardsListView](docs:kirigami2;CardsListView) är en listvy som kan användas med [AbstractCard](docs:kirigami2;AbstractCard) komponenter.
uk: [Kirigami.CardsListView](docs:kirigami2;CardsListView) є панеллю перегляду списком, якою можна скористатися за допомогою компонентів [AbstractCard](docs:kirigami2;AbstractCard).

source: A [CardsListView](docs:kirigami2;CardsListView) will stretch child cards to its own width. This component should therefore only be used with cards which will look good at any horizontal size. Use of a [Card](docs:kirigami2;Card) component inside it is discouraged, unless it has [Qt.Horizontal](docs:qtcore;Qt::Orientation) as its [headerOrientation](docs:kirigami2;templates::AbstractCard::headerOrientation) property.
eo: [CardsListView](docs:kirigami2;CardsListView) etendos infanajn kartojn al sia propra larĝo. Ĉi tiu komponanto devus esti uzata nur kun kartoj, kiuj aspektos bone je ajna horizontala grandeco. Uzo de [Karto](docs:kirigami2;Karto) komponanto ene de ĝi estas malinstigita, krom se ĝi havas [Qt.Horizontal](docs:qtcore;Qt::Orientation) kiel sia [headerOrientation](docs:kirigami2;ŝablonoj:: AbstractCard::headerOrientation) proprieto.
nl: Een [CardsListView](docs:kirigami2;CardsListView) zal kindkaarten uitrekken naar zijn eigen breedte. Deze component zou daarom alleen gebruikt moeten worden met kaarten die er goed uitzien in elke horizontale grootte. Met gebruik van de component [Card](docs:kirigami2;Card) erin wordt ontraden, tenzij het [Qt.Horizontal](docs:qtcore;Qt::Orientation) heeft als zijn eigenschap [headerOrientation]docs:kirigami2;templates::AbstractCard::headerOrientation).
pt: Um [CardsListView](docs:kirigami2;CardsListView) irá esticar os cartões-filhos para a sua própria largura. Por esse motivo, este componente só deverá ser usado com cartões que fiquem bem com qualquer tamanho horizontal. Se usar um `Kirigami.CardsListView`, o componente [Card](docs:kirigami2;Card) é desencorajado, a menos que tenha [Qt.Horizontal](docs:qtcore;Qt::Orientation) como valor da sua propriedade [headerOrientation](docs:kirigami2;templates::AbstractCard::headerOrientation).
sv: En [CardsListView](docs:kirigami2;CardsListView) sträcker ut underliggande kort till sin egen bredd. Komponenten bör därför bara användas med kort som ser bra ut med vilken horisontell storlek som helst. Användning av komponenten [kort](docs:kirigami2;Card) avråds från, om den inte har [Qt.Horizontal](docs:qtcore;Qt::Orientation) som sin [headerOrientation](docs:kirigami2;templates::AbstractCard::headerOrientation) egenskap.
uk: [CardsListView](docs:kirigami2;CardsListView) розтягуватиме дочірні картки до власної ширини. Тому цей компонент слід використовувати із картками, які виглядатимуть добре за будь-якого горизонтального розміру. Не варто використовувати компонент [Card](docs:kirigami2;Card) всередині, якщо не встановлено значення [Qt.Horizontal](docs:qtcore;Qt::Orientation) для його властивості [headerOrientation](docs:kirigami2;templates::AbstractCard::headerOrientation).

source: The choice between using this view with [AbstractCard](docs:kirigami2;AbstractCard) components or a conventional [ListView](docs:qtquick;QtQuick.ListView) with [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) components is purely an aesthetic one.
eo: La elekto inter uzi ĉi tiun vidon kun [AbstractCard](docs:kirigami2;AbstractCard) komponantoj aŭ konvencia [ListView](docs:qtquick;QtQuick.ListView) kun [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem] :kirigami2;BasicListItem) komponantoj estas nur estetika.
es: La elección entre usar esta vista con componentes [AbstractCard](docs:kirigami2;AbstractCard) o una [ListView](docs:qtquick;QtQuick.ListView) convencional con componentes [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) es solo una cuestión de estética.
nl: De keuze tussen deze weergave gebruiken met componenten [AbstractCard](docs:kirigami2;AbstractCard) of een conventionele [ListView](docs:qtquick;QtQuick.ListView) met componenten [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) is puur een esthetische.
pt: A opção entre usar esta janela com os componentes [AbstractCard](docs:kirigami2;AbstractCard) ou com uma [ListView](docs:qtquick;QtQuick.ListView) convencional com componentes [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) é meramente estética.
sv: Valet mellan användning av vyn med [AbstractCard](docs:kirigami2;AbstractCard)-komponenter eller en konventionell [ListView](docs:qtquick;QtQuick.ListView) med [AbstractListItem](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem)-komponenter är rent estetiskt.
uk: Вибір щодо використання цієї панелі перегляду з компонентами [AbstractCard](docs:kirigami2;AbstractCard) або типовим [ListView](docs:qtquick;QtQuick.ListView) з компонентами [`AbstractListItem`](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) є суто справою естетичних смаків.

source: Chips
eo: Blatoj
sl: Čipi
uk: Чіпси

source: [Kirigami.Chip](docs:kirigami2;Chip) components are small elements inherited from [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) used for displaying common properties or filters of something. These are typically text elements, which is also interactable and comes with an optional delete button.
eo: [Kirigami.Chip](docs:kirigami2;Chip) komponantoj estas malgrandaj elementoj hereditaj de [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) uzataj por montri komunajn proprecoj aŭ filtriloj de io. Ĉi tiuj estas tipe tekstaj elementoj, kiuj ankaŭ estas interageblaj kaj venas kun laŭvola forigbutono.
es: Los componentes [Kirigami.Chip](docs:kirigami2;Chip) son pequeños elementos que heredan de [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) y que se usan para mostrar propiedades comunes o filtros de algo. Suelen ser elementos de texto, con el que se puede interactuar, y contienen un botón de borrado opcional.
nl: [Kirigami.Chip](docs:kirigami2;Chip) componenten zijn kleine elementen geërfd van [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) gebruikt voor het tonen van gemeenschappelijke eigenschappen of filters van iets. Dit zijn typisch tekstelementen, waarop ook geacteerd kan worden en komt met een optionele knop voor wissen.
sv: [Kirigami.Chip](docs:kirigami2;Chip) komponenter är små element som ärvs från [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) och som används för att visa vanliga egenskaper eller filtrera något. Det är vanligtvis textelement, som också är ändringsbara och levereras med en valfri borttagningsknapp.
uk: Компоненти [Kirigami.Chip](docs:kirigami2;Chip) є малими елементами, які успадковують властивості від [AbstractButton](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html) і які використовують для показу типових властивостей або фільтрів чогось. Типово, це текстові елементи, з якими можна взаємодіяти і які містять необов'язкову кнопку вилучення даних.

source: Chips can easily be added using the `Kirigami.Chip` component. By assigning a string to its `text` field, we give chips their name.
eo: Blatoj povas facile esti aldonitaj uzante la komponanton "Kirigami.Chip". Asignante ĉenon al ĝia `teksto`-kampo, ni donas al blatoj sian nomon.
es: Se pueden añadir Chips con facilidad usando el componente `Kirigami.Chip`. Proporcionamos un nombre a un chip asignando una cadena al campo `text`.
nl: Chips kunnen gemakkelijk toegevoegd worden met de component `Kirigami.Chip`. Door het toekennen van een tekenreeks aan zijn `text`-veld geven we chips hun naam.
sl: Čipe lahko preprosto dodate s komponento `Kirigami.Chip`. Z dodelitvijoniza v njegovo polje 'text', damo čipom njihovo ime.
sv: Chips kan enkelt läggas till genom att använda komponenten `Kirigami.Chip`. Genom att tilldela en sträng till deras fält `text`, ger vi chips sina namn.
uk: Чіпси можна без проблем додати за допомогою компонента `Kirigami.Chip`. Наданням рядкових даних для поля `text` чіпса ми надаємо чіпсу назву.
