Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![An inline message with close button showing](/docs/use/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
fr: ! [Un message intégré avec l'affichage d'un bouton de fermeture](/docs/use/kirigami/components-inlinemessages/inlinemessages-closebutton.png)

source: Listviews can help you display objects from a model in an attractive way. To use a list view, you have to keep track of three things:
fr: Les affichages en liste peuvent vous aider à afficher les objets d'un modèle de manière attrayante. Pour utiliser un affichage en liste, vous devez tenir compte de trois éléments :
pl: Listviews mogą pomóc ci wyświetlić obiekt z modelu w przystępny sposób. Aby użyć widoku listy, musisz pamiętać o trzech rzeczach:

source: If you would like further clarification, the Qt documentation has [an informative page](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html) on the topic.
fr: Si vous souhaitez obtenir des précisions, la documentation de Qt contient [une page d'informations](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html) sur ce sujet.
pl: Jeśli potrzebujesz bardziej szczegółowego wyjaśnienia, to dokumentacja Qt zawiera [stronę informacyjną](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html) na ten temat.
pt: Se quiser mais informações, a documentação do Qt tem [uma página informativa](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html) sobre o tópico.

source: Creating a basic listview
fr: Création d'une Listview basique
pl: Tworzenie podstawowego widoku listy
pt: Criar uma lista básica

source: `model`, which accepts the data or the `id` of the object that holds the data
fr: « model », acceptant les données ou l'« id » de l'objet détenant les données
pl: `model`, który przyjmuje dane lub `id` obiektu, który przechowuje dane

source: `delegate`, which accepts the component we will use to display the data in the model
fr: « delegate », acceptant le composant que nous utiliserons pour afficher les données dans le modèle.
pl: `delegate`, którzy przyjmuje składnik, którego użyjemy do wyświetlenie danych z modelu

source: Providing a number for the model property will generate that number of data entries starting from 0.
fr: La fourniture d'un nombre pour la propriété du modèle générera ce nombre d'entrées de données à partir de 0.
pl: Wpisanie liczby dla właściwości modelu stworzy taką liczbę wpisów, poczynając od 0.
pt: Fornecer um número na propriedade `model`irá gerar esse conjunto de itens de dados a começar no 0.

source: ![A simple listview](/docs/use/kirigami/components-listview/listview-simple.png)
fr: ![Un affichage simple de listes](/docs/use/kirigami/components-listview/listview-simple.png)

source: In cases where your model data only contain a single piece of data, like in the example above, you can just grab the data in the model by referencing `modelData`.
fr: Dans les cas où les données de votre modèle ne contiennent qu'un seul élément de données, comme dans l'exemple ci-dessus, vous pouvez simplement rassembler les données dans le modèle en faisant référence à « modelData ».
pl: W przypadku, gdy twoje dane modelu zawierają tylko pojedynczy kawałek danych, jak w powyższym przypadku, to wystarczy, że pobierzesz dane z modelu, odnosząc się do `modelData`.

source: A note on delegates: if your model contains objects with data in named properties, the name of these properties will be automatically exposed to your delegate and you will only need to use these names in your delegate.
fr: Une note sur les délégués : si votre modèle contient des objets avec des données dans des propriétés nommées, le nom de ces propriétés sera automatiquement exposé à votre délégué et vous aurez seulement besoin d'utiliser ces noms dans votre délégué.
pl: Uwaga odnośnie delegatów: jeśli twój model zawiera obiekty z danymi w nazwanych właściwościach, to nazwy tych właściwości staną się samoczynnie dostępne dla twojego delegata i wystarczy, że będziesz używać ich nazw w swoim delegacie.
pt: Una nota sobre os métodos delegados: se o seu modelo contém objectos com dados em propriedades com nomes, o nome dessas propriedades ficará automaticamente exposto ao seu delegado e só irá necessitar desses nomes no seu delegado.

source: Kirigami offers a number of components that have been designed specifically for use in list views, such as `Kirigami.BasicListItem`, `Kirigami.CheckableListItem` and `Kirigami.SwipeListItem`, all of which build upon `Kirigami.AbstractListItem`. There are also `Kirigami.CheckDelegate`, `Kirigami.RadioDelegate`, and `Kirigami.SwitchDelegate`, which are designed to take advantage of those specific controls.
fr: Kirigami propose un certain nombre de composants spécialement conçus pour être utilisés dans des affichages en liste, tels que « Kirigami.BasicListItem », « Kirigami.CheckableListItem » et « Kirigami.SwipeListItem », reposant tous sur « Kirigami.AbstractListItem ». Il existe également « Kirigami.CheckDelegate x, « Kirigami.RadioDelegate » et « Kirigami.SwitchDelegate », conçus pour tirer parti de ces contrôles spécifiques.
pl: Kirigami daje wiele składników, które zostały opracowane do użytku w widokach list, takie jak `Kirigami.BasicListItem`, `Kirigami.CheckableListItem` oraz `Kirigami.SwipeListItem`, wszystkie z nich są zbudowane na `Kirigami.AbstractListItem`. Istnieje także `Kirigami.CheckDelegate`, `Kirigami.RadioDelegate` oraz `Kirigami.SwitchDelegate`, które zostały stworzone, aby korzystać z danych elementów sterowania.

source: However, you are not limited to using these components and can choose whichever ones you wish - though this may mean some tweaking to your layout.
fr: Cependant, vous n'êtes pas limité à l'utilisation de ces composants. Vous pouvez choisir ceux que vous souhaitez - bien que cela puisse impliquer une certaine adaptation de votre mise en page.
pl: Jednakże, nie jesteś ograniczony do używania tylko tych składników i możesz używać jakichkolwiek chcesz - co może się wiązać z pewnym dostrojeniem twojego układu.

source: Placeholder messages
fr: Messages de remplacement
pl: Wiadomości zastępcze
pt: Mensagens de substituição

source: In some cases, you might want to use a list view that is empty until the user does something. In these situations, using a `Kirigami.PlaceholderMessage` can be an attractive way of telling your user that the list is empty and that they can do something about it.
fr: Dans certains cas, vous pouvez utiliser un affichage de liste restant vide jusqu'à ce que l'utilisateur fasse quelque chose. Dans ces situations, l'utilisation d'un objet « Kirigami.PlaceholderMessage » peut être une façon attrayante de dire à votre utilisateur que la liste est vide et qu'il peut faire quelque chose à ce sujet.
pl: W niektórych przypadkach, możesz chcieć użyć widoku listy, który jest pusty, aż do chwili, gdy użytkownik w nim coś umieści. W takich przypadkach, użycie `Kirigami.PlaceholderMessage` może być dobrym sposobem na powiedzenie użytkownikowi, że lista jest pusta i że muszą coś z tym zrobić.

source: You will generally want to place a PlaceholderMessage in the center of the ListView and you will want it to not span the entire width of the ListView either. You will obviously also want it to not be visible once the ListView's model becomes populated with data: thankfully, ListViews have a property named `count` that makes doing this quite easy.
fr: Vous souhaiterez généralement placer un « PlaceholderMessage » au centre de l'objet « ListView » et vous voudrez qu'il ne s'étende pas sur toute la largeur de ce dernier non plus. Vous voudrez évidemment aussi qu'il ne soit pas visible une fois que le modèle de la « ListView » sera rempli de données. Heureusement, les objets « ListView » ont une propriété nommée « count » la rendant très facile.
pl: Zazwyczaj będziesz chciał umieścić PlaceholderMessage na środku ListView i nie będziesz też chciał, aby rozciągało się na całą szerokość ListView. Oczywiście nie będziesz też chciał, aby było to widoczne, po tym jak model ListView wypełni się danymi: na szczęście, ListViews ma właściwość o nazwie `count`, która czyni to łatwiejszym.

source: You might also want to add a helpful action to your placeholder message. This can be done by attaching an action to the `Kirigami.PlaceHolderMessage`'s `helpfulAction` property.
fr: Vous pouvez également ajouter une action utile à votre message de remplacement. Vous pouvez le faire en attachant une action à la propriété « helpfulAction » de l'objet « Kirigami.PlaceHolderMessage ».
pl: Możesz także chcieć dodać pomocne działanie do naszej wiadomości zastępczej. Można to zrobić doczepiając działanie do własności `helpfulAction` rzeczy `Kirigami.PlaceHolderMessage`

source: ![A list view with a placeholder message](/docs/use/kirigami/components-listview/listview-placeholdermessage.png)
fr: ! [Une vue en liste avec un message de remplacement](/docs/use/kirigami/components-listview/listview-placeholdermessage.png)

source: List headers
fr: En-têtes de liste
pl: Nagłówki list

source: ListViews also support header components with the `header` property, and Kirigami provides an attractive component for this purpose: `Kirigami.ItemViewHeader`. We provide this component with text for the `title` property and with an image location for the `backgroundImage.source` property and we are set.
fr: Les objets » ListView » prennent également en charge les composants d'en-tête avec la propriété « header ». Kirigami fournit un composant attrayant à cet effet : « Kirigami.ItemViewHeader ». Nous fournissons à ce composant un texte pour la propriété « title » et un emplacement d'image avec la propriété « backgroundImage.source ». Et voilà, le tour est joué.
pl: ListViews także obsługują składniki nagłówka wewnątrz właściwości `header`, a Kirigami zapewnia ładnie wyglądający składnik do tych celów: `Kirigami.ItemViewHeader`. Dajemy ten składnik z tekstem dla właściwości `title` oraz położeniem obrazu dla właściwości `backgroundImage.source` i już gotowe.

source: An interesting property of the list view is `headerPositioning`. This affects the way that our header will move when we are interacting with a long list view that expands beyond the height of the page. `headerPositioning` can be set to three different settings:
fr: Une propriété intéressante de l'affichage en liste est l'objet « headerPositioning ». Cela va déterminer la façon dont votre en-tête sera déplacé quand nous interagirons avec un affichage d'une longue liste, dépassant la hauteur de la page. Cet objet peut être mis en œuvre selon trois configurations différentes :
pl: Ciekawą właściwością widoku listy jest `headerPositioning`. Wpływa to na sposób poruszania się naszego nagłówka, gdy będziemy z nim oddziaływać na długim widoku listy, który wychodzi poza wysokość strony. `headerPositioning` może być ustawiony na trzy różne wartości:

source: `ListView.OverlayHeader`: In this setting, the header will contract once we start scrolling down but will remain visible in a more compact state.
fr: Paramètre « ListView.OverlayHeader » : avec ce paramètre, l'en-tête se contractera lorsque nous commencerons à faire un défilement vers le bas mais restera visible dans sous une forme plus réduite.
pl: `ListView.OverlayHeader`: W tym ustawieniu, nagłówek skurczy się, gdy zaczniemy przewijać w dół, lecz pozostanie widoczny w bardziej zwartym stanie.

source: `ListView.PullBackHeader`: The header will disappear as we scroll down, but will reappear as we scroll back up, even if we haven't yet reached the top of the list view.
fr: « ListView.PullBackHeader » : l'en-tête disparaîtra lorsque nous ferons défiler la liste vers le bas, mais elle réapparaîtra lorsque nous ferons défiler la liste vers le haut, même si nous n'avons pas encore atteint le haut de la liste.
pl: `ListView.PullBackHeader`: Nagłówek zniknie, gdy przewiniemy na dół, lecz pojawi się ponownie, gdy przewiniemy z powrotem w górę, nawet gdy nie osiągniemy jeszcze szczytu widoku listy.

source: `ListView.InlineHeader`: The header will act like a part of the listview and remain at the top of the listview.
fr: « ListView.InlineHeader » : l'en-tête se comportera comme une partie de l'affichage en liste et restera en haut de l'affichage en liste.
pl: `ListView.InlineHeader`: Nagłówek będzie działał jako część widoku listy i pozostanie na szczycie widoku listy.

source: ![A listview with a header](/docs/use/kirigami/components-listview/listview-header.png)
fr: ![Un affichage en liste avec une en-tête](/docs/use/kirigami/components-listview/listview-header.png)

source: Overlay sheets
fr: Feuilles de recouvrement
pl: Arkusze nakładkowe
pt: Folhas sobrepostas

source: Overlay sheets can serve a variety of uses for both serving and inputting data.
fr: Les feuilles de superposition peuvent servir à de multiples usages, autant pour afficher que pour saisir des données.
pl: Arkusze nakładowe mogą służyć zarówno do wyświetlania jak i wprowadzania danych.
pt: As folhas sobrepostas poderão servir um conjunto de propósitos para servir e receber dados.

source: Overlay sheets provide a simple component that you can use to supplement the content being displayed on an application's page. They are designed to display long, vertical content and can accommodate content longer than the application window itself.
fr: Les feuilles de recouvrement fournissent un composant simple que vous pouvez utiliser pour compléter le contenu étant affiché dans une page d'application. Elles sont conçues pour afficher du contenu long et vertical et peut s'adapter à un contenu plus long que la fenêtre d'application elle-même.
pl: Arkusze nakładkowe zapewniają proste składniki, których możesz użyć do uzupełnienia treści wyświetlanej na stronie aplikacji. Są stworzone do wyświetlania długiej, pionowej treści i mogą mieścić treść dłuższą niż samo okno aplikacji.

source: They can be dismissed by clicking or tapping outside of their area or by clicking the 'x' icon on sheets' headers.
fr: Ils peuvent être supprimés en cliquant ou en tapotant à l'extérieur de leur zone ou en cliquant sur l'icône « x » dans l'en-tête des feuilles.
pl: Można je odwołać naciskając lub stukając poza ich obszarem lub naciskając na ikonę 'x' na nagłówkach stron.
pt: As mesmas podem ser fechadas se carregar ou tocar fora da área delas ou se carregar no ícone 'x' nos cabeçalhos das folhas.

source: Learning about the sheet
fr: Apprendre à connaître la feuille
pl: Nauka arkuszy
pt: Aprender sobre a folha

source: In order to use an overlay sheet, we should create it inside the Kirigami Page we want it to appear in.
fr: Pour utiliser une feuille de superposition, nous devons la créer dans la page de Kirigami dans laquelle nous voulons qu'elle apparaisse.
pl: Aby użyć arkusza nakładkowego, powinniśmy stworzyć go wewnątrz strony Kirigami, na której chcemy, aby się pojawił.
pt: Para usar uma folha sobreposta, devemos criá-la dentro da Page do Kirigami onde queremos que apareça.

source: ![Simple overlay sheet](/docs/use/kirigami/components-overlaysheets/sheet_simple.png)
fr: ![Une simple feuille de recouvrement](/docs/use/kirigami/components-overlaysheets/sheet_simple.png)

source: Overlay sheets come with methods we can use to open (`mySheet.open()`) or close (`mySheet.close()`) them as we see fit. By default overlay sheets are hidden, so at the very least we will need to use the `open()` method.
fr: Les feuilles de recouvrement sont dotées de méthodes que nous pouvons utiliser pour les ouvrir avec « mySheet.open() » ou les fermer avec « mySheet.close() » selon nos besoins. Par défaut, les feuilles de recouvrement sont masquées. Par conséquent, nous devrons au moins utiliser la méthode « open() ».
pl: Arkusze nakładkowe zawierają metody, których możemy użyć do ich otwierania (`mySheet.open()`) lub zamykania (`mySheet.close()`) w dowolnej chwili. Domyślnie, arkusze nakładkowe są ukryte, więc będziemy musieli użyć co najmniej metody `open()`.

source: When opened, this overlay sheet will appear centered vertically and horizontally within its parent page. Horizontally it will be bounded by its parent even if its contents' width exceeds its parent's. If the sheet's vertical length exceeds its' parent's, then the sheet will be displayed from its top position, and will be scrollable.
fr: Lorsqu'elle est ouverte, cette feuille de recouvrement apparaîtra centrée verticalement et horizontalement dans sa page mère. Horizontalement, elle sera limitée par son parent, même si la largeur de son contenu dépasse celle de son parent. Si la longueur verticale de la feuille est supérieure à celle de ses « parents », alors, la feuille sera affichée à partir de sa position supérieure et il faudra la faire défiler.
pl: Po otwarciu, ten nałożony arkusz będzie wyśrodkowany w pionie i poziomie wewnątrz swojej strony nadrzędnej. W poziomie będzie ograniczony szerokością elementu nadrzędnego, nawet gdy szerokość jego treści ją przekracza. Jeśli długość arkusza w pionie przekracza tę elementu nadrzędnego, to zostanie on wyświetlony od góry i będzie go można przewijać.

source: Global sheet
fr: Feuille globale
pl: Arkusz globalny
pt: Folha global

source: If you want to display the sheet as a global sheet — one that spans across the entire width of the application, regardless of the page it is a child to — we have to reparent our overlay sheet to our application window's overlay property. We can do this with the `parent` property.
fr: Si vous souhaitez afficher la feuille en tant que feuille globale, c'est-à-dire une feuille s'étendant sur toute la largeur de l'application, indépendamment de la page dont elle est la fille - nous devons rétablir sa parenté avec notre feuille de recouvrement de notre fenêtre d'application. Nous pouvons le faire avec la propriété « parent ».
pl: Jeśli chcesz wyświetlić arkusz jako globalnych arkusz — taki który rozciąga się na całą szerokość aplikacji, niezależnie od tego do jakiej strony należy — to musimy zmienić właściwość element nadrzędny naszego arkusza nakładkowego na okno aplikacji. Możemy to zrobić przy użyciu właściwości `parent`.

source: Non-global overlay sheet
fr: Feuille non globale de recouvrement
pl: Nieglobalny arkusz nakładkowy
pt: Folha sobreposta não-global

source: Global overlay sheet
fr: Feuille globale de recouvrement
pl: Globalny arkusz nakładkowy
pt: Folha sobreposta global

source: Fixed sizing
fr: Dimensionnement fixe
pl: Stały rozmiar
pt: Tamanho fixo

source: A sheet is greedy and will take the maximum amount of available width in a page if needed. We can avoid this by specifying an `implicitWidth` or a `Layout.preferredWidth` for its child elements, which will limit how much the sheet will grow width-wise.
fr: Une feuille est gourmande et prendra le maximum de la largeur disponible dans une page si nécessaire. On peut éviter cela en spécifiant « implicitWidth » ou « Layout.preferredWidth » pour ses éléments fils, ce qui limitera la largeur de la feuille.
pl: Arkusz jest chciwy i wykorzysta całą dostępną szerokość strony, gdy będzie tego potrzebować. Możemy tego uniknąć, określając `implicitWidth` lub `Layout.preferredWidth` dla jego rzeczy podrzędnych, co ograniczy ilość o jaką arkusz będzie mógł rozciągnąć się na szerokość.

source: Non-fixed width overlay sheet
fr: Feuille de recouvrement à largeur variable
pl: Arkusz nakładkowy z nieustaloną szerokością
pt: Folha sobreposta com largura não-fixa

source: Fixed width overlay sheet
fr: Feuille de recouvrement à largeur fixe
pl: Arkusz nakładkowy z ustaloną szerokością
pt: Folha sobreposta com largura fixa

source: Headers and footers
fr: En-têtes et pieds de page
pl: Nagłówki i stopki
pt: Cabeçalhos e rodapés

source: Overlay sheets come by default with a header which only contains a button for closing our overlay sheet. We can add a Kirigami heading as a title in our header to make it easy for users to understand what the sheet is for. This is done by setting the `header` property to contain our Kirigami heading component.
fr: Les feuilles de superposition sont fournies par défaut avec un en-tête contenant uniquement un bouton pour la fermeture de notre feuille de superposition. Nous pouvons ajouter un titre de Kirigami dans notre en-tête pour permettre aux utilisateurs de comprendre facilement à quoi sert la feuille. Pour ce faire, il suffit de définir la propriété « header » pour qu'elle contienne notre composant de titre de Kirigami.
pl: Arkusze nakładkowe domyślnie zawierają nagłówek, który zawiera tylko przycisk do zamykania arkusza. Możemy dodać nagłówek Kirigami jako tytuł w naszym nagłówku, aby ułatwić użytkownikom zrozumienie przeznaczenia arkuszy. Robi się to poprzez ustawienie właściwości `header` tak, aby zawierała składnik nagłówka Kirigami.

source: ![Sheet header](/docs/use/kirigami/components-overlaysheets/sheet_header.png)
fr: ![En-tête de feuille](/docs/use/kirigami/components-overlaysheets/sheet_header.png)

source: We can also provide our overlay sheet with a footer. Footers in overlay sheets are quite flexible, but most often they are used to provide overlay sheets with some sort of quick interactive input similar to that provided by modal dialogs (e.g. buttons for 'Apply', 'Ok', 'Cancel', 'Close', etc.)
fr: Nous pouvons également fournir à notre feuille de recouvrement un pied de page. Les pieds de page des feuilles de recouvrement sont assez flexibles. Mais, le plus souvent, ils sont utilisés pour fournir aux feuilles de recouvrement, une sorte d'entrée interactive rapide similaire à celle fournie par les boîtes de dialogues modales(par exemple, des boutons pour « Appliquer », « Ok », « Annuler », « Fermer », etc.).
pl: Możemy także nadać naszemu arkuszowi nakładkowemu stopkę. Stopki w arkuszach nakładkowych są całkiem elastyczne, lecz najczęściej są używane do danie arkuszowi nakładki szybkiego pola wprowadzania podobnego w wyglądzie do okien modalnych (np. przyciski dla 'Zastosuj', 'Ok', 'Anuluj', 'Zamknij', itp.)

source: Footers are set in much the same way as headers:
fr: Les pieds de page sont définis de la même manière que les en-têtes :
pl: Stopki są ustawiane w ten sam sposób co nagłówki:
pt: Os rodapés são configurados da mesma forma que os cabeçalhos:

source: ![Sheet footer](/docs/use/kirigami/components-overlaysheets/sheet_footer.png)
fr: ![Pied de page de la feuille](/docs/use/kirigami/components-overlaysheets/sheet_footer.png)

source: Using delegate / model views
fr: Utilisation de vues déléguées / modèles
pl: Używanie widoków delegatów / modeli
pt: Usar as áreas com delegados / modelos

source: Since overlay sheets are designed to display vertical content, they can be especially useful when used in conjunction with components such as ListViews. When displaying content longer than the application window itself, the overlay sheet becomes scrollable:
fr: Puisque les feuilles de recouvrement sont conçues pour afficher du contenu verticalement, elles peut être particulièrement utiles lorsque utilisées avec des composants comme les objets « Listview ». Lors de l'affichage de contenu plus long que la largeur de la fenêtre elle-même, la feuille de recouvrement devient directement capable de faire du défilement :
pl: Podczas gdy arkusze nakładkowe zostały stworzone do wyświetlania pionowej treści, to mogą być szczególnie użyteczne, gdy użyte w połączeniu ze składnikami takimi jak ListViews. Podczas wyświetlania treści dłuższej niż same okno aplikacji, na arkuszu nakładki pojawiają się paski przewijania:

source: ![Sheet with a listview](/docs/use/kirigami/components-overlaysheets/sheet_listview.png)
fr: ![Une feuille avec un affichage en liste](/docs/use/kirigami/components-overlaysheets/sheet_listview.png)

source: The PageRow
fr: La rangée de pages
pl: PageRow
