Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Kirigami's Actions are used to add functionality to components.
ca: Les Kirigami Actions s'utilitzen per a afegir funcionalitat als components.
eo: La Agoj de Kirigami estas uzataj por aldoni funkciojn al komponantoj.
es: Las acciones de Kirigami se usan para añadir funcionalidad a los componentes.
fr: Les actions de Kirigami sont utilisées pour ajouter des fonctionnalités aux composants.
nl: Acties van Kirigami worden gebruikt om functionaliteit aan componenten toe te voegen.
pl: Działania Kirigami są używane do dodawania możliwości do składników.
pt: As Acções do Kirigami são usadas para adicionar funcionalidades aos componentes.
sl: Kirigamijeva dejanja se uporabljajo za dodajanje funkcionalnosti komponentam.
sv: Åtgärder (Actions) i Kirigami används för att lägga till funktionalitet i komponenter.
uk: Дії (Actions) у Kirigami використовують для додавання функціональних можливостей до компонентів.

source: Actions
ca: Accions
eo: Agoj
es: Acciones
nl: Acties
pl: Działania
pt: Acções
sl: Dejanja
sv: Åtgärder
uk: Дії

source: A [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) consists of a clickable action whose appearance depends on where it is added. Typically it is a button with an icon and text.
ca: Una [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) consisteix d'una acció que s'hi pot fer clic i la seva aparença depèn d'on s'ha afegit. Normalment és un botó amb una icona i text.
sl: [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) je sestavljen iz dejanja, ki ga je mogoče klikniti in katerega videz je odvisen od tega, kje je dodan. Običajno je to gumb z ikono in besedilom.

source: We can use these to provide our applications with easy-to-reach actions that are essential to their functionality.
ca: Podem utilitzar-les per a proporcionar a les nostres aplicacions accions d'accés fàcil que són essencials per a la seva funcionalitat.
eo: Ni povas uzi ĉi tiujn por provizi niajn aplikojn per facile atingeblaj agoj, kiuj estas esencaj por ilia funkcieco.
es: Podemos usarlas para proporcionar a nuestras aplicaciones acciones de fácil acceso que son esenciales para su funcionalidad.
nl: We kunnen deze gebruiken om onze toepassingen te voorzien van gemakkelijk te bereiken acties die essentieel zijn voor hun functionaliteit.
sl: Te lahko uporabimo, da našim aplikacijam zagotovimo enostavno dosegljiva dejanja, ki so bistvena za njihovo delovanje.
sv: Vi kan använda dem för att tillhandahålla åtgärder i våra program som är enkla att nå och är grundläggande för deras funktion.
uk: Діями можна скористатися для надання нашій програмі легкодоступних дій, які є критичними для виконання нею функціональних можливостей.

source: Kirigami Actions inherit from [QtQuick.Controls.Action](docs:qtquickcontrols;QtQuick.Controls.Action) and can be assigned shortcuts.
ca: Les accions del Kirigami hereten a partir de [QtQuick.Controls.Action](docs:qtquickcontrols;QtQuick.Controls.Action) i es poden assignar a dreceres.
eo: Kirigami-Agoj heredas de [QtQuick.Controls.Action](docs:qtquickcontrols;QtQuick.Controls.Action) kaj povas esti asignitaj ŝparvojoj.
es: Las acciones de Kirigami heredan de [QtQuick.Controls.Action](docs:qtquickcontrols;QtQuick.Controls.Action) y se les pueden asignar atajos de teclado.
nl: Kirigami acties erven uit [QtQuick.Controls.Action](docs:qtquickcontrols;QtQuick.Controls.Action) en kunnen toegekend worden aan sneltoetsen.
sl: Kirigami dejanja dedujejo od [QtQuick Controls Action](docs:qtquickcontrols;QtQuick.Controls.Action) in jim lahko dodelimo bližnjice.
sv: Åtgärder i Kirigami ärver från [QtQuick Controls Action](docs:qtquickcontrols;QtQuick.Controls.Action) och kan tilldelas genvägar.
uk: Дії Kirigami успадковують від [QtQuick Controls Action](docs:qtquickcontrols;QtQuick.Controls.Action), і з ними можна пов'язувати клавіатурні скорочення.

source: Like [QtQuick Controls Actions](docs:qtquickcontrols;QtQuick.Controls.Action), they can be assigned to menu items and toolbar buttons, but also to multiple other Kirigami components.
ca: Igual que [QtQuick Controls Actions](docs:qtquickcontrols;QtQuick.Controls.Action), es poden assignar a elements de menú i botons de la barra d'eines, però també a molts altres components de Kirigami.
eo: Kiel [QtQuick Controls Actions](docs:qtquickcontrols;QtQuick.Controls.Action), ili povas esti asignitaj al menueroj kaj ilobretobutonoj, sed ankaŭ al pluraj aliaj Kirigami-komponentoj.
es: Al igual que las [acciones de los controles de QtQuick](docs:qtquickcontrols;QtQuick.Controls.Action), se pueden asignar a elementos del menú y a botones de la barra de herramientas, así como a otros componentes de Kirigami.
nl: Net als [QtQuick bestuurt acties](docs:qtquickcontrols;QtQuick.Controls.Action), kunnen ze toegekend worden aan menu-items en werkbalkknoppen, maar ook aan meerdere andere Kirigami-componenten.
pt: Como as [Action's do QtQuick Controls](docs:qtquickcontrols;QtQuick.Controls.Action), as mesmas poderão ser associadas não só aos itens do menu e aos botões das barras de ferramentas, mas também a vários outros componentes do Kirigami.
sl: Podobno se [QtQuick Controls Actions](docs:qtquickcontrols;QtQuick.Controls.Action) lahko dodelijo elementom menija in gumbom orodne vrstice, pa tudi več drugim komponentam Kirigamija.
sv: Liksom [QtQuick Controls Actions](docs:qtquickcontrols;QtQuick.Controls.Action), kan de tilldelas till menyalternativet och knappar i verktygsrader, men också till flera andra komponenter i Kirigami.
uk: Подібно до [дій Control QtQuick](docs:qtquickcontrols;QtQuick.Controls.Action), їх можна пов'язати із пунктами меню і кнопками панелі інструментів, а також декількома іншими компонентами Kirigami.

source: The [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) property takes names for system-wide icons following the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application which comes with [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec).
ca: La propietat `[icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) pren els noms per a les icones de tot el sistema seguint l'especificació de FreeDesktop. Aquestes icones i noms d'icones es poden veure amb l'aplicació CuttleFish del KDE que venen amb [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), o visitant l'[especificació per a l'anomenat de les icones de FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec).

source: One feature offered by Kirigami Actions on top of QtQuick Actions is the possibility to nest actions.
ca: Una característica que ofereixen les Kirigami Actions a més de les QtQuick Actions és la possibilitat d'imbricar les accions.
eo: Unu funkcio ofertita de Kirigami Actions aldone al QtQuick Actions estas la ebleco nesti agojn.
es: Una funcionalidad que ofrecen las acciones de Kirigami sobre las acciones de QtQuick es la posibilidad de anidar acciones.
fr: Une fonctionnalité offerte par les actions de Kirigami, au dessus des actions QtQuick Actions, est la possibilité d'imbriquer des actions.
nl: Een functie geboden door acties van Kirigami bovenop acties van QtQuick is de mogelijkheid acties te nesten.
pl: Działania Kirigami dają możliwość nad działaniami QtQuick taką, że można je zagnieżdżać.
sl: Ena zmožnost, ki jo ponuja Kirigami Actions poleg QtQuick Actions, je možnost gnezdenja dejanj.
sv: En funktion som åtgärder i Kirigami erbjuder över QtQuick Actions är möjligheten att nästla åtgärder.
uk: Однією з можливостей, які пропонуються діями Kirigami, окрім дій QtQuick, є можливість вкладення дій одна в одну.

source: Another feature of Kirigami Actions is to provide various hints to items using actions about how they should display the action. These are primarily handled by the [displayHint](https://api.kde.org/qml-org-kde-kirigami-action.html#displayHint-prop) and [displayComponent](https://api.kde.org/qml-org-kde-kirigami-action.html#displayComponent-prop) properties.
ca: Una altra característica de les Kirigami Actions és proporcionar diversos consells als elements que fan servir accions sobre com mostraran l'acció. Aquests són gestionats principalment per les propietats [displayHint](https://api.kde.org/qml-org-kde-kirigami-action.html#displayHint-prop) i [displayComponent](https://api.kde.org/qml-org-kde-kirigami-action.html#displayComponent-prop).

source: These properties will be respected by the item if possible. For example, the following action will be displayed as a [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) with the item trying its best to keep itself visible as long as possible.
ca: Si és possible, aquestes propietats seran respectades per l'element. Per exemple, l'acció següent es mostrarà com un [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) amb l'element fent tot el possible per a mantenir-se visible el temps més gran possible.
eo: Ĉi tiuj propraĵoj estos respektataj de la objekto se eble. Ekzemple, la sekva ago estos montrata kiel [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) kun la objekto klopodas por konservi sin videbla kiel eble plej longe.
es: Estas propiedades serán respetadas por el elemento siempre que sea posible. Por ejemplo, la siguiente acción se mostrará como un [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) con el elemento haciendo todo lo posible para mantenerse visible el mayor tiempo posible.
nl: Deze eigenschappen zullen, indien mogelijk, gerespecteerd worden door het item. Bijvoorbeeld, de volgende actie zal getoond worden als een [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) met het item dat zijn best doet om het item zo lang als mogelijk zichtbaar te houden.
pt: Estas propriedades serão respeitadas pelo item, se possível. Por exemplo, as seguintes acções serão apresentadas como um [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) com o item a tentar o seu melhor em manter o item visível o máximo de tempo possível.
sl: Če je mogoče, bo ta element spoštoval te lastnosti. Na primer, naslednje dejanje bo prikazano kot Polje besedila [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField) s postavko, ki se trudi, da bo postavka čim dlje vidna.
sv: Egenskaperna respekteras av objektet om möjligt. Exempelvis visas följande åtgärd som ett [textfält](docs:qtquickcontrols;QtQuick.Controls.TextField) och objektet gör sitt bästa för att hålla objektet synligt så länge som möjligt.
uk: Ці властивості буде враховано пунктом, якщо це можливо. Наприклад, наведену нижче дію буде показано як [TextField](docs:qtquickcontrols;QtQuick.Controls.TextField), а її пункт намагатиметься максимально зберігати видимість.

source: Using actions in other components
ca: Utilitzar accions en altres components
eo: Uzante agojn en aliaj komponantoj
es: Uso de acciones en otros componentes
fr: Utilisation des actions dans d'autres composants
nl: Acties in andere componenten gebruiken
pl: Używanie działań w innych składnikach
pt: Usar as acções noutros componentes
sl: Uporaba dejanj v drugih komponentah
sv: Använda åtgärder i andra komponenter
uk: Використання дій у інших компонентах

source: As mentioned in the [introduction tutorial for actions](/docs/getting-started/kirigami/introduction-actions), Kirigami Actions are [contextual](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual), which means they show up in different places depending on where you put them. In addition to that, they also have different representations for desktop and mobile.
ca: Com s'ha esmentat en la [guia d'aprenentatge d'introducció a les accions](/docs/getting-started/kirigami/introduction-actions), les accions del Kirigami són [contextuals](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual), el qual vol dir que es mostren en llocs diferents depenent d'on les poseu. A més, també tenen representacions diferents per a escriptori o mòbil.
eo: Kiel menciite en la [enkonduka lernilo por agoj](/docs/getting-started/kirigami/introduction-actions), Kirigami-agoj estas [kunteksta](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual ), kio signifas, ke ili aperas en malsamaj lokoj depende de kie vi metas ilin. Krom tio, ili ankaŭ havas malsamajn reprezentadojn por labortablo kaj poŝtelefono.
nl: Zoals genoemd in de [introductiehandleiding voor acties](/docs/getting-started/kirigami/introduction-actions), zijn Kirigami Actions [contextueel](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual), wat betekent dat ze verschijnen op verschillende plaatsen afhankelijk van waar u ze neerzet. Daarnaast hebben ze ook verschillende representaties voor bureaublad en mobiel.
sl: Kot je omenjeno v [uvodnem učbeniku za dejanja](/docs/getting-started/kirigami/introduction-actions), so dejanja Kirigami [kontekstualna](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual ), kar pomeni, da se prikažejo na različnih mestih, odvisno od tega, kam jih postavite. Poleg tega imajo tudi različne predstavitve za namizne in mobilne naprave.
sv: Som nämnts i [introduktionshandledningen om åtgärder](/docs/getting-started/kirigami/introduction-actions), är Kirigami Actions [kontextuella](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual ), vilket innebär att de dyker upp på olika ställen beroende på var du placerar dem. Utöver det har de också olika representationer för skrivbord och mobil.
uk: Як вже було згадано у [вступі щодо дій](/docs/getting-started/kirigami/introduction-actions), Kirigami Actions є [контекстуальними](/docs/getting-started/kirigami/introduction-actions#actions-are-contextual), тобто їх буде показано у різних місцях, залежно від того, де ви їх розмістите. Крім того, вони матимуть різне представлення для робочих станцій та мобільних пристроїв.

source: Page
ca: Pàgina
eo: Paĝo
es: Página
nl: Pagina
pl: Strona
pt: Página
sl: Stran
sv: Sida
uk: Сторінка

source: A [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) shows Actions on the right of the top header in desktop mode, and on a footer in mobile mode.
ca: Una [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) mostra les accions a la dreta de la capçalera superior en el mode d'escriptori i en un peu en el mode de mòbil.
sl: [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) prikazuje dejanja na desni strani zgornje glave v namiznem načinu in na nogi v mobilnem načinu.

source: Page actions on the desktop
ca: Accions de la pàgina a l'escriptori
eo: Paĝaj agoj sur la labortablo
es: Acciones de página en el escritorio
fr: Actions de page pour le bureau
nl: Pagina-acties op het bureaublad
pl: Działania stron na urządzeniach biurkowych
pt: Acções da página no computador
sl: Dejanja strani na namizju
sv: Sidoåtgärder på skrivbordet
uk: Пункти дій сторінки на робочій станції

source: Page actions on a mobile device
ca: Accions de la pàgina en un dispositiu mòbil
eo: Paĝaj agoj sur poŝtelefono
es: Acciones de página en un dispositivo móvil
fr: Actions de page pour un périphérique mobile
nl: Pagina-acties op een mobiel apparaat
pl: Działania stron na urządzeniach przenośnych
pt: Acções da página num dispositivo móvel
sl: Dejanja strani na mobilni napravi
sv: Sidoåtgärder på en mobil
uk: Пункти дій на мобільному комп'ютері

source: Global drawer
ca: Calaix global
eo: Ĉiea tirkesto
es: Cajón global
fr: Tiroir global
nl: Globale schuiflade
pl: Globalna półka
pt: Área global
sl: Globalni predal
sv: Global låda
uk: Загальна панель

source: The [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) is a menu-like sidebar that provides an action based navigation to your application. This is where nested actions are useful because it is possible to create nested navigation:
ca: El [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) és una barra lateral que sembla un menú que proporciona a l'aplicació una navegació basada en accions. Aquest és el lloc on les accions imbricades són útils perquè permeten crear una navegació imbricada:
sl: [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) je meniju podobna stranska vrstica, ki omogoča krmarjenje po dejanjih do vaše aplikacije. Tukaj so ugnezdena dejanja uporabna, saj je mogoče ustvariti ugnezdeno navigacijo:

source: Global Drawer actions on the desktop
ca: Accions del calaix global a l'escriptori
eo: Global Drawer agoj sur la labortablo
es: Acciones del cajón global en el escritorio
nl: Globale schuiflade-acties op het bureaublad
pt: Acções das Áreas Globais no computador
sl: Dejanja globalnih predalov na namizju
sv: Åtgärder i global låda på skrivbordet
uk: Пункти дій загальних панелей на робочій станції

source: You can read more about Global Drawers in the [documentation page for drawers](../components-drawers#globaldrawer).
ca: Podeu llegir més sobre els calaixos globals a la [pàgina de documentació per als calaixos](../components-drawers#globaldrawer).
eo: Vi povas legi pli pri Global Drawers en la [dokumentada paĝo por kestoj](../components-drawers#globaldrawer).
es: Puede obtener más información sobre los cajones globales en la [página de documentación de los cajones](../components-drawers#globaldrawer).
nl: U kunt meer lezen over globale schuifladen in de [documentatiepagina voor opvangbakken](../components-drawers/#globaldrawer).
pt: Poderá ler mais sobre as Áreas Globais na [página de documentação das mesmas](../components-drawers#globaldrawer).
sl: Več o globalnih predalih si lahko preberete na strani dokumentacije [documentation page for drawers](../components-drawers#globaldrawer).
sv: Du kan läsa mer om globala lådor på [dokumentationssidan för lådor](../components-drawers#globaldrawer).
uk: Почитати більше про загальних панелей можна на [сторінці документації до панелей](../components-drawers#globaldrawer).

source: Context drawer
ca: Calaix contextual
eo: Kunteksta tirkesto
es: Cajón de contexto
nl: Context-lade
sl: Kontekstni predal
sv: Sammanhangslåda
uk: Контекстна панель

source: A [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) consists of an additional set of actions that are hidden behind a three-dots menu on the top right in desktop mode or on the bottom right in mobile mode if there is no space. It is used to display actions that are only relevant to a specific page. You can read more about them in our [Kirigami Drawers](/docs/getting-started/kirigami/components-drawers) tutorial.
ca: Un [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) consisteix en un conjunt addicional d'accions que s'oculten darrere d'un menú de tres punts a la part superior dreta en el mode d'escriptori o a la part inferior dreta en el mode de mòbil si no hi ha espai. S'utilitza per a mostrar accions que només són rellevants en una pàgina específica. Podeu llegir-ne més a la nostra guia d'aprenentatge [Kirigami Drawers](/docs/getting-started/kirigami/components-drawers).
sl: [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) je sestavljen iz dodatnega niza dejanj, ki so skrita za menijem s tremi pikami zgoraj desno v namiznem načinu ali spodaj desno v mobilnem načinu, če ni prostora. Uporablja se za prikaz dejanj, ki so pomembna le za določeno stran. Več o njih lahko preberete v našem učbeniku [Kirigami Drawers](/docs/getting-started/kirigami/components-drawers).

source: ActionTextFields
ca: ActionTextField
eo: AgoTextFields

source: A [Kirigami.ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField) is used to add some contextual actions to a text field, for example to clear the text, or to search for the text.
ca: S'utilitza un [Kirigami.ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField) per a afegir algunes accions contextuals a un camp de text, per exemple, per a netejar el text o per a fer-ne la cerca.
sl: [Kirigami.ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField) se uporablja za dodajanje nekaterih kontekstualnih dejanj v besedilno polje, npr. za počiščenje besedila ali iskanje besedila.

source: In this example, we are creating a "clear" button for a search field that is only visible when text is entered.
ca: En aquest exemple, estem creant un botó de «neteja» per a un camp de cerca que només serà visible quan s'hi introdueix text.
eo: En ĉi tiu ekzemplo, ni kreas butonon "klarigi" por serĉkampo kiu estas videbla nur kiam teksto estas enigita.
es: En este ejemplo, vamos a crear un botón de borrado para un campo de búsqueda, que solo será visible tras introducir texto.
nl: In dit voorbeeld zijn we een "wis"knop aan het maken voor een zoekveld dat alleen zichtbaar is wanneer tekst wordt ingevoerd.
pt: Neste exemplo, estamos a criar um botão "limpar" para um campo de pesquisa que só aparece quando tiver introduzido algum texto.
sl: V tem primeru ustvarjamo čistilni gumb "clear" za iskalno polje, ki je vidno le ob vnosu besedila.
sv: I det här exemplet skapar vi en "rensningsknapp" för ett sökfält som bara är synligt när text matas in.
uk: У цьому прикладі ми створюємо кнопку вилучення тексту для поля пошуку, яку буде показано, лише якщо до поля введено якийсь текст.

source: ![Search field with text: "I want ](searchfield.webp)
ca: ![Camp de cerca amb el text: "I want ](searchfield.webp)
eo: ![Serĉkampo kun teksto: "Mi volas ](serĉkampo.webp)
es: ![Campo de búsqueda con el texto: "Quiero ](searchfield.webp)
nl: ![Zoekveld met tekst: "Ik zoek ](searchfield.webp)
sl: ![Iskalno polje z besedilom: "Želim ](searchfield.png)
sv: ![Sökfält med text: "I want ](searchfield.webp)
uk: ![Поле пошуку із текстом: "I want ](searchfield.webp)

source: You should rarely use an ActionTextField directly. [SearchField](docs:kirigami;org.kde.kirigami.SearchField) and [PasswordField](docs:kirigami;org.kde.kirigami.PasswordField) both inherit from [ActionTextField](https://api.kde.org/qml-org-kde-kirigami-actiontextfield.html) and are likely to cover your desired use-case.
ca: Rarament hauríeu d'utilitzar un ActionTextField directament. El [SearchField](docs:kirigami;org.kde.kirigami.SearchField) i el [PasswordField](docs:kirigami;org.kde.kirigami.PasswordField) hereten de l'[ActionTextField](https://api.kde.org/qml-org-kde-kirigami-actiontextfield.html) i és probable que cobreixin el vostre cas d'ús desitjat.

source: A [Kirigami.SwipeListItem](docs:kirigami;org.kde.kirigami.SwipeListItem) is a delegate intended to support extra actions. When using a mouse, its actions will always be shown. On a touch device, they can be shown by dragging the item with the handle. In the following pictures, these are the icons to the right.
ca: Un [Kirigami.SwipeListItem](docs:kirigami;org.kde.kirigami.SwipeListItem) és un delegat destinat a permetre accions extres. Quan s'empra un ratolí, sempre es mostrarà. En un dispositiu tàctil, es podrà mostrar arrossegant l'element amb la nansa. A les imatges següents, aquests són les icones de la dreta.
sl: [Kirigami.SwipeListItem](docs:kirigami;org.kde.kirigami.SwipeListItem) je delegat, namenjen podpori dodatnih dejanj. Pri uporabi miške bodo prikazane ob miškini kazalki nad elementom. V napravi na dotik se lahko prikažejo tako, da povlečete element z ročico. V naslednjih slikah so to ikone na desni strani.

source: do something
ca: fa alguna cosa
eo: fari ion
es: hacer algo
fr: Faire quelque chose
nl: iets doen
pl: zrób coś
pt: fazer algo
sl: narediti nekaj
sv: gör någonting
uk: якісь дії
