Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Above: progress bar at 50%; below: indeterminate progress bar
ca: A dalt: barra de progrés al 50%. A baix: barra de progrés indeterminat
eo: Supre: progresa stango ĉe 50%; sub: nedeterminita progresstango
es: Arriba: barra de avance al 50%; abajo: barra de avance indeterminada
nl: Boven: voortgangsbalk op 50%; onder: onbepaalde voortgangsbalk
pt: Acima: barra de progresso nos 50%; abaixo: barra de progresso indeterminada
sl: Zgoraj: vrstica napredka pri 50 %; spodaj: nedoločljiva vrstica napredka
sv: Ovan: förloppsrad vid 50 %, nedan: obestämd förloppsrad
uk: Вище: смужка поступу на рівні 50%; нижче: невизначена смужка поступу

source: Busy indicator
ca: Indicador d'ocupat
eo: Okupita indikilo
es: Indicador de ocupado
fr: Indicateur d'occupation
nl: Indicator voor bezig
pl: Wskaźnik zajętości
pt: Indicador de ocupado
sl: Indikator zasedenosti
sv: Upptagetindikering
uk: Індикатор зайнятості

source: In cases where loading times are shorter or measuring progress is not feasible, you can instead use [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). This component provides a simple spinning wheel that shows users that something is happening.
ca: En els casos en què els temps de càrrega són més curts o el mesurament del progrés no és factible, podreu utilitzar el [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Aquest component proporciona una roda giratòria senzilla que mostra als usuaris que està succeint alguna cosa.
eo: En kazoj kie ŝargotempoj estas pli mallongaj aŭ mezuri progreson ne estas farebla, vi povas anstataŭe uzi [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Ĉi tiu komponanto provizas simplan turniĝantan radon, kiu montras al uzantoj, ke io okazas.
es: En los casos en los que los tiempos de carga son más cortos o la medición del avance no es factible, puede usar un [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Este componente proporciona una sencilla rueda giratoria que indica al usuario que está sucediendo algo.
nl: In gevallen waar tijden voor laden korter zijn of voortgang meten niet mogelijk is, kunt u in plaats daarvan [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator) gebruiken. Deze component biedt een eenvoudig ronddraaiend rondje dat aan de gebruikers toont dat er iets gebeurt.
pt: Nos casos em que os tempos de carregamento sejam mais curtos ou em que não seja possível medir o progress, poderá então usar o [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Este componente oferece uma roda rotativa simples que mostra aos utilizadores que algo está a acontecer.
sl: V primerih, ko so časi nalaganja krajši ali merjenje napredka ni smiselno, lahko namesto tega uporabite [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Ta komponenta zagotavlja preprosto vrteče kolo, ki uporabnikom pokaže, da se nekaj dogaja.
sv: I fallen där inläsningstider är kortare eller det inte är möjligt att mäta förloppet, kan du använda [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator) istället. Komponenten tillhandahåller ett enkelt spinnande hjul som visar att något händer för användaren.
uk: У випадках, коли час завантаження є коротшим або вимірювання поступу неможливе, ви можете скористатися [Controls.BusyIndicator](docs:qtquickcontrols;QtQuick.Controls.BusyIndicator). Цей компонент забезпечує роботу простого обертового коліщатка, яке показує користувачам, що щось відбувається.

source: If you want the indicator to stop running, you can do so by setting the [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) property to false, in which case the .
ca: Si voleu que l'indicador deixi d'executar-se, podreu fer-ho establint la propietat [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) a `false`.
eo: Se vi volas, ke la indikilo ĉesu funkcii, vi povas fari tion agordante la proprecon [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) al malvera, tiukaze la .
es: Si prefiere que el indicador deje de girar, puede definir la propiedad [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) a `false`.
nl: Als u de indicator wilt laten stoppen met ronddraaien, kunt u dat doen door de eigenschap [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) op false in te stellen in welk geval de .
sl: Če želite, da se indikator preneha izvajati, lahko to storite tako, da lastnost [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) nastavite na false, v tem primeru .
sv: Om du vill att indikatorn ska sluta köra, kan du göra det genom att ställa in egenskapen [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) till false, i vilket fall .
uk: Якщо ви хочете, щоб індикатор припинив показ поступу, ви можете зробити це встановленням для властивості [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) значення `false`.

source: Scrollable pages and list views
ca: Pàgines desplaçables i vistes de llista
eo: Rulumeblaj paĝoj kaj listvidoj
es: Páginas desplazables y vistas de lista
nl: Schuifbare pagina's en lijstweergaven
sl: Drseče strani in pogledi seznama
sv: Rullningsbara sidor och listvyer
uk: Сторінки і панелі списків із гортанням

source: Scrollable pages are useful when combined with vertical components or dynamic components such as List Views.
ca: Les pàgines desplaçables són útils quan es combinen amb components verticals o dinàmics com les vistes de llista.
eo: Rulumeblaj paĝoj estas utilaj kiam kombinitaj kun vertikalaj komponantoj aŭ dinamikaj komponantoj kiel Listo de Vidoj.
es: Las páginas desplazables resultan de utilidad cuando se combinan con componentes verticales o con componentes dinámicos, como las vistas de lista.
fr: Les pages avec défilement sont utiles lorsqu'elles sont combinées avec des composants verticaux ou des composants dynamiques telles que des affichages en liste.
nl: Schuifbare pagina's zijn nuttig in combinatie met verticale componenten of dynamische componenten zoals lijstweergaven.
pl: Przewijalne strony są użyteczne w połączeniu ze składnikami pionowymi lub dynamicznymi takimi jak widoki list.
pt: As páginas com deslocamento são úteis quando forem combinadas em conjunto com componentes verticais ou componentes dinâmicos, como as listas.
sl: Strani, po katerih je mogoče drseti, so uporabne v kombinaciji z navpičnimi komponentami ali dinamičnimi komponentami, kot so pogledi seznama.
sv: Rullningsbara sidor är användbara när de kombineras med vertikala komponenter eller dynamiska komponenter som listvyer.
uk: Сторінки із гортанням є корисними у поєднанні із вертикальними компонентами або динамічними компонентами, зокрема панелями списків.

source: A [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) is a page that holds scrollable content, such as a [ListView](docs:qtquick;QtQuick.ListView). Scrolling, as well as scrolling indicators, are automatically managed.
ca: Una [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) és una pàgina que conté contingut desplaçable, com ara una vista de llista [ListView](docs:qtquick;QtQuick.ListView). El desplaçament i els indicadors de desplaçament es gestionen automàticament.

source: The rectangle will automatically be scrollable
ca: El rectangle es podrà desplaçar automàticament
eo: La rektangulo aŭtomate estos rulebla
es: El rectángulo se podrá desplazar automáticamente
fr: Le rectangle sera automatiquement défini avec une barre de défilement.
nl: De rechthoek zal automatisch te schuiven zijn
pl: Prostokąt sam umożliwi swoje przewijanie
pt: O rectângulo ficará deslizante automaticamente
sl: Po pravokotniku se bo samodejno dalo drseti
sv: Rektangeln är automatiskt rullningsbar
uk: Прямокутник буде автоматично створено придатним до гортання

source: In almost every other way, a scrollable page is the same as a normal page.
ca: En gairebé tots els altres aspectes, una pàgina desplaçable és el mateix que una pàgina normal.
eo: En preskaŭ ĉiu alia maniero, rulebla paĝo estas sama kiel normala paĝo.
es: En casi todos los demás aspectos, una página desplazable es lo mismo que una página normal.
fr: Dans presque tous les autres cas, une page avec défilement est identique à une page normale.
nl: Op bijna elke andere manier is een schuifbare pagina hetzelfde als een normale pagina.
pl: Pod prawie każdym względem, przewijalna strona jest taka sama jak zwykła.
pt: De outra forma qualquer, uma página com deslocamento é igual a uma página normal.
sl: Na skoraj vsak drug način je stran, po kateri je mogoče drseti, enaka običajni strani.
sv: På nästan alla andra sätt är en rullningsbar sida likadan som en normal sida.
uk: У майже будь-який інший спосіб, сторінка з гортанням є подібною до звичайної сторінки.

source: Do not put a [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) inside of a [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage); children of a `Kirigami.ScrollablePage` are already inside a `ScrollView`.
ca: No poseu una [ScrollView](docs:qtquickcontrols;QtQuick.Controls.ScrollView) dins d'una [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami. ScrollablePage). Els fills d'una `Kirigami.ScrollablePage` ja estan dins d'una `ScrollView`.

source: ListView in a ScrollablePage
ca: Vista de llista en una pàgina desplaçable
eo: ListView en ScrollablePage
es: ListView en una ScrollablePage
fr: ListView dans une page avec barres de défilement
nl: ListView in een ScrollablePage
pl: ListView w ScrollablePage
pt: Uma ListView numa ScrollablePage
sl: Pregled seznama v strani, po kateri se da drseti
sv: Listvy på en rullningsbar sida
uk: ListView у ScrollablePage

source: When the direct children of a [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) extend vertically beyond the size of the page itself, a scrollbar appears at the right edge of the page and the page will be scrollable.
ca: Quan els fills directes d'una [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) s'estenen verticalment més enllà de la mida de la pàgina en si, apareixerà una barra de desplaçament a la vora dreta de la pàgina i la pàgina es podrà desplaçar.

source: Two scrollable pages, both containing a ListView with custom contents (screenshot of NeoChat)
ca: Dues pàgines desplaçables, ambdues amb una ListView amb contingut personalitzat (captura de pantalla del NeoChat).
eo: Du ruleblaj paĝoj, ambaŭ enhavantaj ListView kun propra enhavo (ekrankopio de NeoChat)
es: Dos páginas desplazables, ambas conteniendo una ListView con contenido personalizado (captura de pantalla de NeoChat)
nl: Twee schuifbare pagina's, beiden bevatten een ListView met aangepaste inhoud (schermafdruk van NeoChat)
pt: Duas páginas com deslocamento, contendo ambas uma ListView com conteúdos personalizados (Imagem do NeoChat)
sl: Dve strani, po katerih se da drseti in obe vsebujeta pogled seznama z vsebino po meri (posnetek zaslona NeoChat)
sv: Två rullningsbara sidor, som båda innehåller en listvy med eget innehåll (skärmbild av NeoChat)
uk: Дві сторінки із гортанням, обидві містять ListView із нетиповим вмістом (знімок вікна NeoChat)

source: Often you have more than one child in your [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), and positioning items can be tricky—especially in combination with a [ListView](docs:qtquick;QtQuick.ListView).
ca: Sovint tindreu més d'un fill a la vostra [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), i col·locar-hi els elements pot ser complicat, especialment en combinació amb una [ListView](docs:qtquick;QtQuick.ListView).

source: For non-visual components, having them inside the [ListView](docs:qtquick;QtQuick.ListView) component won't change the visuals of the page, so we can move them inside the scope of the list view. Same for elements anchored to the center of the page, such as placeholder messages for empty list views.
ca: Per als components no visuals, tenir-los dins del component [ListView](docs:qtquick;QtQuick.ListView) no canviarà la visualització de la pàgina. Llavors podem moure'ls dins de l'àmbit de la vista de llista. El mateix per als elements ancorats al centre de la pàgina, com els missatges amb marcador de posició per a les vistes de llistes buides.
eo: Por nevideblaj komponantoj, havi ilin ene de la komponanto [ListView](docs:qtquick;QtQuick.ListView) ne ŝanĝos la vidaĵojn de la paĝo, do ni povas movi ilin en la amplekson de la listvido. Same por elementoj ankritaj al la centro de la paĝo, kiel anstataŭigaj mesaĝoj por malplenaj listvidoj.
nl: Voor niet-zichtbare componenten, die binnen de [ListView](docs:qtquick;QtQuick.ListView) component zitten wijzigen niet de zichtbaarheden van de pagina. We kunnen ze dus binnen de lijstweergave plaatsen. Hetzelfde voor elementen verankert aan het centrum van de pagina, zoals plaatshouderberichten voor lege lijstweergaven.
pt: Para os componentes não-visuais, tê-los dentro do elemento [ListView](docs:qtquick;QtQuick.ListView) não irá afectar o visual da página. Por isso, podemos movê-los para dentro da `ListView`. O mesmo se aplica aos elementos associados ao centro da página, como as mensagens de substituição para as listas vazias.
sl: Nevizualne komponente v elementu [ListView](docs:qtquick;QtQuick.ListView) ne bodo spremenile videz strani. Lahko jih premaknemo v seznam pogledov. Enako velja za elemente, ki so zasidrani na sredino strani, kot so lokacije za sporočila o praznih seznamih pogledov.
sv: För icke synliga komponenter, ändras inte sidans utseende om de finns inne i komponenten [ListView](docs:qtquick;QtQuick.ListView), så vi kan flytta dem in i listvyns omgivning. Samma sak för element förankrade på sidans mitt, såsom platsmarkeringsmeddelanden för en tom listvy.
uk: Для невізуальних компонентів розташування у компоненті [ListView](docs:qtquick;QtQuick.ListView) не змінює вигляду сторінки. Тому ми можемо пересунути їх всередину області видимості панелі списку. Те саме стосується елементів, які пов'язано із центром сторінки, зокрема повідомлень-замінників для порожніх панелей списків.

source: For other items, it might make sense to move them to the header or footer of the [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage). This is often the case for search bars.
ca: Per als altres elements, podria tenir sentit moure'ls a la capçalera o al peu de pàgina de la [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage). Sovint, aquest és el cas de les barres de cerca.

source: It is possible to add a [Kirigami.PlaceholderMessage](docs:kirigami;org.kde.kirigami.PlaceholderMessage) with some instructions in case the list view is empty.
ca: És possible afegir un [Kirigami.PlaceholderMessage](docs:kirigami;org.kde.kirigami.PlaceholderMessage) amb algunes instruccions en cas que la vista de llista estigui buida.

source: More code...
ca: Més codi...
eo: Pli da kodo...
es: Más código...
nl: Meer code...
sl: Več kode...
sv: Mer kod...
uk: Ще код…

source: Model code...
ca: Codi de model...
eo: Modelkodo...
es: Código del modelo...
sl: Model kode...
sv: Modellkod...
uk: Код моделі…

source: Search in the ListView
ca: Cercar a la vista de llista
eo: Serĉu en la ListView
es: Buscar en la ListView
fr: Rechercher dans ListView
nl: In de ListView zoeken
pl: Szukanie w widoku listy
pt: Pesquisar numa ListView
sl: Iskanje v pogledu seznama
sv: Söka i listvyn
uk: Пошук у ListView

source: A search field is often added to a [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) to filter the [ListView](docs:qtquick;QtQuick.ListView). This can be done by changing the default [titleDelegate](https://api.kde.org/qml-org-kde-kirigami-page.html#titleDelegate-prop) to use a [Kirigami.SearchField](docs:kirigami;org.kde.kirigami.SearchField) instead.
ca: Sovint s'afegeix un camp de cerca a una [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) per a filtrar la [ListView](docs:qtquick;QtQuick.ListView). Això es pot fer canviant el [titleDelegate](https://api.kde.org/qml-org-kde-kirigami-page.html#titleDelegate-prop) predeterminat per a utilitzar en el seu lloc un [Kirigami.SearchField](docs:kirigami;org.kde.kirigami.SearchField).

source: Rest of listview code...
ca: Resta del codi de la «listview»...
eo: Resto de listvido-kodo...
es: Resto del código de la vista de lista...
nl: De rest van de listview code...
sl: Preostala koda listview...
sv: Resten av listvyns kod
uk: Решта коду listview…

source: Hint
ca: Consell
eo: Sugesto
es: Sugerencia
fr: Astuce
nl: Tip
pl: Podpowiedź
pt: Sugestão
sl: Namig
sv: Tips
uk: Підказка

source: You can use [KSortFilterProxyModel](https://api.kde.org/qml-org-kde-kitemmodels-ksortfilterproxymodel.html) from [KItemModel](docs:kitemmodels;kitemmodels-index.html) to easily add filtering capability directly in QML without any need for C++ code.
ca: Podeu utilitzar un [KSortFilterProxyModel](https://api.kde.org/qml-org-kde-kitemmodels-ksortfilterproxymodel.html) des del [KItemModel](docs:kitemmodels;kitemmodels-index.html) per a afegir amb facilitat la capacitat de filtratge directament en el QML sense necessitat de codi en C++.

source: Pull to refresh
ca: Estirar per a actualitzar
eo: Tiru por refreŝigi
es: Tirar para actualizar
fr: Tirer pour rafraîchir
nl: Pull om te vernieuwen
pl: Pociągnij, aby odświeżyć
pt: Puxar para actualizar
sl: Povlecite za osvežitev
sv: Dra för att uppdatera
uk: Отримання для оновлення даних

source: Another function provided by this component is a "pull-to-refresh" action. To use this, activate it as follows:
ca: Una altra funció proporcionada per aquest component és una acció d'«estira per a actualitzar». Per a utilitzar això, activeu-lo de la manera següent:
eo: Alia funkcio provizita de ĉi tiu komponanto estas ago "tiri por refreŝigi". Por uzi ĉi tion, aktivigu ĝin jene:
es: Otra función que proporciona este componente es una acción «tirar para actualizar». Para usarla, actívela como se indica a continuación:
nl: Een andere functie geleverd door deze component is een actie "pull-om-te-vernieuwen". Om dit te gebruiken, activeer het als volgt:
pt: Outra função oferecida por este componente é uma acção de "puxar para actualizar". Para usar isto, active-a da seguinte forma:
sl: Druga funkcija, ki jo zagotavlja ta komponenta, je dejanje "Povlecite za osvežitev". Če želite to uporabiti, jo aktivirajte na naslednji način:
sv: An annan funktion som tillhandahålls av komponenten är åtgärden "dra för att uppdatera". För att göra det, aktivera den på följande sätt:
uk: Іншою функцією, яка надається цим компонентом є дія «виштовхнути, щоб освіжити». Щоб скористатися цією дією, активуйте її ось так:

source: NOTE: MyModel doesn't come from the components, it's purely an example on how it can be used together with some application logic that can update the list model and signals when it's done.
ca: NOTA: MyModel no prové dels components, senzillament és un exemple de com es pot emprar juntament amb alguna lògica de l'aplicació que quan està feta pot actualitzar el model de llista i els senyals.
eo: NOTO: MyModel ne venas de la komponantoj, ĝi estas nur ekzemplo pri kiel ĝi povas esti uzata kune kun iu aplika logiko, kiu povas ĝisdatigi la listomodelon kaj signali kiam ĝi estas farita.
es: Nota: MyModel no proviene de los componentes; solo es un ejemplo de cómo se puede usar junto con alguna lógica de aplicación que puede actualizar el modelo de la lista y emitir una señal cuando haya terminado.
nl: OPMERKING: MyModel komt niet uit de componenten, het is puur een voorbeeld over hoe het gebruikt kan worden samen met enige toepassingslogica die het lijstmodel en signalen kan bijwerken wanneer het gereed is.
pt: NOTA: o MyModel não vem dos componentes, sendo apenas um exemplo de como poderá ser usado em conjunto com alguma lógica de aplicação que possa actualizar o modelo da lista e assinale quando tudo terminar.
sl: OPOMBA: MyModel ne prihaja iz komponent, to je zgolj primer, kako se lahko uporablja skupaj nekaj logike aplikacije, ki lahko posodobi model seznama in signalizira, ko je to končano.
sv: Observera: MyModel kommer inte från komponenterna, det är ett rent exempel på hur den kan användas tillsammans med någon programlogik som kan uppdatera listmodellen och signalerar när den är klar.
uk: Зауваження: MyModel не походить від компонентів. Це просто приклад того, як нею можна скористатися разом із певною логікою програми, яка може оновлювати список моделі і сигналізувати про завершення роботи.

source: By pulling down, you can also activate a special mode with a larger top margin which makes single-handed use of the application easier.
ca: En estirar cap avall, també podreu activar un mode especial amb un marge superior més gran que facilita l'ús de l'aplicació amb una sola mà.
eo: Tirante malsupren, vi ankaŭ povas aktivigi specialan reĝimon kun pli granda supra marĝeno, kiu faciligas unumanan uzon de la aplikaĵo.
es: Al tirar hacia abajo, también puede activar un modo especial con un margen superior más grande que facilita el uso de la aplicación con una sola mano.
fr: En tirant vers le bas, vous pouvez également activer un mode spécial avec une marge supérieure plus grande, facilitant l'utilisation de l'application à une seule main.
nl: Door omlaag te trekken kunt u ook een speciale modus activeren met een grotere bovenmarge die gebruik van de toepassing met één hand gemakkelijker maakt.
pl: Pociągając w dół, możesz także włączyć wyjątkowy tryb z większym marginesem górnym, który czyni obsługę aplikacji jedną ręką łatwiejszą.
pt: Ao puxar para baixo, também poderá activar um modo especial com uma margem superior maior, o que torna a utilização da aplicação apenas com uma mão mais simples.
sl: Z vlečenjem navzdol lahko aktivirate tudi poseben način z večjim zgornjim robom, ki še lažje omogoča enoročno uporabo aplikacije.
sv: Genom att dra neråt, kan du också aktivera ett specialläge med en större övre marginal, som gör det enklare att använda programmet med en hand.
uk: Крім того, перетягуванням вниз ви можете активувати спеціальний режим із більшим верхнім полем, яке спрощує користування програмою однією рукою.

source: Adding actions
ca: Afegir accions
eo: Aldonante agojn
es: Añadir acciones
fr: Ajout d'actions
nl: Toevoegen van acties
pl: Dodawanie działań
pt: Adicionar acções
sl: Dodajanje dejanj
sv: Lägga till åtgärder
uk: Дії з додавання

source: Learning more about Kirigami's Actions will help us make our application more useful.
ca: Aprendre més sobre les Kirigami Actions ens ajudarà a fer que la nostra aplicació sigui més útil.
eo: Lerni pli pri la Agoj de Kirigami helpos nin fari nian aplikaĵon pli utila.
es: Aprender más sobre las acciones de Kirigami nos ayudará a que nuestra aplicación sea más útil.
fr: En apprendre plus sur les actions de Kirigami nous aidera à rendre notre application plus utilisable.
nl: Meer te weten komen over acties van Kirigami zal ons helpen om onze toepassing nuttiger te maken.
pl: Nauka o działaniach Kirigami pomoże nam uczynić naszą aplikację bardziej użyteczną.
pt: Aprender mais como funcionam as Action's (acções) do Kirigami e como o ajudarão a tornar a sua aplicação mais útil.
sl: Več informacij o Kirigamijevih aktivnostih nam bo pomagalo, da bo naša aplikacija še bolj uporabna.
sv: Att lära oss mer om åtgärder i Kirigami hjälper oss att göra vårt program användbarare.
uk: Ширші знання щодо дій Kirigami допоможуть нам зробити нашу програму кориснішою.
