Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: If you want to see a few ways on how the C++ code can be improved, like using [KAboutData](docs:kcoreaddons;KAboutData) for translatable application metadata, be sure to check our [KXmlGui tutorial](/docs/getting-started/kxmlgui).
ca: Si voleu veure algunes maneres de millorar el codi C++, com ara utilitzar el [KAboutData](docs:kcoreaddons;KAboutData) per a les metadades d'aplicació traduïbles, reviseu la [Guia d'aprenentatge del KXmlGui](/docs/getting-started/kxmlgui).
eo: Se vi volas vidi kelkajn manierojn pri kiel la C++-kodo povas esti plibonigita, kiel uzi [KAboutData](docs:kcoreaddons;KAboutData) por tradukeblaj aplikaĵmetadatumoj, nepre kontrolu nian [KXmlGui-lerniilon](/docs/getting-started /kxmlgui).
nl: Als u een paar manieren wilt bestuderen over hoe C++ code verbetert kan worden, zoals het gebruik van [KAboutData](docs:kcoreaddons;KAboutData) voor vertaalbare metadata van het programma, ga dan naar onze [KXmlGui-instructie](/docs/getting-started/kxmlgui).
sl: Če želite videti nekaj načinov, kako je mogoče izboljšati kodo C++, na primer z uporabo [KAboutData](docs:kcoreaddons;KAboutData) za metapodatke aplikacij, ki jih je mogoče prevesti, si oglejte našo [KXmlGui tutorial](/docs/getting-started/kxmlgui).
sv: Om du vill se några sätt C++ koden kan förbättras, som att använda [KAboutData](docs:kcoreaddons;KAboutData) för översättbar metadata i programmet, se till att ta en titt på vår [KXmlGui handledning](/docs/getting-started) /kxmlgui).
uk: Якщо вам потрібні ще декілька способів удосконалення коду C++, зокрема використання [KAboutData](docs:kcoreaddons;KAboutData) для придатних до перекладу метаданих програми, ознайомтеся із нашим [підручником з KXmlGui](/docs/getting-started/kxmlgui).

source: For now, the part that interests us is this line:
ca: De moment, la part que ens interessa és aquesta línia:
eo: Nuntempe, la parto kiu interesas nin estas ĉi tiu linio:
nl: Op dit moment interesseert ons deze regel:
sl: Za zdaj nas zanima ta vrstica:
sv: För tillfället är den del som intresserar oss den här raden:
uk: Зараз нас цікавитиме цей рядок:

source: The first argument is the URI set in `kirigami-tutorial/src/CMakeLists.txt`, and the second argument is the name of the QML module we want to use (`Main`, coming from the name of our `Main.qml` file, which needs to start with an uppercase letter).
ca: El primer argument és l'URI establert a `kirigami-tutorial/src/CMakeLists.txt`, i el segon argument és el nom del mòdul QML que volem utilitzar (`Main`), que prové del nom del nostre fitxer `Main.qml`, el qual ha de començar amb una lletra en majúscula).
eo: La unua argumento estas la URI aro en `kirigami-tutorial/src/CMakeLists.txt`, kaj la dua argumento estas la nomo de la QML-modulo, kiun ni volas uzi (`Main`, venante de la nomo de nia `Main.qml ` dosiero, kiu devas komenci per majuskla litero).
nl: Het eerste argument is de ingestelde URI in `kirigami-tutorial/src/CMakeLists.txt`, en het tweede argument is de naam van de QML module die we willen gaan gebruiken (`Main`, komend van de naam van ons `Main.qml`-bestand, wat moet beginnen met een hoofdletter).
sl: Prvi argument je URI, nastavljen v `kirigami-tutorial/src/CMakeLists.txt`, drugi argument pa je ime modula QML, ki ga želimo uporabiti (`Main`, izhaja iz imena našega `Main.qml` `, ki se mora začeti z veliko črko).
sv: Det första argumentet är URI angiven i `kirigami-tutorial/src/CMakeLists.txt`, och det andra argumentet är namnet på QML-modulen vi vill använda (`Main`, kommer från namnet på vår `Main.qml `-fil, som måste börja med en stor bokstav).
uk: Першим аргументом є адреса, яку встановлено у `kirigami-tutorial/src/CMakeLists.txt`, а другим аргументом є назва модуля QML, яким ми хочемо скористатися (`Main`, що походить від назви нашого файла `Main.qml`, яка має починатися з великої літери).

source: The old method
ca: El mètode antic
eo: La malnova metodo
es: El método antiguo
nl: De oude methode
sl: Stara metoda
sv: Den gamla metoden
uk: Старий метод

source: <details> <summary>You might encounter this alternative way to load QML files in real code!</summary> <br>
ca: <details> <summary>Podeu trobar aquesta manera alternativa de carregar fitxers QML en codi real!</summary> <br>
eo: <detaloj> <summary>Vi eble renkontos ĉi tiun alternativan manieron ŝargi QML-dosierojn en reala kodo!</summary> <br>
nl: <details> <summary>U kan deze alternatieve methode om QML-bestanden te laden tegen komen in echte code!</summary> <br>
sl: <details> <summary>Morda boste naleteli na ta alternativni način za nalaganje datotek QML v pravo kodo!</summary> <br>
sv: <details> <summary>Du kan stöta på det här alternativa sättet att ladda QML-filer i riktig kod!</summary> <br>
uk: <details> <summary>Ви можете зустрітися із цим альтернативним способом завантаження файлів QML у справжньому коді!</summary> <br>

source: The old method of loading QML files had some disadvantages and after Qt6 it became excessively verbose:
ca: El mètode antic de càrrega de fitxers QML tenia alguns inconvenients i després de les Qt6 es va tornar excessivament detallat a la sortida:
eo: La malnova metodo de ŝargo de QML-dosieroj havis kelkajn malavantaĝojn kaj post Qt6 ĝi iĝis troe devorta:
nl: De oude methode voor het laden van QML-bestanden had enkele nadelen en na Qt6 werd het wel erg spraakzaam:
sl: Stara metoda nalaganja datotek QML je imela nekaj slabosti in po Qt6 je postala pretirano obširna:
sv: Den gamla metoden att ladda QML-filer hade några nackdelar och efter Qt6 blev den överdrivet omfattande:
uk: Старий метод завантаження файлів QML мав недоліки, і після Qt6 він став суттєво багатослівнішим:

source: This [Qt resource URI](https://doc.qt.io/qt-6/resources.html) above follows the pattern `<resource_prefix><import_URI><optional_QML_dir><file>`. In this case:
ca: Aquest [UR del recurs Qt](https://doc.qt.io/qt-6/resources.html) segueix el patró `<resource_prefix><import_URI><optional_QML_dir><file>`. En aquest cas:
eo: Ĉi tiu [Qt-rimedo URI](https://doc.qt.io/qt-6/resources.html) supre sekvas la ŝablonon `<resource_prefix><import_URI><optional_QML_dir><file>`. Tiuokaze:
nl: Dit [Qt resource URI](https://doc.qt.io/qt-6/resources.html) hierboven volgt het patroon `<resource_prefix><import_URI><optional_QML_dir><file>`. In dit geval:
sl: Ta [URI vira Qt](https://doc.qt.io/qt-6/resources.html) zgoraj sledi vzorcu `<resource_prefix><import_URI><optional_QML_dir><file>`. V tem primeru:
sv: Ovanstående [Qt resurs-URI](https://doc.qt.io/qt-6/resources.html) följer mönstret `<resurs_prefix><import_URI><valfri_QML_kaalog><fil>`. I vårt fall:
uk: Ця [адреса ресурсу Qt](https://doc.qt.io/qt-6/resources.html) вище записується у такому шаблоні: `<префікс_ресурсу><адреса_імпортування><необов'язковий_каталог_QML><файл>`. У цьому випадку:

source: resource prefix = default / in Qt5, /qt/qml in Qt6
ca: resource prefix = predeterminat / a Qt5, /qt/qml a Qt6
eo: rimeda prefikso = defaŭlta / en Qt5, /qt/qml en Qt6
sl: predpona vira = privzeto / v Qt5, /qt/qml v Qt6
sv: resource prefix = default / i Qt5, /qt/qml i Qt6
uk: префікс ресурсу = типовий / у Qt5, /qt/qml у Qt6

source: import URI = /org/kde/tutorial, which matches the URI org.kde.tutorial
ca: import URI = /org/kde/tutorial, que coincideix amb l'URI org.kde.tutorial
eo: import URI = /org/kde/tutorial, kiu kongruas kun la URI org.kde.tutorial
nl: importeer URI = /org/kde/tutorial, wat overeenkomt met de URI org.kde.tutorial
sl: import URI = /org/kde/tutorial, ki se ujema z URI org.kde.tutorial
sv: import URI = /org/kde/tutorial, som motsvarar webbadressen org.kde.tutorial
uk: адреса імпортування URI = /org/kde/tutorial, що відповідає адресі org.kde.tutorial

source: optional QML dir = /qml, necessary if the QML files are stored in a directory called qml/
ca: optional QML dir = /qml, necessari si els fitxers QML s'emmagatzemen en un directori anomenat qml/
eo: laŭvola QML dir = /qml, necesa se la QML-dosieroj estas konservitaj en dosierujo nomita qml/
nl: optioneel QML dir = /qml, noodzakelijk als de QML-bestanden worden opgeslagen in een map met de naam qml/
sl: neobvezno QML dir = /qml, potrebno, če so datoteke QML shranjene v imeniku z imenom qml/
sv: optional QML dir = /qml, nödvändigt om QML-filerna lagras i en katalog som heter qml/
uk: необов'язковий каталог QML = /qml, потрібен, якщо файли QML зберігаються у каталозі із назвою qml/

source: file = the QML file
ca: file = el fitxer QML
eo: dosiero = la QML-dosiero
nl: bestand = het QML-bestand
sl: file = datoteka QML
sv: file = QML-filen
uk: file = файл QML

source: Compiling and installing the application
ca: Compilar i instal·lar l'aplicació
eo: Kompilante kaj instalante la aplikaĵon
nl: De toepassing compileren en installeren
sl: Prevajanje in namestitev aplikacije
sv: Kompilera och installera programmet
uk: Збирання і встановлення програми

source: We are almost at the finish line. The last thing we need to do is build and run our application. Doing so will depend on which platform you are on.
ca: Estem gairebé a la línia de meta. L'últim que hem de fer és construir i compilar la nostra aplicació. Fer això dependrà de la plataforma en la qual estem.
eo: Ni estas preskaŭ ĉe la cellinio. La lasta afero, kiun ni devas fari, estas konstrui kaj ruli nian aplikaĵon. Fari tion dependos de kiu platformo vi estas.
nl: We zijn bijna bij de eindstreep. Het laatste wat we moeten doen is bouwen en onze toepassing uitvoeren. Om dat te doen hangt af van op welke platform u bent.
sl: Skoraj smo na ciljni črti. Zadnja stvar, ki jo moramo narediti, je zgraditi in zagnati našo aplikacijo. To bo odvisno od platforme, na kateri ste.
sv: Vi har nästa nått mållinjen. Det sista vi måste göra är att bygga och köra vårt program. Hur man gör det beror på vilken plattform som används.
uk: Ми наблизилися до фінішу. Наприкінці процесу нам слід зібрати і запустити нашу програму. При цьому послідовність дій залежить від програмної платформи.

source: Linux or FreeBSD
ca: Linux o FreeBSD
eo: Linux aŭ FreeBSD
es: Linux o FreeBSD
nl: Linux of FreeBSD
sl: Linux ali FreeBSD
sv: Linux eller FreeBSD
uk: Linux або FreeBSD

source: Compiling with kde-builder
ca: Compilar amb el «kde-builder»
eo: Kompilante per kde-builder
sl: Prevajanje s kde-builder
uk: Збирання за допомогою kde-builder

source: Make sure you have followed the instructions in [Using kde-builder](#kde-builder).
ca: Assegureu-vos que heu seguit les instruccions d'[Utilitzar el «kde-builder»](#kde-builder).
sl: Prepričajte se, da ste sledili navodilom v [Uporaba kde-builder](#kde-builder).
uk: Виконайте настанови з розділу [користування kde-builder](#kde-builder).

source: Compile the necessary build dependencies with kde-builder, then compile `kirigami-tutorial` by running the following commands in a terminal:
ca: Compileu les dependències de construcció necessàries amb el «kde-builder», després compileu `kirigami-tutorial` executant les ordres següents en un terminal:
sl: Prevedite potrebne odvisnosti gradnje s kde-builderjem, nato prevedite `kirigami-tutorial` tako, da zaženete naslednje ukaze v terminalu:
uk: Зберіть потрібні для збирання залежності за допомогою kde-builder, потім зберіть `kirigami-tutorial` за допомогою таких команд у терміналі:

source: Compiling manually
ca: Compilar manualment
eo: Kompilante permane
sl: Prevajanje ročno
uk: Збирання вручну

source: Change directories to the project's root folder, then run the following command in a terminal:
ca: Canvieu els directoris a la carpeta arrel del projecte i executeu l'ordre següent en un terminal:
sl: Spremenite imenike v korensko mapo projekta, nato pa v terminalu zaženite naslednji ukaz:
uk: Перейдіть до кореневої теки проєкту, а потім віддайте таку команду у терміналі:

source: The program will be installed to `~/.local/bin` and its desktop entry to `~/.local/share/applications`.
ca: El programa s'instal·larà a `~/.local/bin` i la seva entrada «desktop» a `~/.local/share/applications`.
sl: Program bo nameščen v `~/.local/bin`, njegov vnos na namizju pa v `~/.local/share/applications`.
sv: Programmet installeras i `~/.local/bin` och dess skrivbordspost i `~/.local/share/applications`.
uk: Програму буде встановлено до `~/.local/bin`, а її стільничний запис — до `~/.local/share/applications`.

source: If you are compiling your project on Windows after having set up [Craft](#craft), CMake should automatically detect the right compiler:
ca: Si esteu compilant el projecte al Windows després d'haver configurat [Craft](#craft), el CMake hauria de detectar automàticament el compilador correcte:
eo: Se vi kompilas vian projekton en Vindozo post agordi [Craft](#craft), CMake devus aŭtomate detekti la ĝustan kompililon:
nl: Als u uw project op Windows compileert nadat [Craft](#craft) in opgezet, zou CMake automatisch de juiste compiler detecteren:
sl: Če prevajate svoj projekt v sistemu Windows, potem ko ste nastavili [Craft](#craft), CMake bi moral samodejno zaznati pravi prevajalnik:
sv: Om du kompilerar projektet på Windows efter att ha ställt in [Craft](#craft), ska CMake automatiskt upptäcka rätt kompilator:
uk: Якщо ви збираєте ваш проєкт у Windows після налаштовування [Craft](#craft), CMake має автоматично визначити належний компілятор:

source: Depending on how you installed the compiler, you might need to specify a CMake Generator for the first step, depending on whether you are using Visual Studio (msvc) or MinGW (make) to compile your projects.
ca: En funció de com heu instal·lat el compilador, potser caldrà especificar un generador de CMake per al primer pas, depenent de si esteu utilitzant el Visual Studio (msvc) o el MinGW (make) per a compilar els projectes.
eo: Depende de kiel vi instalis la kompililon, vi eble bezonos specifi CMake-Generatoron por la unua paŝo, depende de ĉu vi uzas Visual Studio (msvc) aŭ MinGW (make) por kompili viajn projektojn.
nl: Als u uw project met [Craft](#craft) compileert onder Windows, hebt u misschien een CMake-generator nodig voor de eerste stap, afhankelijk van of u Visual Studio (msvc) of MinGW (make) gebruikt om uw projecten te compileren.
sl: Odvisno od tega, kako ste namestili prevajalnik, boste morda morali določiti CMake Generator za prvi korak, odvisno od tega, ali za prevajanje svojih projektov uporabljate Visual Studio (msvc) ali MinGW (make).
sv: Beroende på hur du installerade kompilatorn, kan du behöva ange en CMake Generator för det första steget, beroende på om du använder Visual Studio (msvc) eller MinGW (make) för att kompilera dina projekt.
uk: Залежно від способу встановлення компілятора, вам, можливо, на першому кроці слід вказати породжувач CMake, залежно від того, користуєтеся ви для збирання ваших проєктів Visual Studio (msvc) чи MinGW (make).

source: If Visual Studio, depending on the compiler you chose to install, it might be:
ca: Si és Visual Studio, depenent del compilador que trieu instal·lar, podria ser:
eo: Se Visual Studio, depende de la kompililo kiun vi elektis instali, povus esti:
nl: Bij Visual Studio, afhankelijk van de gekozen compiler die is geïnstalleerd, kan het zijn:
sl: Če je Visual Studio, odvisno od prevajalnika, ki ste ga izbrali za namestitev, je lahko:
sv: Om Visual Studio, beroende på kompilatorn du valde att installera, kan det vara:
uk: Якщо це Visual Studio, залежно від компілятора, який ви встановите, це може бути:

source: Or:
ca: o:
eo: Aŭ:
es: O:
nl: Of:
sl: Ali:
sv: Eller:
uk: Або:

source: If MinGW:
ca: Si és MinGW:
eo: Se MinGW:
es: Con MinGW:
nl: En bij MinGW:
sl: Če MinGW:
sv: För MinGW:
uk: Якщо MinGW:

source: In both cases, the program will be installed to `C:\CraftRoot\bin`.
ca: En els dos casos, el programa s'instal·larà a `C:\CraftRoot\bin`.
eo: En ambaŭ kazoj, la programo estos instalita al `C:\CraftRoot\bin`.
es: En ambos casos, el programa se instalará en `C:\CraftRoot\bin`.
nl: In beide gevallen zal het programma geïnstalleerd worden in `C:\CraftRoot\bin`.
sl: V obeh primerih bo program nameščen na `C:\CraftRoot\bin`.
sv: I båda fall, installeras programmet i `C:\CraftRoot\bin`.
uk: В обох випадках програму буде встановлено до `C:\CraftRoot\bin`.

source: If you ever get in doubt as to the name of the compiler that should be used in the `cmake` call, run:
ca: Si alguna vegada dubteu sobre el nom del compilador que s'ha d'utilitzar en la crida del `cmake`, executeu:
eo: Se vi iam dubas pri la nomo de la kompililo, kiu devus esti uzata en la alvoko `cmake`, rulu:
nl: Als u twijfels heeft over de naam van de compiler die in `cmake` aangeroepen moet worden, voer dan het volgende uit:
sl: Če ste kdaj v dvomih glede imena prevajalnika, ki bi ga morali uporabiti v klicu `cmake`, zaženite:
sv: Om du någon gång tvivlar på namnet på kompilatorn som ska användas i 'cme-anropet', kör:
uk: Якщо ви раптом засумніваєтеся у назві компілятора, який має бути використано при виклику `cmake`, віддайте таку команду:

source: It will list all available generators.
ca: Llistarà tots els generadors disponibles.
eo: Ĝi listigos ĉiujn disponeblajn generatorojn.
nl: Dit zal een lijst met alle beschikbare generators tonen.
sl: Navedel bo vse razpoložljive generatorje.
sv: Det listar alla tillgängliga generatorer.
uk: Буде показано список усіх доступних засобів створення даних.

source: You can then run the `kirigami-hello` program with:
ca: Llavors podeu executar el programa `kirigami-hello` amb:
eo: Vi povas tiam ruli la programon `kirigami-hello` per:
nl: U kunt daarna het programma `kirigami-tutorial` uitvoeren met:
sl: Nato lahko zaženete program `kirigami-hello` z:
sv: Därefter kan programmet `kirigami-hello` köras med:
uk: Далі, ви можете запустити програму `kirigami-hello` такою командою:

source: On Linux, manually
ca: Al Linux, manualment
eo: En Linukso, permane
es: En Linux, manualmente
nl: Op Linux, handmatig
sl: Na Linuxu, ročno
sv: På Linux, manuellt
uk: У Linux, вручну

source: With kde-builder
ca: Amb el «kde-builder»
eo: Per kde-builder
sl: S kde-builderjem
uk: За допомогою kde-builder

source: With kdesrc-build
ca: Amb el «kdesrc-build»
eo: Per kdesrc-build
sl: S kdesrc-build
uk: За допомогою kdesrc-build

source: On Windows
ca: Al Windows
eo: Sur Vindozo
es: En Windows
nl: Op Windows
sl: Na Windows
sv: På Windows
uk: У Windows

source: Voilà! Now you will see your very first Kirigami app appear before your very own eyes.
ca: Heus aquí! Ara veureu aparèixer la vostra primera aplicació escrita amb el Kirigami.
eo: Jen! Nun vi vidos vian unuan Kirigami-aperon aperi antaŭ viaj propraj okuloj.
es: ¡Ya está! Ahora verá su primera aplicación de Kirigami aparecer ante sus ojos.
nl: Voilà! Nu ziet u uw allereerste Kirigami toepassing voor uw eigen ogen verschijnen.
pt: Voilá! Agora tem a sua primeira aplicação do Kirigami a funcionar diante dos seus olhos.
sl: Voilà! Zdaj boste videli, da se vaša prva Kirigami aplikacija pojavi pred vašimi očmi.
sv: Se där! Nu dyker ditt allra första Kirigami-program upp framför dina ögon.
uk: Ось і все! Тепер ви бачите перед собою вашу першу програму Kirigami вашими власними очима.

source: ![Screenshot of the generated Kirigami application](hello-kworld.webp)
ca: ![Captura de pantalla de l'aplicació generada amb el Kirigami](hello-kworld.webp)
eo: ![Ekrankopio de la generita Kirigami-aplikaĵo](hello-kworld.webp)
es: ![Captura de pantalla de la aplicación de Kirigami generada](hello-kworld.webp)
nl: ![Schermafdruk van de gegenereerde Kirigami toepassing](hello-kworld.webp)
sl: ![Posnetek zaslona ustvarjene aplikacije Kirigami](hello-kworld.webp)
sv: ![Skärmbild av det genererade Kirigami-programmet](hello-kworld.webp)
uk: ![Знімок вікна створеної програми Kirigami](hello-kworld.webp)

source: To run the new QML application in mobile mode, you can use `QT_QUICK_CONTROLS_MOBILE=1`:
ca: Per a executar la nova aplicació QML en mode de mòbil, podeu utilitzar `QT_QUICK_CONTROLS_MOBILE=1`:
eo: Por ruli la novan QML-aplikaĵon en movebla reĝimo, vi povas uzi `QT_QUICK_CONTROLS_MOBILE=1`:
nl: Om het nieuwe QML-programma in de modus mobiel op te starten, kan u `QT_QUICK_CONTROLS_MOBILE=1` gebruiken:
sl: Za zagon nove aplikacije QML v mobilnem načinu lahko uporabite `QT_QUICK_CONTROLS_MOBILE=1`:
sv: För att köra den nya QML-applikationen i mobilläge kan man använda `QT_QUICK_CONTROLS_MOBILE=1`:
uk: Щоб запустити нову програму QML у режимі мобільного пристрою, ви можете скористатися `QT_QUICK_CONTROLS_MOBILE=1`:

source: If you have compiled the project manually with CMake and for some reason you'd like to uninstall the project, you can run:
ca: Si heu compilat el projecte manualment amb el CMake i per algun motiu voleu desinstal·lar el projecte, podeu executar:
eo: Se vi kompilis la projekton permane per CMake kaj ial vi ŝatus malinstali la projekton, vi povas ruli:
nl: Als u voor een reden het project handmatig met CMake heeft gecompileerd en voor de een of andere reden het project wilt dëinstalleren, dan kan u het volgende uitvoeren:
sl: Če ste projekt prevedli ročno s CMake in bi iz nekega razloga želeli odstraniti projekt, lahko zaženete:
sv: Om du har kompilerat projektet manuellt med CMake och av någon anledning vill avinstallera projektet kan du köra:
uk: Якщо ви зібрали проєкт вручну за допомогою CMake і з якихось причин хочете вилучити встановлений проєкт, ви можете скористатися такою командою:
