Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) is inside the [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) component we have provided for the property [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). This is the [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) that contains what will be displayed in your card.
ca: La [GridLayout](https://doc.qt.io/qt-6/qml-layouts-gridlayout.html) es troba dins del component [Item](https://doc.qt.io/qt-6/qtquick-item.html) que hem proporcionat per a la propietat [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Aquest és l'[Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) que conté el que es mostrarà a la targeta.
eo: La [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) estas ene de la [Ero](https://doc.qt.io/qt-6/ qml-qtquick-item.html) komponanto, kiun ni provizis por la propreco [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Ĉi tiu estas la [Ero](https://doc.qt.io/qt-6/qml-qtquick-item.html) kiu enhavas tion, kio estos montrata en via karto.
nl: De [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) is binnen de [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html)-component die we hebben geleverd voor de eigenschap [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Dit is het [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) dat bevat wat getoond zal worden in uw kaart.
pt: O [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) está dentro do componente [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) que passámos à propriedade [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Este é o [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) que contém o que será apresentado no seu cartão.
sl: Postavitev [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) je znotraj komponente postavke [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html), ki smo jo zagotovili za lastnost [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). To je postavka [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html), ki vsebuje, kar bo prikazano v vaši kartici.
sv: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) är inne i komponenten [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) vi tillhandahåller för egenskapen [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Det är [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) som innehåller det som kommer att visas på kortet.
uk: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) перебуває всередині компонента [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html), який ми надали для властивості [contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-control.html#contentItem-prop). Це [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html), який містить те, що буде показано у вашій картці.

source: We also need to choose a [layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) for our components so that they don't just pile on top of each other. There are three main types that we can choose from:
ca: També haurem de triar una [disposició «layout»](https://doc.qt.io/qt-6/qtquicklayouts-index.html) per als nostres components, de manera que no s'apilin un damunt de l'altre. Hi ha tres tipus principals entre les quals podem triar:
eo: Ni ankaŭ devas elekti [aranĝon](https://doc.qt.io/qt-6/qtquicklayouts-index.html) por niaj komponantoj, por ke ili ne nur amasiĝu unu sur la alian. Estas tri ĉefaj tipoj, kiujn ni povas elekti:
es: También necesitamos escoger un [diseño](https://doc.qt.io/qt-6/qtquicklayouts-index.html) para nuestros componentes, de modo que no se apilen unos encima de otros. Existen tres tipos principales entre los que podemos escoger:
nl: We moeten ook een [layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) voor onze componenten kiezen zodat ze niet op elkaar gestapeld worden. Er zijn drie hoofdtypen waaruit we kunnen kiezen:
pt: Também teremos de escolher uma [disposição](https://doc.qt.io/qt-6/qtquicklayouts-index.html) para os nossos componentes, para que eles simplesmente não fiquem empilhados uns em cima dos outros. Existem três tipos principais que poderemos escolher:
sl: Izbrati moramo tudi postavitev [layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) za naše komponente, tako da se ne bodo nakopičili drug na drugega. Obstajajo trije glavni tipi, ki jih lahko izbiramo:
sv: Vi behöver också välja en [layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) för våra komponenter så att de inte bara staplas upp på varandra. Det finns tre huvudtyper vi kan välja bland:
uk: Нам також потрібно вибрати [компонування](https://doc.qt.io/qt-6/qtquicklayouts-index.html) для наших компонентів так, щоб вони не просто накопичувалися один над одним. Існує три основних типи, один з яких ми можемо вибрати:

source: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) lays out your components vertically, in a single column
ca: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) distribueix els components verticalment, en una sola columna
eo: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) aranĝas viajn komponantojn vertikale, en ununura kolumno
es: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) organiza los componentes verticalmente, en una única columna
nl: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) zet uw componenten verticaal neer, in een enkele kolom
pt: O [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) dispõe os seus componentes na vertical, numa única coluna
sl: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) naniza vaše komponente navpično v enem stolpcu
sv: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) placerar ut komponenterna vertikalt, i en enda kolumn
uk: [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) розташовує ваші компоненти вертикально, у один стовпчик

source: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) lays out your components horizontally, in a single row
ca: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) distribueix els components horitzontalment, en una sola fila
eo: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) aranĝas viajn komponantojn horizontale, en ununura vico
es: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) organiza los componentes horizontalmente, en una única fila
nl: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) zet uw componenten horizontaal neer, in een enkele rij
pt: O [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) dispõe os seus componentes na horizontal, numa única linha
sl: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) naniza vaše komponente vodoravno v eni vrstici
sv: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) placerar ut komponenterna horisontellt, i en enda rad
uk: [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) розкладає ваші компоненти горизонтально у один рядок

source: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) lays out your components in a grid with a composition of your choosing
ca: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) distribueix els components en una quadrícula amb una composició de la vostra elecció
eo: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) prezentas viajn komponantojn en krado kun komponado de via elekto
es: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) organiza los componentes en una cuadrícula con una composición de su elección
nl: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) zet uw componenten neer in een raster met een compositie naar keuze
pt: O [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) dispõe os seus componentes numa grelha com uma composição à sua escolha
sl: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) naniza vaše komponente v mreži s sestavo, ki jo izberete
sv: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) placerar ut komponenterna i ett rutnät med en sammansättning du väljer
uk: [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) розкладає ваші компоненти у таблицю із вибраним вами компонуванням

source: With [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) and [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), all we have to do is write our components inside the Layout component. As you can see, we went with a [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), which entails a bit more handiwork.
ca: Amb [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) i [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), tot el que hem de fer és escriure els nostres components dins del component «Layout». Com podeu veure, hem optat per una [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), la qual implica una mica més de treball manual.
eo: Kun [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) kaj [RowLayout](https://doc.qt.io/qt-6/qml- qtquick-layouts-rowlayout.html), ĉio, kion ni devas fari, estas skribi niajn komponantojn ene de la Layout-komponento. Kiel vi povas vidi, ni iris kun [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), kiu implicas iom pli da manlaboro.
es: Con [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) y [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), todo lo que tenemos que hacer es escribir nuestros componentes dentro del componente Layout. Como puede ver, hemos optado por un [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), lo que implica un poco más de trabajo manual.
nl: Met [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) en [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), is alles wat we hoeven te doen is onze componenten binnen de component Layout schrijven. Zoals u kunt zien, we gingen voor een [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), die wat meer handwerk vraagt.
pt: Com o [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) e o [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), tudo o que temos a fazer é escrever os nossos componentes dentro do componente Layout. Como poderá ver, usámos uma disposição com a [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), que traz consigo um pouco mais de trabalho.
sl: Pri [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) and [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) moramo samo napisati naše komponente znotraj komponente Layout. Kot lahko vidite, smo šli z mrežno postavitev [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), ki vključuje malo več ročnega dela.
sv: Med [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) och [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html), är allt vi behöver göra är att skriva våra komponenter inne i komponenten Layout. Som du kan se, bestämde vi oss för en [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), vilket medför lite mer hantverk.
uk: З [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) і [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html) усе, що нам слід зробити, — це записати наші компоненти всередину компонента Layout. Як ви можете бачити, ми використали [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html), що потребує додаткового опису вручну.

source: The first thing you see is our `anchors`. [QtQuick's anchoring system](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) provides a useful way of making sure your components are positioned in certain parts of a parent component. We have anchored our [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) to the left, top, and right of the parent card, ensuring our content stretches across the whole card.
ca: El primer que veieu és `anchors`. El [sistema d'ancoratge de QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) proporciona una forma útil d'assegurar-vos que els components estiguin col·locats en certes parts d'un component pare. Hem ancorat la nostra [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) a l'esquerra, a dalt i a la dreta de la targeta principal, assegurant que el nostre contingut s'estengui per tota la targeta.
eo: La unua afero, kiun vi vidas, estas niaj `ankroj`. [La ankra sistemo de QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) provizas utilan manieron certigi, ke viaj komponantoj estas poziciigitaj en certaj partoj de gepatra komponanto. Ni ankris nian [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) maldekstren, supre kaj dekstren de la gepatra karto, certigante ke nia enhavo etendiĝas transe. la tuta karto.
nl: Het eerste wat u ziet is ons `anchors`. Het [verankeringssysteem van QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) biedt een bruikbare manier om te verzekeren dat uw componenten gepositioneerd worden in bepaalde delen van een oudercomponent. We hebben onze [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) linksboven verankerd en rechts van de ouderkaart, om te verzekeren dat onze inhoud zich uitstrekt over de gehele kaart.
pt: A primeira coisa que vê é a nossa `anchor`. O [sistema de associação de elementos do QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) oferece uma forma útil de garantir que os seus componentes estão posicionados em cartas partes de um dado componente-pai. Nós associámos a nossa [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) aos extremos esquerdo, superior e direito no cartão-pai, garantindo que o nosso conteúdo se prolonga ao longo do cartão completo.
sl: Prva stvar, ki jo vidite je naša sidra 'anchors'. Sistem za sidranje [QtQuick's anchoring system](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) zagotavlja uporaben način, da zagotovite, da so vaše komponente postavljene na določenih delih nadrejene komponente. Zasidrali smo našo [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) levo, vrh in desno od nadrejene kartice, kar zagotavlja, da se naša vsebina razteza čez celotno kartico.
sv: Det första du ser är våra `anchors`. [Förankringssystemet i QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) är ett användbart sätt att säkerställa att komponenterna är placerade på vissa ställen i en överliggande komponent. Vi har förankrat vår [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) till vänster, överst och till höger om det överliggande kortet, vilket säkerställer att vårt innehåll sträcker sig över hela kortet.
uk: Першим, що ви бачите, є наш `anchor`. [Система прив'язок QtQuick](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) надає зручний спосіб визначення розташування ваших компонентів у певних місцях батьківського компонента. Ми прив'язали наш [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) ліворуч, згори і праворуч до батьківської картки, забезпечивши розтягування вмісту на усю картку.

source: Next we specify the spacing between the rows and columns within our grid, so that our components don't bunch up. Kirigami provides a number of handy [predefined units](https://api.kde.org/qml-org-kde-kirigami-platform-units.html) to use for this purpose:
ca: A continuació, especificarem l'espai entre les files i les columnes dins la nostra quadrícula, de manera que els nostres components no s'amunteguin. El Kirigami proporciona una sèrie d'útils [unitats predefinides](https://api.kde.org/qml-org-kde-kirigami-platform-units.html) per a utilitzar amb aquest propòsit:

source: Kirigami Unit
ca: Unitat de Kirigami
eo: Kirigami Unuo
es: Unidad de Kirigami
fr: Unité de Kirigami
nl: Kirigami-eenheid
pl: Jednostka Kirigami
pt: Unidade do Kirigami
sl: Enota Kirigami
sv: Kirigami-enhet
uk: Одиниця Kirigami

source: Pixels
ca: Píxels
eo: Rastrumeroj
es: Píxeles
pl: Piksele
sl: Slik. točk
sv: Bildpunkter
uk: Пікселі

source: KDE's Visual Design Group (VDG) has a lot more information about the different units defined within Plasma and Kirigami on the [Human Interface Guidelines](/hig/layout/units/).
ca: El Grup de Disseny Visual de KDE (VDG) té molta més informació sobre les diferents unitats definides en el Plasma i el Kirigami a les [Directrius d'interfície humana](/hig/layout/units/).
eo: La Vida Dezajno-Grupo (VDG) de KDE havas multe pli da informoj pri la malsamaj unuoj difinitaj ene de Plasma kaj Kirigami sur la [Gvidlinioj pri Homaj Interfaco](/hig/layout/units/).
nl: De Visuele ontwerpgroep (VDG) van KDE heeft heel wat meer informatie over de verschillende eenheden gedefinieerd in Plasma en Kirigami op het [Human Interface Guidelines](/hig/layout/units/).
pt: O Grupo de Desenho Visual do KDE (VDG) tem bastantes mais informações sobre as diferentes unidades definidas dentro do Plasma e do Kirigami nas [Directrizes de Interfaces com Humanos](/hig/layout/units/).
sl: Skupina KDE's Visual Design Group (VDG) ima veliko več informacij o različnih enotah določenih v Plasmi and Kirigami v Smernicah za uporabniški vmesnik [Human Interface Guidelines](/hig/layout/units/).
sv: KDE's visuella designgrupp (VDG) har mycket mer information om de olika enheterna definierade inom Plasma och Kirigami i [Human Interface Guidelines](/hig/layout/units/).
uk: Група з візуального дизайну KDE (VDG) надає багато [настанов щодо зручності інтерфейсу](/hig/layout/units/) щодо різних модулів, які визначено у Плазмі і Kirigami.

source: As you might remember, `root` is the id of our [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow). It provides the [wideScreen](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#wideScreen-prop) property, used to determine whether the current device screen is a widescreen (i.e. a computer monitor or a phone in landscape). We use a [ternary conditional](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) here to vary the number of columns in our grid depending on the screen we are using: if it's a widescreen, the grid will have 4 columns, else it will have 2.
ca: Com recordareu, `root` és l'identificador de la nostra [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow). Proporciona la propietat [wideScreen](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#wideScreen-prop), utilitzada per a determinar si la pantalla del dispositiu actual és una pantalla ampla (és a dir, un monitor d'ordinador o un telèfon apaïsat). Aquí utilitzem un [condicional ternari](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) per a variar el nombre de columnes a la nostra quadrícula depenent de la pantalla que utilitzem: si és una pantalla ampla, la quadrícula tindrà 4 columnes, en cas contrari en tindrà 2.

source: Inner components
ca: Components interns
eo: Internaj komponantoj
es: Componentes interiores
nl: Interne componenten
pt: Componentes interiores
sl: Notranje komponente
sv: Inre komponenter
uk: Внутрішні компоненти

source: We could just create three labels within our delegate component and call it a day, but that wouldn't look particularly nice. We'll make use of a few more convenient components:
ca: Podríem crear tres etiquetes dins del nostre component delegat i cridar-les un dia. Però això no es veuria particularment bonic. Farem ús d'alguns components més adequats:
eo: Ni povus simple krei tri etikedojn ene de nia delegita komponanto kaj nomi ĝin tage, sed tio ne aspektus precipe bela. Ni uzos kelkajn pli oportunajn komponantojn:
nl: We konden net drie labels in onze gedelegeerde component aanmaken en dan gereed zijn, maar dat zou er niet erg mooi uit zien. We zullen gebruik maken van een paar handigere componenten:
sl: Lahko bi samo ustvarili tri oznake znotraj naše delegatske komponente in to označili za dan, vendar to ne bi bilo videti posebej lepo. Uporabili bomo nekaj priročnejših komponent:
sv: Vi skulle kunna bara skapa tre beteckningar inne i vår delegatkomponent och låta det vara nog, men det skulle inte se särskilt snyggt ut. Vi utnyttjar några ytterligare praktiska komponenter:
uk: Ми могли б просто створити три мітки у нашому компоненті-делегаті, і все. Але це не виглядало б аж надто привабливо. Ми ж скористаємося декількома додатковими зручними компонентами:

source: How the custom Card looks like
ca: Com es veu la targeta personalitzada
eo: Kiel aspektas la propra Karto
nl: Hoe de aangepaste kaart er uitziet
sl: Kako je videti kartica po meri
sv: Hur ett eget Card ser ut
uk: Як виглядає нетипова картка

source: Left, [Kirigami.Heading](https://api.kde.org/qml-org-kde-kirigami-heading.html): uses the `ListElement`'s `date` as a level 1 heading.
ca: A l'esquerra, [Kirigami.Heading](https://api.kde.org/qml-org-kde-kirigami-heading.html): utilitza la `date` d'un `ListElement` com una capçalera de nivell 1.

source: Middle, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): has a [Kirigami.Heading](https://api.kde.org/qml-org-kde-kirigami-heading.html) that displays the task name; a [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator), which provides the horizontal line; and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), that displays a task's optional description. The latter two components have a [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop) property, which checks if the description is empty or not and displays the components depending on the result of `description.length > 0`.
ca: Al mig, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): té una [Kirigami.Heading](https://api.kde.org/qml-org-kde-kirigami-heading.html) que mostra el nom de la tasca; un [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator), el qual proporciona la línia en horitzontal; i un [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), que mostra una descripció opcional de la tasca. Els dos últims components tenen una propietat [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop), la qual comprova si la descripció està buida o no, i mostra els components segons el resultat de `description.length > 0`.
