Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Don't be intimidated by all the material on here! No one starts off being able to create something like Plasma from scratch. But KDE is no multi-billion dollar company with a high barrier for entry (we have no five-round coding interviews!) and as long as you are nice, you will be welcomed.
ca: No us deixeu intimidar per tot aquest material! Ningú comença sent capaç de crear des de zero quelcom com el Plasma. Però, el KDE no és una empresa de mil milions amb una gran barrera a l'entrada (no tenim entrevistes de codificació de cinc tandes!). I mentre sigueu us porteu bé, sereu benvingut.
eo: Ne timiĝu la tuta materialo ĉi tie! Neniu komencas povi krei ion kiel Plasmo de nulo. Sed KDE ne estas multimiliarda kompanio kun alta baro por eniro (ni havas neniujn kvin-raŭndajn kodajn intervjuojn!) kaj tiel longe kiel vi estas afabla, vi estos bonvenigita.
es: ¡No se deje intimidar por todo el material que hay aquí! Nadie comienza siendo capaz de crear algo como Plasma desde cero. Pero KDE no es una compañía de miles de millones de dólares con una alta barrera de entrada (¡no hacemos entrevistas de programación de cinco rondas!) Y mientras sea amable, será bienvenido.
nl: Wees niet geïntimideerd door al het materiaal hier! Niemand begint en is in staat om zoiets als Plasma vanaf niets te maken. Maar KDE is geen multi-miljoen dollar company met een hoge barrière om te beginnen (we hebben geen vijf-ronden coderingsinterviews!) en zolang u vriendelijk bent, zult u verwelkomt worden.
pt: Não se assuste com todo o material aqui! Ninguém começa logo a ser capaz de criar algo como o Plasma do zero. Mas o KDE não é uma empresa com milhões de dólares com uma grande barreira à entrada - não temos entrevistas com código em cinco rondas! - e, desde que você seja uma boa pessoa, será sempre bem-vindo.
sl: Ne ustrašite se zaradi vsega materiala! Nihče sam ne more ustvariti nečesa podobnega Plasmi od začetka. Toda KDE ni več milijardno podjetje z visoko oviro za vstop (nimamo intervjujev za kodiranje v petih krogih!) in dokler boste prijazni, boste dobrodošli.
sv: Bli inte avskräckt av allt material här. Ingen börjar med att kunna skapa någonting som Plasma från början. Men KDE är inget multimiljon-företag med hög ingångsbarriär, vi har inga fem omgångars kodningsintervjuer, och så länge du är trevlig är du välkommen.
uk: Не лякайтеся кількістю усього матеріалу тут! Ніхто не збирається розпочинати створення чогось подібного до Плазми з нуля. Але KDE не є компанією вартістю у багато мільярдів із високим вхідним бар'єром — у нас немає п'ятираундових інтерв'ю з програмування! — і доки ви лишатиметеся ввічливою людиною, ми будемо вам раді.

source: Good luck!
ca: Bona sort!
eo: Bonŝancon!
es: ¡Buena suerte!
fr: Bonne chance !
nl: Veel geluk!
pl: Powodzenia!
pt: Boa sorte!
sl: Srečno!
sv: Lycka till!
uk: Щасти!

source: Explaining pages
ca: Explicar les pàgines
eo: Klarigante paĝojn
es: Explicación de las páginas
nl: Pagina's uitleggen
sl: Razlaganje strani
sv: Förklaring av sidor
uk: Пояснення щодо сторінок

source: Pages allow you to organize your application content
ca: Pàgines que permeten organitzar el contingut de la vostra aplicació
eo: Paĝoj permesas al vi organizi vian aplikaĵenhavon
es: Las páginas le permiten organizar el contenido de la aplicación
fr: Les pages vous permettent d'organiser le contenu de votre application
nl: Pagina's waarmee u uw de inhoud van uw toepassing kunt organiseren
pl: Strony umożliwiają ułożenie treści aplikacji
pt: As páginas permitem-lhe organizar o conteúdo da sua aplicação
sl: Strani omogočajo organiziranje vsebine aplikacije
sv: Sidor låter dig organisera programmets innehåll
uk: За допомогою сторінок ви можете упорядкувати дані вашої програми

source: Our app
ca: La nostra aplicació
eo: Nia apo
es: Nuestra aplicación
fr: Notre application
nl: Onze toepassing (app)
pl: Nasza aplikacja
pt: A nossa aplicação
sl: Naša aplikacija
sv: Vårt program
uk: Наша програма

source: In the previous tutorial, we managed to set up, build, and compile our first Kirigami application. With the basics in place, we can begin our journey towards creating a fully-featured application.
ca: A la guia d'aprenentatge anterior, hem aconseguit configurar, construir i compilar la nostra primera aplicació escrita amb el Kirigami. Amb els conceptes bàsics en el seu lloc, podem començar el nostre viatge cap a la creació d'una aplicació amb totes les característiques.
eo: En la antaŭa lernilo, ni sukcesis agordi, konstrui kaj kompili nian unuan Kirigami-aplikaĵon. Kun la bazaĵoj en la loko, ni povas komenci nian vojaĝon al kreado de plene prezentita aplikaĵo.
es: En el tutorial anterior hemos configurado, construido y compilado nuestra primera aplicación de Kirigami. Con los conceptos básicos en su lugar, podemos comenzar nuestro viaje hacia la creación de una aplicación repleta de funcionalidad.
fr: Dans le tutoriel précédent, nous avons réussi à configurer, construire et compiler notre première application sous Kirigami. Avec les bases en place, nous pouvons commencer notre voyage vers la création d'une application fonctionnement complète.
nl: In de vorige inleiding waren we in staat om onze eerste Kirigami toepassing op te zetten, te bouwen, en te compileren. Met de basis op zijn plaats, kunne we onze reis beginnen naar het maken van een toepassing met volledige mogelijkheden.
pl: W poprzednim samouczku, udało nam się utworzyć oraz zbudować naszą pierwszą aplikację Kirigami. Posiadając podstawy, możemy rozpocząć naszą przygodę z tworzeniem pełnowartościowych aplikacji.
pt: No tutorial anterior, conseguimos configurar, criar e compilar a nossa primeira aplicação em Kirigami. Com as bases instaladas, poderemos iniciar a nossa viagem para a criação de uma aplicação cheia de funcionalidades.
sl: V prejšnjem učbeniku, smo uspeli vzpostaviti, graditi, in prevesti našo prvo Kirigami aplikacijo. Z osnovami, ki so na mestu, lahko začnemo naše potovanje v smeri ustvarjanja celotne aplikacije z veliko možnostmi.
sv: I föregående handledning, lyckades vi ställa in, bygga och kompilera vårt första Kirigami-program. Med grunderna på plats, kan vi börja vår resa mot att skapa ett program med fullständig funktion.
uk: У попередньому розділі підручника ми змогли налаштувати, зібрати і запустити нашу першу програму Kirigami. Тепер, коли нам відомі основи, ми можемо розпочати нашу подорож до створення повнофункціональної програми.

source: These tutorials will focus on creating an application that lets the user see how many days are left until an event of their choice.
ca: Aquestes guies d'aprenentatge se centraran a crear una aplicació que permeti a l'usuari veure quants dies queden fins a un esdeveniment de la seva elecció.
eo: Ĉi tiuj lerniloj koncentriĝos pri kreado de aplikaĵo, kiu ebligas al la uzanto vidi kiom da tagoj restas ĝis evento de ilia elekto.
nl: In deze instructie zullen we ons voornamelijk richten op de creatie van een programma waarin de gebruiker kan zien hoeveel dagen het nog duurt tot een gebeurtenis naar keuze.
sl: Te učbeniki se bodo osredotočili na ustvarjanje aplikacije, ki uporabniku omogoča, da vidi, koliko dni je ostalo do dogodka po lastni izbiri.
sv: De här handledningarna fokuserar på att skapa ett program som låter användaren se hur många dagar som är kvar till en valfri händelse.
uk: Акцент у цих підручниках зроблено на створенні програми, яка показуватиме користувачеві, скільки днів лишилося до визначеної ним події.

source: We also recommend you check out the [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), which provides a number of useful UI examples.
ca: També us recomanem que consulteu la [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), que proporciona una sèrie d'exemples útils d'interfície d'usuari.
eo: Ni ankaŭ rekomendas vin kontroli la [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), kiu provizas kelkajn utilajn UI-ekzemplojn.
nl: We raden ook aan om eens te kijken in de [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), waar een aantal handige UI voorbeelden te vinden zijn.
sl: Priporočamo tudi, da si ogledate [galerijo Kirigami](https://apps.kde.org/en/kirigami2.gallery), ki ponuja številne uporabne primere uporabniškega vmesnika.
sv: Vi rekommenderar också att du tittar på [Kirigami-galleriet](https://apps.kde.org/en/kirigami2.gallery), som ger ett antal användbara exempel på användargränssnitt.
uk: Ми також рекомендуємо вам ознайомитися зі [галереєю Kirigami](https://apps.kde.org/en/kirigami2.gallery), де можна знайти декілька корисних прикладів інтерфейсу користувача.

source: In this section we'll be focusing on pages, one of the key structural elements of any Kirigami application.
ca: En aquesta secció ens centrarem en les pàgines, un dels elements estructurals clau de qualsevol aplicació escrita amb el Kirigami.
eo: En ĉi tiu sekcio ni koncentriĝos pri paĝoj, unu el la ŝlosilaj strukturaj elementoj de iu ajn Kirigami-apliko.
es: En esta sección nos centraremos en las páginas, uno de los elementos estructurales clave de cualquier aplicación Kirigami.
fr: Dans cette section, nous nous concentrerons sur les pages, l'un des éléments structurels clés de toute application avec Kirigami.
nl: In deze sectie leggen we de focus op pagina's, een van de voornaamste structurele elementen van elke Kirigami toepassing.
pl: W tym obszarze skupimy się na stronach, jednej z głównych rzeczy aplikacji Kirigami.
pt: Nesta secção focar-nos-emos nas páginas, um dos elementos-chave estruturais de qualquer aplicação de Kirigami.
sl: V tem razdelku se bomo osredotočili na strani, enega ključnih strukturnih elementov vsake Kirigami aplikacije.
sv: I det här avsnittet fokuserar vi på sidor, ett av de viktigaste strukturelementen i alla Kirigami-program.
uk: У цьому розділі ми зосередимося на сторінках, одному з ключових структурних елементів будь-якої програми Kirigami.

source: Pages
ca: Pàgines
eo: Paĝoj
es: Páginas
nl: Pagina's
pl: Strony
pt: Páginas
sl: Strani
sv: Sidor
uk: Сторінки

source: Kirigami apps are typically organized in pages by using [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Pages are the different "screens" of an app. You will want to have a page dedicated to specific aspects of your app's interaction, and to make things easier you can create different QML files for each page.
ca: Les aplicacions escrites amb el Kirigami solen estar organitzades en [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Les pàgines són les «pantalles» diferents d'una aplicació. Voldreu tenir una pàgina dedicada a aspectes específics de la interacció amb la vostra aplicació, i per a facilitar les coses podreu crear fitxers QML diferents, un per a cada pàgina.

source: Pages are organized in a [page stack](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) where they can be pushed and popped. On a phone only the top-most page is shown, whereas on a larger screen (desktop or tablet), if desired, multiple pages can be shown next to each other.
ca: Les pàgines estan organitzades en una [pila de pàgines](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) on es podran empènyer i fer aparèixer. En un telèfon només es mostrarà la pàgina superior, mentre que en una pantalla més gran (escriptori o tauleta), si es desitja, es podran mostrar diverses pàgines una al costat de l'altra.

source: A single page on the phone
ca: Una pàgina única al telèfon
eo: Ununura paĝo en la telefono
es: Una única página en el teléfono
nl: Een enkele pagina op de telefoon
sl: Ena sama stran na telefonu
sv: En enda sida på telefonen
uk: Одинарна сторінка на телефоні

source: Two pages next to each other on the desktop
ca: Dues pàgines una al costat de l'altra a l'escriptori
eo: Du paĝoj unu apud la alia sur la labortablo
es: Dos páginas, una junto a la otra, en el escritorio
nl: Twee pagina's naast elkaar op het bureaublad
sl: Dve strani druga poleg druge na namizju
sv: Två sidor intill varandra på skrivbordsdatorn
uk: Дві сторінки, одна поруч із іншою, на комп'ютері

source: A [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) inherits from a [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), and as such you can use the latter's properties as well.
ca: Una [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) hereta d'un [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), i com a tal, també podeu utilitzar les propietats d'aquest últim.

source: When looking through QML API documentation, make sure to look into the functions and properties inherited by the API you are looking at as well.
ca: Quan cerqueu a la documentació de l'API del QML, assegureu-vos també de cercar les funcions i propietats heretades per l'API que esteu cercant.
eo: Kiam vi trarigardas QML-API-dokumentadon, nepre rigardu la funkciojn kaj ecojn hereditajn de la API, kiun vi rigardas ankaŭ.
nl: Als u de QML API documentatie bestudeert, zorg er dan voor dat u ook veel aandacht besteed aan de functies en de eigenschappen die via de API worden geërfd.
sl: Ko pregledujete dokumentacijo API-ja QML, se prepričajte, da si ogledate tudi funkcije in lastnosti, ki jih podeduje API, ki ga gledate.
sv: När du tittar igenom QML-programmeringsgränssnittets dokumentation, se till att också titta på funktionerna och egenskaperna som ärvs av programmeringsgränssnittet du tittar på.
uk: При пошуку у документації з програмного інтерфейсу QML не забувайте ознайомитися із функціями і властивостями, які успадковує програмний інтерфейс, який вам потрібен.

source: Let's go back to the `Main.qml` file we created in our previous tutorial:
ca: Tornem al fitxer `Main.qml` que hem creat en la nostra guia d'aprenentatge anterior:
eo: Ni reiru al la dosiero `Main.qml`, kiun ni kreis en nia antaŭa lernilo:
es: Volvamos al archivo `Main-qml` que hemos creado en el anterior tutorial:
nl: Laten we teruggaan naar het bestand `Main.qml` dat we gemaakt hebben in onze vorige handleiding:
sl: Vrnimo se k datoteki `Main.qml`, ki smo jo ustvarili v prejšnjem učbeniku:
sv: Låt oss gå tillbaka till filen `Main.qml` vi skapade i föregående handledning:
uk: Повернімося до файла `Main.qml`, який ми створили у нашому попередньому розділі підручника:

source: We make our application start to our [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). All we have included in it is a label containing "Hello World", but we're going to spruce things up a little.
ca: Fem que la nostra aplicació comenci a la nostra [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Tot el que hi hem inclòs és una etiqueta que conté «Hello World», però arreglarem una mica les coses.

source: The idea behind our app is that we're going to be able to display a bunch of countdowns to the user. The problem with a normal [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) is that it has a fixed vertical size, so instead we can use a [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), which already comes with its own built-in scrollbar.
ca: La idea darrere de la nostra aplicació és que podrem mostrar a l'usuari un munt de comptes enrere. El problema amb una [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) normal és que té una mida vertical fixa, així que en el seu lloc farem servir una [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), que ja ve amb la seva pròpia barra de desplaçament integrada.

source: Kirigami pages also feature neat titles placed within the toolbar, quickly indicating to the user which page they are on. All we need to do is to set a page title using the [title](https://doc.qt.io/qt-6/qml-qtquick-controls-page.html#title-prop) property of [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage). In this case, we used one of the `i18nc()` functions we explored in our previous tutorial to this end.
ca: Les pàgines escrites amb el Kirigami també compten amb títols niuats col·locats dins de la barra d'eines, indicant ràpidament a l'usuari en quina pàgina es troba. Tot el que necessitem fer per a establir un títol de pàgina és emprar la propietat [title](https://doc.qt.io/qt-6/qml-qtquick-controls-page.html#title-prop) de la [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage). En aquest cas, per a aquesta finalitat utilitzarem una de les funcions `i18nc()` que hem explorat en la nostra guia d'aprenentatge anterior.

source: You could also choose to define your page within its own QML document. To do so, you'd create the new QML file, for example `kirigami-tutorial/src/qml/StartPage.qml`, add it to your `kirigami-tutorial/src/CMakeLists.txt` file, and set the window's first page to load it, like so:
ca: També podeu optar per definir la vostra pàgina dins del seu propi document QML. Per a fer-ho, cal crear el fitxer QML nou, per exemple `kirigami-tutorial/src/qml/StartPage.qml`, i afegir-lo al fitxer `kirigami-tutorial/src/CMakeLists.txt` i establir la finestra de la primera pàgina per a carregar-lo, com així:
eo: Vi ankaŭ povus elekti difini vian paĝon ene de sia propra QML-dokumento. Por fari tion, vi kreus la novan QML-dosieron, ekzemple `kirigami-tutorial/src/qml/StartPage.qml`, aldonu ĝin al via `kirigami-tutorial/src/CMakeLists.txt` dosiero, kaj agordus la fenestron. unua paĝo por ŝargi ĝin, tiel:
nl: U zou ook uw pagina binnen zijn eigen QML-document kunnen definiëren. Om dat zo te doen, creëert u het nieuwe QML-bestand, bijvoorbeeld `kirigami-tutorial/src/qml/StartPage.qml`, voegt het toe aan uw bestand `kirigami-tutorial/src/CMakeLists.txt` en stelt de eerste pagina in om het te laden, zoals:
sl: Lahko se tudi odločite, da svojo stran definirate znotraj lastnega dokumenta QML. To storite tako, da ustvarite novo datoteko QML, na primer `kirigami-tutorial/src/qml/StartPage.qml`, jo dodate svoji datoteki `kirigami-tutorial/src/CMakeLists.txt` in nastavite okno prva stran za nalaganje, takole:
sv: Du skulle också kunna välja att definiera sidan i ett eget QML-dokument. För att göra det, skulle du skapa den nya QML-filen, exempelvis `kirigami-tutorial/src/qml/StartPage.qml`, lägga till den i filen `kirigami-tutorial/src/CMakeLists.txt`, och ställa in fönstrets första sida för att läsa in den, på följande sätt:
uk: Ви також можете визначити вашу сторінку у окремому документі QML. Для цього слід створити файл QML, наприклад `kirigami-tutorial/src/qml/StartPage.qml`, додати його до вашого файла `kirigami-tutorial/src/CMakeLists.txt` і налаштувати першу сторінку документа на його завантаження, ось так:

source: `pageStack.initialPage` sets the initial Page of the application's page stack, and [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) converts the relative URL of the QML file into an absolute one.
ca: `pageStack.initialPage` estableix la pàgina inicial de la pila de pàgines de l'aplicació, i [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) converteix l'URL relatiu del fitxer QML en un d'absolut.
eo: `pageStack.initialPage` fiksas la komencan Paĝon de la paĝa stako de la aplikaĵo, kaj [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) konvertas la relativan URL de la QML-dosiero en absolutan.
nl: `pageStack.initialPage` stelt de initiële pagina van de paginastapel van de toepassing en [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) converteert de relatieve URL van het QML-bestand in een absolute.
pt: O `pageStack.initialPage` define a Page inicial da pilha de páginas, e o [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) irá converter o URL relativo do ficheiro QML para um absoluto.
sl: 'pageStack.initialPage' določa začetno stran sklada strani in [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) pretvori relativni naslov URL datoteke QML v absolutni naslov.
sv: `pageStack.initialPage` ställer in den ursprungliga sidan i sidstapeln, och [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) konverterar den relativa webbadressen i QML-filen till en absolut.
uk: `pageStack.initialPage` встановлює початкову сторінку стосу сторінок програми, а [Qt.resolvedUrl](docs:qtqml;QtQml.Qt::resolvedUrl) перетворює відносну адресу файла QML на абсолютну.

source: There is further information about alternative page structures [within our Kirigami documentation](/docs/getting-started/kirigami/components-pagerow_pagestack).
ca: Hi ha més informació sobre estructures de pàgina alternatives [dins la documentació del Kirigami](/docs/getting-started/kirigami/components-pagerow_pagestack).
eo: Estas pliaj informoj pri alternativaj paĝaj strukturoj [en nia Kirigami-dokumentado](/docs/getting-started/kirigami/components-pagerow_pagestack).
es: Existe más información sobre estructuras de páginas alternativas [dentro de nuestra documentación de Kirigami](/docs/getting-started/kirigami/components-pagerow_pagestack).
nl: Er is verdere informatie over alternatieve paginastructuren [in onze Kirigami documentatie](/docs/getting-started/kirigami/components-pagerow_pagestack).
pt: Existe mais informações sobre estruturas alternativas de páginas [dentro da nossa documentação do Kirigami](/docs/getting-started/kirigami/components-pagerow_pagestack).
sl: Obstajajo še dodatne informacije o alternativnih strukturah strani [v naši dokumentaciji o Kirigami](/docs/kirigami/components-pagerow_pagestack).
sv: Det finns ytterligare information om alternativa sidstrukturer [i vår Kirigami-dokumentation](/docs/getting-started/kirigami/components-pagerow_pagestack).
uk: У [нашій документації з Kirigami](/docs/getting-started/kirigami/components-pagerow_pagestack) є докладніші відомості щодо альтернативних структур сторінки.

source: Using separate files in a C++ project
ca: Utilitzar fitxers separats en un projecte C++
sl: Uporaba ločenih datotek v projektu C++

source: Separating unwieldy code into different files, and attach signals to your components.
ca: Separar el codi difícil de gestionar en diferents fitxers, i adjuntar senyals als components.
eo: Disigante neoportunan kodon en malsamajn dosierojn, kaj aligu signalojn al viaj komponantoj.
es: Separar código difícil de manejar en diferentes archivos y adjuntar señales a los componentes.
fr: Séparer le code difficile à manier dans différents fichiers et attacher des signaux à vos composants.
nl: Onpraktische code in verschillende bestanden scheiden en signalen aan uw componenten hangen.
pl: Oddzielenie kodu tak dużego, że nie do ogarnięcia, do osobnych plików i dołączenie sygnałów do twoich składników.
pt: Separar código gigantesco em vários ficheiros e associar sinais/eventos aos seus componentes.
sl: Ločevanje neusmiljene kode v različne datoteke in spajanje signalov komponentam.
sv: Separera tungrodd kod i olika filer, och koppla signaler till dina komponenter.
uk: Розподіл громіздкого коду між різними файлами і долучення сигналів до ваших компонентів.

source: Why and how
ca: Per què i com
eo: Kial kaj kiel
es: Por qué y cómo
nl: Hoe en waarom
sl: Zakaj in kako
sv: Varför och hur
uk: Чому і як
