Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog) is a specialized dialog that is used to list a selection of clickable options for the user using its [actions](https://api.kde.org/qml-org-kde-kirigami-dialogs-menudialog.html#actions-prop) property.
ca: El [Kirigami.MenuDialog](docs:kirigami;org.kde.kirigami.dialogs.MenuDialog) és un diàleg especialitzat que s'utilitza per a llistar una selecció d'opcions clicables per a l'usuari utilitzant la seva propietat [actions](https://api.kde.org/qml-org-kde-kirigami-dialogs-menudialog.html#actions-prop).

source: ![A simple MenuDialog listing actions like Play and Pause for media](menudialog.webp)
ca: ![Una llista senzilla d'accions de MenuDialog com Reprodueix o Pausa per a elements multimèdia](menudialog.webp)
eo: ![Simpla MenuDialog listiganta agojn kiel Ludi kaj Paŭzi por aŭdvidaĵoj](menudialog.webp)
es: ![Un sencillo MenuDialog que enumera acciones como Reproducir y Pausar para multimedia](menudialog.webp)
nl: ![Een eenvoudige MenuDialog lijst met acties zoals Afspelen en Pause voor media](menudialog.webp)
sl: ![Preprost pogovorni meni s seznamom dejanj, kot sta predvajanje in premor za medije](menudialog.webp)
sv: ![En enkel MenuDialog som listar åtgärder som Spela och Paus för media](menudialog.webp)
uk: ![Просте вікно MenuDialog зі списком дій, зокрема «Пуск» і «Пауза» для мультимедійних даних](menudialog.webp)

source: Drawers
ca: Calaixos (drawers)
eo: Kestoj
es: Cajones
fr: Tiroirs
nl: Schuifladen
pl: Panele
pt: Áreas
sl: Predali
sv: Lådor
uk: Висувні панелі

source: Drawers provide applications with quick access to controls and pages of your application.
ca: Els calaixos proporcionen aplicacions amb accés ràpid als controls i les pàgines de la vostra aplicació.
eo: Kestoj provizas aplikojn kun rapida aliro al regiloj kaj paĝoj de via aplikaĵo.
es: Los cajones proporcionan aplicaciones con acceso rápido a los controles y a las páginas de la aplicación.
fr: Les tiroirs permettent aux applications d'accéder rapidement aux contrôles et aux pages de votre application.
nl: Schuifladen bieden toepassingen snelle toegang tot besturing en pagina's van uw toepassing.
pl: Półki dają aplikacjom szybki dostęp do rzeczy sterujących i stron twojej aplikacji.
pt: Estas áreas ou gavetas oferecem às aplicações um acesso rápido aos controlos e páginas da sua aplicação.
sl: Predali (angl. drawer) zagotavljajo aplikacijam hiter dostop do kontrolnikov in strani vaše aplikacije.
sv: Lådor tillhandahåller snabbåtkomst till kontroller och sidor i ditt program.
uk: Висувні панелі надають змогу створювати програми із панелями швидкого доступу до елементів керування та сторінок програми.

source: Drawers are panels that slide out of the sides of the application window. They can be populated with interactive elements such as Kirigami Actions, buttons, text, and more.
ca: Els calaixos són subfinestres que llisquen pels costats de la finestra de l'aplicació. Es poden completar amb elements interactius com les Kirigami Actions: botons, text i més.
eo: Kestoj estas paneloj, kiuj glitas el la flankoj de la aplika fenestro. Ili povas esti plenigitaj per interagaj elementoj kiel Kirigami-Agoj, butonoj, teksto kaj pli.
es: Los cajones son paneles que se deslizan por los lados de la ventana de la aplicación. Pueden contener elementos interactivos, como acciones de Kirigami, botones y texto, entre otros.
fr: Les tiroirs sont des panneaux coulissant sur les côtés de la fenêtre de l'application. Ils peuvent être remplis d'éléments interactifs tels que des actions de Kirigami, des boutons, du texte, etc.
nl: Schuifladen zijn panelen die aan de zijkanten van het toepassingenvenster uitschuiven. Ze kunnen bevolkt worden met interactieve elementen zoals Kirigami acties, knoppen, tekst en meer.
pl: Półki to panele, które wysuwają się z boków okna aplikacji. Można je wypełnić rzeczami interaktywnymi takimi jak Działania Kirigami, przyciskami, tekstem i wieloma innymi.
pt: As áreas são painéis que deslizam dos lados da janela da aplicação. Os mesmos poderão ser preenchidos com elementos interactivos como acções, botões, texto, entre outras coisas do Kirigami.
sl: Predali so plošče, ki zdrsnejo iz strani okna aplikacije. Napolnjene so lahko z interaktivnimi elementi, kot so Kirigami Actions, gumbi, besedilo in drugo.
sv: Lådor är paneler som glider ut från programfönstrets sidor. De kan befolkas med interaktiva element som Kirigami åtgärder, knappar, text, med mera.
uk: Висувні панелі є панелями, які висуваються з боків вікна програми. На ці панелі можна додати інтерактивні елементи, подібні до кнопок дій Kirigami, простих кнопок дій, текстових міток тощо.

source: Drawers come in different types, shapes, and forms. In this page we will go over each type and provide an overview of their characteristics.
ca: Els calaixos venen en diferents tipus, formes i formularis. En aquesta pàgina repassarem cada tipus i proporcionarem un resum de les seves característiques.
eo: Kestoj venas en malsamaj specoj, formoj kaj formoj. En ĉi tiu paĝo ni trarigardos ĉiun tipon kaj provizos superrigardon de iliaj karakterizaĵoj.
es: Los cajones pueden ser de distintos tipos, formas y formatos. En esta página vamos a repasar cada tipo y proporcionaremos un resumen de sus características.
fr: Les tiroirs sont proposés avec différents types, différentes formes et différents modèles. Dans cette page, nous allons passer en revue chaque type et donner un aperçu de leurs caractéristiques.
nl: Schuifladen komen in verschillende typen, vormen en formulieren. In deze pagina bespreken we elk type en leveren een overzicht van hun karakteristieken.
pl: Półki występują w różnych rodzajach, kształtach i postaciach. Na tej stronie przerobimy każdy rodzaj i przedstawimy ich cechy szczególne.
pt: As áreas existem sob diferentes tipos, formas e formatos. Nesta página iremos passar por cada tipo e dar uma visão geral das suas características.
sl: Predali prihajajo v različnih vrstah, oblikah in formatih. Na tej strani bomo šli čez vsako vrsto in zagotovili pregled njihovih značilnosti.
sv: Lådor har olika typer, skepnader och former. På den här sidan går vi igenom alla typer och ger en översikt över deras karaktärer.
uk: Висувні панелі можуть належати до різних типів, можуть мати різні форми. На цій сторінці ми опишемо усі типи і оглянемо їхні характеристики.

source: The global drawer is a standard feature in KDE's mobile applications and can sometimes be found in their desktop incarnations too. It contains an application's main menu: included here are any functions that are not specific to the current page but still significant to general navigation or interaction within the application.
ca: El calaix global és una característica estàndard en les aplicacions de mòbil del KDE i, de vegades, també es pot trobar en les seves encarnacions per a l'escriptori. Conté el menú principal d'una aplicació: aquí s'inclouen totes les funcions que no són específiques de la pàgina actual, però que encara són importants per a la navegació general o la interacció dins de l'aplicació.
eo: La ĉiea tirkesto estas norma funkcio en la poŝtelefonaj aplikoj de KDE kaj foje troviĝas ankaŭ en iliaj labortablaj enkarniĝoj. Ĝi enhavas la ĉefan menuon de aplikaĵo: inkluditaj ĉi tie estas iuj funkcioj, kiuj ne estas specifaj por la nuna paĝo sed ankoraŭ signifaj por ĝenerala navigado aŭ interagado ene de la aplikaĵo.
es: El cajón global es una funcionalidad estándar de las aplicaciones móviles de KDE, que a veces también se puede encontrar en sus reencarnaciones del escritorio. Contiene el menú principal de una aplicación: aquí se incluyen todas las funciones que no son específicas de la página actual, aunque siguen siendo importantes para la navegación general o la interacción dentro de la aplicación.
fr: Le tiroir global est une fonctionnalité standard dans les applications mobiles de KDE et peut parfois être aussi présent dans leurs versions de bureau. Il contient un menu principal d'une application. Ce qui est inclus sont toutes les fonctions qui ne sont pas spécifiques à la page en cours, mais qui sont importantes pour la navigation ou l'interaction générale au sein de l'application.
nl: De globale schuiflade is een standaard functie in de mobiele toepassingen van KDE en kunnen soms ook in hun incarnaties op het bureaublad zijn te vinden. Deze bevat een hoofdmenu van de toepassing: hierin zit alle functies die niet specifiek zijn voor de huidige pagina maar nog steeds significant voor de algemene navigatie of interactie met de toepassing.
pl: Globalna półka jest standardową cechą w aplikacjach przenośnych KDE, a czasami można ją znaleźć także na aplikacjach biurkowych. Zawiera główne menu aplikacji: znajdują się tutaj wpisy, które nie są szczególne dla danej strony lecz znaczące do ogólnego poruszania i oddziaływania na aplikację.
pt: A área global é uma característica-padrão das aplicações móveis e que poderá ser encontrada alguma vezes nas suas versões futuras. Contém um menu principal da aplicação: neste existem as funções que não sejam específicas da página actual, mas que sejam à mesma relevantes para a navegação geral ou para alguma interacção dentro da aplicação.
sl: Globalni predal je standardna funkcija v KDE-jevih mobilnih aplikacijah in ga je včasih mogoče najti tudi v njihovih inkarnacijah na namizju. Vsebuje glavni meni aplikacije: vključene so vse funkcije, ki niso specifične za trenutno stran, vendar so še vedno pomembne za splošno krmarjenje ali interakcijo znotraj aplikacije.
sv: Den globala lådan är en standardfunktion i KDE:s mobilprogram och kan ibland också finnas i deras skrivbordsinkarnationer. Den innehåller programmets huvudmeny: här ingår alla funktioner som inte är specifika för den nuvarande sidan men ändå signifikanta för allmän navigering eller interaktion med programmet.
uk: Загальна панель є стандартною можливістю у мобільних програмах KDE, яку іноді можна знайти і у їхніх варіантах для звичайних комп'ютерів. На ній міститься головне меню програми: до нього включено усі функції, які не є специфічними для поточної сторінки, але є важливими для загальної навігації або взаємодії у програмі.

source: It can be activated by tapping the hamburger menu or by swiping from the left edge to the middle of the screen in Left to Right mode or from the right edge in Right to Left mode.
ca: Es pot activar tocant el menú d'hamburguesa o lliscant des de la vora esquerra al centre de la pantalla en el mode d'esquerra a dreta o des de la vora dreta en el mode de dreta a esquerra.
eo: Ĝi povas esti aktivigita frapante la hamburgeran menuon aŭ svingante de la maldekstra rando al la mezo de la ekrano en Maldekstre al Dekstra reĝimo aŭ de la dekstra rando en Dekstre al Maldekstra reĝimo.
es: Se puede activar tocando el menú de hamburguesas o deslizando el dedo desde el borde izquierdo hacia el centro de la pantalla en el modo de izquierda a derecha, o desde el borde derecho en el modo de derecha a izquierda.
nl: Het kan geactiveerd worden door op het hamburgermenu te tikken of door vegen van de linker rand naar het midden van het scherm in modus Links-naar-rechts of vanaf de rechter rand in modus Rechts-naar-links.
pt: Poderá ser activado se tocar no menu do hambúrguer ou deslizando do extremo esquerdo para o meio do ecrã, no modo da Esquerda para a Direita, ou do extremo direito para o centro no modo da Direita para a Esquerda.
sl: Aktivirajte ga lahko tako, da tapnete v hamburger meniju ali s potegom z levega roba do sredine zaslona v načinu od leve na desno ali od desnega roba v načinu z desne v levo.
sv: Den kan aktiveras genom att röra vid hamburgermenyn eller genom att svepa från vänster kant till mitten av skärmen i vänster till höger-läge eller från höger kant i höger till vänster-läge.
uk: Її можна активувати натисканням кнопки меню-гамбургера або рухом пальця від лівого краю до середини екрана у режимі зліва праворуч або від правого краю у режимі справа ліворуч.

source: [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) components are what we use to create such drawers. These are set to the [globalDrawer](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#globalDrawer-prop) property of the [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow) that forms the basis of our Kirigami application.
ca: Els components d'un [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) són els que utilitzem per a crear aquests calaixos. S'estableixen a la propietat [globalDrawer](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#globalDrawer-prop) de la [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow) que forma la base de la nostra aplicació escrita amb el Kirigami.

source: ![Screenshot of a global drawer in desktop mode that looks like a sidebar](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
ca: ![Captura de pantalla d'un nostre calaix global en mode d'escriptori que sembla una barra lateral](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
eo: ![Ekrankopio de ĉiea tirkesto en labortabla reĝimo kiu aspektas kiel flankbreto](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
es: ![Captura de pantalla de un cajón global en modo escritorio que se asemeja a una barra lateral](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
nl: ![Schermafdruk van een globale schuiflade in modus bureaublad die lijkt op een zijbalk](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
sl: ![Posnetek zaslona globalnega predala v namiznem načinu, ki je videti kot stranska vrstica](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
sv: ![Skärmbild av en global låda i skrivbordsläge som ser ut som en sidorad](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)
uk: ![Знімок загальної висувної панелі у режимі робочої станції, коли вона виглядає як бічна панель](/docs/getting-started/kirigami/components-drawers/globaldrawer_simple.webp)

source: The [titleIcon](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#titleIcon-prop) property takes names for system-wide icons according to the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application which comes with [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec).
ca: La propietat [titleIcon](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#titleIcon-prop) pren els noms per a les icones de tot el sistema segons l'especificació de FreeDesktop. Aquestes icones i noms d'icones es poden veure amb l'aplicació CuttleFish del KDE que es distribueix amb el [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), o visitant l'[especificació per a l'anomenat de les icones de FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec).

source: Header
ca: Capçalera
eo: Kapo
es: Cabecera
fr: En-tête
nl: Koptekst
pl: Nagłówek
pt: Cabeçalho
sl: Glava
sv: Sidhuvud
uk: Шапка

source: Headers can be used to place sticky components at the top of your global drawer. Header components will stay in place even if your global drawer contains nested Kirigami actions that replace the current layer on the global drawer.
ca: Les capçaleres es poden utilitzar per a col·locar components adhesius a la part superior del vostre calaix global. Els components de la capçalera romandran en el seu lloc, fins i tot si el vostre calaix global conté accions de Kirigami imbricades que substitueixen la capa actual en el calaix global.
eo: Titoloj povas esti uzataj por meti gluiĝemajn komponantojn ĉe la supro de via ĉiea kesto. Kapaj komponantoj restos en la loko eĉ se via ĉiea tirkesto enhavas nestitajn Kirigami-agojn, kiuj anstataŭigas la nunan tavolon sur la ĉiea kesto.
es: Las cabeceras se pueden usar para situar componentes adhesivos en la parte superior de nuestro cajón global. Los componentes de cabecera permanecerán en su sitio incluso cuando el cajón global contiene acciones anidadas de Kirigami que sustituyen la capa actual del cajón global.
fr: Les en-têtes peuvent être utilisés pour placer des composants collants en haut de votre tiroir global. Les composants d'en-tête resteront en place même si votre tiroir global contient des actions de Kirigami imbriquées qui remplacent la couche actuelle du tiroir global.
nl: Er kunnen opschriften gebruikt worden om plakcomponenten te plaatsen bovenaan uw globale schuiflade. Deze opschriftcomponenten blijven op hum plaats zelfs als uw globale schuiflade geneste Kirigami acties bevatten die de huidige laag in de globale schuiflade vervangen.
pl: Nagłówków można używać do umieszczania lepkich składników na górze naszej globalnej półki. Składki nagłówków pozostaną na swoim miejscu nawet gdy globalna półka będzie zawierać zagnieżdżone działania, które będą zastępować bieżącą warstwę w globalnej półce.
pt: Os cabeçalhos poderão ser usados para colocar componentes fixos no topo da sua área global. Os componentes de cabeçalho irão permanecer no lugar, mesmo que a sua área global tenha acções encadeadas do Kirigami que substituam a camada actual na área global.
sl: Glave headers se lahko uporabljajo za nameščanje lepljivih komponent na vrh vašega globalnega predala. Komponente glave ostanejo na mestu, tudi če vaš globalni predal vsebuje ugnezdena dejanja Kirigami, ki nadomeščajo trenutni sloj na globalnem predalu.
sv: Sidhuvud kan användas för att placera orörliga komponenter längst upp i din globala låda. Sidhuvudkomponenter förblir på plats även om din globala låda innehåller nästlade Kirigami-åtgärder som ersätter det nuvarande lagret i den globala lådan.
uk: Шапками можна скористатися для розташування липких компонентів поверх вашої загальної панелі. Компоненти шапки лишаються на місці, навіть якщо загальна панель містить вкладені дії Kirigami, які замінюють поточний шар на загальній панелі.

source: Your chosen header component can be set with the global drawer's [header](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#header-prop) property, and it will replace the global drawer's title. This is useful to add a [Kirigami.SearchField](https://api.kde.org/qml-org-kde-kirigami-searchfield.html), for example:
ca: El component de capçalera que trieu es pot configurar amb la propietat [header](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#header-prop) del calaix global, i substituirà el títol del calaix global. Això és útil per afegir un [Kirigami.SearchField](https://api.kde.org/qml-org-kde-kirigami-searchfield.html), per exemple:

source: Our global drawer now shows the search bar component we set as the header
ca: El nostre calaix global ara mostra el component de la barra de cerca que hem establert com a capçalera
eo: Nia ĉiea tirkesto nun montras la serĉtrinkkomponenton, kiun ni starigis kiel la kaplinion
es: Nuestro cajón global muestra ahora el componente de barra de búsqueda que hemos definido como cabecera
nl: Onze globale schuiflade toont nu de zoekbalkcomponent die we als het opschrift instellen
pt: A nossa área global agora mostra o componente da barra de pesquisa que definimos como cabeçalho
sl: Naš globalni predal zdaj prikazuje komponento vrstice za iskanje, ki smo jo nastavili kot glavo
sv: Vår globala låda visar nu sökradskomponenten som vi angav som sidhuvudet
uk: Тепер на нашій загальній панелі буде показано компонент панелі пошуку, який ми визначили як шапку

source: Adapting for the desktop
ca: Adaptar-la per a l'escriptori
eo: Adaptado por la labortablo
es: Adaptación para el escritorio
fr: Adaptation au bureau
nl: Aanpassen voor het bureaublad
pl: Dostosowywanie na urządzenia biurkowe
pt: Adaptar-se ao computador
sl: Prilagajanje namizju
sv: Anpassa till skrivbordet
uk: Адаптування для робочої станції

source: While panel-style global drawers can be useful in mobile environments, they might be too large on the desktop, especially when the application has few actions.
ca: Si bé els calaixos globals d'estil subfinestra poden ser útils en entorns mòbils, és possible que siguin massa grans a l'escriptori, especialment quan les aplicacions tenen poques accions.
eo: Dum panel-stilaj ĉiea tirkestoj povas esti utilaj en moveblaj medioj, ili eble estos tro grandaj sur la labortablo, precipe kiam la aplikaĵo havas malmultajn agojn.
es: Aunque los cajones globales de estilo panel pueden ser útiles en entornos móviles, es posible que sean demasiado grandes en el escritorio, especialmente cuando la aplicación tiene pocas acciones.
nl: Terwijl paneel-stijl globale schuifladen nuttig kunnen zijn in mobiele omgevingen, kunnen ze te groot zijn op het bureaublad, speciaal wanneer de toepassing weinig acties heeft.
sl: Medtem ko so globalni predali v obliki plošče lahko uporabni v mobilnih okoljih, so morda preveliki na namizju, zlasti če ima aplikacija malo dejanj.
sv: Medan globala lådor med panelstil kan vara användbara i mobilomgivningar, kan de vara för stora för skrivbordsdatorer, särskilt om programmet har ett fåtal åtgärder.
uk: Хоча загальні панелі у стилі звичайних панелей можуть бути корисними у середовищах мобільних пристроїв, вони можуть бути надто великими на звичайних комп'ютерах, особливо якщо у програмі небагато пунктів дій.

source: Thankfully, Kirigami global drawers provide an [isMenu](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop) property. When set to `true`, they turn into more traditional menus only on the desktop.
ca: Afortunadament, els calaixos globals de Kirigami proporcionen una propietat [isMenu](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop). Quan es configura com a `true`, els nostres calaixos globals esdevindran menús més tradicionals només a l'escriptori.

source: In this menu mode, headers and banners are not visible.
ca: En aquest mode de menú, les capçaleres i els bàners no seran visibles.
eo: En ĉi tiu menua reĝimo, kaplinioj kaj standardoj ne estas videblaj.
es: En este modo de menú, las cabeceras y los *banners* no son visibles.
fr: Dans ce mode de menu, les en-têtes et les bannières ne sont pas visibles.
nl: In deze menumodus, zijn opschriften en banners niet zichtbaar.
pl: W tym trybie menu, nagłówki i banery nie są widoczne.
pt: Neste modo de menu, os cabeçalhos e rodapés não ficam visíveis.
sl: V tem načinu menija glave in pasice niso vidni.
sv: I menyläget är inte sidhuvuden och baner synliga.
uk: У цьому режимі меню заголовки і банери є невидимими.

source: Kirigami Actions here...
ca: Aquí les accions del Kirigami...
eo: Kirigami-Agoj ĉi tie...
nl: Hier Kirigami-acties...
sl: Kirigami Addons tukaj...
sv: Kirigami-åtgärder här ...
uk: Ось дії Kirigami...

source: Global drawer in menu mode, without a header or banner
ca: Calaix global en el mode de menú, sense capçalera ni bàner
eo: Ĉiea tirkesto en menureĝimo, sen kaplinio aŭ standardo
es: Cajón global en modo menú, sin cabecera ni banner
nl: Globale schuiflade in modus menu, zonder een kop of banner
pt: Área global no modo de menu, sem um cabeçalho ou separador
sl: Globalni predal v načinu menija brez glave ali pasice
sv: Global låda i menyläge, utan sidhuvud eller baner
uk: Загальна висувна панель у режимі меню, без шапки або банера

source: Context Drawers
ca: Calaixos contextuals
eo: Kuntekstaj Kestoj
es: Cajones de contexto
nl: Context van schuifladen
pt: Áreas de Contexto
sl: Kontekstni predali
sv: Sammanhangslådor
uk: Контекстні висувні панелі
