Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked) property of the "Edit" button on our cards now calls the `openPopulatedSheet()` function, with the card's fetched list element properties set as the arguments for this function. With these, the sheet can be populated with the correct text.
pt: A propriedade [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked) do botão "Editar" nos nossos cartões agora invoca a função `openPopulateSheet` com o elemento da lista de cartões obtidos configurada como argumentos desta função. Com estes, a folha poderá ser preenchida com o texto correcto.

source: Primitive components such as [Rectangle](docs:qtquick;QtQuick.Rectangle) should always be colored with the color palette provided by Kirigami via the [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) attached property.
pt: Os componentes primitivos como o [Rectangle](docs:qtquick;QtQuick.Rectangle) deverão sempre ser coloridos com a paleta de cores oferecida pelo Kirigami através da propriedade [`Theme`](docs:kirigami2;Kirigami::PlatformTheme) associada.

source: Hardcoded colors in QML, such as `#32b2fa` or `red`, should usually be avoided; if it is really necessary to have elements with custom colors, it should be an area where only custom colors are used (usually in the content area of the app, and never in chrome areas such as toolbars or dialogs). For instance, a hardcoded `black` foreground cannot be used over a [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::PlatformTheme::backgroundColor) background, because if the platform uses a dark color scheme the result will have poor contrast with black over almost black. This is an accessibility issue and should be avoided.
pt: As cores fixas no QML, como por exemplo `#32b2fa` ou `red` devem normalmente ser evitadas; se é realmente necessário ter elementos com cores personalizadas, deverá ser uma área onde só são usadas cores personalizadas (normalmente na área de conteúdo da aplicação, e nunca em outras áreas, como as barras de ferramentas ou janelas); por exemplo, um texto fixo em `black` não poderá ser usado sobre um fundo [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::PlatformTheme::backgroundColor), porque se a plataforma usar um esquema de cores escuras, o resultado terá um contraste fraco de preto sobre quase-preto. Isto é um problema, do ponto de vista de acessibilidade, e deverá ser evitado.

source: [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) is an attached property, and therefore it is available to use for any QML item. Its properties include all the colors available in the palette, and what palette to use, such as the [colorSet](docs:kirigami2;Kirigami::PlatformTheme::colorSet) property.
pt: O [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) é uma propriedade anexada, pelo que está disponível para ser usada em qualquer item do QML. Contém como propriedades todas as cores disponíveis na paleta e qual a paleta a usar na propriedade [colorSet](docs:kirigami2;Kirigami::PlatformTheme::colorSet).

source: [Kirigami Gallery](../introduction-kirigami-gallery) provides a code example showcasing [all colors available for Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) through [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme). This includes all their states: if you click outside the window, the colors change to their inactive state, and if you switch your system to a dark theme, the dark variants of the colors should show up in real time.
pt: O [Kirigami Gallery](../introduction-kirigami-gallery) oferece um exemplo de código que demonstra [todas as cores disponíveis para o Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) através do [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme). Isto inclui todos os seus estados: se carregar fora da janela, as cores mudam para o seu estado inactivo, e se mudar o seu sistema para um tema escuro, deverão aparecer as cores na sua variante escura em tempo-real.

source: If you define a color set for an item, all of its child items will recursively inherit it automatically (unless the property [inherit](docs:kirigami2;Kirigami::PlatformTheme::inherit) has explicitly been set to `false`, which should always be done when the developer wants to force a specific color set) so it is easy to change colors for an entire hierarchy of items without touching any of the items themselves.
pt: Se tiver uma cor definida para um dado item, todos os seus itens-filhos irão herdar essa cor de forma recursiva e automática (a menos que a propriedade [inherit](docs:kirigami2;Kirigami::PlatformTheme::inherit) tenha sido explicitamente configurada como `false`, o que deverá sempre ser feito quando o programador quiser forçar um conjunto de cores específico), pelo que é fácil modificar as cores para uma hierarquia inteira de itens, sem tocar em nenhum dos itens propriamente ditos.

source: [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) supports 5 different color sets:
pt: O [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) suporta 5 diferentes conjuntos de cores:

source: The font size of the [Kirigami.Theme](docs:kirigami2;Kirigami::PlatformTheme) is available as `Kirigami.Theme.defaultFont.pointSize` in your application.
pt: O tamanho do texto do [Theme](docs:kirigami2;Kirigami::PlatformTheme) do Kirigami está disponível como `Kirigami.Theme.defaultFont.pointSize` na sua aplicação.

source: <img src="https://apps.kde.org/app-icons/org.kde.discover.svg" width="50" height="50"><br />Discover
pl: <img src="https://apps.kde.org/app-icons/org.kde.discover.svg" width="50" height="50"><br />Odkrywca
