Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A displayable program name string.
fr: La chaîne de caractères pour afficher le nom du programme.

source: The program version string.
fr: La chaîne de version du programme.

source: Short description of what the app does.
fr: Brève description de ce que fait l'application

source: The license this code is released under.
fr: La licence sous laquelle le code est publié.

source: Copyright Statement.
fr: Déclaration de droits d'auteur.

source: In the cpp file we include `KAboutData` and the `.h` file we just created, [KAboutData](docs:kcoreaddons;KAboutData) is a core KDE Frameworks component that stores information about an application, which can then be reused by many other KDE Frameworks components. We instantiate a new `KAboutData` object with its fairly complete default constructor and add author information.
fr: Dans le fichier « cpp », nous incluons « KAboutData » et le fichier « .h » que nous venons de créer. [KAboutData](docs:kcoreaddons;KAboutData) est un composant central de KDE Frameworks stockant des informations sur une application et pouvant ensuite être réutilisées par de nombreux autres composants des environnements de développement de KDE. Nous instancions un nouvel objet « KAboutData » avec son constructeur par défaut assez complet et ajoutons les informations sur l'auteur.
pl: W pliku zawieramy `KAboutData` oraz plik `.h`, który właśnie utworzyliśmy, [KAboutData](docs:kcoreaddons;KAboutData) jest głównym składnikiem Szkieletów KDE, który przechowuje szczegóły o aplikacji, które później mogą być wykorzystane przez wiele innych składników Szkieletów KDE. Tworzymy nowy obiekt `KAboutData`, który jest całkowicie pełnym domyślnym konstruktorem i dodajemy szczegóły o autorze.

source: We also include this `config-helloworld.h` file which gives us this `HELLOWORLD_VERSION_STRING` variable that we'll set later in this tutorial.
fr: Nous incluons également ce fichier « config-helloworld.h » qui nous donne cette variable « HELLOWORLD_VERSION_STRING » que nous définirons plus tard dans ce tutoriel.

source: After all the required information has been set, we call `KAboutData::setApplicationData` to initialize the properties of the [QApplication ](https://doc.qt.io/qt-5/qapplication.html) object.
fr: Une fois que toutes les informations requises ont été définies, nous appelons la méthode « KAboutData::setApplicationData » pour initialiser les propriétés de l'objet [QApplication ](https://doc.qt.io/qt-5/qapplication.html).
pl: Po ustawieniu wszystkich wymaganych danych, wywołujemy `KAboutData::setApplicationData`, aby przygotować właściwości obiektu [QApplication](https://doc.qt.io/qt-5/qapplication.html).

source: After the QML Engine definition, we create a [qmlRegisterSingletonType](https://doc.qt.io/qt-5/qqmlengine.html#qmlRegisterSingletonType), the first argument is a URI, basically a package name, the second and third arguments are major and minor versions respectively, the fourth is the type name, the name that we will call when accessing the `AboutType` methods.
fr: Avant la définition du moteur « QML », nous créons un objet [qmlRegisterSingletonType](https://doc.qt.io/qt-5/qqmlengine.html#qmlRegisterSingletonType). Le premier argument est un URI, en fait un nom de paquet, les deuxième et le troisième arguments sont respectivement les versions majeure et mineure, le quatrième argument est le nom du type, le nom que nous appellerons lors de l'accès aux méthodes « AboutType ».
pl: Przed określeniem Silnika QML, tworzymy [qmlRegisterSingletonInstance](https://doc.qt.io/qt-5/qqmlengine.html#qmlRegisterSingletonInstance), gdzie pierwszym argumentem jest URI, co stanowi nazwę pakietu, drugi i trzeci argument stanowi odpowiednio główną i poboczną wersję, czwarty nazwę jego rodzaju, nazwę, którą będziemy wywoływać przy dostępie do metod `AboutType`.

source: In the `qmlRegisterSingletonType` lambda we just return a new `AboutType` object;
fr: Dans le lambda « qmlRegisterSingletonType », nous retournons simplement un nouvel objet « AboutType » ;
pl: W lamdzie `qmlRegisterSingletonType` zwracamy nowy obiekt `AboutType`;

source: First, we import the package we defined in the `main.cpp` file, add a `Kirigami.Action` to our global drawer that will send us to the about page and create a component with a `Kirigami.AboutPage` in it, the About Page only have one property: `aboutData`, we then pass `Conrtoller.aboutData` to it.
fr: Tout d'abord, nous importons le paquet que nous avons défini dans le fichier « main.cpp ». Puis, nous ajoutons un objet « Kirigami.Action » à notre tiroir global qui nous enverra à la page « A propos ». Enfin, nous créons un composant avec un objet « Kirigami.AboutPage » dedans. La page « A propos » n'a qu'une seule propriété : « aboutData », nous lui passons alors le paramètre « Controler.aboutData ».

source: In the CMakeLists.txt file in our top-level folder, add `CoreAddons` to the `find_package` module. You'll also want to add these three `ECM` includes which will allow us to use the `ecm_setup_version` function, this function let's use the `PROJECT_VERSION` variable in our code so we only need to change one variable when bumping up versions.
fr: Dans le fichier « CMakeLists.txt » de notre dossier de premier niveau, ajoutez « CoreAddons » au module « find_package ». Vous voudrez également ajouter ces trois includes « ECM » qui nous permettront d'utiliser la fonction « ecm_setup_version ». Cette fonction permet d'utiliser la variable « PROJECT_VERSION » dans notre code. Ainsi, nous n'avons à changer qu'une seule variable lors d'un changement de version.

source: In the CMakeLists.txt file in the ‘src’ directory, add `controller.cpp` to the `add_executable` module and `KF5::CoreAddons` to the `target_link_libraries` module.
fr: Dans le fichier « CMakeLists.txt » du répertoire « src », ajoutez le fichier « controller.cpp » au module « add_executable » et « KF5::CoreAddons » au module « target_link_libraries ».

source: Add the following content to the new header file (the one with the `.h` extension):
fr: Ajoutez le contenu suivant au nouveau fichier d'en-tête (celui ayant l'extension « .h ») :
pl: Dodaj następującą treść do pliku nowego nagłówka (tego z rozszerzeniem `.h`):

source: The cpp file containing the definitions is similarly empty right now, it should contain something like the following:
fr: Le fichier « cpp » contenant les définitions est vide pour l'instant. Il devrait contenir quelque chose comme ceci :
pl: Plik cpp zawierający definicje jest podobnie pusty w tej chwili, powinien on zawierać coś na kształt:

source: To `main.cpp`, right after creating the `QQmlApplicationEngine`, add the type registration as follows:
fr: Dans le fichier « main.cpp », juste après avoir créé l'objet « QQmlApplicationEngine », ajoutez l'enregistrement de type comme ceci :
pl: Do `main.cpp`, zaraz po stworzeniu `QQmlApplicationEngine`, dodaj rejestrację typu w następujący sposób:

source: From now on, the backend will be known to QML as `Backend`. It is contained in a module called `org.kde.example`. Since the module is part of the application, you don't need to worry about versioning it, just stay with 1.0 and use it consistently throughout the application.
fr: A partir de maintenant, le moteur sera connu de QML sous le nom de « Moteur ». Il est contenu dans un module appelé « org.kde.example ». Puisque le module fait partie de l'application, vous n'avez pas besoin de vous soucier de sa version, restez-en à la version 1.0 et utiliser le de manière cohérente dans l'application.
pl: Od teraz, część logiczna będzie znana QML jako `Backend`. Zawiera się w module o nazwie `org.kde.example`. Ponieważ moduł jest częścią aplikacji, to nie musisz się martwić jego wersjonowaniem, wystarczy, że pozostaniesz przy 1.0 i będziesz jej używał przez całą aplikację.

source: Right under the `Q_OBJECT` macro, add a new `Q_PROPERTY`.
fr: Juste sous la macro « Q_OBJECT », ajoutez une nouvelle « Q_PROPERTY ».
pl: Zaraz pod makrem `Q_OBJECT`, dodaj nowe `Q_PROPERTY`.

source: That seems like quite a lot for a simple property we'll use to show some text from the backend, right? But a closer look reveals that this can already run logic when the property is read by the user interface, and when it is written. It will automatically inform frontend and backend of changes.
fr: Cela semble beaucoup pour une simple propriété que nous allons utiliser pour afficher du texte depuis le moteur, n'est-ce pas ? Mais, un regard plus attentif révèle que cela peut déjà exécuter de façon logique lorsque la propriété est lue par l'interface utilisateur et lorsqu'elle est écrite. Il informera automatiquement l'interface graphique et le moteur de tout changement.
pl: Wydaje się to całkiem dużo jak na prostą właściwość, której użyjemy do pokazania jakiegoś tekstu z części logiki programu, prawda? Po bliższym zapoznaniu, okazuje się, że może to odczytywać logikę, gdy właściwość jest czytana przez interfejs użytkownika oraz wtedy gdy jest zapisywania. Samoczynnie powiadomi część obsługi oraz logiki programu o zmianach.

source: The reading and writing is based on getter and setter functions, so add a new private attribute to your class, like this, and add getter and setter functions.
fr: La lecture et l'écriture reposent sur des fonctions « getter » et « setter ». Ainsi, pour ajouter un nouvel attribut privé à votre classe, comme ceci, puis ajoutez les fonctions « getter » et « setter ».
pl: Odczyt i zapis jest oparty na funkcjach getter oraz setter, więc dodaj nowy prywatny atrybut do twojej klasy, w ten sposób oraz dodaj funkcje getter oraz setter.

source: The first function is the getter, the second the setter, and the third a signal that is emitted when the property was changed. The signal doesn't need any implementation in the cpp file, since it doesn't do much more than being emitted, but the getter and setter need to be implemented similar to the following:
fr: La première fonction est « getter », la deuxième « setter » et la troisième un signal étant émis lorsque la propriété a été modifiée. Le signal n'a pas besoin d'implémentation dans le fichier « cpp », puisqu'il ne fait rien de plus que d'être émis. Cependant, les fonctions « getter » et « setter » doivent être implémentés de la manière suivante :
pl: Pierwsza funkcja to pobieracz, druga to ustawiacz, a trzecia to sygnał wysyłany gdy właściwość ulegnie zmianie. Sygnał nie potrzebuje żadnej implementacji w pliku cpp, bo nie robi nic więcej poza byciem wysłanym, lecz pobiercze i ustawiacze muszą być zaimplementowane w sposób podobny do poniższego:

source: To display the text, in `main.qml` add a heading displaying it right under the text property of the `Kirigami.Page` element that is already contained in the template.
fr: Pour afficher le texte, ajoutez dans « main.qml » un titre l'affichant juste sous la propriété de texte de l'élément « Kirigami.Page », déjà contenu dans le modèle.
pl: Aby wyświetlić tekst, dodaj w `main.qml` nagłówek, wyświetlający go zaraz pod właściwością tekstową rzeczy `Kirigami.Page`, która znajduje się już w tym szablonie

source: If you want to know more about the integration between QML and C++, we recommend reading the [official Qt documentation](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html).
fr: Si vous souhaitez en savoir plus sur l'intégration entre QML et C++, nous vous recommandons la lecture de la [documentation officielle de Qt](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html).
pl: Jeśli chcesz dowiedzieć się więcej o integracji pomiędzy QML oraz C++, zlecamy przeczytanie [oficjalnej dokumentacji Qt](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html).
pt: Se quiser saber mais sobre a integração entre o QML e o C++, recomendamos a leitura da [documentação oficial do Qt](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html).

source: Here, we'll be going over the `main.cpp` file we created in the 'Getting Started' page so that we can better understand what is going on in the central C++ file of our application. While this is a basic `main.cpp`, the features we will go over will remain essential no matter what kind of application it is that you decide to create.
fr: Nous allons examiner, ici, le fichier « main.cpp » que nous avons créé dans la page « Pour commencer », afin de mieux comprendre ce qui se passe dans le fichier C++, au centre de notre application. Bien qu'il s'agisse d'un « main.cpp » standard, les fonctionnalités que nous allons aborder resteront essentielles quel que soit le type d'application que vous décidez de créer.
pl: Tutaj, przejdziemy przez plik `main.cpp`, który utworzyliśmy na stronie 'Pierwszych korków' tak, abyśmy mogli lepiej zrozumieć, co się dzieje w głównym pliku C++ naszej aplikacji. Mimo, że jest to podstawowy `main.cpp`, to zawarte w nim rzeczy są istotne, niezależnie od rodzaju aplikacji, którą postanowisz stworzyć.

source: First we must include a number of Qt header files, allowing us to use their functions. In this case, we include a number of Qt headers that handle application logic, reading QML files, and accessing files defined in `resources.qrc`.
fr: Tout d'abord, nous devons inclure un certain nombre de fichiers d'en-tête Qt, nous permettant d'utiliser leurs fonctions. Dans ce cas, nous incluons un certain nombre d'en-têtes Qt gérant la logique de l'application, la lecture des fichiers QML et l'accès aux fichiers définis dans « resources.qrc ».
pl: Najpierw musimy dołączyć kilka plików nagłówkowych Qt, co umożliwi nam użycie zawartych w nich funkcji. W tym przypadku, dołączamy kilka nagłówków Qt, które obsługują logikę aplikacji, odczytywanie plików QML oraz dostęp do plików określonych w `resources.qrc`.

source: Enter our main function. Its first line `QGuiApplication::setAttribute(Qt::AA_EnableHighDpiScaling);` enables High DPI scaling. This lets our application scale properly across devices with different display pixel densities.
fr: Regardons notre fonction principale. Sa première ligne « QGuiApplication::setAttribute(Qt::AA_EnableHighDpiScaling) ; » permet d'activer la mise à l'échelle en haute résolution. Cela indique à notre application de se mettre à l'échelle correctement sur des appareils ayant des affichages avec différentes densités de pixels.
pl: Wejdź do swojej głównej funkcji. Jej pierwszy wiersz `QGuiApplication::setAttribute(Qt::AA_EnableHighDpiScaling);` włącza skalowanie do wysokiego DPI. Umożliwia to twoim aplikacjom poprawne przeskalowanie się na urządzeniach o różnej gęstości pikseli.

source: We then create a [`QApplication`](https://doc.qt.io/qt-5/qapplication.html#QApplication) instance which we call `app`. We pass `argc` and `argv` to the constructor here, letting Qt parse and use arguments meant to affect Qt.
fr: Nous créons ensuite une instance de [ « QApplication »](https://doc.qt.io/qt-5/qapplication.html#QApplication) que nous appelons « app ». Nous passons les paramètres « argc » et « argv » au constructeur ici, laissant Qt analyser et utiliser les arguments destinés à l'affecter.
pl: Następnie tworzymy wystąpienie [`QApplication`](https://doc.qt.io/qt-5/qapplication.html#QApplication), które nazwiemy `app`. Przekazujemy tutaj `argc` oraz `argv` do konstruktora, pozwalając Qt przetworzyć i użyć argumentów, które mają wpływ na Qt.

source: We also set some metadata relating to the application. These include the organisation that created the application, the organisation's website, and the name of the application. We set these properties in [`QCoreApplication`](https://doc.qt.io/qt-5/qcoreapplication.html), an object which provides the event loop for applications regardless of whether they have a GUI or not (so if we ran our program without the GUI, this metadata would still be set).
fr: Nous définissons également certaines métadonnées relatives à l'application. Celles-ci concernent l'organisation ayant créé l'application, le site Internet de l'organisation et le nom de l'application. le nom de l'application. Nous définissons ces propriétés dans [ « QCoreApplication »](https://doc.qt.io/qt-5/qcoreapplication.html), un objet fournissant la boucle d'évènements pour les applications, qu'elles aient ou non une interface graphique (donc si nous exécutons notre programme sans interface graphique utilisateur, les métadonnées seraient toujours définies).
pl: Ustawiamy także kilka metadanych związanych z aplikacją. Zalicza się do tego organizacja, która stworzyła aplikację, strona sieciowa organizacji oraz nazwa aplikacji. Ustawiamy te właściwości w [`QCoreApplication`](https://doc.qt.io/qt-5/qcoreapplication.html), obiekcie, który zapewnia pętlę wydarzeń dla aplikacji, niezależnie od tego, czy mają interfejs graficzny, czy nie, więc gdybyśmy uruchomili ten program bez niego, to te metadane także zostałyby ustawione.

source: The [`QQmlApplicationEngine`](https://doc.qt.io/qt-5/qqmlapplicationengine.html) lets us load an application from a QML file, which we do in the next line. In `engine.load(QUrl(QStringLiteral("qrc:/main.qml")));` we load our QML from a URL in our `resources.qrc` file.
fr: L'objet [ « QQmlApplicationEngine »](https://doc.qt.io/qt-5/qqmlapplicationengine.html) nous permet de charger une application à partir d'un fichier « QML », ce que nous faisons à la ligne suivante. Avec « engine.load(QUrl(QStringLiteral("qrc:/main.qml"))) ; », nous chargeons notre « QML » à partir d'une URL dans notre fichier « resources.qrc ».
pl: [`QQmlApplicationEngine`](https://doc.qt.io/qt-5/qqmlapplicationengine.html) umożliwia nam wczytanie aplikacji z pliku QML, co robimy w następnym wierszu. W `engine.load(QUrl(QStringLiteral("qrc:/main.qml")));` wczytujemy nasz QML z adresu URL w naszym pliku `resources.qrc`.

source: Next, we check if our engine correctly loaded the QML file by checking that the engine's `rootObjects` list is not empty. We can then run our application with `app.exec()`.
fr: Ensuite, nous vérifions si notre moteur a correctement chargé le fichier QML en vérifiant que la liste « rootObjects » du moteur n'est pas vide. Nous pouvons alors exécuter notre application avec « app.exec() ».
pl: Następnie, sprawdzamy, czy nasz silnik poprawnie wczytał plik QML, sprawdzając czy lista silnika `rootObjects` nie jest pusta. Następnie możemy uruchomić naszą aplikację poprzez `app.exec()`.

source: In our introductory tutorial, we used CMake as the build system for our application, but we only really paid close attention to one of our CMakeLists. Here, we're going to go over how CMakeLists work in a bit more detail.
fr: Dans notre tutoriel d'introduction, nous avons utilisé « CMake » comme système de construction de notre application. Cependant, nous n'avons prêté attention qu'à un seul de nos « CMakeLists ». Ici, nous allons revoir le fonctionnement des « CMakeLists » de manière un peu plus détaillée.
pl: W naszym wprowadzającym samouczku, użyliśmy CMake jako systemu budowania dla naszej aplikacji, lecz uwagę poświęciliśmy tylko jednemu z naszych CMakeLists. Tutaj w szczegółach przejdziemy przez to jak działają CMakeLists.

source: You might remember this CMakeLists file from the first tutorial:
fr: Vous vous souvenez peut-être de ce fichier « CMakeLists » du premier tutoriel :
pl: Możesz pamiętać ten plik CMakeLists z pierwszego samouczka:

source: The first line, `project(helloworld)` defines the name of the project.
fr: La première ligne, « projet(helloworld) » définit le nom du projet.
pl: Pierwszy wiersz, `project(helloworld)` określa nazwę projektu.

source: After that, we are setting the versions of our needed tools. `cmake_minimum_required(VERSION 3.10)` sets the version of CMake we will be calling. We then use `set` to define variables (`KF5_MIN_VERSION` and `QT_MIN_VERSION`) containing the versions of the KDE Frameworks and Qt.
fr: Après cela, nous définissons les versions de nos outils nécessaires. « cmake_minimum_required(VERSION 3.10) » définit la version de « CMake » que nous allons appeler. Nous utilisons ensuite « set » pour définir des variables (« KF5_MIN_VERSION » et « QT_MIN_VERSION ») contenant les versions des environnements de développement de KDE et de Qt.
pl: Po tym, ustawiamy wersje narzędzi, które potrzebujemy. `cmake_minimum_required(VERSION 3.10)` ustawia wersję CMake, którą będziemy wywoływać. Używamy `set` do określania zmiennych (`KF5_MIN_VERSION` oraz `QT_MIN_VERSION`) zawierające wersje Szkieletów KDE oraz Qt.

source: Then we get to a section where we include a number of necessary CMake and KDE settings. You shouldn't worry too much about these lines for now and we won't need to change them in this tutorial.
fr: Ensuite, nous arrivons à une section où nous incluons un certain nombre de paramètres « CMake » et de KDE nécessaires. Vous ne devriez pas trop vous soucier de ces lignes pour l'instant et nous n'aurons pas besoin de les modifier dans ce tutoriel.
pl: Następnie przechodzimy do obszaru, w którym dodajemy kilka wymaganych ustawień CMake oraz KDE. Nie musisz się zbytnio przejmować tymi wierszami teraz i nie będziemy musieli ich zmieniać w tym samouczku.

source: The following section is important, because it specifies which dependencies we'll be bringing in at compile time. Let's look at the first line:
fr: La section suivante est importante, car elle spécifie les dépendances que nous allons introduire au moment de la compilation. Regardons la première ligne :
pl: Następujący obszar jest ważny, bo określa, które zależności wciągniemy podczas budowania programu. Spójrzmy na pierwszy wiersz:

source: `find_package` finds and loads the external component.
fr: « find_package » trouve et charge le composant externe.
pl: `find_package` znajduje i wczytuje zewnętrzne składniki.

source: The first word is the framework (`KF5`).
fr: Le premier mot est l'environnement de développement (« KF5 »).
pl: Pierwszym słowem jest słowo szkieletu (`KF5`).

source: Then we are calling the variable with the versions we set in the second line.
fr: Ensuite, nous appelons la variable avec les versions que nous avons définies dans la deuxième ligne.
pl: Następnie wywołujemy zmienną z wersjami, które ustawiliśmy w drugim wierszu.

source: Each word after `COMPONENTS` refers to a specific component.
fr: Chaque mot après « COMPONENTS » fait référence à un composant spécifique.
pl: Każde słowo po `COMPONENTS` odnosi się do danego składnika.
pt: Cada palavra a seguir ao `COMPONENTS` refere-se a um componente específico.

source: The final line, `add_subdirectory(src)`, points CMake into the 'src' directory.
fr: La dernière ligne, « add_subdirectory(src) », fait pointer « CMake » vers le dossier « src ».
pl: Ostatni wiersz, `add_subdirectory(src)`, wskazuje CMake na katalog 'src'.

source: Since most of the heavy lifting is done by the first file, this one is a lot shorter.
fr: Comme le gros du travail est fait dans le premier fichier, celui-ci est beaucoup plus court.
pl: Ponieważ najwięcej robi pierwszy wiersz, to ten może być krótszy.
pt: Dado que a maior parte do trabalho pesado é feito pelo primeiro ficheiro, este é bastante mais pequeno.

source: `set` is used to set `helloworld_SRCS` to `main.cpp` and `resources.qrc` (if we decide to create additional C++ files we'll need to add them here too)
fr: La propriété « set » est utilisée pour définir « helloworld_SRCS » à « main.cpp » et « resources.qrc » (si nous décidons de créer des fichiers C++ supplémentaires, nous devrons les ajouter ici aussi).
pl: `set` jest używany do ustawienia `helloworld_SRCS` na `main.cpp` oraz`resources.qrc` (jeśli postanowimy stworzyć dodatkowe pliki C++, to także będziemy musieli je tutaj dodać)
