Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Finally, we include in our page a `Controls.Label` that lets us place text on our page. We use `anchors.centerIn: parent` to center our label horizontally and vertically within our parent element. In this case, `Controls.Label`'s parent component is `Kirigami.Page`. The last thing we need to do is set the text: `text: i18n("Hello World!")`.
fr: Enfin, nous incluons dans notre page un objet « Controls.Label » nous permettant d'insérer du texte sur notre page. Nous utilisons la commande « anchors.centerIn : parent » pour centrer notre étiquette horizontalement et verticalement dans notre élément fils. Dans ce cas, l'élément parent de « Controls.Label » est « Kirigami.Page ». La dernière chose à faire pour nous est de définir l'attribut de texte « text : i18n(« Hello World ! ») ».
pl: Na końcu, dodajemy do naszej strony `Controls.Label`, która umożliwia nam umieszczenie tekstu na naszej stronie. Używamy `anchors.centerIn: parent` do wyśrodkowania etykiety w poziomie i pionie wewnątrz naszej nadrzędnej rzeczy. W tym przypadku nadrzędnym składnikiem `Controls.Label` jest `Kirigami.Page`. Ostatnią rzeczą jaką musimy zrobić, to ustawienie tekstu: `text: i18n("Hello World!")`.

source: `main.cpp` handles the 'business logic' of our application. C++ is handy because it is flexible and fast, even if it is more involved than other programming languages.
fr: Le fichier « main.cpp » gère la « logique commerciale » de notre application. Le langage C++ est pratique car il est flexible et rapide, même s'il est plus complexe que d'autres langages de programmation.
pl: `main.cpp` obsługuje 'logikę biznesową' naszej aplikacji. C++ jest użyteczny, bo jest elastyczny i szybki, nawet gdy jest bardziej zawiły niż inne języki programowania.

source: `main.cpp` is also the entrypoint to our application. The two parts of our project, the backend and the user interface, are both set up and started here.
fr: Le fichier « main.cpp » est aussi le point d'entrée de notre application. Les deux parties de notre projet, le moteur et l'interface utilisateur, sont toutes deux configurées et démarrées ici.
pl: `main.cpp` jest także punktem wejściowym twojej aplikacji. Dwie części naszego projektu, silnik oraz interfejs użytkownika są tutaj przygotowywane i uruchamiane.
pt: O `main.cpp` também é o ponto de entrada da nossa aplicação. As duas partes do nosso projecto, a infra-estrutura e a interface de utilizador, são ambas configuradas e iniciadas aqui.

source: For now, we don't need to go into too much detail regarding what our `main.cpp` code does, but its role will grow significantly more important once we decide to add more complex functionality to our application in the future. If you want to get ahead, you can read more about how this `main.cpp` works [in this page](/docs/kirigami/advanced-maincpp/).
fr: Pour l'instant, nous n'avons pas besoin d'entrer dans les détails de ce que fait notre code « main.cpp ». Mais, son rôle deviendra beaucoup plus important lorsque nous déciderons d'ajouter des fonctionnalités plus complexes à notre application dans le futur. Si vous voulez aller plus loin, vous pouvez trouver plus de détails sur le fonctionnement de ce « main.cpp » dans cette [page](/docs/kirigami/advanced-maincpp/).
pl: Na razie nie musimy zagłębiać się w to, co nasz kod `main.cpp` robi, lecz jego rola urośnie znacząco, gdy dodamy bardziej złożone możliwości do naszej aplikacji w przyszłości. Jeśli chcesz więcej o tym jak działa `main.cpp`, to przeczytaj o tym [na tej stronie](/docs/kirigami/advanced-maincpp/).

source: `resources.qrc` contains the list of all QML files as well as other files (like custom icons) that will be included in the binary.
fr: Le fichier « resources.qrc » contient la liste de tous les fichiers QML ainsi que d'autres fichiers (comme les icônes personnalisées) qui seront inclus dans le binaire.
pl: `resources.qrc` zawiera listę wszystkich plików QML, a także inne pliki (takie jak własne ikony) które będą umieszczone w pliku wykonywalnym.

source: Notice the line `<file alias="main.qml">contents/ui/main.qml</file>`. It details which QML files are going to be included in the compilation process. In our case we are only using `main.qml`, but if we were to add more QML files to our code, we'd need to make sure we include it in `resources.qrc` file by adding another line like this one.
fr: Veuillez regarder la ligne « <file alias="main.qml">contents/ui/main.qml</file> ». Elle fournit des détails sur quels fichiers QML vont être inclus dans le processus de compilation. Dans notre cas, nous utilisons seulement « main.qml ». Mais, si nous devions ajouter plus de fichiers QML à notre code, nous devrions nous assurer de les inclure dans le fichier « resources.qrc » en ajoutant une autre ligne comme celle-ci.
pl: Zwróć uwagę na wiersz `<file alias="main.qml">contents/ui/main.qml</file>`. Określa pliki QML, które zostaną dołączone podczas budowania. W naszym przypadku używamy tylko `main.qml`, lecz gdybyśmy chcieli dodać więcej plików QML do naszego kodu, to musielibyśmy załączyć je do pliku `resources.qrc`, dodają kolejne wiersze takie jak ten.
pt: Repare na linha `<file alias="main.qml">contents/ui/main.qml</file>`. A mesma refere quais os ficheiros QML que serão incluídos no processo de compilação. No nosso caso, só iremos usar o `main.qml`, mas se quisermos adicionar mais ficheiros QML ao nosso código, teríamos de confirmar que os mesmos seriam incluídos no ficheiro `resources.qrc`, adicionando outra linha como esta.

source: You can read more about the specifics of how the Qt resource system works [in Qt's docs](https://doc.qt.io/qt-5/resources.html).
fr: Vous pouvez en apprendre plus sur les spécificités du fonctionnement du système de ressources de Qt [dans la documentation de Qt](https://doc.qt.io/qt-5/resources.html).
pl: Więcej o tym jak działa system zasobów Qt możesz przeczytać w [dokumentacji Qt](https://doc.qt.io/qt-5/resources.html).

source: `CMakeLists.txt` files are needed to use KDE's build system of choice, [CMake](https://cmake.org/). The CMakeLists.txt file in our top-level folder is going to specify some of our application's characteristics. It also includes some of the dependencies we need to compile it.
fr: Les fichiers « CMakeLists.txt » sont nécessaires pour utiliser le système de construction de choix de KDE, [CMake](https://cmake.org/). Le fichier « CMakeLists.txt » dans notre dossier de premier niveau va spécifier certaines des caractéristiques de notre application. Il inclut également certaines des dépendances dont nous avons besoin pour la compiler.
pl: `CMakeLists.txt` są potrzebne do używania systemu budowania wybranego przez KDE, [CMake](https://cmake.org/). Plik CMakeLists.txt w naszym głównym katalogu określi pewne szczegóły naszej aplikacji. Zawiera także niektóre z zależności, wymagane do jej zbudowania.

source: The CMakeLists.txt defines how to build your projects. Most of the content here is just to bootstrap your project. You can read a line-by-line, in-depth explanation of what this CMakeLists file does [here](https://develop.kde.org/docs/kirigami/advanced-understanding_cmakelists/).
fr: Le fichier « CMakeLists.txt » définit comment compiler vos projets. La plupart du contenu ici ne sert juste qu'au démarrage de votre projet. Vous pouvez lire ligne par ligne. Une explication approfondie de ce que fait ce fichier « CMakeLists » est donnée [ici](https://develop.kde.org/docs/kirigami/advanced-understanding_cmakelists/).
pl: CMakeLists.txt określa sposób budowania naszego projektu. Większość z treści tutaj jest tylko po to, aby stworzyć zalążek naszego projektu. Możesz przeczytać wiersz po wierszu, nasze szczegółowe wyjaśnienie tego, co robi plik CMakeLists [tutaj](https://develop.kde.org/docs/kirigami/advanced-understanding_cmakelists/).

source: The most important thing to keep in mind is that the Qt and KDE Frameworks dependencies are managed with `find_package`. You will have to modify these lines and include any additional components that you decide to use during the development of your application.
fr: La chose la plus importante à conserver à l'esprit est que les dépendances des environnements de développement de Qt et de KDE sont gérés avec « find_package ». Vous devrez modifier ces lignes et y ajouter toutes les composants supplémentaires que vous avez décidé d'utiliser lors du développement de votre application.
pl: Najważniejsze do zapamiętania jest to, że zależności Qt i Szkieletów KDE są zarządzane przez `find_package`. Będziesz musiał zmienić te wiersze i dołączyć dowolne dodatkowe składniki, których postanowisz użyć podczas tworzenia swojej aplikacji.

source: The final line, `add_subdirectory(src)`, points CMake into the 'src' directory, where our source code is located. Let's delve into the CMakeLists.txt file in there.
fr: La dernière ligne, « add_subdirectory(src) », fait pointer « CMake » vers le dossier « src », où se trouve notre code source. Plongeons dans le fichier « CMakeLists.txt » s'y trouvant.
pl: Ostatni wiersz, `add_subdirectory(src)`, wskazuje CMake na katalog 'src', gdzie znajduje się nasz kod źródłowy. Zagłębmy się tutaj w plik CMakeLists.txt.

source: This one's a lot shorter! Let's go through what it does:
fr: Celui-ci est beaucoup plus court ! Voyons ce qu'il fait :
pl: Ten jest dużo krótszy! Spójrzmy po kolei, co on robi:
pt: Este é um bocado mais curto! Vamos perceber o que faz:

source: `add_executable` creates an executable from the given source files.
fr: « add_executable » crée un exécutable à partir des fichiers sources fournis.
pl: `add_executable` tworzy plik wykonywalny z danych plików źródłowych.

source: `target_link_libraries` links the libraries used in our code to our executable.
fr: « target_link_libraries » effectue la liaison des bibliothèques utilisées dans notre code à notre exécutable.
pl: `target_link_libraries` dowiązuje biblioteki użyte w naszym kodzie do naszego pliku wykonywalnego.

source: Note that these libraries should match the components that we included in our previous CMakeLists.txt file - otherwise these components will not be included and our application won't compile.
fr: Veuillez noter que ces bibliothèques doivent correspondre aux composants que nous avons inclus dans notre fichier « CMakeLists.txt » précédent - autrement ces composants ne seront pas inclus et notre application ne pourra pas se compiler.
pl: Pamiętaj, że te biblioteki powinny odpowiadać składnikom, które dołączyliśmy w naszym poprzednim pliku CMakeLists.txt - w przeciwnym przypadku te składniki nie zostaną dołączone, a nasza aplikacja się nie zbuduje.

source: Compiling and running the application
fr: Compilation et exécution de l'application
pl: Kompilowanie i uruchamianie aplikacji
pt: Compilar e executar a aplicação

source: We are almost at the finish line. The last thing we need to do is build and compile our application. To do that, we need to enter our 'helloworld' folder in our terminal application of choice and run the following command:
fr: Nous sommes presque arrivés à la ligne d'arrivée. La dernière chose que nous devons faire est de construire et compiler notre application. Pour ce faire, nous devons aller dans notre dossier « helloworld » dans l'application d'émulation de terminal de notre choix et exécuter la commande suivante :
pl: Już prawie jesteśmy na mecie. Ostatnią rzeczą jaką musimy zrobić to zbudować naszą aplikację. Aby to zrobić, musimy wpisać katalog 'helloworld' do naszego terminala i wykonać następujące polecenie:

source: And launch it with:
fr: Et lancez le avec :
pl: I uruchom poprzez

source: Voila! Now you will see your very first Kirigami app appear before your very own eyes.
fr: Voilà ! Vous allez maintenant voir apparaître votre toute première application avec Kirigami de vos propres yeux.
pl: Voila! Teraz możesz zobaczyć swoją pierwszą aplikację Kirigami na własne oczy.

source: ![Screenshot of the generated Kirigami application](hello-kworld.png)
fr: ! [Une capture d'écran de l'application générée avec Kirigami](hello-kworld.png)
pl: ![Zrzut ekranu wytworzonej aplikacji Kirigami](hello-kworld.png)
pt: ![Imagem da aplicação do Kirigami gerada](hello-kworld.png)

source: Next time you want to create the files and folders needed, you can use [KAppTemplate](https://apps.kde.org/kapptemplate) or KDevelop to automatically generate a suitable project to start from. They are available from each major distribution's repositories. These applications will also generate files containing [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) metadata and a `.desktop` file that contains information about how the application should be displayed in a linux application launcher.
fr: La prochaine fois que vous voudrez créer les fichiers et les dossiers requis, vous pourrez utiliser [KAppTemplate](https://apps.kde.org/kapptemplate) ou KDevelop pour générer automatiquement un projet approprié pour commencer. Ils sont disponibles dans les dépôts de chaque distribution majeure. Ces applications vont également générer des fichiers contenant des métadonnées [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) et un fichier « .desktop » contenant des informations sur la façon dont l'application doit s'afficher dans un lanceur d'applications sous Linux.
pl: Do tworzenia potrzebnych plików i katalogów, kolejnym razem użyj [KAppTemplate](https://apps.kde.org/kapptemplate) lub KDevelop do samoczynnego utworzenia zalążkowego projektu. Są one dostępne w repozytoriach każdej dużej dystrybucji. Aplikacje te utworzą pliki, zawierające metadane [AppStream](https://www.freedesktop.org/software/appstream/docs/sect-Metadata-Application.html) oraz plik `.desktop`, który zwiera szczegóły o tym jak wyświetlać aplikację w uruchamiaczu programów na Linuksie.

source: Thanks to the magic of CMakeLists, you can also use IDEs such as KDevelop or QtCreator to develop this application within a comfortable environment with minimal effort.
fr: Grâce à la magie de « CMakeLists », vous pouvez également utiliser des environnements de développement intégré tels que KDevelop ou QtCreator pour développer cette application dans un environnement confortable avec un un effort minimal.
pl: Dzięki magii CMakeLists, może użyć programów IDE takich jak KDevelop lub QtCreator do rozwoju tej aplikacji wewnątrz wygodnego środowiska z niewielkim wysiłkiem.

source: Using Kirigami Gallery
fr: Utilisation de la galerie de Kirigami
pl: Używanie Galerii Kirigami
pt: Usar a Galeria do Kirigami

source: Using Kirigami Gallery to find code patterns
fr: Utilisation de la galerie de Kirigami pour trouver des briques de codes.
pl: Używanie Galerii Kirigami do znajdywania wzorców kodu
pt: Usar a Galeria do Kirigami para encontrar padrões de código

source: [Kirigami Gallery](https://invent.kde.org/sdk/kirigami-gallery/) is a helpful friend when developing a Kirigami application. It is an application which uses the features of Kirigami, provides links to the source code, tips on how to use the components as well as links to the corresponding HIG pages.
fr: La [galerie de Kirigami](https://invent.kde.org/sdk/kirigami-gallery/) est une amie utile lors du développement d'une application avec Kirigami. Il s'agit d'une application utilisant les fonctionnalités de Kirigami, fournissant des liens vers le code source, proposant des conseils sur l'utilisation des composants ainsi que des liens vers les pages « HIG » correspondantes.
pl: [Galeria Kirigami](https://invent.kde.org/sdk/kirigami-gallery/) jest pomocnym przyjacielem podczas rozwoju aplikacji Kirigami. Jest to aplikacja, która używa cech Kirigami, daje wgląd w kod źródłowy, wskazówki w temacie używania składników, a także odnośniki do odpowiednich stron HIG.

source: Before continuing please install Kirigami Gallery. It should already be in the repository of your Linux distribution.
fr: Avant de continuer, veuillez installer la galerie de Kirigami. Elle devrait déjà être dans le dépôt de votre distribution Linux.
pl: Zanim przejdziesz dalej, wgraj Galerię Kirigami. Powinna ona już być w repozytorium twojej dystrybucji Linuksa.
pt: Antes de prosseguir, instale por favor a Galeria do Kirigami. Já deverá existir no repositório da sua distribuição de Linux.

source: Find a card grid
fr: Trouver une grille de cartes
pl: Znajdź siatkę kart

source: Navigating through the Kirigami Gallery application, we will stumble upon the "Grid view of cards" gallery component. This is a good candidate for example to display a grid of contact cards.
fr: En naviguant dans l'application de galerie de Kirigami, nous rencontrerons le composant de galerie « Affichage en grille de cartes ». C'est un bon candidat par exemple pour afficher une grille de cartes de contacts.
pl: Przeglądając aplikację Galerii Kirigami, natrafimy na jej składnik o nazwie "Karty w widoku siatki". Jest to dobry kandydat na przykład do wyświetlenia siatki kart kontaktów.

source: ![List of kirigami gallery components](components.png)
fr: ![Liste des composants de la galerie de Kirigami](components.png)
pl: ![Lista składników galerii Kirigami](components.png)

source: After selecting the "Grid view of cards" gallery component, we will click to the bottom action and we will get some useful information about the Card and Abstract Card types.
fr: Après avoir sélectionné le composant de la galerie « Vue en grille des cartes », nous cliquerons sur l'action inférieure et nous obtiendrons des informations utiles sur les types de cartes et de cartes abstraites.
pl: Po wybraniu składnika galerii "Karty w widoku siatki", naciskamy na dolnym działaniu, poprzez co uzyskujemy przydatne dane o Karcie oraz Abstrakcyjnej Karcie.

source: ![Kirigami gallery grid view](cards.png)
fr: ! [Affichage en grille de la galerie de Kirigami](cards.png)
pl: ![Widok siatki Galerii Kirigami](cards.png)

source: In this information dialog we will also find a link to the source code of the Cards Grid View. Let's navigate to this page.
fr: Dans cette boîte de dialogue d'informations, nous trouverons également un lien vers le code source de l'affichage en grille des cartes. Naviguons vers cette page.
pl: W tym oknie informacyjnym znajduje się także odnośnik do kodu źródłowego widoku siatki kart. Przejdźmy do tej strony.

source: Implement the card grid
fr: Implémenter une grille de cartes
pl: Zaimplementuj siatkę kart

source: We will reuse most of the code found in the Cards Grid View Gallery [source code page](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/CardsGridViewGallery.qml). In particular, we will remove the extra parts of the OverlaySheet (which is the implementation of the Kirigami Gallery that helped us reach the kirigami-gallery source code repository).
fr: Nous allons réutiliser la plupart du code trouvé dans la [page de code source](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/CardsGridViewGallery.qml) de l'affichage en grille des cartes. En particulier, nous allons supprimer les parties supplémentaires de l'objet « OverlaySheet » (qui est l'implémentation de la galerie de Kirigami nous ayant aidé à atteindre le dépôt de code source de la galerie de Kirigami).
pl: Użyjemy ponownie większości kodu znajdującego się w galerii widoku kart w siatce ze [strony kodu źródłowego ](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/CardsGridViewGallery.qml). W szczególności, usuniemy dodatkowe części OverlaySheet (która znajduje się w implementacji galerii Kirigami, która pomogła nam w dojściu do repozytorium kodu źródłowego kirigami-gallery).

source: So, we are going to substitute the Page component of main.qml of the skeleton app with the below Scrollable Page:
fr: Ainsi, nous allons substituer le composant « Page » de « main.qml » dans le squelette de l'application avec la « Page avec défilement » :
pl: Tak więc, podmienimy składnik strony main.qml aplikacji szkieletowej poniższą stroną przewijaną:

source: What we have done so far is to create a [ScrollablePage](docs:kirigami2;ScrollablePage) and put a [CardsGridView](docs:kirigami2;CardsGridView) into it, since we want to display a grid of Cards generated from a model. The data of each contact is provided by a [ListModel](https://doc.qt.io/qt-5/qml-qtqml-models-listmodel.html) while the card delegate is responsible for the presentation of the data. For more info about models and views in Qt Quick, see [here](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html).
fr: Ce que nous avons fait jusqu'à présent est de créer un objet [ScrollablePage](docs:kirigami2;ScrollablePage) et d'y placer un objet [CardsGridView](docs:kirigami2;CardsGridView), puisque nous voulons afficher une grille de cartes générées à partir d'un modèle. Les données de chaque contact sont fournies par un objet [ListModel](https://doc.qt.io/qt-5/qml-qtqml-models-listmodel.html), tandis que le délégué de carte est responsable de la présentation des données. Pour plus d'informations concernant les modèles et les affichages dans Qt Quick, veuillez consulter la [page suivante](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html).
pl: Dotychczas utworzyliśmy [ScrollablePage](docs:kirigami2;ScrollablePage) i umieściliśmy w niej [CardsGridView](docs:kirigami2;CardsGridView), bo chcemy wyświetlić siatkę kart wytworzoną z modelu. Dane każdego kontaktu są dostarczane przez [ListModel](https://doc.qt.io/qt-5/qml-qtqml-models-listmodel.html) podczas, gdy delegat karty jest odpowiedzialny za dane. Po więcej szczegółów nt. modeli i widoków w Qt Quick, zajrzyj [tutaj](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html).

source: Now let's populate the model that will feed our grid view with data. In [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) definition, just after:
fr: Maintenant, nous allons remplir le modèle qui alimentera notre affichage en grille avec des données. Dans la définition de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), juste après :
pl: Teraz wypełnijmy model, który zasili nasz widok siatki danymi. W definicji [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), zaraz po:

source: add the below:
fr: ajouter la chose suivante :
pl: dodaj poniższe:

source: The model part of our implementation is ready. Let's proceed to defining a delegate that will be responsible for displaying the data. So, we add the following code to the main.qml page, just after the Component.onCompleted definition:
fr: La partie de modèle de notre implémentation est prête. Passons à la définition d'un délégué qui sera responsable de l'affichage des données. Ainsi, nous ajoutons le code suivant à la page « main.qml », juste après la définition de « Component.onCompleted » :
pl: Część modelu naszej implementacji jest gotowa. Przejdźmy do określenia delegatów, które będą odpowiedzialne za wyświetlanie danych. Tak więc, dodajemy następujący kod do strony main.qml, zaraz po określeniu Component.onCompleted:

source: Following the related information on the [api page](docs:kirigami2;Card) we populate a "banner" (although without an image yet), that will act as a header that will display the name of the contact as well as a contact icon.
fr: En suivant les informations relatives de la [page api](docs:kirigami2;Card), nous créons une « bannière » (sans image pour l'instant), qui servira d'en-tête, affichant le nom du contact ainsi qu'une icône de contact.
pl: Podążając za powiązaną informacją na [stronie api](docs:kirigami2;Card) wypełniamy "banner" (jednakże jeszcze bez obrazu), który będzie działać jak nagłówek, który będzie wyświetlać zarówno nazwę jak i ikonę kontaktu.
