Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In Kirigami apps, we use buttons from QtQuick Controls. Using them is pretty straightforward: we set the text to the [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) property and any action we want it to perform is set to the [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked) property.
eo: En Kirigami-programoj, ni uzas butonojn de QtQuick Controls. Uzi ilin estas sufiĉe simpla: ni agordas la tekston al la propreco [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) kaj ajna ago kiun ni volas. ĝi por plenumi estas agordita al la proprieto [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).
nl: In Kirigami toepassingen gebruiken we knoppen uit QtQuick Controls. Deze gebruiken is tamelijk rechtlijnig: we zetten de tekst op de eigenschap [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) en een actie die we het willen laten uitvoeren wordt ingesteld op de eigenschap [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).
pt: Nas aplicações do Kirigami, usamos os botões dos controlos do QtQuick. O uso dos mesmos é bastante simples: configuramos o texto na propriedade [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) e todas as acções que pretendemos que ela faça serão definidas na propriedade [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).
sl: V aplikacijah Kirigami uporabljamo kontrolne gumbe iz QtQuick Controls. Njihova uporaba je precej enostavna: besedilo nastavimo na lastnost [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) in katerokoli dejanje, ki želimo da ga izvede, je nastavljeno na lastnost [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).
sv: I Kirigami-program använder vi knappar från QtQuick Controls. Att använda dem är ganska rättframt: vi ställer in texten i egenskapen [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop) och alla åtgärder vi vill utföra ställs in i egenskapen [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).
uk: У програмах Kirigami ми використовуємо кнопки з QtQuick Controls. Користування кнопками є доволі простим: ми призначаємо фрагмент тексту для властивості [text](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#text-prop), усі дії, які слід виконати вписуємо у властивість [onClicked](docs:qtquickcontrols;QtQuick.Controls.AbstractButton::clicked).

source: A [Kirigami.Dialog](docs:kirigami2;Dialog) is a simple component that you can use to supplement the content being displayed on an application's page. It can display non-interactive content (only text) and interactive content (forms, listviews and buttons).
eo: [Kirigami.Dialog](docs:kirigami2;Dialog) estas simpla komponanto, kiun vi povas uzi por kompletigi la enhavon montratan sur la paĝo de aplikaĵo. Ĝi povas montri ne-interagan enhavon (nur teksto) kaj interagan enhavon (formoj, listvidoj kaj butonoj).
nl: Een [Kirigami.Dialog](docs:kirigami2;Dialog) is een eenvoudige component die gebruikt kan worden om de getoonde inhoud van een pagina van de toepassing aan te vullen. Deze kan niet-interactieve inhoud (alleen tekst) en interactieve inhoud tonen (formulieren, lijstweergaven en knoppen).
sv: En [Kirigami.Dialog](docs:kirigami2;Dialog) är en enkelt komponent som du kan använda för att komplettera innehåll som visas på en programsida. Den kan visa icke-interaktivt innehåll (bara text) och interaktivt innehåll (formulär, listvyer och knappar).
uk: [Kirigami.Dialog](docs:kirigami2;Dialog) є простим компонентом, яким ви можете скористатися для надання даних, які буде показано на сторінці програми. Він може показувати неінтерактивні дані (лише текст) та інтерактивні дані (форми, списки з вибором та кнопки).

source: A standard Kirigami.Dialog is used to create custom dialogs. They are very easy to extend:
eo: Norma Kirigami.Dialog estas uzata por krei proprajn dialogojn. Ili estas tre facile etendeblaj:
es: Un Kirigami.Dialog estándar se usa para crear diálogos personalizados. Son muy fáciles de extender:
nl: Een standaard Kirigami.Dialog wordt gebruikt om aangepaste dialogen aan te maken. Ze zijn erg gemakkelijk uit te breiden:
sl: Standardni Kirigami.Dialog se uporablja za ustvarjanje pogovornih oken po meri. Zelo enostavno jih je razširiti:
sv: En vanlig Kirigami.Dialog används för att skapa egna dialogrutor. De är mycket lätta att utöka:
uk: Стандартний Kirigami.Dialog використовують для створення нетипових діалогових вікон. Такі вікна дуже просто розширити:

source: In most cases however you will likely want to use one of its derived dialog types, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) or [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).
eo: Plejofte vi tamen verŝajne volos uzi unu el ĝiaj derivitaj dialogtipoj, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) aŭ [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).
es: No obstante, en la mayoría de casos tal vez quiera usar uno de los tipos de diálogo derivados, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) o [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).
nl: In de meeste gevallen echter wilt u waarschijnlijk een van zijn afgeleide dialoogtypen gebruiken, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) of [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).
sv: I de flesta fall vill man dock troligen använda en av de härledda dialogtyperna, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) eller [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).
uk: Втім, у більшості випадків вам, ймовірно, варто скористатися одним із похідних типів діалогових вікон, [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) або [Kirigami.MenuDialog](docs:kirigami2;MenuDialog).

source: A [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) is essentially a dialog with a built-in label and default [contentPadding](docs:kirigami2;PromptDialog::contentPadding) that is used to prompt the user for some information. This type of dialog is supposed to be used only for simple yes/no prompts or brief requests for user input.
eo: [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) estas esence dialogo kun enkonstruita etikedo kaj defaŭlta [contentPadding](docs:kirigami2;PromptDialog::contentPadding) kiu estas uzata por peti la uzanton por iuj informoj. Ĉi tiu tipo de dialogo supozeble estas uzata nur por simplaj jes/neaj invitoj aŭ mallongaj petoj por uzanta enigo.
nl: Een [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) is eigenlijk een dialoogvenster met een ingebouwde label en standaard [contentPadding](docs:kirigami2;PromptDialog::contentPadding) dat wordt gebruikt om de aandacht van de gebruiker te vragen voor wat informatie. Dit type dialoogvenster wordt geacht alleen gebruikt te worden voor eenvoudige ja/nee vragen of korte vragen aan de gebruiker voor een antwoord.
sv: En [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) är i huvudsak en dialogruta med en inbyggd beteckning och normal [contentPadding](docs:kirigami2;PromptDialog::contentPadding) som används för att fråga användaren om viss information. Den här typen av dialogruta är tänkt att endast användas för enkla ja/nej-uppmaningar eller korta frågor om användarinmatning.
uk: [Kirigami.PromptDialog](docs:kirigami2;PromptDialog) на базовому рівні є діалоговим вікном із вбудованою міткою та типовим [contentPadding](docs:kirigami2;PromptDialog::contentPadding), який використовують для надсилання користувачеві запиту щодо певної інформації. Вважається, що цей тип діалогових вікон використовується лише для простих запитів із відповіддю «так» чи «ні» або для коротких запитів із введенням тексту користувачем.

source: Its main property is [Kirigami.Dialog.subtitle](docs:kirigami2;PromptDialog::subtitle), to which you would add text. If any QML component is added as a child of the prompt dialog, that component will take the place of the subtitle instead, and this can be explicitly specified with [Kirigami.Dialog.mainItem](docs:kirigami2;Dialog::mainItem).
eo: Ĝia ĉefa propreco estas [Kirigami.Dialog.subtitle](docs:kirigami2;PromptDialog::subtitle), al kiu vi aldonus tekston. Se iu QML-komponento estas aldonita kiel infano de la prompta dialogo, tiu komponanto anstataŭe anstataŭos la subtitolon, kaj ĉi tio povas esti eksplicite specifita per [Kirigami.Dialog.mainItem](docs:kirigami2;Dialog::mainItem).
nl: De belangrijkste eigenschap daarvan is [Kirigami.Dialog.subtitle](docs:kirigami2;PromptDialog::subtitle), waaraan tekst toegevoegd kan worden. Als een QML component als kind van het promptdialoog is toegevoegd, dan zal dit component de plaats van de subtitel innemen, die expliciet kan worden opgegeven met [Kirigami.Dialog.mainItem](docs:kirigami2;Dialog::mainItem).
sv: Dess huvudsakliga egenskap är [Kirigami.Dialog.subtitle](docs:kirigami2;PromptDialog::subtitle), som man lägger till text med. Om någon QML-komponent läggs till som underordnad till dialogrutan, ersätter den komponenten istället undertexten, och det kan uttryckligen anges med [Kirigami.Dialog.mainItem](docs:kirigami2;Dialog::mainItem).
uk: Його головною властивістю є [Kirigami.Dialog.subtitle](docs:kirigami2;PromptDialog::subtitle). До неї ви маєте додати текст. Якщо як дочірній елемент діалогового вікна запиту буде додано будь-який компонент QML, цей компонент займе місце підзаголовка, і це можна явно вказати за допомогою [Kirigami.Dialog.mainItem](docs:kirigami2;Dialog::mainItem).

source: MenuDialog
eo: MenuDialogo
sv: Menydialogruta

source: The [Kirigami.MenuDialog](docs:kirigami2;MenuDialog) is a specialized dialog that is used to list a selection of clickable options for the user using its [actions](docs:kirigami2;MenuDialog::actions) property.
eo: La [Kirigami.MenuDialogo](docs:kirigami2;MenuDialogo) estas faka dialogo, kiu estas uzata por listigi elekton de klakeblaj opcioj por la uzanto uzante ĝian [actions](docs:kirigami2;MenuDialogo::agoj) proprecon.
nl: De [Kirigami.MenuDialog](docs:kirigami2;MenuDialog) is een gespecialiseerde dialoog die gebruikt wordt om lijst met selecties van aan te klikken opties voor de gebruiker die zijn eigenschappen van [acties](docs:kirigami2;MenuDialog::actions) gebruikt.
sv: [Kirigami.MenuDialog](docs:kirigami2;MenuDialog) är en specialiserad dialogruta som används för att lista ett urval av klickbara alternativ för användaren med hjälp av egenskapen [actions](docs:kirigami2;MenuDialog::actions).
uk: [Kirigami.MenuDialog](docs:kirigami2;MenuDialog) — спеціалізоване діалогове вікно, яке використовують для показу користувачеві списку вибору з придатних до клацання пунктів з використанням властивості [actions](docs:kirigami2;MenuDialog::actions).

source: [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) components are what we use to create such drawers. These are set to the [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) property of the [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) that forms the basis of our Kirigami application.
eo: [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) komponantoj estas tio, kion ni uzas por krei tiajn kestojn. Ĉi tiuj estas agordita al la proprieto [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) de la [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) kiu formas la bazon de nia Kirigami-aplikaĵo.
es: Usamos componentes [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) para crear este tipo de cajones. Para ello, los asignamos a la propiedad [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) de la [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) que constituye la base de nuestra aplicación Kirigami.
nl: Componenten [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) zijn wat we gebruiken om zulke laden te maken. Deze zijn ingesteld op de eigenschap [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) van de [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) die de basis vormt van onze Kirigami toepassing.
pt: Os componentes [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) são o que usamos para criar essas áreas. São configurados na propriedade [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) do [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) que forma a base da nossa aplicação de Kirigami.
sv: [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) komponenter är vad vi använder för att skapa sådana lådor. De ställs in till egenskapen [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) från [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) som utgör basen för vårt Kirigami-program.
uk: Компоненти [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) є тим, чим ми користуємося для створення таких висувних панелей. Назви цих панелей записують до властивості [globalDrawer](docs:kirigami2;AbstractApplicationWindow::globalDrawer) [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), яка складає основу нашої програми Kirigami.

source: The [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) property takes names for system-wide icons according to the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application which comes with [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
eo: La propreco [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) prenas nomojn por tutsistemaj piktogramoj laŭ la specifo de FreeDesktop. Ĉi tiuj piktogramoj kaj piktogramnomoj povas esti viditaj per la aplikaĵo CuttleFish de KDE, kiu venas kun [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), aŭ vizitante [la specifo pri piktogramoj de FreeDesktop](https: //specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
nl: De eigenschap [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) neemt namen voor systeembrede pictogrammen volgens de FreeDesktop-specificatie. Deze pictogrammen en pictogramnamen kunnen bekeken worden met de toepassing CuttleFish van KDE, die meekomt met [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) of door [Specificatie van pictogrambenaming van FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pt: A propriedade [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) recebe nomes dos ícones conhecidos do sistema, de acordo com a especificação do FreeDesktop. Estes ícones e nomes de ícones poderão ser vistos com a aplicação CuttleFish, que vem com o pacote [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), ou consultando a [especificação de nomes de ícones do FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
sv: Egenskapen [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) använder namn på systemomfattande ikoner enligt FreeDesktop-specifikationen. Ikonerna och ikonnamnen kan visas med KDE:s program CuttleFish som levereras med [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), eller genom att besöka [FreeDesktops specifikation för namngivning av ikoner](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
uk: Властивість [titleIcon](docs:kirigami2;GlobalDrawer::titleIcon) визначає назву загальносистемної піктограми за специфікацією FreeDesktop. Піктограми і назви піктограм можна переглянути за допомогою програми CuttleFish KDE, яка є частиною [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), або відвідавши [сторінку специфікації назв піктограм FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: Your chosen header component can be set with the global drawer's `header` property, and it will replace the global drawer's title. This is useful to add a `Kirigami.SearchField`, for example:
eo: Via elektita kaplinia komponanto povas esti agordita per la `header' de la ĉiea tirkesto, kaj ĝi anstataŭigos la titolon de la ĉiea tirkesto. Ĉi tio estas utila por aldoni `Kirigami.SearchField`, ekzemple:
es: Puede definir el componente de cabecera de su elección en la propiedad `header` del cajón global, con lo que sustituirá el título del cajón global. Esto resulta útil para añadir un `Kirigami.SearchField`. Por ejemplo:
nl: Uw gekozen opschriftcomponent kan ingesteld worden met de globale eigenschap van de schuiflade `header` en zal vervangen worden door de titel van de globale schuiflade. Dit is nuttig om een `Kirigami.SearchField` toe te voegen, bijvoorbeeld:.
sl: Vašo izbrano komponento glave lahko nastavite z lastnostjo `header` globalnega predala in nadomestila bo naslov globalnega predala. To je koristno za dodajanje `Kirigami.SearchField`, na primer:
sv: Din valda sidhuvudkomponent kan anges med den globala lådans egenskap `header`, och den ersätter den globala lådans titel. Det är användbart för att lägga till `Kirigami.SearchField`, till exempel:
uk: Вибраний вами компонент шапки можна встановити за допомогою властивості `header` загальної панелі. Він замінить собою заголовок загальної висувної панелі. Це корисно, наприклад, для додавання `Kirigami.SearchField`:

source: Thankfully, Kirigami global drawers provide an [isMenu](docs:kirigami2;GlobalDrawer::isMenu) property. When set to `true`, they turn into more traditional menus only on the desktop.
eo: Feliĉe, Kirigami ĉieaj tirkestoj disponigas [isMenu](docs:kirigami2;GlobalDrawer::isMenu) proprecon. Kiam ili agordas al "veraj", ili iĝas pli tradiciaj menuoj nur sur la labortablo.
nl: Gelukkig leveren Kirigami globale schuifladen een eigenschap [isMenu](docs:kirigami2;GlobalDrawer::isMenu). Wanneer ze op `true` zijn gezet, veranderen ze alleen op het bureaublad in meer traditionele menu's.
pt: Felizmente, as áreas globais do Kirigami oferecem uma propriedade [isMenu](docs:kirigami2;GlobalDrawer::isMenu). Quando for configurada como `true`, as nossas áreas globais transformam-se em menus mais tradicionais no computador.
sv: Som tur är tillhandahåller Kirigami globala lådor egenskapen [isMenu](docs:kirigami2;GlobalDrawer::isMenu). När den är inställd till `true`, förvandlas vår globala låda till mer traditionella menyer på skrivbordsdatorer.
uk: На щастя, у загальних панелей Kirigami є властивість [isMenu](docs:kirigami2;GlobalDrawer::isMenu). Якщо для неї встановлено значення `true`, наші загальні панелі перетворюються у традиційніші меню лише на робочих станціях.

source: While a [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) displays global actions available throughout your application, a [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) should be used to display actions that are only relevant in certain contexts. This is usually used in separate [pages](/docs/getting-started/kirigami/introduction-pages).
eo: Dum [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) montras ĉieajn agojn disponeblajn tra via aplikaĵo, [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) devus esti uzata por montri agojn kiuj estas nur gravaj en certaj kuntekstoj. Ĉi tio estas kutime uzata en apartaj [paĝoj](/docs/getting-started/kirigami/introduction-pages).
nl: Terwijl een [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) globale acties toont beschikbaar in geheel uw toepassing, zou een [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) gebruikt moeten worden om acties te tonen die alleen relevant zijn in een bepaalde context. Dit wordt gewoonlijk gebruikt in gescheiden [pagina's](/docs/getting-started/kirigami/introduction-pages).
pt: Enquanto um [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) mostra as acções globais disponíveis por toda a sua aplicação, um [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) deverá ser usado para mostrar as acções que só são relevantes em determinados contextos. Este é normalmente usado em [páginas](/docs/getting-started/kirigami/introduction-pages) separadas.
sv: Medan en [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) visar globala åtgärder tillgängliga överallt i programmet, ska en [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) användas för att visa åtgärder som bara är relevanta i vissa sammanhang. Det används oftast på separata [sidor](/docs/getting-started/kirigami/introduction-pages).
uk: [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) показує загальні кнопки дій, які доступні у вашій програмі, а [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) слід користуватися для показу дій, які стосуються лише певних контекстів. Ним, зазвичай, користуються на окремих [сторінках](/docs/getting-started/kirigami/introduction-pages).

source: A context drawer will only show up if any [contextualActions](docs:kirigami2;Page::contextualActions) have been created as part of the [Page.actions group](docs:kirigami2;Page::actions). It also behaves differently depending on whether it is being used on a mobile platform or on a desktop.
eo: Kunteksta tirkesto aperos nur se iuj [kuntekstaj Agoj](docs:kirigami2;Paĝo::kuntextualaj Agoj) estis kreitaj kiel parto de la [Paĝo.agoj-grupo](docs:kirigami2;Paĝo::agoj). Ĝi ankaŭ kondutas alimaniere laŭ ĉu ĝi estas uzata sur movebla platformo aŭ sur labortablo.
nl: Een contextschuiflade zal alleen verschijnen als een [contextualActions](docs:kirigami2;Page::contextualActions) is aangemaakt als onderdeel van de [Page.actions groep](docs:kirigami2;Page::actions). Het gedraagt verschillend afhankelijk van of het wordt gebruikt op een mobielplatform of op een bureaublad.
pt: Uma área de contexto só irá aparecer se tiver criado alguma variável [contextualActions](docs:kirigami2;Page::contextualActions) como parte do [grupo Page.actions](docs:kirigami2;Page::actions). Também se comporta de forma diferente, dependendo se é usado num dispositivo móvel ou num computador.
sv: En sammanhangslåda dyker bara upp om några [contextualActions](docs:kirigami2;Page::contextualActions) har skapats som en del av [Page.actions group](docs:kirigami2;Page::actions). Den beter sig också annorlunda beroende på om den används på en mobilplattform eller en skrivbordsdator.
uk: Контекстну висувну панель буде показано, якщо було створено якусь [contextualActions](docs:kirigami2;Page::contextualActions), як частину [групи Page.actions](docs:kirigami2;Page::actions). Вона також поводиться по-різному, залежно від того, є платформа мобільною чи стільничною.
