Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: For our required name field, all we need to do is to check whether the field text is an empty string. For the date field, because it has an input mask, we need to use [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop) instead, which only becomes true once the whole field is filled and contains only acceptable characters.
ca: Per al nostre camp de nom requerit, tot el que hem de fer és comprovar si el text del camp és una cadena buida. Per al camp de data, com que té una màscara d'entrada, cal utilitzar [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop) en el seu lloc, el qual només serà cert una vegada que tot el camp s'ompli i només contingui caràcters acceptables.
eo: Por nia postulata nomkampo, ĉio, kion ni devas fari, estas kontroli ĉu la kampoteksto estas malplena ĉeno. Por la data kampo, ĉar ĝi havas enigmaskon, ni devas uzi [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop) anstataŭe, kiu nur fariĝas vera post kiam la tuta kampo estas plenigita kaj enhavas nur akcepteblajn signojn.
nl: Voor ons vereiste nameField, is alles wat we moeten doen is controleren of de veldtekst een lege tekst is. Voor het dateField, omdat het een inputMask heeft, moeten we in plaats daarvan [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop) gebruiken, wat alleen 1 wordt als het hele veld is ingevuld is en alleen acceptable karakters bevat.
sl: Za naše zahtevano polje z imenom moramo le preveriti, ali je besedilo polja prazen niz. Ker ima polje z datumom vnosno masko, moramo namesto tega uporabiti [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop), kar samo postane true, ko je celotno polje izpolnjeno in vsebuje samo sprejemljive znake.
sv: För vårt obligatoriska namnfält är allt vi behöver göra att kontrollera om fälttexten är en tom sträng. För datumfältet, eftersom det har en inmatningsmask, behöver vi istället använda [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop), vilket endast är sant när hela fältet är ifyllt och endast innehåller acceptabla tecken.
uk: Для нашого обов'язкового поля name нам достатньо перевірити, чи є текстом поля порожній рядок. Для поля date, оскільки для нього визначено маску введення, замість цього, нам слід скористатися [acceptableInput](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#acceptableInput-prop), значенням якого стане true, щойно усе поле буде заповнено, і у ньому міститимуться лише прийнятні символи.

source: Then, the [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) method of our `kountdownModel` list model adds a JavaScript object including the properties we have provided.
ca: Llavors, el mètode [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) del nostre model de llista `kountdownModel` afegeix un objecte JavaScript incloent-hi les propietats que hem proporcionat.
eo: Tiam, la [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) metodo de nia lista modelo `kountdownModel` aldonas JavaScript-objekton inkluzive de la proprecoj, kiujn ni disponigis.
nl: Daarna, de methode [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) van ons lijstmodel `kountdownModel` voegt een JavaScript object toe inclusief de eigenschappen die we hebben geleverd.
sl: Nato metoda [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) našega modela seznama `kountdownModel` doda objekt JavaScript, ki vključuje lastnosti, ki smo jih zagotovili.
sv: Sedan lägger metoden [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) i vår listmodell `kountdownModel` till ett Javascript-objekt som inkluderar egenskaperna vi har tillhandahållit.
uk: Далі, метод [append()](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) нашої моделі списку `kountdownModel` додає об'єкт JavaScript, включно із наданими нами властивостями.

source: Lastly, we make sure to clear the text fields by setting their [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) properties to an empty string, then [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close) it.
ca: Per a acabar, ens assegurem, de netejar els camps de text definint les propietats del seu [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) a una cadena buida, després fem un [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close).
eo: Finfine, ni certigas forigi la tekstajn kampojn agordante iliajn [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) ecojn al malplena ĉeno, tiam [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close) ĝi.
nl: Tenslotte verzekeren we ons ervan om de tekstvelden te wissen door hun [teksteigenschappen](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) op een lege tekenreeks in te stellen, daarna [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close) sluit het.
sl: Na koncu poskrbimo, da počistimo besedilna polja tako, da nastavimo njihove lastnosti [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) na prazen niz, nato ga zapremo s [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close).
sv: Till sist, säkerställer vi att textfälten är tomma genom att ställa in deras egenskap [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) till en tom sträng, och sedan stänga den med [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close).
uk: Нарешті, ми спорожняємо текстові поля встановленням для їхніх властивостей [text](https://doc.qt.io/qt-6/qml-qtquick-textinput.html#text-prop) значення порожнього рядка, а потім виконуємо [close()](docs:qtquickcontrols;QtQuick.Controls.Popup::close).

source: Once we save our files and build our program, we'll be able to add our own custom countdowns! We can make one last touch to improve the interface, namely remove the dummy countdown we had in the previous lessons:
ca: Un cop desem els fitxers i construïm el programa, podrem afegir els nostres propis comptes enrere personalitzats! Podem fer un últim toc per a millorar la interfície, és a dir, eliminar el compte enrere fictici que teníem a les lliçons anteriors:
eo: Post kiam ni konservos niajn dosierojn kaj konstruos nian programon, ni povos aldoni niajn proprajn proprajn retronombradojn! Ni povas fari la lastan tuŝon por plibonigi la interfacon, nome forigi la falsan retronombradon, kiun ni havis en la antaŭaj lecionoj:
nl: Nadat we onze bestanden hebben opgeslagen en ons programma hebben gebouwd, kunnen we onze eigen aftelling toevoegen! We kunnen een laatste wijziging aanbrengen om de interface te verbeteren, namelijk de dummy aftelling verwijderen die we in de vorige lessen hadden:
sl: Ko shranimo svoje datoteke in zgradimo svoj program, bomo lahko dodali lastna odštevanja po meri! Za izboljšanje vmesnika lahko naredimo še zadnji dotik, in sicer odstranimo navidezno odštevanje, ki smo ga imeli v prejšnjih lekcijah:
sv: När vi har sparat våra filer och byggt vårt program kommer vi att kunna lägga till våra egna anpassade nedräkningar! Vi kan göra en sista touch för att förbättra gränssnittet, nämligen ta bort exempelnedräkningen vi hade i de tidigare lektionerna:
uk: Після зберігання наших файлів і збирання нашої програми ми зможемо додати наші власні зворотні відліки! Ми можемо додати останній штрих для удосконалення інтерфейсу, а саме вилучити фіктивний зворотний відлік, який ми мали у попередніх уроках:

source: Secondly now that we have an actual date to play around with, we can calculate the time until said date:
ca: En segon lloc, ara que tenim una data real amb la qual jugar, podem calcular el temps fins a aquesta data:
nl: Ten tweede nu we een actuele datum hebben om mee te spelen, kunnen we de tijd tot de vermelde datum berekenen:
sl: Drugič, zdaj, ko imamo dejanski datum, s katerim se lahko igramo, lahko izračunamo čas do omenjenega datuma:
sv: För det andra, nu när vi har ett verkligt datum att leka med, kan vi beräkna tiden fram till datumet:
uk: По-друге, тепер, коли у нас є справжня дата, ми можемо обчислити час до цієї дати:

source: And thirdly increase the window size so that we have more room for our new cards:
ca: I en tercer lloc, augmentar la mida de la finestra perquè tinguem més espai per a les targetes noves:
nl: En ten derde verhoog de venstergrootte zodat we meer ruimte hebben voor onze nieuwe kaarten:
sl: In tretjič, povečamo velikost okna, da bomo imeli več prostora za naše nove kartice:
sv: Och för det tredje öka fönsterstorleken så att vi har mer plats för våra nya kort:
uk: І по-третє, збільшуємо розмір вікна, щоб у нас було місце для наших нових карток:

source: Much nicer.
ca: Molt millor.
eo: Multe pli bela.
es: Mucho mejor.
nl: Veel beter
sl: Veliko lepše.
sv: Mycket trevligare.
uk: Набагато краще.

source: ![Screenshot of the application with four example cards](addedKountdowns.webp)
ca: ![Captura de pantalla de l'aplicació amb quatre targetes d'exemple](addedKountdowns.webp)
eo: ![Ekrankopio de la aplikaĵo kun kvar ekzemplokartoj](aldonitaKountdowns.webp)
es: ![Captura de pantalla de la aplicación con cuatro cards de ejemplo](addedKountdowns.webp)
nl: ![Schermafdruk van de toepassing met vier voorbeeldkaarten](addedKountdowns.webp)
pt: ![Imagem da aplicação com quatro cartões de exemplo](addedKountdowns.webp)
sl: ![Posnetek zaslona aplikacije s primerom štirih kartic](addedKountdowns.webp)
sv: ![Skärmbild av programmet med fyra exempelkort](addedKountdowns.webp)
uk: ![Знімок вікна програми з чотирма картками-прикладами](addedKountdowns.webp)

source: Layouts, ListViews, and Cards
ca: Disposicions (Layout), vistes de llista (ListView) i targetes (Card)
eo: Aranĝoj, ListViews kaj Kartoj
es: Layouts, ListViews y Cards
fr: Dispositions, vues en liste et cartes
nl: Indelingen, Lijstweergaven en Kaarten
pl: Układy, widoki list oraz karty
pt: Layouts, ListViews e Cards
sl: Postavitve, seznam pogledov in kartice
sv: Layouter, listvyer och kort
uk: Компонування, панелі списків і картки

source: Figuring out the different ways of placing things on a page
ca: Descobrint les formes diferents de col·locar les coses en una pàgina
eo: Eltrovi la malsamajn manierojn meti aferojn sur paĝon
es: Entender los diferentes modos de situar cosas en una página
fr: Comprendre les différentes façons de placer les éléments sur une page
nl: Uitvogelen van de verschillende manieren van plaatsen van dingen op een pagina
pl: Poznawanie różnych sposobów na umieszczanie rzeczy na stronie
pt: Descobrir as diferentes formas de colocar as coisas numa página
sl: Ugotavljanje različnih načinov postavitve stvari na stran
sv: Räkna ut de olika sätten att placera saker på en sida
uk: Розбираємося із різними способами розташовування елементів на сторінці

source: Laying out your content
ca: Dissenyar el contingut
eo: Disponi vian enhavon
es: Organización del contenido
fr: Mise en page de votre contenu
nl: Uw inhoud indelen
pl: Układanie twojej treści
pt: Dispor o seu conteúdo
sl: Postavitev vsebine
sv: Placera ut ditt innehåll
uk: Компонування ваших даних

source: Now that we understand how pages work, it is time to add stuff to them. We will be going through a number of important layout components and elements that will be useful when designing our app.
ca: Ara que entenem com funcionen les pàgines, és hora d'afegir-hi coses. Repassarem una sèrie de components i elements de disposició importants que seran útils en dissenyar la nostra aplicació.
eo: Nun kiam ni komprenas kiel funkcias paĝoj, estas tempo aldoni aĵojn al ili. Ni ekzamenos kelkajn gravajn aranĝajn komponantojn kaj elementojn, kiuj estos utilaj dum desegnado de nia apo.
nl: Nu we begrijpen hoe pagina's werken, is het tijd om zaken eraan toe te voegen. We zullen door een aantal belangrijke indelingscomponenten en elementen lopen die nuttig zullen zijn bij het ontwerpen van onze toepassing.
sl: Zdaj, ko razumemo, kako strani delujejo, je čas, da jim dodamo stvari. Preučili bomo številne pomembne komponente in elemente postavitve, ki bodo uporabni pri oblikovanju naše aplikacije.
sv: Nu när vi förstår hur sidor fungerar, är det dags att lägga till saker på dem. Vi går igenom ett antal viktiga layoutkomponenter och element som är användbara när vi konstruerar vårt program.
uk: Тепер, коли ми вже розуміємо, як працюють сторінки, час додати можливості до них. Ми розглянемо декілька важливих компонентів та елементів компонування, які будуть корисними при створенні дизайну нашої програми.

source: By the end of this section you'll have a neat-looking app.
ca: Al final d'aquesta secció tindreu una aplicació d'aspecte polit.
eo: Ĝis la fino de ĉi tiu sekcio vi havos aspektantan aplikaĵon.
nl: Aan het eind van deze sectie zal u een goed uitziend programma hebben.
sl: Na koncu tega razdelka boste imeli lično aplikacijo.
sv: I slutet av det här avsnittet har du ett snyggt program.
uk: Наприкінці цього розділу ви матимете програму, яка виглядатиме лаконічно.

source: ListViews
ca: Vistes de llista (ListView)
fr: Vues en liste
nl: Lijstweergaven
sl: Seznam pogledov
sv: Listvyer
uk: ListView

source: If you've ever used [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/), or Plasma's System Settings, you will have come across a [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Quite simply, it lets you display data on a list.
ca: Si heu emprat alguna vegada el [Discover](https://apps.kde.org/discover/), el [NeoChat](https://apps.kde.org/neochat/) o l'Arranjament del sistema del Plasma, us haureu trobat amb una [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). En poques paraules, les vistes de llista permeten mostrar les dades en una llista.
eo: Se vi iam uzis [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/), aŭ la Sistemajn Agordojn de Plasma, vi havos trovi [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Tute simple, ĝi ebligas al vi montri datumojn en listo.
nl: Als u ooit [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/) of Systeeminstellingen van Plasma hebt gebruikt, bent u langs een [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) gekomen. Heel eenvoudig, het laat u gegevens in een lijst tonen.
pt: Se já tiver usado o [Discover](https://apps.kde.org/discover/), o [NeoChat](https://apps.kde.org/neochat/) ou a Configuração do Sistema do Plasma, já terá passado por uma [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). De uma forma muito simples, as ListViews permitem-lhe mostrar os dados numa lista.
sl: Če ste kdaj uporabljali [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/), ali sistemske nastavitve Plasme, ste naleteli na seznam pogledov [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Preprosto, seznam pogledov vam dovoli prikaz podatkov v seznamu.
sv: Om du någonsin har använt [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/) eller Plasmas systeminställningar, har du stött på en [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Den låter dig helt enkelt visa data i en lista.
uk: Якщо ви колись користувалися [Discover](https://apps.kde.org/discover/), [NeoChat](https://apps.kde.org/neochat/) або Системними параметрами Плазми, ви вже бачили [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Доволі прості, ListView надають вам змогу показувати дані у форматі списку.

source: That seems cryptic, but don't worry. Let's start from the beginning.
ca: Això sembla críptic, però no us preocupeu. Comencem des del principi.
eo: Tio ŝajnas kripta, sed ne maltrankviliĝu. Ni komencu de la komenco.
es: Eso parece críptico, pero no se preocupe. Empecemos por el principio.
nl: Dat lijkt cryptisch, maar geen getob. Laten we vanaf het begin beginnen.
pt: Isto parece complicado, mas não se preocupe. Vamos começar pelo topo.
sl: To se zdi skrivnostno, ampak ne skrbite. Začnimo na začetku.
sv: Det verkar kryptiskt, men oroa dig inte. Låt oss börja från början.
uk: Це може здатися якимось шифром, але не переймайтеся. Розпочнімо з початку.

source: We add this component inside our [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) from the last tutorial.
ca: Ara afegirem aquest component dins del nostre [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) de la darrera guia d'aprenentatge.

source: We're using [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView), which is a [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) that allows us to easily display cards in a list. However, ListViews are made to show data taken from a model - to automatically populate itself from a set of data that we point it to. That's where the [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop) property comes in: in this example, it's pointing to `kountdownModel`.
ca: Estem emprant la [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView), que és una [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) que ens permet mostrar targetes en una llista amb facilitat. No obstant això, les ListViews estan fetes per a mostrar les dades preses a partir d'un model, per a emplenar-se automàticament a partir d'un conjunt de dades a les quals apuntem. Aquí és on entra la propietat [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop): en aquest exemple, apunta a `kountdownModel`.

source: Each ListElement is an element on the list, containing information
ca: Cada ListElement és un element en la llista que conté informació
eo: Ĉiu ListElement estas elemento en la listo, enhavante informojn
es: Cada ListElement es un elemento de la lista que contiene información
fr: Chaque « ListElement » est un élément de la liste, contenant des informations.
nl: Elk ListElement is een element in de lijst, die informatie bevat
pl: Każdy ListElement jest rzeczą na liście, która zawiera pewne dane
pt: Cada ListElement é um elemento na lista, contendo informações
sl: Vsak element seznama je element na seznamu, ki vsebuje informacije
sv: Varje ListElement är ett element i listan, och innehåller information
uk: Кожне з ListElement є елементом списку, що містить дані

source: We add our `kountdownModel` inside the [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow) from the last tutorial.
ca: Afegirem el `kountdownModel` dins de la [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow) de la darrera guia d'aprenentatge.

source: A model defines the way that a data entry is structured. Our `kountdownModel` will consist of only one element for now. By looking at our [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) above, we can see how the data of our `kountdownModel` are structured: it contains a name, a description, and a date. This isn't set in stone, and you may have different sorts of data in your model. The first two are just strings, and the third is a number we're using as a placeholder.
ca: Un model defineix la manera en què s'estructura una entrada de dades. Per ara, el nostre `kountdownModel` només consistirà d'un element. Si mirem el nostre [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) anterior, veurem com s'estructuren els elements del `kountdownModel`: conté un nom, una descripció i una data. Això no és immutable, i podeu tenir diversos tipus de dades en el vostre model. Els dos primers són cadenes i el tercer és un número que utilitzem com a marcador de posició.
eo: Modelo difinas la manieron kiel dateneniro estas strukturita. Nia `countdownModel` konsistos el nur unu elemento nuntempe. Rigardante nian [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) supre, ni povas vidi kiel la datumoj de nia `kountdownModel` estas strukturitaj: ĝi enhavas nomo, priskribo kaj dato. Ĉi tio ne estas fiksita, kaj vi eble havas malsamajn specojn de datumoj en via modelo. La unuaj du estas nur ĉenoj, kaj la tria estas nombro, kiun ni uzas kiel anstataŭilon.
nl: Een model definieert de manier waarop invoer van gegevens zijn gestructureerd. Ons `kountdownModel` zal, voor nu, bestaan uit slechts één element. Door naar ons bovenstaande [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) te kijken kunnen we zien hoe gegevens van het `kountdownModel` zijn gestructureerd: ze bevatten een naam, een beschrijving en een datum. Dit is niet in beton gegoten en u kunt verschillende soorten gegevens in uw model hebben. De eerste twee zijn gewoon tekenreeksen en de derde is een getal dat we als plaatshouder gebruiken.
pt: Um modelo define a forma como se estrutura um elemento de dados. O nosso `kountdownModel` irá consistir apenas num elemento para já. Ao olhar para o nosso [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) acima, podemos ver como são estruturados os elementos do 'kountdownModel': contêm um nome, uma descrição e uma data. Isto não está 'escrito na pedra', e poderá ter vários tipos de dados no seu modelo. Os dois primeiros são textos simples, enquanto o terceiro é um número que será usado como substituição.
sl: Model določa način strukturiranja vnosa podatkov. Naš `kountdownModel` bo za zdaj sestavljen samo iz enega elementa. Z ogledom našega [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) zgoraj, vidimo, kako so strukturirani podatki naše modela `kountdownModel`: vsebuje ime, opis in datum. To ni vklesano v kamen in vi imate lahko v vašem modelu različne vrste podatkov. Prva dva sta samo niza, tretja pa število, ki jo uporabljamo kot držalo prostora.
sv: En modell definierar sättet som en datapost är strukturerad. Vår `kountdownModel` består för tillfället bara av ett element. Genom att titta på vårt [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) ovan, kan vi se hur data i vår `kountdownModel` är strukturerade: de innehåller ett namn, en beskrivning och ett datum. Det är inte hugget i sten, och du kan ha olika typer av data i din modell. De två första är bara strängar, och den tredje är ett tal som vi använder som platsmarkering.
uk: Модель визначає спосіб, у який структуровано запис даних. Зараз наша `kountdownModel` складається лише з одного елемента. Структурування дані у нашій `kountdownModel` можна бачити у нашому [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html): вони містять назву, опис і дату. Це не жорстка структура, і у вашій моделі можуть бути інші типи даних. Перші два елементи є лише рядками, а третій є числом, яким ми користуємося як замінником.
