Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In the `CMakeLists.txt` file in our top-level folder, be sure to have `CoreAddons` in your [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) call. It is needed for [KAboutData](docs:kcoreaddons;KAboutData).
ca: Al fitxer `CMakeLists.txt` de la nostra carpeta de nivell superior, assegureu-vos de tenir `CoreAddons` a la crida [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). És necessari per a [KAboutData](docs:kcoreaddons;KAboutData).
eo: En la dosiero `CMakeLists.txt` en nia plej alta dosierujo, nepre havi `CoreAddons` en via [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) voki. Ĝi estas bezonata por [KAboutData](docs:kcoreaddons;KAboutData).
es: En el archivo `CMakeLists.txt` de nuestra carpeta principal, nos aseguramos de tener `CoreAddons` en la llamada a [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). Es necesario para [KAboutData](docs:kcoreaddons;KAboutData).
nl: In het bestand `CMakeLists.txt` in onze hoofdmap, gaan we na dat `CoreAddons` in uw aanroep [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) aanwezig is. Het is nodig voor [KAboutData](docs:kcoreaddons;KAboutData).
pt: No ficheiro `CMakeLists.txt` da nossa pasta de topo, certifique-se que tem o `CoreAddons` na nossa chamada [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). É necessária por causa do [KAboutData](docs:kcoreaddons;KAboutData).
sl: V datoteki `CMakeLists.txt` v mapi najvišjega nivoja, preverite da imate `CoreAddons` v vašem klicu [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). Je potreben za [KAboutData](docs:kcoreaddons;KAboutData).
sv: I filen `CMakeLists.txt` i vår toppkatalog, se till att ha "CoreAddons" i anropet till [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). Det behövs för [KAboutData](docs:kcoreaddons;KAboutData).
uk: У файлі `CMakeLists.txt` у найвищій теці проєкту додайте `CoreAddons` до виклику [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). Цей пакунок потрібен для [KAboutData](docs:kcoreaddons;KAboutData).

source: In the `CMakeLists.txt` file in the `src/` directory, nothing is needed since we instantiated out `aboutData` in place.
ca: En el fitxer `CMakeLists.txt` en el directori `src/`, no es necessita res, ja que hem instanciat `aboutData` al lloc.
eo: En la dosiero `CMakeLists.txt` en la dosierujo `src/`, nenio necesas, ĉar ni kreis `aboutData` en la loko.
es: En el archivo `CMakeLists.txt` del directorio `src/` no hace falta nada, ya que hemos creado una instancia de `aboutData` en el lugar.
nl: In het bestand `CMakeLists.txt` in de map `src/`, is niets nodig omdat we ter plekken een exemplaar van onze `aboutData` hebben gemaakt.
pt: No ficheiro `CMakeLists.txt` da pasta `src/`, não é necessário nada, dado que instanciámos o `aboutData` no local.
sl: V datoteki `CMakeLists.txt` file v mapi `src/`, ni potrebno ničesar, saj smo postavili `aboutData` na pravo mesto.
sv: I filen `CMakeLists.txt` i katalogen `src/`, behövs ingenting eftersom vi instansierade `aboutData` på plats.
uk: У файлі `CMakeLists.txt` у каталозі `src/` дописувати нічого не потрібно, оскільки ми створюємо екземпляр з `aboutData` на місці.

source: Running the application
ca: Executar l'aplicació
eo: Rulante la aplikaĵon
es: Ejecución de la aplicación
fr: Exécution de l'application
nl: De toepassing uitvoeren
pl: Uruchamianie aplikacji
pt: Executar a aplicação
sl: Zagon aplikacije
sv: Köra programmet
uk: Запуск програми

source: Now if you run your application and trigger the "About" action in the global drawer you should see our about page.
ca: Ara, si executeu la vostra aplicació i activeu l'acció «About» en el calaix global, s'hauria de mostrar la nostra pàgina.
eo: Nun se vi rulas vian aplikaĵon kaj ekigas la agon "Pri" en la ĉiea tirkesto, vi devus vidi nian pri paĝo.
es: Ahora, si ejecuta la aplicación y lanza la acción "Acerca de" del cajón global, debería ver nuestra página «Acerca de».
fr: Maintenant, si vous exécutez votre application et déclenchez l'action « A propos » dans le tiroir global, vous devriez voir notre page « A propos ».
nl: Als u nu uw toepassing uitvoert en de actie "Info over" aanklikt in de globale schuiflade zou u uw pagina Info over moeten zien.
pl: Teraz, gdy uruchomisz aplikację i wyzwolisz działanie "About" w globalnej półce, to powinieneś zobaczyć stronę o programie.
pt: Agora, se executar a sua aplicação e invocar a acção "Acerca" na área global, deverá ver a nossa página 'Acerca'.
sl: Če zaženete aplikacijo in sprožite dejanje »O programu« v globalnem predalu, bi morali videti našo stran o programu.
sv: Om du nu kör programmet och använder alternativet "Om" i den globala lådan, bör du se vår Om-sida.
uk: Тепер, якщо ви запустите програму і скористаєтеся пунктом «About» на загальній висувній панелі, ви побачите нашу сторінку відомостей щодо програми.

source: ![Screenshot of the Kirigami About Page](about-page.png)
ca: ![Captura de pantalla d'una pàgina «Quant al» creada amb el Kirigami](about-page.png)
eo: ![Ekrankopio de la Kirigami Pri Paĝo](about-page.png)
es: ![Captura de pantalla de la página acerca de Kirigami](about-page.png)
fr: ! [Copie d'écran de la page « A propos » de Kirigami](about-page.png)
nl: ![Schermafdruk van de pagina Info over van Kirigami](about-page.png)
pl: ![Zrzut ekranu strony o programie Kirigami](about-page.png)
pt: ![Imagem da página Acerca do Kirigami](about-page.png)
sl: ![Posnetek zaslona strani o programu Kirigami] (o strani.png)
sv: ![Skärmbild av Om-sidan i Kirigami](about-page.png)
uk: ![Знімок сторінки «Про програму» Kirigami](about-page.png)

source: Connect logic to your QML user interface
ca: Connectar la lògica amb la vostra interfície d'usuari en QML
eo: Konektu logikon al via uzantinterfaco de QML
es: Conectar la lógica a la interfaz de usuario QML
fr: Connecter une logique à votre interface utilisateur QML
nl: Verbindingslogica naar uw QML gebruikersinterface
pl: Podłącz logikę do swojego interfejsu użytkownika QML
pt: Ligar a lógica à sua interface de utilizador em QML
sl: Povežite logiko s svojim uporabniškim vmesnikom QML
sv: Anslut logik till ditt QML användargränssnitt
uk: З'єднання логіки з вашим інтерфейсом користувача QML

source: Connect a backend to do calculations and supply your user interface with data to display
ca: Connectant un dorsal per a fer càlculs i proporcionar dades per a mostrar a la vostra interfície d'usuari
eo: Konektu backend por fari kalkulojn kaj provizi vian uzantinterfacon kun datumoj por montri
es: Conectar un motor para realizar cálculos y suministrar los datos a mostrar en la interfaz de usuario
fr: Connectez un moteur pour réaliser des calculs et fournir à votre interface utilisateur les données à afficher.
nl: Een backend verbinden om berekeningen te doen en uw gebruikersinterface te leveren met te tonen gegevens
pl: Podłącz silnik, aby wykonać obliczenia i zasilić twój interfejs użytkownika danymi do wyświetlenia
pt: Ligar uma infra-estrutura que faça cálculos e fornecer a sua interface de utilizador com os dados a apresentar
sl: Povežite zaledje za opravljanje izračunov in oskrbovanje uporabniškega vmesnika s podatki za prikaz
sv: Anslut bakgrundskod för att göra beräkningar och tillhandahålla användargränssnittet med data att visa
uk: З'єднання модуля для виконання обчислень і надання інтерфейсу даних для показу

source: Project structure
ca: Estructura del projecte
eo: Projekta strukturo
es: Estructura del proyecto
fr: Structure du projet
nl: Projectstructuur
pl: Struktura projektu
pt: Estrutura do projecto
sl: Struktura projekta
sv: Projektstruktur
uk: Структура проєкту

source: Now we have connected the class holding the future logic to the application, but it still doesn't do anything. To change that, let's add a property to the class. Properties are a lot more than a simple variable. They can inform the UI about changes so it can update the right areas.
ca: Ara hem connectat la classe que conté la lògica futura amb l'aplicació, però encara no fa res. Per a canviar això, afegirem una propietat a la classe. Les propietats són molt més que una simple variable. Poden informar a la interfície d'usuari sobre els canvis perquè pugui actualitzar les àrees correctes.
eo: Nun ni konektis la klason tenantan la estontan logikon al la aplikaĵo, sed ĝi ankoraŭ nenion faras. Por ŝanĝi tion, ni aldonu proprecon al la klaso. Propraĵoj estas multe pli ol simpla variablo. Ili povas informi la UI pri ŝanĝoj, por ke ĝi povu ĝisdatigi la ĝustajn areojn.
es: Ahora hemos conectado la clase que contiene la futura lógica a la aplicación, pero todavía no hace nada. Para cambiar esto, vamos a añadir una propiedad a la clase. Las propiedades son mucho más que una simple variable. Pueden informar a la interfaz de usuario de los cambios para que pueda actualizar las áreas correctas.
fr: Maintenant, nous avons connecté la classe contenant la future logique de l'application, mais elle ne fait toujours rien. Pour changer cela, ajoutons une propriété à la classe. Les propriétés sont bien plus qu'une simple variable. Elles peuvent informer l'interface utilisateur de tout changement afin qu'elle puisse mettre à jour les bonnes zones.
nl: We hebben nu de klasse die de toekomstige logica bevat van de toepassing, maar het doet nog steeds niets. Om dat te wijzigen, voegen we een eigenschap toe aan de klasse. Eigenschappen zijn heel wat meer dan een eenvoudige variabele. Ze kunnen ed UI informeren over wijzigingen, dus kan het de juiste gebieden bijwerken.
pl: Teraz połączyliśmy klasę przechowującą przyszłą logikę z aplikację, lecz nadal nie robi ona nic. Aby to zmienić, dodajmy właściwość do klasy. Właściwości to coś więcej niż prosta zmienna. Powiadamiają interfejs użytkownika o zmianach tak, aby mógł się uaktualnić w odpowiednich obszarach.
pt: Agora já ligámos a classe que trata da lógica futura com a aplicação, mas ainda não faz nada. Para mudar isso, vamos adicionar uma propriedade à classe. As propriedades são um pouco mais que uma simples variável. Elas conseguem informar a interface sobre alterações, pelo que poderá actualizar as áreas correctas.
sl: Zdaj smo razred, ki drži bodočo logiko, povezali z aplikacijo, a še vedno ne naredi ničesar. Če želite to spremeniti, dodajmo lastnost razredu. Lastnosti so veliko več kot preprosta spremenljivka. Uporabniški vmesnik lahko obvestijo o spremembah, tako da lahko posodobijo prava področja.
sv: Nu har vi anslutit klassen som innehåller den framtida programlogiken, men den gör inte ännu någonting. För att ändra det, låt oss lägga till en egenskap i klassen. Egenskaper är mycket mer än en enkel variabel. De kan informera användargränssnittet om ändringar så att det kan uppdatera riktiga områden.
uk: Тепер клас, який містить майбутню логіку, з'єднано із програмою, але він усе ще не виконує ніяких корисних дій. Щоб змінити це, давайте додамо до класу властивість. Призначення властивостей є набагато ширшим за прості змінні. Вони можуть інформувати інтерфейс користувача щодо змін, щоб той міг оновлювати належні області.

source: This may seem like a lot of code to just read and write some code from the backend. However, a closer look reveals that reading the property from the UI can already run some logic—same when it is written to. In this case, it will automatically inform the frontend and backend of changes.
ca: Això sembla molt codi per a només llegir i escriure codi des del dorsal. Però una mirada més atenta revela que llegir la propietat des de la IU pot executar una lògica, i el mateix quan s'escriu. En aquest cas, informarà automàticament el frontal i el dorsal dels canvis.
eo: Ĉi tio povas ŝajni kiel multe da kodo por simple legi kaj skribi iom da kodo de la malantaŭo. Tamen, pli proksima rigardo rivelas, ke legado de la propreco el la UI jam povas funkcii iun logikon—same kiam ĝi estas skribita al ĝi. En ĉi tiu kazo, ĝi aŭtomate informos la fasadon kaj backend pri ŝanĝoj.
es: Esto puede parecer una gran cantidad de código para solo leer y escribir código desde el motor. Sin embargo, una mirada más cercana revela que leer la propiedad de la interfaz de usuario ya puede ejecutar cierta lógica (lo mismo ocurre cuando se escribe en ella). En este caso, informará automáticamente a la interfaz y al motor de los cambios.
nl: Dit lijkt misschien heel wat code om enige code uit de backend te lezen. Maar een nadere beschouwing laat zien dat lezen van de eigenschap uit de UI al enige logic-same kan uitvoeren wanneer er naar geschreven is. In dat geval zal automatisch de frontend en backend informeren over wijzigingen.
pt: Isto parece bastante para uma simples propriedade que iremos usar para mostrar algum texto da infra-estrutura. Mas uma vista mais aproximada revela que a mesma poderá executar lógica em código, quando a propriedade é lida a partir da interface do utilizador e quando é escrita. A mesma irá informar das alterações a nível da interface e da infra-estrutura.
sl: To se morda zdi veliko kode, samo za to da preberete in napišete nekaj kode iz zaledja. Vendar natančnejši pogled razkriva, da branje lastnosti iz uporabniškega vmesnika že lahko zažene nekaj logike - in enako, kadar je zapisujemo. V tem primeru bo samodejno obvestilo začelje in zaledje o spremembah.
sv: Det verkar som rätt mycket kod för att bara läsa och skriva en del bakgrundskod. Men en närmare titt avslöjar att det redan kan utföra logik när egenskapen läses av användargränssnittet, och även när den skrivs till. I detta fall, informerar den automatiskt både förgrunden och bakgrunden om ändringar.
uk: Здається, забагато коду для простого читання і написання коду модуля обробки, чи не так? Але прискіпливіший погляд показує, що читання властивості з інтерфейсу вже може запускати логіку. Те саме стосується запису. У цьому випадку код автоматично інформує оболонку і модуль обробки про зміни.

source: The reading and writing is based on the concept of [getter and setter functions](https://www.w3schools.com/cpp/cpp_encapsulation.asp). Go ahead and add a new private attribute to your class that holds the data, as well as the relevant getter and setter functions.
ca: La lectura i escriptura es basen en les [funcions capturadora i establidora](https://www.w3schools.com/cpp/cpp_encapsulation.asp). Continueu i afegiu un atribut privat nou a la vostra classe que contingui les dades, així com les funcions capturadora i establidora rellevants.
eo: La legado kaj skribo baziĝas sur la koncepto de [funkcioj de ricevilo kaj agordilo] (https://www.w3schools.com/cpp/cpp_encapsulation.asp). Antaŭeniru kaj aldonu novan privatan atributon al via klaso, kiu enhavas la datumojn, kaj ankaŭ la koncernajn ricevilo- kaj setter-funkciojn.
es: La lectura y la escritura están basadas en los conceptos de las [funciones *getter* y *setter*](https://www.w3schools.com/cpp/cpp_encapsulation.asp). Siga adelante y añada un nuevo atributo privado a la clase para contener los datos, así como las pertinentes funciones *getter* y *setter*.
nl: Het lezen en schrijven is gebaseerd op het concept van [getter en setter-functies](https://www.w3schools.com/cpp/cpp_encapsulation.asp). Ga verder en voeg een nieuw privé attribuut toe aan uw klasse die de gegevens bevat, evenals de relevante getter en setter-functies.
pt: A leitura e modificação são baseadas em [funções 'getter' (leitura) e 'setter' (escrita)](https://www.w3schools.com/cpp/cpp_encapsulation.asp); como tal, adicione um novo atributo privado à sua classe, como este, e adicione as funções de leitura e escrita mencionadas.
sl: Branje in pisanje temeljita na funkcijah [getter in setter](https://www.w3schools.com/cpp/cpp_encapsulation.asp). Nadaljujte in dodajte nov zasebni atribut vašemu razredu, kot je ta, in dodajte funkciji getter in setter.
sv: Läsning och skrivning är baserade på [hämtnings- och tilldelningsfunktioner](https://www.w3schools.com/cpp/cpp_encapsulation.asp), så lägg till en ny privat egenskap i din klass, och lägg till hämtnings- och tilldelningsfunktioner.
uk: Читання і запис засновано на концепції [функцій отримання та встановлення значень](https://www.w3schools.com/cpp/cpp_encapsulation.asp), тому додайте новий закритий (приватний) атрибут, який міститиме дані, до вашого класу у описаний спосіб, а також додайте відповідні функції отримання та встановлення значень.

source: As you can see, when the setter is called, the signal will be emitted, and inform the ui and backend of the change.
ca: Com podeu veure, quan es crida al configurador, s'emetrà el senyal i informarà la interfície d'usuari i al dorsal del canvi.
eo: Kiel vi povas vidi, kiam la setter estas vokita, la signalo estos elsendita, kaj informos la ui kaj backend pri la ŝanĝo.
es: Como puede ver, cuando se llama al *setter*, se emite la señal y se informa a la interfaz de usuario y al motor del cambio.
fr: Comme vous pouvez le voir, lorsque le transmetteur est appelé, le signal sera émis et informera l'interface utilisateur et le moteur de ce changement.
nl: Zoals u kunt zien, wanneer de setter wordt aangeroepen, zal het signaal worden uitgezonden en wordt de ui (gebruikersinterface) en de backend van de wijziging geïnformeerd.
pl: Jak widzisz, gdy setter jest wywoływany, to sygnał zostanie wysłany i powiadomi interfejs oraz silnik o zmianie.
pt: Como poderá ver, quando for invocado o método de alteração, o sinal será emitido e informará a interface e a infra-estrutura da alteração.
sl: Kot vidite, bo ob klicu setterja oddan signal oddan, ki bo obvestil uporabniški vmesnik in zaledje o spremembi.
sv: Som du kan se, när tilldelningsfunktionen anropas, skickas signalen, och informerar användargränssnittet och bakgrundskoden om ändringen.
uk: Як можна бачити, при виклику функції встановлення значення буде видано сигнал, отже про зміну буде проінформовано інтерфейс користувача і модуль обробки.

source: The resulting code in that part of the file should look like this:
ca: El codi resultant en aquesta part del fitxer s'hauria de veure així:
eo: La rezulta kodo en tiu parto de la dosiero devus aspekti jene:
es: El código resultante en esta parte del archivo debería parecerse a esto:
fr: Le code résultant dans cette partie du fichier devrait ressembler à ceci :
nl: De resulterende code in dat gedeelte van het bestand zou er uit moeten zien als dit:
pl: Kod wynikowy w tej części pliku powinien wyglądać następująco:
pt: O código resultante dessa parte do ficheiro deverá ser semelhante ao seguinte:
sl: Nastala koda v tem delu datoteke mora biti videti tako:
sv: Den resulterande koden i den delen av filen ska se ut så här:
uk: Код-результат у тій частині файла має виглядати ось так:

source: Our app so far
ca: La nostra aplicació fins ara
eo: Nia aplikaĵo ĝis nun
es: Nuestra aplicación hasta ahora
fr: Notre application jusqu'à présent
nl: Onze toepassing (app) tot zover
pl: Nasza aplikacja w tej chwili
pt: A nossa aplicação até agora
sl: Naša aplikacija do sedaj
sv: Vårt program så långt
uk: Наша програма на поточний момент

source: Congratulations, you learned:
ca: Felicitacions, heu après:
eo: Gratulon, vi lernis:
es: ¡Enhorabuena! Ha aprendido lo siguiente:
fr: Félicitations, vous êtes formé :
nl: Gefeliciteerd, u hebt geleerd:
pl: Gratulacje, nauczyłeś się:
pt: Parabéns, acabou de aprender:
sl: Čestitamo, naučili ste se:
sv: Gratulerar, du har lärt dig:
uk: Вітаємо, ви навчилися:

source: How to register backend types to QML
ca: Com registrar els tipus de dorsal en QML
eo: Kiel registri backend tipojn al QML
es: Cómo registrar tipos de motores en QML
fr: Comment enregistrer des types de moteurs dans QML
nl: Hoe backend-typen to QML te registreren
pl: Jak zarejestrować rodzaje silnika w QML
pt: Como registar os tipos de infra-estruturas no QML
sl: Kako registrirati vrste zaledij v QML
sv: Hur man registrerar gränssnittstyper i QML
uk: Як реєструвати типи модулів обробки у QML

source: Add new elements to the QML file
ca: Afegir elements nous al fitxer en QML
eo: Aldonu novajn elementojn al la QML-dosiero
es: Añadir nuevos elementos al archivo QML
fr: Ajouter de nouveaux éléments au fichier QML
nl: Nieuwe elementen aan het QML-bestand toevoegen
pl: Dodaj nowe rzeczy do pliku QML
pt: Adicionar novos elementos ao ficheiros QML
sl: Dodati nove elemente v datoteko QML
sv: Att lägga till nya element i QML-filen
uk: Додавати нові елементи до файла QML

source: Create new QObject subclasses
ca: Crear subclasses noves de QObject
eo: Kreu novajn QObject-subklasojn
es: Crear nuevas subclases de QObject
fr: Créer des sous-classes nouvelles de QObject
nl: Nieuwe QObject-subklassen aanmaken
pl: Stwórz nowe podklasy QObject
pt: Criar novas sub-classes de QObject
sl: Ustvariti nove podrazrede QObject
sv: Att skapa nya QObject delklasser
uk: Створювати підкласи QObject

source: How to add properties and what they do
ca: Com afegir propietats i què fan
eo: Kiel aldoni proprietojn kaj kion ili faras
es: Cómo añadir propiedades y lo que hacen
fr: Comment ajouter des propriétés et ce qu'elles font
nl: Hoe eigenschappen toe te voegen en wat ze doen
pl: Jak dodać właściwości i co one robią
pt: Como adicionar propriedades e o que fazem
sl: Kako dodati lastnosti in kaj počnejo
sv: Hur man lägger till egenskaper och vad de gör
uk: Як додавати властивості і для чого вони потрібні

source: What signals are
ca: Quins són els senyals
eo: Kiaj signaloj estas
es: Qué son las señales
fr: Quels signaux sont
nl: Wat signalen zijn
pl: Czym są sygnały
pt: O que são os sinais ('signals')
sl: Kaj so signali
sv: Vad signaler är
uk: Що таке сигнали

source: If you want to know more about the integration between QML and C++, we recommend reading the [official Qt documentation](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
ca: Si voleu saber més sobre la integració entre QML i C++, us recomanem llegir la [documentació oficial de les Qt](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
eo: Se vi volas scii pli pri la integriĝo inter QML kaj C++, ni rekomendas legi la [oficialan Qt-dokumentadon](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
es: Si quiere saber más sobre la integración entre QML y C++, le recomendamos que lea la [documentación oficial de Qt](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
nl: Als u meer wilt weten over de integratie tussen QML en C++, dan bevelen we het lezen van de [officiële Qt documentatie](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) aan.
sl: Če želite vedeti več o integraciji QML in C++, priporočamo branje [uradne dokumentacije Qt](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
sv: Om du vill veta mer om integreringen mellan QML och C++, rekommenderar vi att läsa den [officiella Qt-dokumentationen](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).
uk: Якщо ви хочете дізнатися про інтеграцію між QML і C++, ми рекомендуємо ознайомитися із [офіційною документацією до Qt](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html).

source: Connect C++ models to your QML user interface
ca: Connectar models C++ a la vostra interfície d'usuari en QML
es: Conectar modelos de C++ a la interfaz de usuario QML
sl: Povežite modele C++ z vašim uporabniškim vmesnikom QML

source: Data from the C++ backend to the QML frontend
ca: Dades des del dorsal C++ a un frontal QML
es: Datos del motor C++ a la interfaz de QML
sl: Podatke iz zaledja C++ s čelnim delom QML
