Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![Two pages next to each other on the desktop](desktop.png)
fr: ! [Deux pages, l'une à côté de l'autre sur le bureau](desktop.png)
pl: ![Dwie strony obok siebie na urządzeniu biurkowym](desktop.png)

source: KDE has a handy [Human Interface Guidelines (HIG) page](/hig/introduction/architecture/) that goes into detail about how to best design your application. The guides there will help ensure your application remain usable, consistent, and aesthetic.
fr: KDE possède une page pratique [Recommandations pour interface utilisateur (Human Interface Guidelines /HIG)](/hig/introduction/architecture/) expliquant en détail comment concevoir au mieux votre application. Les guides s'y trouvant vous aideront à ce que votre application reste utilisable, cohérente et esthétique.
pl: KDE zawiera przydatny [Przewodnik po Interfejsach Ludzkich (HIG)](/hig/introduction/architecture/), który w szczegółach wyjaśnia najlepsze projekty twoich aplikacji. Przewodnik ten zapewni, że twoja aplikacja będzie użyteczna, spójna i estetyczna.

source: A Kirigami [Page](docs:kirigami2;Page) also inherits from a [QQC2 Page](https://doc.qt.io/qt-5/qml-qtquick-controls2-page.html) and as such, you can add a number of extra elements to them. The Qt docs are another useful resource to use when designing your pages.
fr: Une [page de Kirigami](docs:kirigami2;Page) hérite également d'un objet [QQC2 Page](https://doc.qt.io/qt-5/qml-qtquick-controls2-page.html). En tant que tel, vous pouvez lui ajouter un certain nombre d'éléments supplémentaires. La documentation de Qt est une autre ressource utile à utiliser lors de la conception de vos pages.
pl: [Page](docs:kirigami2;Page) Kirigami także dziedziczy z [QQC2 Page](https://doc.qt.io/qt-5/qml-qtquick-controls2-page.html) i dzięki temu, możesz dodać kilka dodatkowych rzeczy do niej. Dokumentacja Qt jest kolejnym użytecznym źródłem, podczas tworzenia stron.

source: Let's go back to the `main.qml` file we created in our previous tutorial:
fr: Revenons au fichier « main.qml » que nous avons créé dans notre précédent tutoriel :
pl: Wróćmy do pliku `main.qml`, który stworzyliśmy w naszym poprzednim samouczku:
pt: Voltemos ao ficheiro `main.qml` que criámos no nosso tutorial anterior:

source: We make our application start to our `Kirigami.Page`. All we have included in it is a label containing 'Hello World', but we're going to spruce things up a little.
fr: Nous faisons démarrer notre application sur notre « Kirigami.Page ». Tout ce que nous avons inclus dans cette page est une étiquette contenant « Hello World » mais nous allons améliorer un peu les choses.
pl: Ustawiamy naszą aplikację tak, aby rozpoczynała na naszej stronie `Kirigami.Page`. Znajduje się na niej tylko etykieta, zawierająca tekst 'Hello World', lecz dodamy tam jeszcze trochę.

source: The idea behind our app is that we're going to be able to display a bunch of countdowns to the user. The problem with a normal `Kirigami.Page` is that it has a fixed vertical size, but don't worry: Kirigami also supports scrollable pages. `Kirigami.ScrollablePage` is going to replace our `Kirigami.Page` now.
fr: L'idée derrière notre application est que nous allons être en mesure d'afficher un tas de comptes à rebours à l'utilisateur. Le problème avec une page « Kirigami.Page » normale est qu'elle possède une taille verticale fixe, mais ne vous inquiétez pas : en effet, Kirigami prend aussi en charge les pages avec barres de défilement. La page « Kirigami.ScrollablePage » va maintenant remplacer notre page « Kirigami.Page ».
pl: Zamysłem naszej aplikacji jest wyświetlenie kilku odliczań naszemu użytkownikowi. `Kirigami.Page` przysparza kłopotu, bo ma rozmiar w pionie ustawiony na sztywno, lecz nie martw się: Kirigami obsługuje także przewijane strony. Teraz `Kirigami.ScrollablePage` zastąpi nasze `Kirigami.Page`.

source: If you've gone ahead of the tutorial, you might have noticed that there is also such a thing as a `ScrollView` that you can use to contain your components. However, do NOT put a `ScrollView` inside a `ScrollablePage` as this can cause problems. Children of a `ScrollablePage` are functionally already in a `ScrollView`.
fr: Si vous avez avancé dans le tutoriel, vous avez peut-être remarqué qu'il existe aussi une chose telle qu'un objet « ScrollView » que vous pouvez utiliser pour contenir vos composants. Cependant, ne mettez PAS un objet « ScrollView » à l'intérieur d'un objet « ScrollablePage », car cela peut conduire des difficultés. Les fils d'un objet « ScrollablePage » sont fonctionnellement déjà intégrés dans un objet « ScrollView ».
pl: Jeśli znajdujesz się już dalej w samouczku, to mogłeś zwrócić uwagę na rzecz o nazwie `ScrollView`, której możesz użyć do zawarcia swoich składników. Jednakże NIE umieszczaj `ScrollView` wewnątrz `ScrollablePage`, gdyż powoduje to kłopoty. Rzeczy podrzędne do `ScrollablePage` pod względem możliwości znajdują się już w `ScrollView`.

source: Kirigami pages also feature neat titles placed within the toolbar, quickly indicating to the user which page they are on. All we need to do to set a page title using the `title` property of `Kirigami.ScrollablePage`. In this case, we used one of the `i18nc()` functions we explored in our previous tutorial to this end.
fr: Les pages de Kirigami comportent également des titres soignés placés dans la barre d'outils, indiquant rapidement à l'utilisateur sur quelle page il se trouve. Tout ce dont nous avons à faire est de définir un titre de page en utilisant la propriété « title » de l'objet « Kirigami.ScrollablePage ». Dans ce cas, nous avons utilisé l'une des fonctions « i18nc() » que nous avons explorées dans notre précédent tutoriel pour cet usage.
pl: Strony Kirigami zawierają także ładne tytuły umieszczone wewnątrz pasków narzędzi, szybko wskazując użytkownikowi, na której stronie się znajduje. Jedyne, co musimy zrobić, to ustawić właściwość `title` w `Kirigami.ScrollablePage`. W tym przypadku użyliśmy `i18nc()`, które sprawdziliśmy w poprzednim samouczku.

source: You could also choose to define your page within its own QML document. To do so, you'd create the new QML doc, add it to your `resources.qrc` file, and set `Kirigami.ApplicationWindow`'s first page to it like so:
fr: Vous pouvez également choisir de définir votre page dans son propre document QML. Pour ce faire, vous devez créer le nouveau document QML, l'ajouter à votre fichier « resources.qrc » puis définir la première page de « Kirigami.ApplicationWindow » comme suit :
pl: Możesz także wybrać określenie swojej strony wewnątrz jej własnego dokumentu QML. Aby to zrobić, musisz utworzyć nowy dokument QML, dodać go do swojego pliku `resources.qrc` oraz ustawić pierwszą stronę `Kirigami.ApplicationWindow` na niego w następujący sposób:

source: `pageStack.initialPage` sets the initial Page of the Page stack, and `Qt.resolvedUrl` is converting the relative URL of the QML file into an absolute one.
fr: Le paramètre « pageStack.initialPage » définit la page initiale de la pile de pages et le paramètre « Qt.resolvedUrl » convertit l'URL relative du fichier QML en une URL absolue.
pl: `pageStack.initialPage` ustawia początkową stronę stosu stron, a `Qt.resolvedUrl` przekształca względny adres URL pliku QML w bezwzględny.

source: There is further information about alternative page structures [within our Kirigami documentation]({{< ref "components-pagerow_pagestack.md" >}}).
fr: Vous trouverez de plus amples informations sur les structures de page alternatives [dans notre documentation de Kirigami]({{< ref "components-pagerow_pagestack.md" >}}).

source: Using separate files and signals
fr: Utilisation de fichiers et de signaux séparés
pl: Używanie osobnych plików i sygnałów
pt: Usar ficheiros separados e sinais

source: But why?
fr: Mais pourquoi ?
pl: Ale dlaczego?
pt: Mas porquê?

source: For the first time, we will be separating some of our components into their own QML files. If we keep adding things to `main.qml`, it's going to quickly become hard to tell what does what, and we risk muddying our code.
fr: Pour la première fois, nous allons séparer certains de nos composants dans leurs propres fichiers QML. Si nous continuons à ajouter des choses au fichier « main.qml », il va rapidement devenir difficile de dire ce qui fait quoi et nous risquons de rendre notre code illisible.
pl: Po raz pierwszy, będziemy rozdzielać część naszych składników do ich własnych plików QML. Jeśli kontynuowalibyśmy dodawanie rzeczy do `main.qml`, to szybko trudnym stało by się rozpoznanie co jest odpowiedzialne za co i ryzykowalibyśmy zamulonym kodem.
pt: Pela primeira vez, iremos começar a separar alguns dos nossos componentes nos seus próprios ficheiros QML. Se continuarmos a adicionar tudo ao `main.qml`, irá começar a ficar cada vez mais difícil de saber o que faz cada coisa, e sujeitamo-nos a enlamear o nosso código.

source: First we need to add our new files into our `resources.qrc` which we created in the first part of this tutorial.
fr: D'abord, nous devons ajouter nos nouveaux fichiers dans notre fichier « resources.qrc » que nous avons créé dans la première partie de ce tutoriel.
pl: Najpierw musimy dodać nasze nowe pliki do naszego `resources.qrc`, którego stworzyliśmy w pierwszej części tego samouczka.
pt: Primeiro precisamos de adicionar os nossos novos ficheiros ao ficheiro `resources.qrc` que foi criado na primeira parte deste tutorial.

source: Using our new files
fr: Utilisation de nos nouveaux fichiers
pl: Używanie naszych nowych plików
pt: Usar os nossos novos ficheiros

source: We'll need to find some way of using our new files in `main.qml`. Thankfully, all we need to do is include a declaration of these components in our `main.qml` like this:
fr: Nous devons trouver certains moyens pour utiliser nos nouveaux fichiers dans « main.qml ». Heureusement, tout ce que nous avons à faire est d'inclure une déclaration de ces composants dans notre fichier « main.qml » comme ceci :
pl: Będziemy musieli znaleźć jakiś sposób na użycie naszych nowych plików w `main.qml`. Na szczęście, wystarczy zawrzeć deklarację tych składników w naszym `main.qml` w następujący sposób:
pt: Teremos de arranjar alguma forma de usar os nossos novos ficheiros no `main.qml`. Felizmente, tudo o que precisamos de fazer é incluir uma declaração destes componentes no nosso `main.qml`, da seguinte forma:

source: Extending our add sheet into an add/edit sheet
fr: Extension de notre feuille d'ajout en une feuille d'ajout / modification
pl: Rozszerzanie naszego arkusza z dodawaniem na arkusz z dodawaniem/edytowaniem
pt: Estender a nossa folha de adição para uma folha de adição/edição

source: While in the last tutorial we made our countdown-adding button do something, the edit button on our countdown cards is still inactive. We also created an adding sheet that we could now repurpose to also serve as an edit sheet... but before we get to that, we need to add a couple of extra things to our `main.qml`.
fr: Alors que dans le dernier tutoriel, nous avons fait en sorte que notre bouton d'ajout de compte à rebours fasse quelque chose, le bouton d'édition de nos cartes de compte à rebours est toujours inactif. Nous avons également créé une feuille d'ajout que nous pouvons maintenant utiliser aussi comme feuille d'édition... Mais avant cela, nous devons ajouter quelques éléments supplémentaires à notre fichier « main.qml ».
pl: W ostatnim samouczku nadaliśmy naszemu przyciskowi dodawania odliczań jakieś działanie, a przycisk edytowania nadal go nie ma. Dodaliśmy także arkusz dodawania, który może nam teraz posłużyć jako arkusz edytowania... lecz zanim dojdziemy do tego, musimy dodać kilka dodatkowych rzeczy do naszego`main.qml`.
pt: Embora no último tutorial tenhamos feito com que o nosso botão de criação de contagens fizesse algo, o botão de edição continua inactivo. Também criámos uma folha de criação que poderemos agora reaproveitar para uma folha de edição... mas antes de o fazermos, precisamos de adicionar algumas coisas extra ao nosso `main.qml`.

source: The key changes we have made involve the addition of our component definition `AddEditSheet` (and `KountdownDelegate` further down) and a new function called `openPopulateSheet`.
fr: Les principaux changements que nous avons effectués concernent l'ajout de la définition de notre composant « AddEditSheet » (et « KountdownDelegate » plus bas) et d'une nouvelle fonction appelée « openPopulateSheet ».
pl: Zmiany klawiszy, których dokonaliśmy, uwzględniają dodanie określenia naszego składnika `AddEditSheet` (oraz dalej `KountdownDelegate`) oraz nowej funkcji o nazwie `openPopulateSheet`.

source: Lets go through our `AddEditSheet` definition:
fr: Passons en revue notre définition de « AddEditSheet » :
pl: Prześledźmy definicję `AddEditSheet`:
pt: Vejamos a definição do nosso `AddEditSheet`:

source: `onAdded` and `onEdited` are signal handlers. Just like `onTriggered` is called when we click an action, we can also use handlers that respond to our custom signals. Looking at our new `AddEditSheet.qml` -- our repurposed adding sheet -- we can see how these signals work:
fr: Les objets « onAdded » et « onEdited » sont des gestionnaires de signaux. De la même manière que l'objet « onTriggered » est appelé lorsque nous cliquons sur une action. Nous pouvons également utiliser des gestionnaires répondant à nos signaux personnalisés. En regardant notre nouvelle feuille « AddEditSheet.qml » -- notre feuille d'ajout -- nous pouvons voir comment ces signaux fonctionnent :
pl: `onAdded` oraz `onEdited` są obsługującymi sygnały. Tak jak w przypadku `onTriggered`, które jest wywoływane po naciśnięciu działania, możemy używać metod obsługujących, które odpowiadają na nasze własne sygnały. Patrząc an nasze nowe `AddEditSheet.qml` -- nasz przystosowany arkusz dodawania -- możemy zobaczyć sposób działania sygnałów:

source: Signals invoke their handlers when they are called. In this case, we have created two signals that we can invoke with different outcomes, and to which we can attach information about the countdown we are adding or creating. A neat thing about signals is that they expose the variables defined in them to the functions that are listening to them, which is why we can just call those variable names in our `onEdited` and `onAdded` handlers in `main.qml`. Our signals are invoked by the 'Done' button depending on what the `mode` property, defined at the top of our AddEditSheet, is set to.
fr: Les signaux invoquent leurs gestionnaires lorsqu'ils sont appelés. Dans ce cas, nous avons créé deux signaux que nous pouvons invoquer avec des résultats différents, et auxquels nous pouvons attacher des informations sur le compte à rebours ajouté ou créé. Une des particularités des signaux est qu'ils exposent les variables qui y sont définies aux fonctions qui les écoutent. C'est pourquoi nous pouvons simplement appeler ces noms de variables dans nos gestionnaires « onEdited » et « onAdded » dans « main.qml ». Nos signaux sont invoqués par le bouton « Done » en fonction de la valeur de la propriété « mode », définie en haut de notre « AddEditSheet ».
pl: Sygnały wywołują swoje metody obsługujące, gdy zostaną wywołana. W tym przypadku utworzyliśmy dwa sygnały, które możemy wywołać z dwoma różnymi wynikami, i do których możemy dołączyć szczegóły o odliczaniu, które dodajemy lub tworzymy. Przydatną własnością sygnałów jest to, że udostępniają one zmienne w nich określone do funkcji, które ich słuchają i to dlatego odwołujemy się do nich po nazwach w metodach `onEdited` oraz `onAdded` w `main.qml`. Nasze sygnały są wywoływane przez przycisk 'Gotowe' w zależności od ustawionej własności `mode`, na górze naszego AddEditSheet.

source: The `mode` property also controls several other things: mainly what the title of our sheet is set to, and what text is to be included in our textfields. However, by default, our `mode` property is just set to add...
fr: La propriété « mode » contrôle également plusieurs autres choses : principalement le titre de notre feuille et le texte devant être inclus dans nos champs de texte. Cependant, par défaut, notre propriété « mode » est juste définie pour ajouter...
pl: Właściwość `mode` steruje także kilkoma innymi rzeczami: głównie tym na jaki tytuł jest ustawiony nasz arkusz i jaki tekst będą zawierały nasze pola tekstowe. Jednakże, domyślnie, nasza właściwość `mode` jest ustawiona tylko na dodawanie ...
pt: A propriedade `mode` também controla várias outras coisas: principalmente, qual o título que a nossa folha tem, qual o texto a incluir nos nossos campos de texto. Contudo, por omissão, a nossa propriedade `mode` está apenas configurada para `add` (adição)...

source: Which brings us back to `main.qml` and our new `openPopulateSheet` function. You might have noticed that this is what is called now when the countdown-adding action is triggered. This function takes in several arguments which have been provided with defaults. This is helpful when we simply want to add a new countdown, because we can have the concise function call `openPopulateSheet("add")`. More importantly, this function sets all the relevant properties in AddEditSheet.
fr: Ce qui nous ramène à « main.qml » et à notre nouvelle fonction « openPopulateSheet ». Vous avez peut-être remarqué que c'est ce qui est appelé maintenant quand l'action de décompte et d'ajout est déclenchée. Cette fonction prend en compte plusieurs arguments fournis avec des valeurs par défaut. Ceci est utile lorsque nous voulons simplement ajouter un nouveau compteur à rebours, parce que nous pouvons utiliser l'appel à la fonction concise « openPopulateSheet(« add ») ». Plus important encore, cette fonction définit toutes propriétés pertinentes dans « AddEditSheet ».
pl: Co sprowadza nas do `main.qml` i naszej nowej funkcji `openPopulateSheet`. Mogłeś już zauważyć, że to jest tym, co jest wykonywane, gdy wyzwalane jest działanie dodające odliczanie. Ta funkcja przyjmuje kilka argumentów, które są wypełniane wartościami domyślnymi. Jest to użyteczne, gdy po prostu chcemy dodać nowe odliczanie, bo możemy krótko wywołać funkcję poprzez `openPopulateSheet("add")`. Co ważne, funkcja ta ustawia wszystkie odpowiednie własności w AddEditSheet.

source: `mode` changes the add/edit sheet depending on whether this argument is set to `"add"` or to `"edit"`
fr: Le paramètre « mode » modifie la feuille d'ajout / modification selon que cet argument est défini comme « add » ou « edit ».
pl: `mode` zmienia dodaj/edytuj arkusz w zależności od tego, czy argument ten jest ustawiony na `"add"` czy `"edit"`
pt: O `mode` muda a folha de adição/edição, dependendo se este argumento está configurado como `"add"` ou como `"edit"`

source: `index` argument is needed so that when we save our edited countdown, the correct one is modified
fr: L'argument « index » est nécessaire pour que lorsque nous enregistrions notre compte à rebours modifié, le bon compte à rebours est modifié.
pl: Argument `index` jest potrzebny, że gdy zapiszemy nasze zmienione odliczanie, to żeby odpowiednie odliczanie zostało zmienione w programie

source: `listName`, `listDesc`, and `listDate` are the relevant countdown details that need to be put in the sheet's fields
fr: Les objets « listName », « listDesc » et « listDate » sont les détails pertinents du compte à rebours, devant être placés dans les champs de la feuille.
pl: `listName`, `listDesc`, oraz `listDate` są odpowiednimi szczegółami odliczeń, które należy umieścić w polach arkusza
pt: O `listName`, `listDesc` e `listDate` são os detalhes relevantes da contagem que precisam de ser colocados nos campos da folha

source: Of course, to actually use our sheet for anything besides adding countdowns first we need to make the edit button on our cards work. But if you look at our `Kirigami.CardsListView` in `main.qml`...
fr: Bien sûr, pour utiliser actuellement notre feuille à d'autres fins que l'ajout de comptes à rebours, nous devons d'abord faire fonctionner le bouton de modification de nos cartes. Mais si vous regardez notre objet « Kirigami.CardsListView » dans « main.qml »...
pl: Oczywiście, aby używać naszych arkuszy do czegokolwiek innego poza dodawaniem odliczań, to musimy najpierw sprawić, że przecisk edytowania na naszej karcie zacznie działać. Lecz jeśli spojrzysz na nasze `Kirigami.CardsListView` w `main.qml`...

source: We've replaced our `Kirigami.AbstractCard` with a delegate component definition from `KountdownDelegate.qml`.
fr: Nous avons remplacé notre objet « Kirigami.AbstractCard » par une définition de composant délégué à partir de « KountdownDelegate.qml ».
pl: Zastąpiliśmy nasze `Kirigami.AbstractCard` delegatem definicji składnika z `KountdownDelegate.qml`.

source: The `onClicked` property of the 'Edit' button on our cards now calls the `openPopulateSheet` function, with the card's fetched list element properties set as the arguments for this function. With these, the sheet can be populated with the correct text.
fr: La propriété « onClicked » du bouton « Edit » de nos cartes appelle maintenant la fonction « openPopulateSheet »avec les propriétés des éléments trouvés dans la liste pour les cartes, utilisées comme arguments de cette fonction. Avec celles-ci, la feuille peut être remplie avec le texte correct.
pl: Właściwość `onClicked` przycisku 'Edit' na naszych kartach wywołuje teraz funkcję `openPopulateSheet`, z właściwościami listy kart jako argumentami do tej funkcji. Dzięki nim, arkusz może być wypełniony poprawnym tekstem.

source: With that, we have a fully-functional sheet where we can add and edit our countdowns!
fr: Avec cela, nous avons une feuille entièrement fonctionnelle où nous pouvons ajouter et modifier nos comptes à rebours !
pl: Dzięki temu, mamy w pełni funkcjonalny arkusz, do którego możemy dodawać i edytować nasze odliczania!
pt: Com isto, já temos uma folha totalmente funciona onde poderemos adicionar e editar as nossas contagens decrescentes!

source: Colors and Themes in Kirigami
fr: Couleurs et thèmes dans Kirigami
pl: Barwy i tryby barw w Kirigami

source: Kirigami has a color palette that follow the system colors, to better integrate on the platform it is running on (i.e. Plasma Desktop, Plasma Mobile, GNOME, Android, etc.).
fr: Kirigami possède une palette de couleurs suivant les couleurs du système, pour mieux mieux s'intégrer à la plate-forme sur laquelle il fonctionne (c'est-à-dire Plasma Desktop, Plasma Mobile, GNOME, Android, etc.).
pl: Kirigami ma paletę barw, która przestrzega barw systemowych, aby lepiej wtopić się na platformie, na której zostało uruchomione (tj. Pulpit Plazmy, Przenośna Plazma, GNOME, Android, itp.).

source: All of Kirigami's QML components and all the Qt Quick Controls 2 QML components will already follow this palette by default, so usually no custom coloring should be needed at all for those controls.
fr: Tous les composants QML de Kirigami et tous les composants QML de Qt Quick Controls 2 suivent déjà cette palette par défaut. Ainsi, généralement, aucune couleur personnalisée ne sera nécessaire pour ces contrôles.
pl: Wszystkie składniki QML oraz Qt Quick Controls 2 QML będą już domyślnie przestrzegać tej palety, więc zazwyczaj nie będzie potrzeby stosowania własnych barw dla tych rzeczy obsługujących.

source: Primitive components such as `Rectangle` should always be colored with the color palette provided by Kirigami via the [`Theme`](docs:kirigami2;Kirigami::PlatformTheme) attached property.
fr: Les composants primaires tels que « Rectangle » devraient toujours être colorés avec la palette de couleurs fournie par Kirigami grâce à la propriété associée [ « Theme » ](docs:kirigami2 ; Kirigami::PlatformTheme).
