Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Getting started with Kirigami
ca: Com començar amb el Kirigami
eo: Komencu kun Kirigami
es: Primeros pasos con Kirigami
fr: Démarrer avec Kirigami
nl: Beginnen met Kirigami
pl: Pierwsze kroki w Kirigami
pt: Introdução ao Kirigami
sl: Prvi koraki s Kirigamijem
sv: Komma igång med Kirigami
uk: Вступ до Kirigami

source: Setup
ca: Configuració
es: Configuración
sl: Nastavitev

source: Introduction
ca: Introducció
eo: Enkonduko
es: Introducción
nl: Inleiding
pl: Wprowadzenie
pt: Introdução
sl: Uvod
sv: Inledning
uk: Вступ

source: Style
ca: Estil
eo: Stilo
es: Estilo
nl: Stijl
pl: Wygląd
pt: Estilo
sl: Slog
sv: Stil
uk: Стиль

source: Advanced
ca: Avançat
eo: Altnivela
es: Avanzado
fr: Avancé
nl: Geavanceerd
pl: Rozszerzone
pt: Avançado
sl: Napredno
sv: Avancerat
uk: Додатково

source: Manipulating data
ca: Manipulació de dades
es: Manipulación de datos
sl: Delo s podatki

source: Kirigami Addons
ca: Complements del Kirigami
eo: Kirigami Aldonaĵoj
es: Complementos de Kirigami
nl: Kirigami-toevoegingen
sv: Kirigami-tillägg
uk: Додатки Kirigami

source: Platform Support
ca: Implementació de la plataforma

source: Learning to create your first applications using Kirigami
ca: Aprenent a crear les vostres primeres aplicacions amb el Kirigami
eo: Lerni krei viajn unuajn aplikaĵojn uzante Kirigami
es: Aprenda a crear su primera aplicación usando Kirigami
fr: Apprentissage pour créer vos premières applications avec Kirigami
nl: Leren om uw eerste toepassing te maken met Kirigami
pl: Nauka tworzenia swoich pierwszych aplikacji przy użyciu Kirigami
pt: Aprenda a criar a sua primeira aplicação com o Kirigami
sl: Kako ustvariti svojo prvo aplikacijo s programom Kirigami
sv: Lär dig skapa din första program med användning av Kirigami
uk: Створюємо ваші перші програми за допомогою Kirigami

source: This tutorial will guide you through the process of creating your own convergent application using the [Kirigami framework](/frameworks/kirigami). A *convergent application*, in this context, means people can use the program easily regardless of the device it is running on. If it is on a desktop computer, it will adapt to a large screen and a mouse and keyboard; if it is being used on a mobile device, it will accept input from a touchscreen and adapt to a smaller portrait screen. And so on.
ca: Aquesta guia d'aprenentatge us guiarà a través del procés de creació de la vostra pròpia aplicació convergent emprant el [marc de treball Kirigami](/frameworks/kirigami). Una *aplicació convergent*, en aquest context, vol dir que les persones poden utilitzar el programa amb facilitat independentment del dispositiu en el qual s'estigui executant. Si està en un ordinador d'escriptori, s'adaptarà a una pantalla gran amb un ratolí i teclat. Si està en un dispositiu mòbil, acceptarà l'entrada d'una pantalla tàctil i s'adaptarà a una pantalla vertical més petita. I així successivament.
eo: Ĉi tiu lernilo gvidos vin tra la procezo krei vian propran konverĝan aplikaĵon per la [Kirigami-kadro](/frameworks/kirigami). *konverĝa aplikaĵo*, en ĉi tiu kunteksto, signifas, ke homoj povas facile uzi la programon sendepende de la aparato, sur kiu ĝi funkcias. Se ĝi estas sur labortabla komputilo, ĝi adaptiĝos al granda ekrano kaj muso kaj klavaro; se ĝi estas uzata en movebla aparato, ĝi akceptos enigon de tuŝekrano kaj adaptiĝos al pli malgranda portretekrano. Kaj tiel plu.
es: Este tutorial lo guiará a través del proceso de creación de su propia aplicación convergente usando la [infraestructura Kirigami](/frameworks/kirigami). Una *aplicación convergente*, en este contexto, significa que el programa se puede usar con facilidad sin importar el dispositivo en el que se ejecuta. Si está en una computadora de escritorio, se adaptará a una pantalla grande y al uso del ratón y del teclado; si se usa en un dispositivo móvil, aceptará entrada de una pantalla táctil y se adaptará a una pantalla más pequeña en modo retrato.
nl: Deze inleiding begeleidt u door het proces van het maken van uw eigen convergente toepassing met gebruik van het [Kirigami framework](/frameworks/kirigami). Een *convergente toepassing*, in deze context, betekent dat mensen het programma gemakkelijk kunnen gebruiken onafhankelijk van het apparaat waarop het wordt uitgevoerd. Als het op een desktopcomputer is, zal het zich aanpassen aan een groot scherm en een muis en toetsenbord; als het gebruikt wordt op een mobiel apparaat, zal het invoer accepteren van een aanraakscherm en zich aanpassen aan een kleiner portretscherm. Enzovoort.
pt: Este tutorial conduzi-lo-á pelo processo de criação da sua própria aplicação convergente, usando a [plataforma Kirigami](/frameworks/kirigami). Uma *aplicação convergente*, neste contexto, significa que as pessoas poderão usar facilmente o programa, independentemente do dispositivo em que está a ser executado. Se for num computador pessoal, adaptar-se-á a um ecrã grande, um rato e um teclado; se estiver a ser usada num telemóvel, irá aceitar a introdução de dados a partir de um ecrã táctil e adaptar-se-á a um ecrã mais pequeno em modo retrato, e assim por diante.
sl: Ta vaja vas bo vodila skozi proces ustvarjanja lastne konvergentne aplikacije z uporabo [ogrodja Kirigami](/frameworks/kirigami). *Konvergentna aplikacija* v tem kontekstu pomeni, da lahko uporabniki brez težav uporabljajo program ne glede na napravo, v kateri se izvaja. Če je v rabi na namiznem računalniku, se bo prilagodil velikemu zaslonu ter miški in tipkovnici; če se uporablja na mobilnem telefonu, bo sprejel vnos z zaslona na dotik in se prilagodil manjšemu pokončnemu zaslonu. In tako naprej.
sv: Den här handledningen leder dig genom processen att skapa ditt eget konvergenta program genom att använda [Kirigami ramverket](/frameworks/kirigami). Ett *konvergent program* betyder i det här sammanhanget att folk enkelt kan använda programmet oberoende av apparaten det kör på. Om det är på en skrivbordsdator, anpassar det sig till en stor skärm, och en mus och tangentbord. Om det används på en mobil apparat, accepterar det inmatning från en pekskärm och anpassar sig till en mindre stående skärm. Ock så vidare.
uk: У цьому розділі підручника ми ознайомимося із процесом створення вашої власної універсальної програми за допомогою [бібліотеки Kirigami](/frameworks/kirigami). Термін *універсальна програма* у цьому контексті означає, що програмою можна буде без проблем користуватися на будь-яких пристроях, на яких її запущено. Якщо програму буде запущено на звичайному комп'ютері, вона пристосується до великого екрана та користування за допомогою миші та клавіатури; якщо ж програму буде запущено на мобільному пристрої, вона працюватиме із сенсорним екраном та пристосується до малого екрана у книжковому режимі. Тощо.

source: Kirigami is built on top of the QML language and Qt Quick Controls 2 components provided by the Qt project. QML has built in support for touch systems, which makes it ideal for mobile apps. Qt Quick components are reusable visual items we can use when building our applications' interfaces. Kirigami is a set of Qt Quick components designed for creating convergent applications.
ca: El Kirigami està construït sobre el llenguatge QML i els components Qt Quick Controls 2 proporcionats pel projecte Qt. El QML té integrada la implementació de sistemes tàctils, el qual el fa ideal per a aplicacions mòbils. Els components Qt Quick són elements visuals reutilitzables que podem utilitzar en crear les interfícies de les aplicacions. El Kirigami és un conjunt de components Qt Quick dissenyats per a crear aplicacions convergents.
eo: Kirigami estas konstruita sur la QML-lingvo kaj Qt Quick Controls 2-komponentoj provizitaj de la Qt-projekto. QML konstruis subtenon por tuŝsistemoj, kio igas ĝin ideala por poŝtelefonaj programoj. Qt Rapidaj komponantoj estas reuzeblaj vidaj eroj, kiujn ni povas uzi dum konstruado de interfacoj de niaj aplikaĵoj. Kirigami estas aro de Qt Quick-komponentoj dizajnitaj por krei konverĝajn aplikojn.
es: Kirigami está construido sobre el lenguaje QML y los componentes Controls 2 de Qt Quick proporcionados por el proyecto Qt. QML tiene integra soporte para sistemas táctiles, lo que lo hace ideal para aplicaciones móviles. Los componentes Qt Quick son elementos visuales reutilizables que se pueden usar crear las interfaces de nuestras aplicaciones. Kirigami es un conjunto de componentes Qt Quick diseñados para crear aplicaciones convergentes.
fr: Kirigami est construit sur la base du langage QML et des composants Qt Quick Controls 2, fournis par le projet Qt. Le langage QML prend en charge nativement les systèmes tactiles, ce qui le rend idéal pour les applications mobiles. Les composants Qt Quick sont des éléments visuels réutilisables que nous pouvons utiliser pour construire les interfaces de nos applications. Kirigami est un ensemble de composants Qt Quick conçu pour créer des applications convergentes.
nl: Kirigami is gebouwd bovenop de QML-taal en Qt Quick Controls 2 componenten geleverd door het Qt-project. QML heeft ingebouwde ondersteuning voor aanraaksystemen, wat het ideaal maakt voor mobiele toepassingen. Qt Quick componenten zijn herbruikbare visuele items die we kunnen gebruiken bij het bouwen van onze interfaces van toepassingen. Kirigami is een set van Qt Quick componenten ontworpen voor het maken van convergente toepassingen.
pl: Kirigami jest zbudowane na podstawie języka QML oraz składników Qt Quick Controls 2 dostarczanych przez projekt Qt. QML ma wbudowaną obsługę urządzeń dotykowych, co czyni go doskonałym na aplikacje na urządzenia przenośne. Składniki Qt Quick są graficznymi rzeczami wielokrotnego użytku, które możemy wykorzystywać w interfejsach naszych aplikacji. Kirigami jest zestawem składników Qt Quick stworzonym do tworzenia całościowych aplikacji.
pt: O Kirigami é desenvolvido sobre a linguagem QML e os componentes do Qt Quick Controls 2 que são fornecidos pelo projecto Qt. O QML tem suporte incorporado para sistemas tácteis, o que o torna ideal para aplicações móveis. Os componentes do Qt Quick são itens visuais reutilizáveis que poderemos usar ao criar as interfaces das nossas aplicações. O Kirigami é um conjunto de componentes do Qt Quick desenhado para criar aplicações convergentes.
sl: Kirigami je zgrajen na osnovi jezika QML in dveh komponent Qt Quick Controls 2, ki jih zagotavlja Qt projekt. QML ima vgrajeno podporo za sisteme na dotik, zaradi česar je idealen za mobilne aplikacije. Komponente Qt Quick so vizualni elementi, ki jih lahko ponovno uporabimo pri gradnji vmesnikov naših programov in aplikacij. Kirigami je komplet komponent Qt Quick, namenjenih ustvarjanju konvergentnih aplikacij in programov.
sv: Kirigami är byggt på språket QML och komponenterna i Qt Quick Controls 2, som tillhandahålls av Qt-projektet. QML har inbyggt stöd för peksystem, vilket gör det idealt för mobilapplikationer. Qt Quick komponenter är återanvändbara visuella objekt som vi kan använda när vi bygger vårt programs gränssnitt. Kirigami är en uppsättning Qt Quick komponenter konstruerade för att skapa konvergenta program.
uk: Kirigami побудовано на основі мови програмування QML і компонентів Qt Quick Controls 2, які надаються у межах проєкту Qt. QML побудовано з врахуванням підтримки систем із сенсорним керуванням, що робить його ідеальним для програм для мобільних пристроїв. Компоненти Qt Quick є придатними для повторного використання візуальними елементами, якими ми можемо скористатися при побудові інтерфейсів наших програм. Kirigami — набір компонентів Qt Quick, які розроблено для створення універсальних програм.

source: While you will use QML to create the visual part of your application, the business logic—the code that does the heavy lifting for your application's functionality—should be written in a different language. We will also explore how to integrate our business logic with our UI in the tutorials below.
ca: Si bé fareu servir QML per a crear la part visual de la vostra aplicació, la lògica empresarial, el codi que fa la feina pesada de la funcionalitat de l'aplicació, s'hauria d'escriure en un llenguatge diferent. També explorarem com integrar la nostra lògica empresarial amb la nostra interfície d'usuari en les guies d'aprenentatge següents.
es: Si bien usará QML para crear la parte visual de su aplicación, la lógica cliente (el código que hace el trabajo pesado para la funcionalidad de su aplicación) debe estar escrito en un lenguaje diferente. También exploraremos cómo integrar nuestra lógica cliente con nuestra interfaz de usuario en los tutoriales que siguen a continuación.
sl: Čeprav boste QML uporabili za ustvarjanje vizualnega dela vaše aplikacije, bi morala biti poslovna logika – koda, ki opravlja težko delo za funkcionalnost vaše aplikacije – napisana v drugem jeziku. V spodnjih vajah bomo raziskali tudi, kako integrirati našo poslovno logiko z našim uporabniškim vmesnikom.

source: First, you will need to set up a new project in a language of your choice. The introduction will show you how to make a small, but functional Kirigami application.
ca: En primer lloc, caldrà establir un projecte nou en un llenguatge de la vostra elecció. La introducció us mostrarà com fer una aplicació petita però funcional del Kirigami.
es: En primer lugar, deberá crear un nuevo proyecto en el lenguaje que elija. La introducción le mostrará cómo crear una aplicación Kirigami pequeña aunque funcional.
sl: Najprej boste morali vzpostaviti nov projekt v jeziku po vaši izbiri. Uvod vam bo pokazal, kako narediti majhno, a funkcionalno aplikacijo Kirigami.

source: You will be shown the basics of how to deal with colors and text in your application, and you will get acquainted with most QML components. Next, you will get acquainted with most of the QML components you might want to use and how they look like. This section won't touch any business logic at all, only QML code.
ca: Se us mostraran els conceptes bàsics de com tractar els colors i el text a la vostra aplicació, i us familiaritzareu amb la majoria dels components del QML. A continuació, us familiaritzareu amb la majoria dels components del QML que potser voldreu utilitzar i com es veuen. Aquesta secció no tocarà cap lògica empresarial en absolut, només el codi QML.
es: Se le mostrarán los conceptos básicos sobre cómo manejar colores y texto en su aplicación, y se familiarizará con la mayoría de los componentes QML. A continuación, se familiarizará con la mayoría de los componentes QML que podría querer usar y con su apariencia. Esta sección no tocará ninguna lógica empresarial, solo el código QML.
sl: Pokazali vam bomo osnove ravnanja z barvami in besedilom v vaši aplikaciji ter se seznanili z večino komponent QML. Nato se boste seznanili z večino komponent QML, ki bi jih morda želeli uporabiti, in kako so videti. Ta razdelek se sploh ne dotika nobene poslovne logike le kodo QML.

source: You will get a deep dive into more advanced topics that concern manipulating the data that will be shown in your program.
ca: Us endinsareu en temes més avançats que tenen a veure amb la manipulació de les dades que es mostraran en el vostre programa.
es: Obtendrá una inmersión profunda en temas más avanzados relacionados con la manipulación de los datos que se mostrarán en su programa.
sl: Globoko se boste poglobili v naprednejše teme, ki zadevajo manipulacijo podatkov, ki bodo prikazani v vašem programu.

source: Lastly, you will be presented with Kirigami Addons, a series of quality-of-life components that you can use to, among other things, design the Settings of your application.
ca: Finalment, se us presentarà Kirigami Addons, una sèrie de components de qualitat de vida que podeu utilitzar per, entre altres coses, dissenyar la Configuració de la vostra aplicació.
es: Por último, se le presentarán los complementos de Kirigami, una serie de componentes de calidad de vida que podrá usar para, entre otras cosas, diseñar la configuración de su aplicación.
sl: Nazadnje vam bomo predstavili Kirigami Addons, serija komponent za kakovost življenja, ki jih lahko uporabite za, med drugim, oblikovanje nastavitev vaše aplikacije.

source: FormCard About pages
ca: Pàgines FormCard «Quant al»
eo: FormCard Pri paĝoj
es: Páginas acerca de FormCard
nl: FormCard over pagina's
sl: FormCard o programu
sv: FormCard om-sidor
uk: Сторінки «Про програму» FormCard

source: Learn to create About pages to credit your application.
ca: Aprendre a crear pàgines «Quant al» per a acreditar la vostra aplicació.
eo: Lernu krei Pri paĝoj por krediti vian aplikaĵon.
es: Aprenda a crear páginas «Acerca de» para mostrar los créditos de su aplicación.
nl: Leer het aanmaken van pagina's Info over om waardering in uw toepassing aan te geven.
sl: Naučite se ustvariti stran O programu, da si pripišete zasluge za aplikacijo.
sv: Lär dig hur man skapar om-sidor för att ge information om programmet.
uk: Дізнайтеся про те, як створювати сторінки «Про програму» для опису вашої програми.

source: Kirigami Addons is an additional set of visual components that work well on mobile and desktop and are guaranteed to be cross-platform. It uses Kirigami under the hood to create its components.
ca: Els complements del Kirigami són un conjunt addicional de components visuals que funcionen bé en el mòbil i l'escriptori i es garanteix que són multiplataforma. Utilitzen el Kirigami per sota per a crear els seus components.
eo: Kirigami Addons estas plia aro de vidaj komponantoj, kiuj bone funkcias ĉe poŝtelefono kaj labortablo kaj estas garantiitaj esti transplatformaj. Ĝi uzas Kirigami sub la kapuĉo por krei siajn komponentojn.
es: Los complementos de Kirigami son un conjunto adicional de componentes visuales que funcionan bien en el móvil y en el escritorio, con la garantía de ser multiplataforma. Usan Kirigami internamente para crear sus componentes.
nl: Kirigami-aanvullingen is een additionele set van visuele componenten die goed werken op een mobiel en bureaublad en gegarandeerd cross-platform zijn. Het gebruikt Kirigami onder de motorkap om zijn componenten aan te maken.
sl: Kirigami Addons je dodaten nabor vizualnih komponent, ki dobro delujejo na mobilnih in namiznih napravah ter so zajamčeno medplatformski. Pod pokrovom uporablja Kirigami za ustvarjanje njegovih komponent.
sv: Kirigami Addons är en ytterligare uppsättning visuella komponenter som fungerar bra på mobiler och skrivbordsdatorer och är garanterade att fungera på flera plattformar. De använder Kirigami i bakgrunden för att skapa sina komponenter.
uk: Додатки Kirigami — це додатковий набір візуальних компонентів, які добре працюють на мобільних пристроях і комп'ютерах і гарантовано є багатоплатформовими. З лаштунками вони використовують Kirigami для створення своїх компонентів.

source: Some of those components allow you to credit your work and the work of other contributors in your project, as well as mention the frameworks being used in your application: [AboutKDE](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutkdepage.html) and [AboutPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutpage.html).
ca: Alguns d'aquests components us permeten acreditar el vostre treball i el treball d'altres col·laboradors en el projecte, així com esmentar els marcs de treball que s'utilitzen a l'aplicació: [AboutKDE](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutkdepage.html) i [AboutPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutpage.html).

source: About KDE
ca: Quant al KDE
eo: Pri KDE
es: Acerca de KDE
nl: Over KDE
sl: O namizju KDE
sv: Om KDE
uk: Про KDE

source: Each new button we created in the previous step should open a new page. You can add new pages by instantiating them as [Components](docs:qtqml;QtQml.Component) and then using `pageStack.layers.push()` for each button to load that page in our `Main.qml`:
ca: Cada botó nou que hem creat en el pas anterior hauria d'obrir una pàgina nova. Podeu afegir pàgines noves instanciant-les com a [Components](docs:qtqml;QtQml.Component) i després utilitzant `pageStack.layers.push()` per a cada botó per a carregar aquesta pàgina en el `Main.qml`:
eo: Ĉiu nova butono, kiun ni kreis en la antaŭa paŝo, devus malfermi novan paĝon. Vi povas aldoni novajn paĝojn kreante ilin kiel [Components](docs:qtqml;QtQml.Component) kaj poste uzante `pageStack.layers.push()` por ĉiu butono por ŝargi tiun paĝon en nia `Main.qml`:
es: Cada nuevo botón que creamos en el paso anterior debería abrir una nueva página. Se pueden añadir nuevas páginas instanciándolas como [Components](docs:qtqml;QtQml.Component) y usando posteriormente `pageStack.layers.push()` en cada botón para cargar la página en nuestro `Main.qml`:
nl: Elke nieuwe knop die we hebben gemaakt in de vorige stap zou een nieuwe pagina openen. U kunt nieuwe pagina's toevoegen door ze als [Componenten](docs:qtqml;QtQml.Component) aan te maken en daarna `pageStack.layers.push()` voor elke knop te gebruiken om die pagina in onze `Main.qml` te gebruiken:
sl: Vsak nov gumb, ki smo ga ustvarili v prejšnjem koraku, bi moral odpreti novo stran. Nove strani lahko dodate tako, da jih ustvarite kot [Components](docs:qtqml;QtQml.Component) in nato uporabite `pageStack.layers.push()` za vsak gumb za nalaganje te strani v našem `main.qml`:
uk: Кожна нова кнопка, яку ми створили на попередньому кроці, має відкривати нову сторінку. Ви можете додати нові сторінки, створивши їх як [компоненти](docs:qtqml;QtQml.Component), а потім використавши `pageStack.layers.push()` для кожної кнопки, щоб завантажити цю сторінку до нашого `Main.qml`:

source: That's it really! All it takes is instantiating `FormCard.AboutKDE`. You should see something like this after clicking the [AboutKDE](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutkdepage.html) button:
ca: Això és realment! Tot el que cal és instanciar `FormCard.AboutKDE`. Hauríeu de veure una cosa així després de fer clic al botó [AboutKDE](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutkdepage.html):

source: About Page
ca: Pàgina «Quant al»
eo: Pri Paĝo
es: Página acerca de
fr: Page « À propos »
nl: Pagina Info over
pl: Strona "O programie"
pt: Página 'Acerca'
sl: Stran o programu
sv: Om-sida
uk: Сторінка «Про програму»

source: The application's [AboutPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutpage.html) is slightly more complex, but it's still very simple to use.
ca: L'[AboutPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-aboutpage.html) de l'aplicació és una mica més complexa, però encara és molt senzilla d'utilitzar.

source: For a simple about page that uses the data set in by `KAboutData::setApplicationData(aboutData);` in `main.cpp` add the following to your `Main.qml`:
ca: Per a una pàgina «quant al» que faci servir el conjunt de dades de `KAboutData::setApplicationData(aboutData);` a `main.cpp` afegiu el següent al vostre `Main.qml`:
es: Para una sencilla página «acerca de» que usa los datos definidos por `KAboutData::setApplicationData(aboutData);` en `main.cpp`, añada lo siguiente a su `Main.qml`:
nl: Voor een eenvoudige pagina Info over die de gegevens gebruikt ingesteld door `KAboutData::setApplicationData(aboutData);` in `main.cpp` voeg het volgende toe aan uw `Main.qml`:
sl: Za preprosto stran z informacijami, ki uporablja podatke, nastavljene v `KAboutData::setApplicationData(aboutData);` v `main.cpp`, dodajte naslednje v svoj `Main.qml`:
uk: Щоб отримати просту інформаційну сторінку, де використано набір даних `KAboutData::setApplicationData(aboutData);` у `main.cpp`, додайте таке до вашого `Main.qml`:
