Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: SwipeListItem on a computer
ca: SwipeListItem en un ordinador
eo: SwipeListItem sur komputilo
es: SwipeListItem en una computadora
fr: SwipeListItem sur un ordinateur
nl: SwipeListItem op een computer
pl: SwipeListItem na urządzeniach biurkowych
pt: O SwipeListItem num computador
sl: SwipeListItem na računalniku
sv: SwipeListItem på en dator
uk: SwipeListItem на комп'ютері

source: SwipeListItem on a mobile device
ca: SwipeListItem en un dispositiu mòbil
eo: SwipeListItem sur poŝtelefono
es: SwipeListItem en un dispositivo móvil
fr: SwipeListItem sur un périphérique mobile
nl: SwipeListItem op een mobiel apparaat
pl: SwipeListItem na urządzeniach przenośnych
pt: O SwipeListItem num dispositivo móvel
sl: SwipeListItem na mobilni napravi
sv: SwipeListItem på en mobil
uk: SwipeListItem на мобільному пристрої

source: A [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) is a toolbar built out of a list of actions. By default, each action that will fit in the toolbar will be represented by a [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), with those that do not fit being moved into a menu at the end of the toolbar.
ca: Una [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) és una barra d'eines construïda a partir d'una llista d'accions. De manera predeterminada, cada acció que càpiga a la barra d'eines estarà representada per un [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), i les que no càpiguen es mouran a un menú al final de la barra d'eines.
sl: [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) je orodna vrstica, zgrajena iz seznama dejanj. Vsako dejanje, ki bo privzeto ustrezalo orodni vrstici, bo predstavljeno z orodnim gumbom [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), s tistimi, ki se ne ujemajo, pa so premaknjeni v meni na koncu orodne vrstice.

source: Like [ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField), you may not need to use [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) directly as it is used by page headers and cards to provide their action display.
ca: Igual que [ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField), és possible que no necessiteu utilitzar [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) directament, ja que l'utilitzen les capçaleres i les targetes de pàgina per a mostrar la seva acció.
sl: Tako kot [ActionTextField](docs:kirigami;org.kde.kirigami.ActionTextField) morda ne boste potrebovali neposredne uporabe vrstice [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar), saj jo uporabljajo glave strani in kartice za zagotavljanje njihovega zaslona dejavnosti.

source: A horizontal toolbar being displayed at the top of the application
ca: Una barra d'eines horitzontal que es mostra a la part superior de l'aplicació
eo: Horizontala ilobreto montriĝas ĉe la supro de la aplikaĵo
es: Una barra de herramientas horizontal que se muestra en la parte superior de la aplicación
nl: Een horizontale werkbalk wordt getoond bovenaan de toepassing
pt: Uma barra de ferramentas horizontal a ser apresentada no topo da aplicação
sl: Na vrhu aplikacije se prikaže vodoravna orodna vrstica
sv: En horisontell verktygsrad visas överst i programmet
uk: Горизонтальна панель інструментів, яку показано у верхній частині вікна програми

source: You can read more about [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) components in their [dedicated documentation page](../components-actiontoolbar/).
ca: Podeu llegir més sobre els components [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) a la seva [pàgina de documentació dedicada](../components-actiontoolbar/).
sl: Več o komponentah [ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) si lahko preberete na njihovi strani z dokumentacijo [dedicated documentation page](../components-actiontoolbar/).

source: Cards
ca: Targetes (Card)
eo: Kartoj
es: Tarjetas
fr: Cartes
nl: Kaarten
pl: Karty
pt: Cartões
sl: Kartice
sv: Kort
uk: Карти

source: A [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) is used to display a collection of information or actions together. These actions can be added to the [actions](https://api.kde.org/qml-org-kde-kirigami-card.html#actions-prop) group, similarly to previous components.
ca: Un [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) s'utilitza per a mostrar una col·lecció d'informació o accions junts. Aquestes accions es poden afegir al grup [actions](https://api.kde.org/qml-org-kde-kirigami-card.html#actions-prop), de manera similar als components anteriors.

source: ![Screenshot of a full-fledged Card with a banner background behind its title, white background behind its text, and two actions with icons and a hamburger menu at the bottom](card.png)
ca: ![Captura de pantalla d'una targeta totalment desenvolupada amb un fons de bàner darrere del títol, fons blanc darrere del text i dues accions amb icones i un menú d'hamburguesa a la part inferior](card.png)
eo: ![Ekrankopio de plenrajta Karto kun standarda fono malantaŭ ĝia titolo, blanka fono malantaŭ ĝia teksto, kaj du agoj kun piktogramoj kaj hamburgera menuo malsupre](card.png)
es: ![Captura de pantalla de una Card completa con un banner detrás del título, un fondo blanco detrás del texto y dos acciones con iconos y un menú hamburguesa en la parte inferior](card.png)
nl: ![Schermafdruk van een volwaardige kaart met een bannerachergrond achter zijn titel, witte achtergrond achter zijn tekst en twee acties met pictogrammen en een hamburgermenu onderaan](card.png)
pt: ![Imagem de um Card completo com um fundo separador debaixo do seu título, um fundo branco atrás do seu texto e duas acções com ícones e um menu em hambúrguer no fundo](card.png)
sl: ![Posnetek zaslona polno opremljene kartice z ozadjem pasice za naslovom, belim ozadjem za besedilom in dvema dejanjema z ikonami in hamburger menijem na dnu](card.png)
sv: ![Skärmbild av ett fullfjädrat kort med en baner i bakgrunden bakom titeln, vit bakgrund bakom texten och två åtgärder med ikoner och en hamburgermeny längst ner](card.png)
uk: ![Знімок повноцінної Card із банером-тлом під її заголовком, білим тлом під її текстом та двома кнопками дій із піктограмами та меню-гамбургером внизу](card.png)

source: For more information consult the [component page for Cards](../components-card/).
ca: Per a més informació consulteu la [pàgina de components per a targetes](../components-card/).
eo: Por pliaj informoj konsultu la [komponan paĝon por Kartoj](../components-card/).
es: Para más información, consulte la [página del componente de tarjetas](../components-card/).
nl: Voor meer informatie raadpleeg de [componentpagina voor kaarten](../components-card/).
pt: Para mais informações, consulte a [página dos componentes Card](../components-card/).
sl: Če želite več informacij, poglejte stran [component page for Cards](../components-card/).
sv: För mer information se [komponentsidan för Cards](../components-card/).
uk: Докладніший опис можна знайти на [сторінці компонентів для карток](../components-card/).

source: Action toolbars
ca: Barres d'eines d'acció
eo: Agaj ilobretoj
es: Barras de herramientas de acciones
nl: Actiewerkbalken
sl: Orodne vrstice dejanj
sv: Åtgärdsverktygsrader
uk: Панелі інструментів дій

source: Create your own customisable tool bars with the ActionToolBar component
ca: Creant les vostres pròpies barres d'eines personalitzables amb el component ActionToolBar
eo: Kreu viajn proprajn agordeblajn ilbretojn per la komponanto ActionToolBar
es: Cree sus propias barras de herramientas personalizables con el componente ActionToolBar
fr: Créer vos propres barres d'outils personnalisables avec le composant « ActionToolBar »
nl: Maak uw eigen aanpasbare werkbalken met de component ActionToolBar
pl: Twórz swoje własne paski narzędzi przy użyciu ActionToolBar
pt: Crie as suas próprias barras de ferramentas personalizadas com o componente ActionToolBar
sl: Ustvarite lastne orodne vrstice, ki jih je mogoče prilagoditi, s komponento ActionToolBar
sv: Skapa dina egna anpassningsbara verktygsrader med komponenten ActionToolBar
uk: Створення власних налаштовуваних панелей інструментів за допомогою компонента ActionToolBar

source: While Kirigami pages allow you to easily place a set of actions in the page header, there are times when you might prefer to have something more flexible.
ca: Si bé les pàgines de Kirigami permeten posar amb facilitat un conjunt d'accions a la capçalera de la pàgina, hi ha ocasions en què potser preferireu tenir una mica més de flexibilitat.
eo: Dum Kirigami-paĝoj permesas vin facile meti aron da agoj en la paĝokapo, estas tempoj kiam vi eble preferas havi ion pli fleksebla.
es: Aunque las páginas de Kirigami le permiten situar con facilidad un conjunto de acciones en la cabecera de la página, hay veces en las que preferirá tener algo más flexible.
fr: Si les pages de Kirigami vous permettent de placer facilement un ensemble d'actions dans l'en-tête de la page, il y a quelques fois où vous préfériez quelque chose de plus souple.
nl: Terwijl Kirigami pagina's u toestaan om gemakkelijk een set acties in de paginakop te plaatsen, zijn er tijden wanneer u de voorkeur geeft iets meer flexibiliteit.
pl: Podczas gdy strony Kirigami umożliwiają ci w łatwy sposób umieszczenie zestawu działań w nagłówku strony, to są przypadki, w których możesz chcieć czegoś bardziej elastycznego.
pt: Embora as páginas do Kirigami lhe permitam facilmente colocar um conjunto de acções no cabeçalho da página, existem ocasiões em que poderá preferir ter algo mais flexível.
sl: Medtem ko vam strani Kirigami omogočajo enostavno namestitev nabora dejanj v glavo strani, so primeri, ko potrebujete nekaj bolj prilagodljivega.
sv: Även om Kirigami låter dig enkelt placera en uppsättning åtgärder i sidhuvuden, finns det tillfällen då man kan föredra att ha någonting flexiblare.
uk: Хоча сторінки Kirigami надають вам змогу без проблем розташовувати набір кнопок дій у шапці сторінки, іноді варто скористатися гнучкішим інструментом.

source: Kirigami provides the component [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar). It displays a list of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) objects and will display as many of them as possible, providing an overflow menu for the ones that don't fit. The ActionToolBar is dynamic and will move actions in and out of the overflow menu depending on the size available to it.
ca: El Kirigami proporciona el component [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar). Mostra una llista d'objectes [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) i en mostrarà tants com sigui possible, proporcionant un menú desbordat per als que no encaixin. L'ActionToolBar és dinàmica i mourà les accions dins i fora del menú desbordat depenent de l'espai disponible.
sl: Kirigami zagotavlja komponento [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar). Prikazala bo seznam predmetov [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) in jih bo prikazala čim več, pri tem pa bo na voljo meni prelivanja za tiste, ki se ne ujemajo. Vrstica ActionToolBar je dinamična in bo premaknila dejanja v in iz menija prelivanja, odvisno od velikosti, ki ji je na voljo.

source: This page assumes you are familiar with [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) objects. If you are not, you can learn all about them in our beginner tutorial or in [the dedicated documentation page for them](../components-actions/).
ca: Aquesta pàgina assumeix que esteu familiaritzat amb els objectes [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action). Si no ho esteu, podeu aprendre-ho tot a la nostra guia d'aprenentatge inicial o a la [pàgina de documentació dedicada a ells](../components-actions/).
sl: Ta stran predpostavlja, da ste spoznani s predmeti [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action). Če niste, se lahko poučite o njih v naši začetni vaji ali na spletni strani o njih [the dedicated documentation page for them](../components-actions/).

source: Creating our first ActionToolBar
ca: Crear la nostra primera ActionToolBar
eo: Kreante nian unuan ActionToolBar
es: Creando su primera ActionToolBar
fr: Création de notre première ActionToolBar
nl: Uw eerste ActionToolBar aanmaken
pl: Tworzenie naszego pierwszego ActionToolBar
pt: Criar a nossa primeira ActionToolBar
sl: Ustvarjanje prve vrstice ActionToolBar
sv: Skapa vår första ActionToolBar
uk: Створюємо нашу першу ActionToolBar

source: The layout and location of your [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) are really up to you, though for the sake of user-friendliness it is usually a good idea to stick to UI conventions and put your toolbar near the top or bottom of your page and to have it spread width wise.
ca: La disposició i la ubicació de la vostra [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) en realitat dependrà de vosaltres, encara que en nom de la facilitat d'ús, generalment és una bona idea cenyir-se a les convencions de la interfície d'usuari i col·locar la barra d'eines a prop de la part superior o inferior de la pàgina i que s'estengui en amplada.
sl: Postavitev in mesto vaše [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) sta resnično odvisna od vas, čeprav je zaradi prijaznosti do uporabnika običajno dobra ideja, da se držite konvencij uporabniškega vmesnika in postavite svojo orodno vrstico blizu vrha ali dna strani ter da se razširi po širini.

source: Like most other action-holding components, [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) has an [actions](https://api.kde.org/qml-org-kde-kirigami-actiontoolbar.html#actions-prop) property. We can assign an array of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) components to this property.
ca: Com la majoria dels altres components que mantenen accions, la [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) té una propietat [accions](https://api.kde.org/qml-org-kde-kirigami-actiontoolbar.html#actions-prop). Podem assignar una matriu de components [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) a aquesta propietat.

source: ActionToolBar with enough space for all children
ca: ActionToolBar amb prou espai per a tots els fills
eo: ActionToolBar kun sufiĉe da spaco por ĉiuj infanoj
es: ActionToolBar con suficiente espacio para todas las acciones hijas
fr: ActionToolBar avec suffisamment d'espace pour tous les enfants
nl: ActionToolBar met genoeg ruimte voor alle kinderen
pl: ActionToolBar z wystarczającą ilością miejsca na wszystkie rzeczy podrzędne
pt: O ActionToolBar com espaço suficiente para todos os seus filhos
sl: ActionToolBar z dovolj prostora za vse podrejene
sv: ActionToolBar med tillräckligt utrymme för alla underliggande objekt
uk: ActionToolBar із достатнім простором для усіх дочірніх елементів

source: ActionToolBar with overflow menu containing children
ca: ActionToolBar amb el menú desbordat que conté els fills
eo: ActionToolBar kun superflua menuo enhavanta infanojn
es: ActionToolBar con un menú de sobrantes que contiene acciones hijas
fr: ActionToolBar avec menu de débordement contenant des fils
nl: ActionToolBar met overflow-menu met kinderen
pl: ActionToolBar z menu przelewowym, zawierającym składniki podrzędne
pt: O ActionToolBar com um menu excedentário que contém filhos
sl: Vrstica ActionToolBar s pretočnim menijem, ki vsebuje podrejene
sv: ActionToolBar med överflödesmeny som innehåller underliggande objekt
uk: ActionToolBar із переповненим меню, що містить дочірні пункти

source: Alignment
ca: Alineació
eo: Vicigo
es: Alineación
fr: Alignement
nl: Uitlijning
pl: Wyrównanie
pt: Alinhamento
sl: Poravnava
sv: Justering
uk: Вирівнювання

source: By default, actions in the [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) will be left aligned. This might not be desirable in all situations. Thankfully we can change this with the [alignment](https://api.kde.org/qml-org-kde-kirigami-actiontoolbar.html#alignment-prop) property. We can set this property to a range of values, but the three most relevant ones are `Qt.AlignLeft`, `Qt.AlignCenter`, and `Qt.AlignRight` (which deal with [horizontal alignment](docs:qtcore;Qt::Alignment)).
ca: De manera predeterminada, les accions a la [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) s'alinearan a l'esquerra. Això pot no ser desitjable en totes les situacions. Afortunadament, podem canviar això amb la propietat [alignment](https://api.kde.org/qml-org-kde-kirigami-actiontoolbar.html#alignment-prop). Podem establir aquesta propietat en un interval de valors, però els tres més rellevants són `Qt.AlignLeft`, `Qt.AlignCenter` i `Qt.AlignRight` (els quals s'ocupen de l'[alineació horitzontal](docs:qtcore;Qt::Alignment)).

source: ![ActionToolBar with children center-aligned](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
ca: ![ActionToolBar amb fills alineats al centre](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
eo: ![ActionToolBar kun infanoj centre-vicigitaj](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
es: ![ActionToolBar con acciones hijas centradas](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
nl: ![ActionToolBar met kinderen centraal uitgelijnd](/docs/getting-star/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
sl: ![ActionToolBar z otroki, poravnanimi na sredino](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
sv: ![ActionToolBar med underliggande objekt centrerade](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)
uk: ![ActionToolBar із вирівняними за центром дочірніми елементами](/docs/getting-started/kirigami/components-actiontoolbar/ActionToolBar-aligned.webp)

source: A card serves as an overview and entry point for more detailed information and can offer direct access to the most important actions of an item.
ca: Una targeta serveix com a una descripció general i punt d'entrada per a obtenir informació més detallada, i pot oferir accés directe a les accions més importants d'un element.
eo: Karto funkcias kiel superrigardo kaj enirpunkto por pli detalaj informoj kaj povas proponi rektan aliron al la plej gravaj agoj de ero.
es: Una tarjeta sirve como resumen, es un punto de entrada para obtener información más detallada y puede ofrecer acceso directo a las acciones más importantes de un elemento.
nl: Een kaart dient als overzicht en ingang voor meer gedetailleerde informatie en kan directe toegang bieden tot de meest belangrijke acties van een item.
pt: Um cartão sobre como visão geral e um ponto de entrada para informações mais detalhadas, podendo oferecer o acesso directo às acções mais importantes de um item.
sl: Kartica služi kot pregled in vstopna točka za podrobnejše informacije in lahko nudi neposreden dostop do najpomembnejših dejanj na postavki.
sv: Ett kort (card) fungerar som en översikt och startpunkt för mer detaljerad information, och kan erbjuda direkt åtkomst till de viktigaste åtgärderna för ett objekt.
uk: Картка слугує як панель огляду та вхідна позиція для отримання докладніших відомостей і може пропонувати безпосередній доступ до найважливіших дій над пунктом.

source: The Kirigami types [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) and [Card](docs:kirigami;org.kde.kirigami.Card) are used to implement the popular card component used on many mobile and web platforms. Cards can be used to display a collection of information or actions in an attractive and distinctive way.
ca: Els tipus [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) i [Card](docs:kirigami;org.kde.kirigami.Card) de Kirigami s'utilitzen per a implementar el popular component de targeta utilitzat en moltes plataformes mòbils i web. Les targetes es poden utilitzar per a mostrar una col·lecció amb informació o accions d'una manera atractiva i distintiva.
sl: Tipi Kirigami[AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) and [Card](docs:kirigami;org.kde.kirigami.Card) se uporabljajo za izvajanje priljubljene komponente kartic, uporabljene na številnih mobilnih in spletnih platformah. Kartice se lahko uporabljajo za prikaz zbirke informacij ali dejanj na privlačen in razločen način.

source: Kirigami also offers 3 kinds of [views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) and [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) to aid you in presenting your cards with beautiful and responsive layouts.
ca: El Kirigami també ofereix 3 tipus de [vistes](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) i [posicionadors](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) per a ajudar-vos a presentar les vostres targetes amb disposicions belles i sensibles.
eo: Kirigami ankaŭ ofertas 3 specojn de [vidoj](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) kaj [poziciantoj](https://doc.qt.io/qt-6 /qtquick-positioning-layouts.html) por helpi vin prezenti viajn kartojn kun belaj kaj respondemaj aranĝoj.
es: Kirigami también ofrece tres tipos de [vistas](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) y [posicionadores](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) para ayudarle a presentar tarjetas con diseños agradables y receptivos.
nl: Kirigami biedt ook 3 soorten [weergaven](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) en [positioneerders](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) om u te helpen bij het presenteren van uw kaarten met mooie en responsieve indelingen.
pt: O Kirigami também oferece 3 tipos de [vistas](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) e [ajudantes de posição](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) para o ajudar a apresentar as suas cartas com disposições bonitas e adaptativas.
sl: Kirigami vam nudi tudi 3 vrste pogledov [views](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) in pozicionerjev [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html), ki vam bodo v pomoč pri predstavitvi vaših kartic z lepimi in odzivnimi postavitvami.
sv: Kirigami erbjuder också tre sorters [vyer](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) och [positioneringsobjekt](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) för att hjälpa dig presentera kort med vackra och mottagliga layouter.
uk: Крім того, Kirigami пропонує 3 типи [панелей перегляду](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) і [засобів розташування](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html), які допоможуть вам у представленні ваших карток з використанням красивих і чутливих до дій користувача компонувань.
