Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: In this example, we set the visibility of an inline drawer according to the status of a toggleable button:
ca: En aquest exemple, establim la visibilitat d'un calaix inclòs d'acord amb l'estat d'un botó commutable:
eo: En ĉi tiu ekzemplo, ni agordas la videblecon de enlinia tirkesto laŭ la stato de ŝanĝebla butono:
es: En este ejemplo, configuramos la visibilidad de un cajón en línea según el estado de un botón conmutable:
nl: In dit voorbeeld zetten we de zichtbaarheid van een in-line schuiflade volgens de status van een omschakelbare knop:
pt: Neste exemplo, definimos a visibilidade de uma área incorporada com base no estado de um botão comutável:
sl: V tem primeru nastavimo vidnost v predalu vrstice glede na stanje preklopnega gumba:
sv: I det här exemplet ställer vi in synligheten hos en låda på plats enligt status av en ändringsbar knapp:
uk: У цьому прикладі ми встановлюємо видимість вбудованої панелі за станом кнопки-перемикача:

source: ![A window containing a toggleable button "Hide inline drawer" in the center which when toggled hides the "Peekaboo" inline drawer](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)
ca: ![Una finestra que conté un botó commutable «Hide inline drawer» en el centre que quan es commuta oculta el calaix en línia «Peekaboo»](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)
eo: ![Fenestro enhavanta ŝalteblan butonon "Kaŝi enlinian tirkeston" en la centro, kiu kiam baskulite kaŝas la "Peekaboo" enlinian tirkeston](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp )
nl: ![Een venster bevattende een om te schakelen knop "Inline schuiflade verbergen" in het centrum, die wanneer omgeschakeld de inline schuiflade "Peekaboo" verbergt](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)
sl: ![Okno, ki vsebuje preklopni gumb »Skrij vgrajeni predal« na sredini, ki ob preklopu skrije vgrajeni predal »Peekaboo«](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)
sv: ![Ett fönster som innehåller en ändringsbar knapp "Hide inline drawer" som när den ändras döljer lådan på plats "Peekaboo"](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)
uk: ![Вікно, у якому міститься кнопка-перемикач «Приховати вбудовану висувну панель» у центрі. Якщо натиснути цю кнопку, програма приховає вбудовану висувну панель «Пікабу»](/docs/getting-started/kirigami/components-controls/controls-togglebutton.webp)

source: With the default Breeze theme in KDE Plasma it can be hard to tell whether a button is toggled, since buttons are coloured blue when they are clicked on. Make sure you take this into account when creating your application: a different control might be more user friendly.
ca: Amb el tema Brisa predeterminat en el Plasma del KDE, pot ser difícil saber si un botó està commutat, ja que els botons seran de color blau quan es fa clic a sobre seu. Assegureu-vos de tenir això en compte quan creeu la vostra aplicació: un control diferent podria ser més fàcil d'utilitzar.
eo: Kun la defaŭlta etoso Breeze en KDE Plasma povas esti malfacile diri ĉu butono estas ŝaltita, ĉar butonoj estas blukoloraj kiam ili estas alklakitaj. Certigu, ke vi konsideru tion dum kreado de via aplikaĵo: malsama regilo povus esti pli uzantema.
es: Con el tema Brisa predeterminado de KDE Plasma puede ser difícil saber si un botón está conmutado, ya que los botones son de color azul cuando se pulsa en ellos. Asegúrese de tener esto en cuenta al crear su aplicación: un control diferente podría ser más fácil de usar.
nl: Met het standaard Breeze thema in KDE Plasma kan het moeilijk te zien zijn of een knop is omgeschakeld, omdat knoppen blauw gekleurd zijn wanneer er op is geklikt. Ga na hier rekening mee te houden bij maken van uw toepassing: een andere besturing kan gebruikersvriendelijker zijn.
pt: Com o tema predefinido Brisa no Plasma do KDE, poderá ser difícil de perceber se um botão está carregado, dado que os botões ficam com uma cor azul quando estão carregados. Certifique-se de que tem isto em conta ao criar a sua aplicação: um controlo diferente poderá ser mais amigável.
sl: S privzeto temo Sapica v KDE Plasmi je težko ugotoviti, ali je gumb preklopljen, saj so gumbi obarvani modro, ko jih kliknete. Upoštevajte to pri kreiranju aplikacije: drug kontrolnik bi morda bil uporabniku bolj prijazen.
sv: Med det förvalda temat Breeze i KDE Plasma kan det vara svårt att avgöra om en knapp är på, eftersom knappar är blåfärgade när de är klickade på. Säkerställ att du tar hänsyn till det när du skapar ditt program: en annan kontroll kan vara mer användarvänlig.
uk: У типовій темі Breeze Плазми KDE може бути важко розрізнити стани кнопки-перемикача, оскільки при натисканні кнопки зафарбовуються синім кольором. Врахуйте це під час створення вашої програми: інший засіб керування може бути зручнішим для користувача.

source: Toolbar buttons
ca: Botons de la barra d'eines
eo: Ilobreto-butonoj
es: Botones de la barra de herramientas
fr: Boutons pour barre d'outils
nl: Werkbalkknoppen
pl: Przyciski paska narzędzi:
pt: Botões da barra de ferramentas
sl: Gumbi orodne vrstice
sv: Verktygsradsknappar
uk: Кнопки панелі інструментів

source: There is a specific button type meant for use in toolbars, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). The most obvious difference between this and a conventional [Button](docs:qtquickcontrols;QtQuick.Controls.Button) is the styling, with toolbuttons being flat (though this is alterable with the boolean property [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
ca: Hi ha un tipus de botó específic per al seu ús en les barres d'eines, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). La diferència més òbvia entre aquest i un botó [Button](docs:qtquickcontrols;QtQuick.Controls.Button) convencional és l'estil, amb botons d'eina plans (encara que això es pot alterar amb la propietat booleana [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
eo: Estas specifa butontipo destinita por uzo en ilbretoj, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). La plej evidenta diferenco inter ĉi tio kaj konvencia [Butono](docs:qtquickcontrols;QtQuick.Controls.Button) estas la stilo, kun ilbutonoj plataj (kvankam tio estas ŝanĝebla kun la bulea eco [flat](https://doc. qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
nl: Er is een specifiek type knop bedoelt voor gebruik in werkbalken, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). Het meest zichtbare verschil tussen deze en een conventionele [Knop](docs:qtquickcontrols;QtQuick.Controls.Button) is de styling, met werkbalkknoppen die vlak zijn (hoewel dat is te wijzigen met de booleaanse eigenschap [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
pt: Existe um tipo de botão específico para usar nas barras de ferramentas, o [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). A diferença mais óbvia entre este e um [Button](docs:qtquickcontrols;QtQuick.Controls.Button) convencional é o estilo, onde os botões de ferramentas ficam planos (ainda que isto possa ser alterado com a propriedade booleana [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
sl: Obstaja določena vrsta gumba namenjena rabi v orodnih vrsticah [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). Najbolj očitna razlika med tem in običajnim gumbom [Button](docs:qtquickcontrols;QtQuick.Controls.Button) je njegov slog, pri čemer so orodni gumbi ploščati (čeprav je to mogoče spremeniti z logično lastnostjo [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
sv: Det finns en specifik knapptyp som är avsedd för att använda i verktygsrader, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). Den mest uppenbara skillnaden mellan den och en vanlig [Button](docs:qtquickcontrols;QtQuick.Controls.Button) är stilen, där verktygsknappar är platta (även om det går att ändra med den Booleska egenskapen [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).
uk: Існує специфічний тип кнопок, який призначено для використання на панелях користувачів, [Controls.ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton). Найочевиднішою відмінністю між цією кнопкою і звичайною [кнопкою](docs:qtquickcontrols;QtQuick.Controls.Button) є стилізація — кнопки інструментів плоскі (хоча це і можна змінити за допомогою булевої властивості [flat](https://doc.qt.io/qt-6/qml-qtquick-controls2-button.html#flat-prop)).

source: ![A window showing a custom toolbar in the window header simulating a Kirigami.globalToolBar, with a left menu icon that shows a passive notification "Kirigami Pages and Actions are better!" and a right toolbutton "Beep" which is completely flat simulating a Kirigami.Action](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)
ca: ![Una finestra que mostra una barra d'eines personalitzada a la capçalera de la finestra que simula un Kirigami.globalToolBar, amb una icona de menú a l'esquerra que mostra una notificació passiva «Kirigami Pages and Actions are better!» i un botó d'eina dret «Beep» que és completament pla simulant una Kirigami.Acció](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)
eo: ![Fenestro montranta propran ilobreton en la fenestrokapo simulanta Kirigami.globalToolBar, kun maldekstra menupiktogramo kiu montras pasivan sciigon "Kirigami Paĝoj kaj Agoj estas pli bonaj!" kaj dekstra ilbutono "Bip" kiu estas tute plata simulante Kirigami.Agon](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)
nl: ![Een venster dat een aangepaste werkbalk toont aan de bovenkant van het venster die een Kirigami.globalToolBar simuleert, met links een menu pictogram dat een passieve melding "Kirigami Pages and Actions are better!" toont en rechts de knop "Beep" die compleet plat is die een Kirigami.Action](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp) simuleert
sl: ![Okno, ki prikazuje orodno vrstico po meri v glavi okna, ki simulira Kirigami.globalToolBar, z levo ikono menija, ki prikazuje pasivno obvestilo "Strani in dejanja Kirigami so boljši!" in desni orodni gumb "Beep", ki je popolnoma raven in simulira Kirigami.Action](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)
sv: ![Ett fönster som visar en egen verktygsrad i fönsterhuvudet som simulerar en Kirigami.globalToolBar, med en vänstermenyikon som visar ett passivt meddelande "Kirigami Pages and Actions are better!" och en verktygsknapp "Beep" till höger som är helt platt och simulerar en Kirigami.Action](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)
uk: ![Вікно, у якому показано нетипову панель інструментів у заголовку вікна, які імітує Kirigami.globalToolBar, із лівою піктограмою меню, яка показує пасивне сповіщення «Сторінки і дії Kirigami — кращі!», і правою кнопкою-інструментом «Дзинь», яка є повністю плоскою і імітує Kirigami.Action](/docs/getting-started/kirigami/components-controls/controls-toolbutton.webp)

source: Selection controls
ca: Controls de la selecció
eo: Elektaj kontroloj
es: Controles de selección
fr: Contrôles de sélection
nl: Selectiebesturing
pl: Pola zaznaczane
pt: Controlos de selecção
sl: Izbirni kontrolniki
sv: Urvalskontroller
uk: Засоби позначення

source: Selection controls let users make a choice or pick an option. There are different types that are best suited to different situations.
ca: Els controls de selecció permeten als usuaris escollir o triar una opció. Hi ha tipus diferents que s'adapten millor a diferents situacions.
eo: Elektaj kontroloj lasas uzantojn fari elekton aŭ elekti opcion. Estas malsamaj tipoj, kiuj plej taŭgas por malsamaj situacioj.
es: Los controles de selección permiten al usuario elegir o escoger una opción. Hay distintos tipos que se adaptan mejor a diferentes situaciones.
fr: Les contrôles de sélection permettent aux utilisateurs de faire un choix ou de sélectionner une option. Il en existe différents types s'adaptant au mieux selon différentes situations.
nl: Besturing van selectie laat gebruikers een keuze maken of een optie kiezen. Er zijn verschillende typen die het best geschikt zijn in verschillende situaties.
pl: Rzeczy sterujące zaznaczeniem umożliwiają użytkownikowi wybór lub wybranie ustawienia. Istnieją różne rodzaje, które najlepiej opowiadają danemu przypadkowi.
pt: Os controlos de selecção permitem aos utilizadores fazerem uma escolha ou seleccionar uma opção. Existem diferentes tipos que são mais adequados, dependendo das diferente situações.
sl: Kontrolniki izbire uporabnikom omogočijo izbiro ali izberejo možnost. Obstajajo različne vrste, ki so najbolje primerni za različne situacije.
sv: Urvalskontroller låter användare göra ett val eller välja ett alternativ. Det finns olika typer som är bäst lämpade i olika situationer.
uk: За допомогою засобів позначення користувачі можуть зробити вибір або вибрати певний варіант. Існують різні типи, які пристосовано до різних ситуацій.

source: Checkboxes
ca: Caselles de selecció
eo: Markobutonoj
es: Casillas de verificación
fr: Boîtes à cocher
nl: Keuzevakjes
pl: Pola zaznaczania
pt: Opções de Marcação
sl: Potrditvena polja
sv: Kryssrutor
uk: Позначки

source: A [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) is meant for options where the choices are non-exclusive and where each option has a clear alternative.
ca: Un [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) està destinat a opcions en què les opcions no són exclusives i en què cada opció té una alternativa clara.
eo: [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) estas intencita por opcioj kie la elektoj estas neekskluzivaj kaj kie ĉiu opcio havas klaran alternativon.
es: Una [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) es adecuada para opciones donde las elecciones no son exclusivas y en las que cada opción tiene una alternativa clara.
nl: Een [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) is bedoeld voor opties waarvan de keuzes niet-exclusief zijn en waar elke optie een helder alternatief heeft.
pt: Uma [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) serve para opções em que as alternativas não são exclusivas e onde cada opção tem uma alternativa bem definida.
sl: Potrditveno polje [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) je namenjeno možnostim, kjer so izbire neizključujoče in kjer ima vsaka možnost jasno alternativo.
sv: En [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) är avsedda för alternativ där valen inte är exklusiva och där varje val har ett klart alternativ.
uk: [Controls.CheckBox](docs:qtquickcontrols;QtQuick.Controls.CheckBox) призначено для випадків, коли вибір не є взаємовиключним, а кожний пункт має чітку альтернативу.

source: ![A window showing two checkboxes where more than one checkbox can be ticked at the same time](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
ca: ![Una finestra que mostra dues caselles de selecció a on es pot marcar més d'una casella de selecció a la vegada](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
eo: ![Fenestro montranta du markobutonojn kie pli ol unu markobutono povas esti markita samtempe](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
nl: ![Een venster dat twee keuzevakjes toont waar meer dan één keuzevakje tegelijk geactiveerd kan worden](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
sl: ![Okno, ki prikazuje dve potrditveni polji, kjer je mogoče označiti več kot eno potrditveno polje hkrati](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
sv: ![Ett fönster som visar en uppsättning kryssrutor där mer än en kryssruta kan markeras samtidigt](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)
uk: ![Вікно, у якому показано два поля для позначок, де можна позначати декілька пунктів одночасно](/docs/getting-started/kirigami/components-controls/controls-checkbox.webp)

source: As you can see, they are simple to use. The [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) property holds a boolean value determining whether or not they have been checked.
ca: Com podeu veure, són fàcils d'utilitzar. La propietat [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) manté un valor booleà que determina si s'ha marcat o no.
eo: Kiel vi povas vidi, ili estas simplaj uzeblaj. La [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) propreco tenas bulean valoron determinantan ĉu aŭ ne ili estis kontrolitaj.
es: Como puede ver, son fáciles de usar. La propiedad [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) tiene un valor booleano que determina si se han marcado o no.
nl: Zoals u kunt zien zijn ze eenvoudig te gebruiken. De eigenschap [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) bevat een booleaanse waarde die bepaalt of ze wel of niet geactiveerd zijn.
pt: Como poderá ver, são simples de usar. A propriedade [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) guarda um valor booleano que determina se estavam ou não assinaladas.
sl: Kot vidite, so preprosti za uporabo. Lastnost [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) ima boolovo vrednost, ki določa, ali so bili potrjeni ali ne.
sv: Som du kan se, är de enkla att använda. Egenskapen [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) innehåller ett Booleskt värde bestämmer om de har markerats eller inte.
uk: Як можна бачити, ними просто користуватися. Властивість [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) містить булеве значення, що визначає, чи було пункт позначено.

source: Radio buttons
ca: Botons d'opció
eo: Radiobutonoj
es: Botones de opción
fr: Boutons radio
nl: Keuzerondjes
pl: Przyciski radio
pt: Opções exclusivas
sl: Radijski gumbi
sv: Alternativknappar
uk: Кнопки варіантів

source: A [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) is designed for situations where the user must choose one option from a set of several options.
ca: Un [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) està dissenyat per a situacions en què l'usuari ha de triar una opció d'entre un conjunt d'opcions diverses.
eo: [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) estas desegnita por situacioj kie la uzanto devas elekti unu opcion el aro de pluraj elektebloj.
es: Un [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) está diseñado para situaciones en las que el usuario debe elegir una opción de un conjunto de varias opciones.
nl: Een [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) is ontworpen voor situaties waar de gebruiker één optie uit een set van verschillende opties moet kiezen.
pt: Um [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) é desenhado para situações em que o utilizador deverá escolher uma única opção a partir de um conjunto de várias opções.
sl: Radijski gumb [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) je zasnovan za situacije, ko mora uporabnik izbrati eno možnost iz velikega nabora možnosti.
sv: En [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) är konstruerade för situationer där användaren måste välja ett alternativ från en uppsättning av flera alternativ.
uk: [Controls.RadioButton](docs:qtquickcontrols;QtQuick.Controls.RadioButton) призначено для випадків, коли користувач має вибрати варіант із набору з декількох варіантів.

source: Radio buttons are exclusive by default: only one button can be checked in the same parent item.
ca: De manera predeterminada, els botons d'opció són exclusius: només en el mateix element pare només se'n pot marcar un.
eo: Radiobutonoj estas defaŭlte ekskluzivaj: nur unu butono povas esti markita en la sama gepatra ero.
es: Los botones de opción son mutuamente exclusivos de forma predeterminada: solo se puede marcar un botón del mismo elemento principal.
fr: Les boutons radio sont exclusifs par défaut : un seul bouton peut être coché dans le même élément parent.
nl: Keuzerondjes zijn standaard exclusief: slechts één knop kan geactiveerd zijn in hetzelfde hoofditem.
pl: Przyciski radio są domyślnie wykluczające: można zaznaczyć tylko jeden przycisk, z przycisków należących do tej samej rzeczy nadrzędnej.
pt: Estes botões são exclusivos por omissão: só um deles poderá estar assinalado no mesmo item-pai.
sl: Radijski gumbi so privzeto izključujoči: v istem nadrejenem elementu je mogoče potrditi samo en gumb.
sv: Alternativknappar är normalt exklusiva: bara en knapp i samma överliggande objekt kan markeras.
uk: Кнопки варіантів є типово взаємно виключними: одночасно у батьківському елементі може бути позначено лише одну кнопку.

source: Like checkboxes, they can be set to be checked or unchecked by default with the [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) property.
ca: Igual que les caselles de selecció, es poden establir perquè estiguin marcats o desmarcats de manera predeterminada amb la propietat [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
eo: Kiel markobutonoj, ili povas esti agorditaj por esti markitaj aŭ malmarkitaj defaŭlte kun la [markita](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop) propreco.
es: Al igual que las casillas de verificación, se pueden configurar para que estén marcados o desmarcados de forma predeterminada con la propiedad [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
nl: Net als keuzevakjes kunnen ze standaard op geactiveerd of niet-geactiveerd gezet worden met de eigenschap [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
pt: Como as opções de marcação, poderão estar assinalados ou não por omissão com a propriedade [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
sl: Tako kot potrditvena polja jih je mogoče nastaviti, da jih je mogoče privzeto nastaviti na potrjeno ali nepotrjeno z lastnostjo [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
sv: Liksom kryssrutor kan de ställas in att vara markerade eller avmarkerade som förval med egenskapen [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
uk: Подібно до кнопок-позначок, для них можна типово встановити стан позначеності або непозначеності за допомогою властивості [checked](https://doc.qt.io/qt-6/qml-qtquick-controls2-abstractbutton.html#checked-prop).
