Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [KDE Apps page](https://apps.kde.org/licentia/)<br />[KDE Invent page](https://invent.kde.org/sdk/licentia)
ca: [Pàgina de KDE Apps](https://apps.kde.org/licentia/)<br />[Pàgina de KDE Invent](https://invent.kde.org/sdk/licentia)
eo: [KDE Apps-paĝo](https://apps.kde.org/licentia/)<br />[KDE Invent-paĝo](https://invent.kde.org/sdk/licentia)
es: [Página de KDE Apps](https://apps.kde.org/licentia/)<br />[Página de KDE Invent](https://invent.kde.org/sdk/licentia)
nl: [KDE Apps pagina](https://apps.kde.org/licentia/)<br />[KDE Invent pagina](https://invent.kde.org/network/sdk/licentia)
pt: [Página de Aplicações do KDE](https://apps.kde.org/licentia/)<br />[Página do KDE Invent](https://invent.kde.org/sdk/licentia)
sv: [KDE-programsida](https://apps.kde.org/licentia/)<br />[KDE Invent-sida](https://invent.kde.org/sdk/licentia)
uk: [Сторінка на KDE Apps](https://apps.kde.org/licentia/)<br />[Сторінка на KDE Invent](https://invent.kde.org/sdk/licentia)

source: A welcome app for the Plasma desktop that lets you create new pages with QML.
ca: Una aplicació de benvinguda per a l'escriptori Plasma que permet crear pàgines noves amb el QML.
eo: Bonvena aplikaĵo por la Plasma labortablo, kiu ebligas al vi krei novajn paĝojn kun QML.
es: Una aplicación de bienvenida para el escritorio Plasma que le permite crear nuevas páginas con QML.
nl: Een toepassing voor welkom voor het Plasma bureaublad die u nieuwe pagina's laat maken met QML.
pt: Uma aplicação de boas-vindas para o ambiente de trabalho Plasma que lhe permite criar páginas novas com QML.
sl: Aplikacija dobrodošlice za namizje Plasma, ki vam omogoča ustvarjanje novih strani s QML.
sv: Ett välkomstprogram för Plasma-skrivbordet som låter dig skapa nya sidor med QML.
uk: Вітальна програма стільниці Плазми, яка надає вам змогу створювати сторінки за допомогою QML.

source: [KDE Invent page](https://invent.kde.org/plasma/plasma-welcome)
ca: [Pàgina de KDE Invent](https://invent.kde.org/plasma/plasma-welcome)
eo: [KDE Invent-paĝo](https://invent.kde.org/plasma/plasma-welcome)
es: [Página de KDE Invent](https://invent.kde.org/plasma/plasma-welcome)
nl: [KDE Invent pagina](https://invent.kde.org/plasma/plasma-welcome)
pt: [Página do KDE Invent](https://invent.kde.org/plasma/plasma-welcome)
sv: [KDE Invent-sida](https://invent.kde.org/plasma/plasma-welcome)
uk: [Сторінка на KDE Invent](https://invent.kde.org/plasma/plasma-welcome)

source: More complex Kirigami projects
ca: Projectes més complexos escrits amb el Kirigami
eo: Pli kompleksaj Kirigami-projektoj
es: Proyectos de Kirigami más complejos
fr: Des projets Kirigami plus complexes
nl: Complexere Kirigami projecten
pl: Bardziej złożone projekty Kirigami
pt: Projectos do Kirigami mais complexos
sl: Kompleksnejši projekti Kirigami
sv: Mer komplexa projekt med Kirigami
uk: Складніші проєкти на Kirigami

source: An application that helps you find and install applications, games, and tools.
ca: Una aplicació que ajuda a trobar i instal·lar les aplicacions, jocs i eines.
eo: Apliko, kiu helpas vin trovi kaj instali aplikaĵojn, ludojn kaj ilojn.
es: Una aplicación que le ayuda a encontrar e instalar aplicaciones, juegos y herramientas.
fr: Une application vous aidant à trouver et à installer des applications, des jeux et des outils.
nl: Een toepassing die u helpt bij het vinden en installeren van toepassingen, spellen en hulpmiddelen.
pl: Aplikacja, która pomaga ci w szukaniu i wgrywaniu aplikacji, gier oraz narzędzi.
pt: Uma aplicação que o ajuda a descobrir e instalar as aplicações, jogos e ferramentas.
sl: Aplikacija, ki vam pomaga najti in namestiti aplikacije, igre in orodja.
sv: Ett program som hjälper dig hitta och installera program, spel och verktyg.
uk: Програма, яка допоможе вам знаходити і встановлювати програми, ігри та робочі інструменти.

source: [KDE Apps page](https://apps.kde.org/discover)<br />[KDE Invent page](https://invent.kde.org/plasma/discover)
ca: [Pàgina de KDE Apps](https://apps.kde.org/discover/)<br />[Pàgina de KDE Invent](https://invent.kde.org/plasma/discover)

source: A music player that strives to be simple and nice to use.
ca: Un reproductor de música que s'esforça a ser senzill i agradable d'emprar.
eo: Muzikludanto kiu klopodas esti simpla kaj agrabla uzi.
es: Un reproductor de música que se esfuerza por ser sencillo y agradable de usar.
fr: Un lecteur de musique s'efforçant d'être simple et agréable à utiliser.
nl: Een muziekspeler met het streven om eenvoudig en fijn in gebruik te zijn.
pl: Odtwarzacz muzyki, który stara się być prostym i przyjemnym w użyciu.
pt: Um leitor de música cujo objectivo é ser simples e agradável de usar.
sl: Glasbeni predvajalnik, ki si prizadeva biti preprost in prijazen za uporabo.
sv: En musikspelare som försöker vara enkel och trevlig att använda.
uk: Проста і приємна у користуванні програма для відтворення музики.

source: [Home page](https://elisa.kde.org/)<br />[KDE Apps page](https://apps.kde.org/elisa)<br />[KDE Community Wiki page](https://community.kde.org/KDEConnect)<br />[KDE Invent page](https://invent.kde.org/multimedia/elisa)
ca: [Pàgina inicial](https://elisa.kde.org/)<br />[Pàgina de KDE Apps](https://apps.kde.org/elisa)<br />[Pàgina wiki de la comunitat KDE](https://community.kde.org/KDEConnect)<br />[Pàgina de KDE Invent](https://invent.kde.org/multimedia/elisa)

source: A multi-platform app that allows your devices to communicate (eg: your phone and your computer).
ca: Una aplicació multiplataforma que permet que els dispositius es comuniquin (p. ex., el telèfon i l'ordinador).
eo: Plurplatforma aplikaĵo, kiu ebligas al viaj aparatoj komuniki (ekz.: via telefono kaj via komputilo).
es: Una aplicación multiplataforma que permite que sus dispositivos se comuniquen entre sí (por ejemplo, su teléfono móvil y su computadora).
fr: Une application multi-plate-forme permettant à vos appareils de communiquer (par exemple, votre téléphone et votre ordinateur).
nl: Een multi-platform toepassing die uw apparaten met elkaar laat communiceren (bijv.: uw telefoon en uw computer)
pl: Wieloplatformowa aplikacja, która umożliwia twoim urządzeniom porozumiewanie się (np. twojemu telefonowi z komputerem).
pt: Uma aplicação multi-plataforma que permite aos seus dispositivos comunicarem entre si (p.ex.: o seu telefone e o seu computador).
sl: Aplikacija na več platformah, ki omogoča komuniciranje vaših naprav (npr. telefon in računalnik).
sv: Ett program för flera plattformar som låter dina apparater kommunicera (t.ex. din telefon och din dator).
uk: Багатоплатформова програма, за допомогою якої пристрої (наприклад ваш телефон і комп'ютер) можуть обмінюватися даними

source: [Home page](https://kdeconnect.kde.org/)<br />[KDE Community Wiki page](https://community.kde.org/KDEConnect)<br />[KDE Invent page](https://invent.kde.org/network/kdeconnect-kde)
ca: [Pàgina inicial](https://kdeconnect.kde.org/)<br />[Pàgina wiki de la comunitat KDE](https://community.kde.org/KDEConnect)<br />[Pàgina de KDE Invent](https://invent.kde.org/network/kdeconnect-kde)
eo: [Hejmpaĝo](https://kdeconnect.kde.org/)<br />[KDE Community Wiki-paĝo](https://community.kde.org/KDEConnect)<br />[KDE Invent-paĝo](https ://invent.kde.org/network/kdeconnect-kde)
es: [Página web](https://kdeconnect.kde.org/)<br />[Página wiki de KDE Community](https://community.kde.org/KDEConnect)<br />[Página de KDE Invent](https://invent.kde.org/network/kdeconnect-kde)
fr: [Page d'accueil](https://kdeconnect.kde.org/)<br />[Page de wiki de la communauté KDE](https://community.kde.org/KDEConnect)<br />[Page de KDE Invent](https://invent.kde.org/network/kdeconnect-kde)
nl: [Homepagina](https://kdeconnect.kde.org/)<br />[KDE Community Wiki-pagina](https://community.kde.org/KDEConnect)<br />[KDE Invent pagina](https://invent.kde.org/network/kdeconnect-kde)
pl: [Strona domowa](https://kdeconnect.kde.org/)<br />[Strona Wiki Społeczności KDE](https://community.kde.org/KDEConnect)<br />[Strona KDE Invent](https://invent.kde.org/network/kdeconnect-kde)
pt: [Página Web](https://kdeconnect.kde.org/)<br />[Página da Wiki da Comunidade do KDE](https://community.kde.org/KDEConnect)<br />[Página do KDE Invent](https://invent.kde.org/network/kdeconnect-kde)
sl: [Domača stran](https://kdeconnect.kde.org/)<br />[Wiki stran KDE Skupnosti](https://community.kde.org/KDEConnect)<br />[KDE Invent page](https://invent.kde.org/network/kdeconnect-kde)
sv: [Hemsida](https://kdeconnect.kde.org/)<br />[KDE-gemenskapens wiki page](https://community.kde.org/KDEConnect)<br />[KDE Invent-sida](https://invent.kde.org/network/kdeconnect-kde)
uk: [Домашня сторінка](https://kdeconnect.kde.org/)<br />[Сторінка у вікі спільноти KDE](https://community.kde.org/KDEConnect)<br />[Сторінка на KDE Invent](https://invent.kde.org/network/kdeconnect-kde)

source: A companion application for conference attendees.
ca: Una aplicació auxiliar per als assistents a congressos.
eo: Akompana aplikaĵo por kongresanoj.
es: Una aplicación complementaria para los asistentes a conferencias.
fr: Une application complémentaire pour les personnes participants à la conférence.
nl: Een compagnon-toepassing voor deelnemers aan conferenties.
pl: Aplikacja towarzysząca dla uczestników konferencji.
pt: Uma aplicação de acompanhamento de participantes em conferências.
sl: Spremljevalna aplikacija za udeležence konferenc.
sv: Ett kompanjonprogram för konferensdeltagare.
uk: Програма-компаньйон для відвідувачів конференцій.

source: [KDE Invent page](https://invent.kde.org/utilities/kongress)
ca: [Pàgina de KDE Invent](https://invent.kde.org/utilities/kongress)
eo: [KDE Invent-paĝo](https://invent.kde.org/utilities/kongress)
es: [Página de KDE Invent](https://invent.kde.org/utilities/kongress)
fr: [Page de KDE Invent](https://invent.kde.org/utilities/kongress)
nl: [KDE Invent pagina](https://invent.kde.org/utilities/kongress)
pl: [Strona KDE Invent](https://invent.kde.org/utilities/kongress)
pt: [Página do KDE Invent](https://invent.kde.org/utilities/kongress)
sl: [Stran Invent KDE](https://invent.kde.org/utilities/kongress)
sv: [KDE Invent-sida](https://invent.kde.org/utilities/kongress)
uk: [Сторінка на KDE Invent](https://invent.kde.org/utilities/kongress)

source: A client for Matrix, the decentralized communication protocol for instant messaging.
ca: Un client per al Matrix, el protocol de comunicacions descentralitzat per a missatgeria instantània.
eo: Kliento por Matrix, la malcentralizita komunika protokolo por tujmesaĝilo.
es: Un cliente para Matrix, el protocolo de comunicación descentralizada para mensajería instantánea.
fr: Un client pour « Matrix », le protocole décentralisé de communications pour messagerie instantanée.
nl: Een client voor Matrix, het gedecentraliseerde communicatieprotocol voor Instant Messaging.
pl: Program dla Matriksa, rozproszonego protokołu do rozmów.
pt: Um cliente para o Matrix, o protocolo descentralizado de comunicações de mensagens instantâneas.
sl: Odjemalec za Matrix, decentraliziran komunikacijski protokol za neposredno sporočanje.
sv: En klient för Matrix, det decentraliserade kommunikationsprotokollet för direktmeddelanden.
uk: Клієнт для Matrix — децентралізованого протоколу обміну даними для миттєвого обміну повідомленнями.

source: [KDE Apps page](https://apps.kde.org/neochat)<br />[KDE Invent page](https://invent.kde.org/network/neochat)
ca: [Pàgina de KDE Apps](https://apps.kde.org/neochat)<br />[Pàgina de KDE Invent](https://invent.kde.org/network/neochat)

source: Learning more
ca: Aprendre més
eo: Lerni pli
es: Más información
fr: En apprendre plus
nl: Meer te weten komen
pl: Więcej nauki
pt: Aprender mais
sl: Spoznati več
sv: Ta reda på mer
uk: Подальше навчання

source: Not feeling quite ready yet? That's okay too.
ca: Encara no us sentiu preparat? Això també està bé.
eo: Ĉu vi ankoraŭ ne sentas sin tute preta? Ankaŭ tio estas en ordo.
es: ¿Aún no se siente preparado? Eso también está bien.
fr: Vous ne vous sentez pas encore tout à fait prêt ? Ce n'est pas grave non plus.
nl: Zich nog niet geheel klaar voelen? Dat is ook okee.
pl: Nie czujesz się jeszcze gotowy? Też dobrze.
pt: Ainda não se sente muito preparado? Está tudo bem à mesma.
sl: Se še ne počutite pripravljeni? Tudi to je v redu.
sv: Känner du dig inte helt redo ännu? Det är också okej.
uk: Почуваєтеся ще неготовими? Гаразд.

source: Many of the projects listed above are invaluable learning resources. You can poke through the code and see how experienced developers have created fully-featured applications, and use these techniques yourself.
ca: Molts dels projectes llistats anteriorment són recursos d'aprenentatge de valor inestimable. Podeu consultar el codi i veure com els desenvolupadors experimentats han creat aplicacions amb totes les característiques i utilitzar vós mateix aquestes tècniques.
eo: Multaj el la projektoj listigitaj supre estas valoregaj lernaj rimedoj. Vi povas trapiki la kodon kaj vidi kiel spertaj programistoj kreis plene elstarajn aplikojn, kaj uzi ĉi tiujn teknikojn mem.
es: Muchos de los proyectos enumerados anteriormente son recursos de aprendizaje invaluables. Puede hojear el código y ver cómo los desarrolladores experimentados han creado aplicaciones con todas su funcionalidad y usar estas técnicas usted mismo.
fr: De nombreux projets listés ci-dessus constituent des ressources d'apprentissage inestimables. Vous pouvez parcourir le code et voir comment des développeurs expérimentés ont créé des applications complètes et utiliser ces techniques vous-même.
nl: Veel van de projecten in de bovenstaande lijsten zijn waardevolle bronnen van kennis. U kunt er door de code lopen en zien hoe ervaren ontwikkelaars toepassingen hebben gemaakt vol met allerlei functies en deze technieken zelf gebruiken.
pl: Wiele wyżej wymienionych projektów jest cennymi źródłami do nauki. Możesz podejrzeć w ich kodzie jak doświadczeni programiści stworzyli pełnowartościowe aplikacje i skorzystać z ich technik w swojej aplikacji.
pt: Muitos dos projectos aqui indicados são fontes valiosas de recursos de aprendizagem. Poderá navegar pelo código e ver como os programadores avançados criaram aplicações plenas de funcionalidades e usar você mesmo essas técnicas.
sl: Številni zgoraj našteti projekti so neprecenljivi učni viri. Lahko se prebijate skozi kodo in si ogledate, kako so izkušeni razvijalci ustvarili aplikacije z veliko možnostmi in uporabite te tehnike tudi sami.
sv: Många av projekten som listas ovan är ovärderliga resurser för upplärning. Du kan gå igenom koden och se hur erfarna utvecklare har skapat program med fullständiga funktioner, och använda teknikerna själv.
uk: Багато із наведених вище проєктів є безцінними ресурсами для навчання. Ви можете ознайомлюватися із кодом і вчитися у досвідчених розробників тому, як створювати повнофункціональні програми, а також користуватися їхніми методиками у своїх програмах.

source: If you feel you need a more gentle approach, we have also compiled some resources we think you might find useful.
ca: Si creieu que us cal un enfocament més suau, també hem recopilat alguns recursos que creiem que poden resultar-vos útils.
eo: Se vi sentas, ke vi bezonas pli mildan aliron, ni ankaŭ kompilis kelkajn rimedojn, kiujn ni opinias, ke vi eble trovos utilaj.
es: Si cree que necesita un enfoque más ligero, también hemos recopilado algunos recursos que creemos que pueden resultarle útiles.
fr: Si vous pensez avoir besoin d'une approche plus douce, nous avons également compilé quelques ressources pouvant vous être utiles.
nl: Als u de noodzaak voelt dat u een meer geleidelijke benadering nodig hebt, dan hebben we ook enige hulpbronnen samengesteld waarvan we denken dat u ze nuttig zou kunnen vinden.
pl: Jeśli wydaje ci się, że potrzebujesz bardziej delikatnego podejścia, to przygotowaliśmy także pewne zasoby, które mogą wydać ci się użyteczne.
pt: Se acha que precisa de uma abordagem mais suave, também compilámos alguns recursos que pensamos que poderá achar úteis.
sl: Če se vam zdi, da potrebujete bolj nežen pristop, smo pripravili tudi nekaj virov, za katere mislimo, da bi se vam zdeli koristni.
sv: Om du känner att du behöver ett mer skonsamt tillvägagångssätt, har vi också sammanställt några resurser som vi tror du kan finna användbara.
uk: Якщо такий підхід здається вам надто агресивним, ми зібрали деякі додаткові ресурси, які можуть видатися вам корисними.

source: The backend and C++
ca: El dorsal i C++
eo: La backend kaj C++
es: El motor y C++
fr: Le moteur et C++
nl: De backend en C++
pl: Silnik oraz C++
pt: A infra-estrutura e o C++
sl: Zaledje in C++
sv: Bakgrundskoden och C++
uk: Модуль обробки і C++

source: While we have learned a lot about QML, we haven't really touched upon how to handle backend code all that much. This is, however, an essential facet of KDE application development.
ca: Si bé hem après molt sobre QML, no hem parlat gaire sobre com gestionar el codi del dorsal. No obstant això, aquesta és una faceta essencial del desenvolupament de les aplicacions KDE.
eo: Dum ni lernis multon pri QML, ni ne vere tuŝis kiel pritrakti malantaŭan kodon tiom multe. Ĉi tio tamen estas esenca aspekto de KDE-aplik-evoluo.
es: Aunque hemos aprendido mucho sobre QML, apenas hemos hablado sobre cómo manejar el código del motor. Sin embargo, esta es una faceta esencial del desarrollo de aplicaciones de KDE.
fr: Si nous avons beaucoup appris sur QML, nous n'avons pas vraiment abordé la question de la gestion du code pour le moteur. Il s'agit pourtant d'une facette essentielle du développement d'applications pour KDE.
nl: Terwijl we heel wat geleerd hebben over QML, hebben we niet echt behandelt hoe de code van de backend in elkaar steekt. Dit is, echter, een essentieel facet van de ontwikkeling van een KDE toepassing.
pl: Podczas gdy nauczyliśmy się wiele o QML, to nie dowiedzieliśmy się właściwie niczego nt. tego jak napisać kod silnika. Jest to jednak istotna cecha rozwoju aplikacji KDE.
pt: Embora tenhamos aprendido bastante sobre o QML, ainda não vimos realmente como lidar com o código de infra-estrutura em particular. Esta é, contudo, uma faceta essencial do desenvolvimento de aplicações do KDE.
sl: Medtem ko smo se naučili veliko o QML, se nismo zares dotaknili, kako kaj več ravnati več z zaledno kodo. To pa je bistveni vidik razvoja aplikacij KDE.
sv: Även om vi har lärt oss en hel del om QML, har vi inte egentligen berört hur man hanterar bakgrundskod i så stor utsträckning. Det är dock en väsentlig aspekt när det gäller utveckling av KDE-program.
uk: Хоча ми доволі багато обговорювали QML, ми, насправді, не чіпали питань, що стосуються того, як працювати з кодом модуля обробки. Втім, це ключовий момент розробки програм KDE.

source: C++/Qt with Kirigami
ca: C++/Qt amb el Kirigami
eo: C++/Qt kun Kirigami
es: C++/Qt con Kirigami
fr: C++ / Qt avec Kirigami
nl: C++/Qt met Kirigami
pl: C++/Qt z Kirigami
pt: C++/Qt com o Kirigami
sl: C++/Qt s Kirigamijem
sv: C++/Qt med Kirigami
uk: C++/Qt з Kirigami

source: In the advanced section of this Kirigami documentation we have some pages that can help you get started:
ca: A la secció avançada d'aquesta documentació de Kirigami, tenim algunes pàgines que poden ajudar-vos a començar:
eo: En la progresinta sekcio de ĉi tiu Kirigami-dokumentado ni havas kelkajn paĝojn, kiuj povas helpi vin komenci:
es: En la sección avanzada de esta documentación de Kirigami tenemos algunas páginas que pueden ayudarle a empezar:
fr: Dans la section avancée de cette documentation de Kirigami, nous avons quelques pages pouvant vous aider à débuter :
nl: In de sectie geavanceerd van deze Kirigami documentatie hebben we enige pagina's die u kunnen helpen om te beginnen:
pl: W rozszerzonej części tej dokumentacji Kirigami mami kilka stron, które pomogą postawić ci pierwsze kroki:
pt: Na secção avançada desta documentação do Kirigami, temos algumas páginas que o poderão ajudar a começar:
sl: V naprednem delu te Kirigami dokumentacije imamo nekaj strani, ki vam lahko pomagajo pri prvih korakih:
sv: Vi har några sidor som kan hjälpa dig att komma igång i den avancerade Kirigami-dokumentationen:
uk: У розділі додаткових відомостей цієї документації до Kirigami міститься декілька сторінок, які допоможуть вам на початковому етапі:

source: Topic
ca: Tema
eo: Temo
es: Tema
fr: Sujet
nl: Onderwerp
pl: Temat
pt: Tópico
sl: Tema
sv: Ämne
uk: Тема

source: [Understanding CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
ca: [Entendre les CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
eo: [Komprenante CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
es: [Entendiendo CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
nl: [CMakeLists begrijpen](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
pt: [Compreender as CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
sl: [Razumevanje CMakeLists](/docs/kirigami/advanced-understanding_cmakelists)
sv: [Förstå CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)
uk: [Розбираємося з CMakeLists](/docs/getting-started/kirigami/advanced-understanding_cmakelists)

source: Learn all about CMake and how to compile your applications.
ca: Aprendre-ho tot sobre CMake i com compilar les vostres aplicacions.
eo: Lernu ĉion pri CMake kaj kiel kompili viajn aplikojn.
es: Conozca todo sobre CMake y cómo compilar sus aplicaciones.
fr: Apprenez tout sur « CMake » et sur comment compiler vos applications.
nl: Leer alles over CMake en hoe uw toepassingen te compileren.
pl: Dowiedz się wszystkiego o CMake i o tym jak budować swoje aplikacje.
pt: Aprenda tudo sobre o CMake e como compilar as suas aplicações.
sl: Izvedite več o CMake in o tem, kako prevajati svoje aplikacije.
sv: Lär dig allt om CMake och hur program kompileras.
uk: Вивчаємо усі аспекти CMake і вчимося збирати програми.

source: [Figuring out main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
ca: [Descobrir el main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
eo: [Eltrovi main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
es: [Entendiendo main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
nl: [Begrijpen van main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
pt: [Descobrir o main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
sl: [Ugotavljanje main.cpp](/docs/kirigami/advanced-maincpp)
sv: [Förstå sig på main.cpp](/docs/getting-started/kirigami/advanced-maincpp)
uk: [Розбираємося у main.cpp](/docs/getting-started/kirigami/advanced-maincpp)

source: Getting to grips with the central C++ file that handles your application's initialisation.
ca: Comprendre el fitxer en C++ central que gestiona la inicialització de la vostra aplicació.
eo: Ekkompreni la centran C++-dosieron, kiu pritraktas la inicialigon de via aplikaĵo.
es: Familiarizándose con el archivo de C++ central que maneja la inicialización de sus aplicaciones.
nl: Greep krijgen op het centrale C++ bestand dat de initialisatie van uw toepassing behandeld.
pt: Colocar as mãos na massa com o ficheiro de C++ central que lida com a inicialização das suas aplicações.
sl: Dojemanje pomena osrednje datoteke C++, ki obravnava inicializacijo programov.
sv: Förstå sig på den centrala C++ filen som hanterar programmens initiering.
uk: Знайомимося із центральним файлом мовою C++, який керуватиме ініціалізацією програм.
