Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: While a [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) displays global actions available throughout your application, a [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) should be used to display actions that are only relevant in certain contexts. This is usually used in separate [pages](/docs/getting-started/kirigami/introduction-pages).
ca: Mentre un [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) mostra les accions globals disponibles a tota la vostra aplicació, un [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) s'ha d'utilitzar per a mostrar accions que només són rellevants en determinats contextos. Normalment s'utilitza en [pàgines](/docs/getting-started/kirigami/introduction-pages) separades.
sl: Medtem ko globalni predal [Kirigami.GlobalDrawer](https://api-staging.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop) prikazuje globalne dejavnosti čez celotno vašo aplikacijo, naj bi bil kontekstni predal [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) uporabljen za prikaz dejavnosti, ki so relevantne samo v določenih kontekstih. To je ponavadi uporabljeno v ločenih straneh [pages]/docs/getting-started/kirigami/introduction-pages).

source: <!-- TODO: mention actions -->
ca: <!-- PER FER: menció d'accions -->
sl: <!-- ZA NAREDITI: omeniti dejavnosti -->

source: A context drawer will behave differently depending on whether it is being used on a mobile platform or on a desktop.
ca: Un calaix contextual es comportarà de manera diferent depenent de si s'està utilitzant en una plataforma mòbil o en un escriptori.
sl: Kontekstni predal se bo obnašal različno, odvisno od tega, ali se uporablja na mobilni platformi ali na namiznem računalniku.

source: On a desktop, when a window has enough space, contextual actions show up as part of the [actions](https://api.kde.org/qml-org-kde-kirigami-contextdrawer.html#actions-prop) group in the top toolbar. When space is limited, such as on a mobile device or in a narrow window, contextual actions are hidden behind a hamburger menu on the right side. This is different from other actions in the `actions` group, namely `actions.main`, `actions.left` and `actions.right`; these do not get hidden in space-constrained windows, and are instead collapsed into their respective icons.
ca: En un escriptori, quan una finestra té prou espai, les accions contextuals es mostren com a part del grup [actions](https://api.kde.org/qml-org-kde-kirigami-contextdrawer.html#actions-prop) a la barra d'eines superior. Quan l'espai és limitat, com en un dispositiu mòbil o en una finestra estreta, les accions contextuals s'oculten darrere d'un menú d'hamburguesa al costat dret. Això és diferent d'altres accions en el grup `actions`, concretament `actions.main`, `actions.left` i `actions.right`; aquestes no s'ocultaran en les finestres restringides per espais, i en el seu lloc es reduiran en les seves icones respectives.

source: Context drawer with contextual actions hidden
ca: Calaix contextual amb accions contextuals ocultes
eo: Kunteksta tirkesto kun kontekstaj agoj kaŝitaj
es: Cajón de contexto con acciones de contexto ocultas
nl: Contextschuiflade met contextuele verborgen acties
pt: Área de contexto com as acções de contexto escondidas
sl: Kontekstni predal s skritimi kontekstnimi dejanji
sv: Sammanhangslåda med sammanhangsberoende åtgärder dolda
uk: Контекстна висувна панель із прихованими контекстними пунктами дій

source: Context drawer showing all contextual actions
ca: Calaix contextual que mostra totes les accions contextuals
eo: Kunteksta tirkesto montranta ĉiujn kontekstajn agojn
es: Cajón de contexto mostrando todas las acciones de contexto
nl: Contextschuiflade die contextuele acties toont
pt: Área de contexto a mostrar todas as acções de contexto
sl: Kontekstni predal, ki prikazuje vsa kontekstnima dejanja
sv: Sammanhangslåda som visar alla sammanhangsberoende åtgärder
uk: Контекстна висувна панель із показаними усіма контекстними пунктами дій

source: On mobile, the drawer always consists of actions hidden behind a hamburger menu. It can be activated by tapping the hamburger menu or by swiping from the right edge to the middle of the screen in Left to Right mode or from the left edge in Right to Left mode.
ca: Al mòbil, el calaix sempre consisteix en accions ocultes darrere d'un menú d'hamburguesa. Es pot activar tocant el menú d'hamburguesa o lliscant des de la vora dreta al centre de la pantalla en el mode d'esquerra a dreta o des de la vora esquerra en el mode de dreta a esquerra.
eo: Sur poŝtelefono, la tirkesto ĉiam konsistas el agoj kaŝitaj malantaŭ hamburgera menuo. Ĝi povas esti aktivigita frapante la hamburgeran menuon aŭ svingante de la dekstra rando al la mezo de la ekrano en Maldekstre al Dekstra reĝimo aŭ de la maldekstra rando en Dekstre al Maldekstra reĝimo.
nl: Op een mobiel bevat de schuiflade altijd acties verborgen achter een hamburgermenu. Het kan geactiveerd worden door op het hamburgermenu te tikken of door vegen van de rechter rand naar het midden van het scherm in modus Links-naar-rechts of vanaf de linker rand in modus Rechts-naar-links.
sl: Na mobilni napravi je predal vedno sestavljen iz dejanj, skritih za hamburger menijem. Aktivirate ga lahko tako, da se dotaknete hamburger menija ali povlečete od desnega roba do sredine zaslona v načinu od leve proti desni ali od levega roba v načinu od desne proti levi.
sv: På en mobil består lådan alltid av åtgärder dolda bakom en hamburgermeny. Den kan aktiveras genom att röra vid hamburgermenyn eller genom att svepa från vänster kant till mitten av skärmen i vänster till höger-läge eller från höger kant i höger till vänster-läge.
uk: На мобільних пристроях висувна панель завжди складається з пунктів дій, які сховано під меню-гамбургером. Її можна активувати натисканням кнопки меню-гамбургера або проведенням пальцем від правого краю до середини екрана у режимі зліва праворуч або від лівого краю у режимі справа ліворуч.

source: Same example above, running in mobile mode
ca: El mateix exemple anterior, executant-se en mode de mòbil
eo: Sama ekzemplo supre, funkciante en movebla reĝimo
es: El mismo ejemplo anterior, ejecutado en modo móvil
nl: Zelfde als bovenstaand voorbeeld, uitgevoerd in modus mobiel
pt: O mesmo exemplo acima, a correr num dispositivo móvel
sl: Isti primer zgoraj pognan v mobilnem načinu
sv: Samma exempel som ovan, men på en mobil
uk: Той самий приклад, що і вище, але у режимі мобільного пристрою

source: Context drawer open in mobile mode
ca: Calaix contextual obert en mode de mòbil
eo: Kunteksta tirkesto malfermita en movebla reĝimo
es: Cajón de contexto abierto en modo móvil
nl: Contextschuiflade open in modus mobiel
pt: Área de contexto aberta no modo para dispositivos móveis
sl: Kontekstni predal odprt v mobilnem načinu
sv: Sammanhangslåda öppen på mobil
uk: Відкрита контекстна висувна панель у режимі мобільного пристрою

source: Modal and Inline drawers
ca: Calaixos modals i inclosos
eo: Modalaj kaj Enliniaj tirkestoj
es: Cajones modales y en línea
fr: Tiroirs modaux et intégrés
nl: Modale en inline schuifladen
pl: Półki modalne i w wierszu
pt: Áreas Modais e Incorporadas
sl: Modalni in znotrajvrstični predali
sv: Modala lådor och lådor på plats
uk: Модальні і вбудовані панелі

source: Kirigami offers two additional types of drawers, modal drawers and inline drawers. They are quite similar to each other: both span the entirety of the application's width or height and can be placed on the edges of the app window. However, they do react differently to user interaction.
ca: El Kirigami ofereix dos tipus addicionals de calaixos: calaixos modals i calaixos inclosos. Són força similars entre si: ambdós abasten la totalitat de l'amplada o alçada de l'aplicació, i es poden col·locar a les vores de la finestra de l'aplicació. No obstant això, reaccionen de manera diferent de la interacció de l'usuari.
eo: Kirigami ofertas du pliajn specojn de kestoj, modalaj kestoj kaj enliniaj kestoj. Ili estas sufiĉe similaj unu al la alia: ambaŭ ampleksas la tuton de la larĝo aŭ alteco de la aplikaĵo kaj povas esti metitaj sur la randojn de la aplika fenestro. Tamen, ili ja reagas alimaniere al uzantinterago.
es: Kirigami ofrece dos tipos adicionales de cajones: modales y en línea. Los dos son bastante similares: ambos se extienden por la totalidad de la anchura o de la altura de la aplicación y se pueden situar en los bordes de la ventana de la aplicación. No obstante, reaccionan de forma diferente a la interacción del usuario.
fr: Kirigami propose deux autres types de tiroirs, les tiroirs modaux et les tiroirs intégrés. Ils sont assez semblables l'un à l'autre. Tous deux s'étendent sur toute la largeur ou la hauteur de l'application et peuvent être placés sur les bords de la fenêtre de l'application. Cependant, ils réagissent différemment lors d'une interaction avec l'utilisateur.
nl: Kirigami biedt twee extra typen schuifladen, modale schuifladen en inline schuifladen. Ze tamelijk gelijk aan elkaar: beiden overspannen de gehele breedte of hoogte van de toepassing en kunnen aan de randen van het toepassingsvenster geplaatst worden. Ze reageren echter verschillend op interactie met de gebruiker.
pl: Kirigami daje dwa dodatkowe rodzaje półek, półki modalne oraz w wierszu. Są do siebie całkiem podobne: oba mogą rozciągnąć się całkowicie na szerokość lub wysokość aplikacji oraz można je umieszczać na krawędziach okna aplikacji. Jednakże, odpowiadają inaczej na działania użytkownika.
pt: O Kirigami oferece dois tipos adicionais de áreas, as áreas modais e as incorporadas. Estas são muito parecidas entre si: ambas ocupam por inteiro a largura ou altura da aplicação e poderão ser colocadas nos extremos da janela da aplicação . Contudo, reagem de forma diferente à interacção com o utilizador.
sl: Kirigami ponuja dve dodatni vrsti predalov, modalne predale in znotrajvrstične predale. Vrsti sta si precej podobni: obe segata v celoto širine ali višine aplikacije in se lahko postavita na robove okna aplikacije. Vendar pa se različno odzivata na interakcijo uporabnikov.
sv: Kirigami erbjuder två ytterligare sorters lådor, modala lådor och lådor på plats. De är mycket lika varandra: båda fyller hela programmets bredd eller höjd och kan placeras vid programfönstrets kanter. Dock reagerar de olika på användarinteraktion.
uk: У Kirigami передбачено два додаткових типи висувних панелей, модальні висувні панелі і вбудовані висувні панелі. Вони доволі подібні між собою: обидві займають усю ширину і висоту вікна програми і можуть бути розташовані на краях вікна програми. Втім, вони по-різному взаємодіють із користувачем.

source: Modal drawers are hidden by default and darken the rest of the application, being dismissed when clicking on a darkened area.
ca: Els calaixos modals estan ocults de manera predeterminada i enfosqueixen la resta de l'aplicació, i es descarten quan se selecciona sobre una àrea enfosquida.
eo: Modalaj tirkestoj estas kaŝitaj defaŭlte kaj mallumigas la reston de la aplikaĵo, estante forĵetitaj kiam oni klakas sur mallumigita areo.
es: Los cajones modales están ocultos de forma predeterminada y oscurecen el resto de la aplicación, desapareciendo al hacer clic en un área oscurecida.
nl: Modale schuifladen zijn standaard verborgen en verdonkeren de rest van de toepassing en afgewezen door klikken op een verdonkerd gebied.
sl: Modalni predali so privzeto skriti in zatemnijo preostanek aplikacije ter se opustijo, ko kliknete zatemnjeno območje.
sv: Modala lådor gör resten av programmet mörkare och avfärdas vid klick på ett mörkare område.
uk: Модальні висувні панелі, які типово приховано, затемнюють решту вікна програми і закриваються, якщо відбудеться клацання на затемненій області.

source: Inline drawers are shown by default and allow the user to still interact with the rest of the application without being dismissed, and do not darken other areas.
ca: Els calaixos inclosos es mostren de manera predeterminada i permeten a l'usuari interactuar amb la resta de l'aplicació sense ser descartats i no enfosqueixen les altres àrees.
eo: Enliniaj tirkestoj estas montritaj defaŭlte kaj permesas al la uzanto ankoraŭ interagi kun la resto de la aplikaĵo sen esti forĵetitaj, kaj ne malheligas aliajn areojn.
es: Los cajones en línea se muestran de forma predeterminada y permiten que el usuario pueda interactuar con el resto de la aplicación sin ser descartados, y no oscurecen otras áreas.
nl: Inline schuifladen worden standaard getoond en bieden de gebruiker nog steeds interactie te hebben met de rest van de toepassing zonder afgewezen te worden en verdonkeren andere gebieden niet.
sl: Znotrajvrstični predali so privzeto prikazani in uporabniku omogočajo interakcijo s preostalim delom aplikacije, ne da bi ga opustili, in ne zatemnijo drugih področij.
sv: Lådor på plats visas normalt och låter användaren fortfarande interagera med resten av programmet utan att de avfärdas, och gör inte andra områden mörkare.
uk: Вбудовані висувні панелі типово показані і надають змогу користувачеві продовжувати взаємодію із рештою програми без закриття панелей, і вони не затемнюють решту вікна програми.

source: This kind of drawer is open ended and flexible, but generally, you may want to use this kind of drawer when you want a small list of options to appear on a long press or right click.
ca: Aquesta mena de calaix és obert i flexible, però generalment, és possible que vulgueu utilitzar aquest tipus de calaix quan vulgueu que aparegui una llista petita d'opcions en una pulsació llarga o un clic dret.
eo: Ĉi tiu speco de tirkesto estas malfermita kaj fleksebla, sed ĝenerale, vi eble volas uzi ĉi tiun tian tirkeston kiam vi volas ke malgranda listo de elektebloj aperu per longa premo aŭ dekstra klako.
es: Este tipo de cajón es abierto y flexible, aunque por lo general querrá usar este tipo de cajón cuando quiera que aparezca una pequeña lista de opciones al hacer una pulsación prolongada o un clic derecho.
nl: Dit soort schuifladen hebben een open eind en zijn flexibel, maar in het algemeen zal u dit soort schuiflade willen gebruiken als u een kleine lijst met keuzes wilt laten verschijnen nadat er langdurig geklikt of rechts geklikt is.
sl: Ta vrsta predala je odprta in prilagodljiva, a na splošno boste morda želeli uporabiti to vrsto predala, ko želite, da se ob dolgem pritisku ali desnem kliku prikaže majhen seznam možnosti.
sv: Den här typen av låda är öppen och flexibel, men allmänhet kanske man vill använda den här typen av låda när man vill att en liten lista med alternativ ska visas med ett långt tryck eller högerklick.
uk: Цей тип висувної панелі є відкритим і гнучким, але загалом, ви можете скористатися тим типом висувної панелі, коли вам потрібно показати невеликий список пунктів при довгому натисканні або клацанні правою кнопкою миші.

source: These two drawers are so similar because they can, in fact, be implemented using the same Kirigami component: [Kirigami.OverlayDrawer](docs:kirigami;org.kde.kirigami.OverlayDrawer). Here are a few important inherited properties of this component to keep in mind:
ca: Aquests dos calaixos són molt similars perquè, de fet, són el mateix component de Kirigami: [Kirigami.OverlayDrawer](docs:kirigami;org.kde.kirigami.OverlayDrawer). Propietats importants d'aquest component a tenir en compte:
sl: Ta dva predala sta si tako podobna, ker sta dejansko izvedena z isto komponento Kirigami: '[Kirigami.OverlayDrawer](docs:kirigami;org.kde.kirigami.OverlayDrawer). Tu je nekaj pomembnih podedovanih lastnosti te komponente, ki jih je treba imeti v mislih:

source: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) controls whether the drawer will be modal or inline depending on a boolean value.
ca: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) controla si el calaix serà modal o inclòs depenent d'un valor booleà.
eo: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) mastrumas ĉu la tirkesto estos modala aŭ enlinia depende de bulea valoro.
es: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) controla si el cajón será modal o en línea según un valor booleano.
nl: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) bestuurt of de schuiflade modaal of inline zal zijn afhankelijk van een booleaanse waarde.
sl: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) nadzira, ali bo predal modalen ali znotrajvrstični, odvisno od logične vrednosti.
sv: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) styr om lådan är modal eller på plats beroende på ett Booleskt värde
uk: [Popup.modal](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#modal-prop) керує тим, буде висувна панель модальною чи вбудованою, залежно від цього булевого значення.

source: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) controls which edge of the application window the drawer will appear on; options for this property are part of the [Edge enum](docs:qtcore;Qt::RightEdge), namely `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge`, and `Qt.LeftEdge`.
ca: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) controla en quina vora de la finestra de l'aplicació apareixerà el calaix. Les opcions per a aquesta propietat són part de l'[Edge enum](docs:qtcore;Qt::RightEdge), això és, `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` i `Qt.LeftEdge`.
eo: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) mastrumas sur kiu rando de la aplika fenestro aperos la tirkesto; elektebloj por ĉi tiu propreco estas parto de la [Edge enum](docs:qtcore;Qt::RightEdge), nome `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge`, kaj `Qt.LeftEdge`.
es: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) controla en qué borde de la ventana de la aplicación aparecerá el cajón; las opciones para esta propiedad forman parte del [enumerador Edge](docs:qtcore;Qt::RightEdge), en concreto `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` y `Qt.LeftEdge`.
nl: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) bestuurt aan welke rand van het toepassingenvenster de schuiflade zal verschijnen; opties voor deze eigenschap zijn onderdeel van de [Edge enum](docs:qtcore;Qt::RightEdge), met name `Qt.TopEdg`, `Qt.RightEdge`, `Qt.BottomEdge` en `Qt.LeftEdge`.
sl: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) nadzoruje, na katerem robu okna aplikacije se bo predal prikazal; možnosti za to lastnost so 'Qt.TopEdge', 'Qt.RightEdge', 'Qt.BottomEdge' in 'Qt.LeftEdge'.
sv: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) bestämmer vilken kant av programfönstret som lådan dyker upp. Alternativ för egenskapen är `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` och `Qt.LeftEdge`
uk: [Drawer.edge](https://doc.qt.io/qt-6/qml-qtquick-controls2-drawer.html#edge-prop) керує тим, з якого з країв вікна програми з'являтиметься панель; варіантами значення цієї властивості є частиною [переліку Edge](docs:qtcore;Qt::RightEdge), а саме, `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` і `Qt.LeftEdge`.

source: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) contains the component that will form the content of your drawer.
ca: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) conté el component que formarà el contingut del calaix.
eo: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) enhavas la komponanton, kiu formos la enhavon de via tirkesto.
es: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) contiene el componente que formará el contenido del cajón.
nl: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) bevat de component die de inhoud vormt van uw schuiflade.
sl: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) vsebuje komponento, ki bo tvorila vsebino predala.
sv: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) innehåller komponenterna som utgör lådans innehåll
uk: [Popup.contentItem](https://doc.qt.io/qt-6/qml-qtquick-controls2-popup.html#contentItem-prop) містить компонент, який формуватиме вміст вашої висувної панелі.

source: Set modal to false to make this drawer inline!
ca: Establiu «modal» a «false» per a fer que aquest calaix estigui inclòs!
eo: Agordu modalon al falsa por enliniigi ĉi tiun tirkeston!
es: Defina `modal` a falso para hacer que este cajón esté en línea.
fr: Définissez le paramètre « modal » à « False » pour que ce tiroir soit en ligne !
nl: Modal op false zetten om deze schuiflade inline te maken!
pl: Ustaw modal na false, aby umieścić tę półkę w wierszu!
pt: Configure o `modal` como falso para tornar esta área incorporada!
sl: Nastavite modal na false, da ta predal postane znotrajvrstični!
sv: Ställ in modal till false för att göra lådan på plats.
uk: Встановіть для `modal` значення `false`, щоб зробити цю висувну панель вбудованою!

source: Modal drawer not visible
ca: Calaix modal no visible
eo: Modala tirkesto ne videbla
es: Cajón modal no visible
nl: Modale schuiflade niet zichtbaar
sl: Modalni predal ni viden
sv: Modal låda inte synlig
uk: Модальна висувна панель є невидимою

source: Modal drawer at the bottom edge of the screen
ca: Calaix modal a la vora inferior de la pantalla
eo: Modala tirkesto ĉe la malsupra rando de la ekrano
es: Cajón modal en el borde inferior de la pantalla
nl: Modale schuiflade aan de onderrand van het venster
sl: Modalni predal na spodnjem robu zaslona
sv: Modal låda vid skärmens underkant
uk: Модальна висувна панель з нижнього краю екрана

source: Form layouts
ca: Disposicions de formulari
eo: Form-aranĝoj
es: Diseños de formulario
nl: Formulierindeling
sl: Postavitve obrazcev
sv: Formulärlayouter
uk: Компонування форми

source: Easily create attractive interaction areas with Kirigami FormLayouts
ca: Creant amb facilitat àrees d'interacció atractives amb les FormLayouts de Kirigami
eo: Facile kreu allogajn interagajn areojn per Kirigami FormLayouts
es: Cree con facilidad áreas de interacción atractivas con FormLayouts de Kirigami
fr: Créez facilement des zones d'interaction attrayantes avec des dispositions de formulaires de Kirigami.
nl: Gemakkelijk aanmaken van attractieve gebieden voor interactie met Kirigami formulierindelingen
pl: Łatwo twórz przystępne obszary do oddziaływania z aplikacją przy użyciu Kirigami FormLayouts
pt: Crie facilmente áreas de interacção atractivas com os FormLayout's do Kirigami
sl: Preprosto ustvarite privlačna področja interakcije z Kirigami FormLayouts
sv: Skapa enkelt attraktiva interaktionsområden med Kirigami FormLayouts
uk: Просте створення привабливих областей взаємодії з користувачем за допомогою FormLayout з Kirigami
