Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: For the first time, we will be separating some of our components into their own QML files. If we keep adding things to `Main.qml`, it's going to quickly become hard to tell what does what, and we risk muddying our code.
ca: Per primera vegada, separarem alguns dels nostres components en els seus propis fitxers en QML. Si seguim afegint coses a `Main.qml`, ràpidament serà difícil saber què fa què, i correm el risc d'enterbolir el nostre codi.
eo: Por la unua fojo, ni apartigos iujn niajn komponantojn en siajn proprajn QML-dosierojn. Se ni daŭre aldonas aferojn al `Main.qml`, rapide fariĝos malfacile diri kio faras kion, kaj ni riskas ŝlimigi nian kodon.
es: Por primera vez, separaremos algunos de nuestros componentes en sus propios archivos QML. Si seguimos añadiendo cosas a `Main.qml`, rápidamente se volverá difícil saber qué hace cada cosa, y corremos el riesgo de enturbiar nuestro código.
nl: Voor de eerste keer, zullen we enige van onze componenten in hun eigen QML bestanden scheiden. Als we dingen aan `Main.qml` blijven toevoegen, wordt het snel moeilijk te vertellen wat wat doet en riskeren we modderige code.
sl: Prvič bomo nekatere naše komponente ločili v lastne datoteke QML. Če dodajamo stvari v `Main.qml`, bo hitro postalo težko ugotoviti, kaj počne kaj, in tvegamo, da bomo umazali našo kodo.
sv: För första gången separerar vi vissa av våra komponenter i sina egna QML-filer. Om vi fortsätter att lägga till saker i `Main.qml`, blir det snart svårt att säga vad som gör vad, och vi riskerar att trassla till vår kod.
uk: Ми вперше відокремлюємо деякі з наших компонентів у окремі файли QML. Якщо ми продовжуватимемо додавати код до `Main.qml`, розростання файла ускладнить розбір його частин і збільшить ризик помилок у нашому коді.

source: In this tutorial, we will be splitting the code in `Main.qml` into `Main.qml`, `AddDialog.qml` and `KountdownDelegate.qml`.
ca: En aquesta guia d'aprenentatge, dividirem el codi de `Main.qml` en `Main.qml`, `AddDialog.qml` i `KountdownDelegate.qml`.
eo: En ĉi tiu lernilo, ni dividos la kodon de `Main.qml` en `Main.qml`, `AddDialog.qml` kaj `KountdownDelegate.qml`.
nl: In deze instructie zullen we de code in `Main.qml` uitsplitsen naar `Main.qml`, `AddDialog.qml` en `KountdownDelegate.qml`.
sl: V tem učbeniku bomo razdelili kodo v `Main.qml` na `Main.qml`, `AddEditDialog.qml` in `KountdownDelegate.qml`.
sv: I den här handledningen delar vi upp koden i `Main.qml` i `Main.qml`, `AddDialog.qml` och `KountdownDelegate.qml`.
uk: У цьому підручнику ми поділимо код у `Main.qml` між `Main.qml`, `AddDialog.qml` і `KountdownDelegate.qml`.

source: Additionally, even when spreading code between multiple QML files, the amount of files in real-life projects can get out of hand. A common solution to this problem is to logically separate files into different folders. We will take a brief look at three common approaches seen in real projects, and implement one of them:
ca: A més, fins i tot quan es dispersa el codi entre diversos fitxers QML, la quantitat de fitxers en projectes reals pot anar-se'n de les mans. Una solució habitual a aquest problema és separar lògicament fitxers en carpetes diferents. Farem una breu aproximació a tres enfocaments comuns vistos en projectes reals, i implementarem un d'ells:
eo: Aldone, eĉ dum disvastigo de kodo inter pluraj QML-dosieroj, la kvanto de dosieroj en realaj projektoj povas malaperi. Ofta solvo al ĉi tiu problemo estas logike apartigi dosierojn en malsamajn dosierujojn. Ni rigardos tri oftajn alirojn viditajn en realaj projektoj, kaj efektivigos unu el ili:
nl: Daarnaast, zelfs als we de code over meerdere QML-bestanden verspreiden, loopt het aantal bestanden in echte projecten al snel uit de hand. Een veel voorkomende oplossing voor dit probleem is het logisch opdelen van de bestanden in meerdere mappen. We kijken kort naar drie voorkomende oplossingen in echte projecten, en implementeren een daarvan:
sl: Poleg tega lahko tudi pri širjenju kode med več datotekami QML količina datotek v realnih projektih uide izpod nadzora. Običajna rešitev te težave je logično ločevanje datotek v različne mape. Na kratko si bomo ogledali tri pogoste pristope, ki jih vidimo v resničnih projektih, in implementirali enega od njih:
sv: Dessutom, även när kod sprids mellan flera QML-filer, kan antalet filer i verkliga projekt gå överstyr. En vanlig lösning på problemet är att separera filer logiskt i olika kataloger. Vi tar en snabb titt på tre vanliga tillvägagångssätt i verkliga projekt och implementera ett av dem:
uk: Крім того, навіть після поділу коду між декількома файлами QML кількість файлів у реальних проєктах може лишитися незручною. Типовим вирішенням цієї проблеми є логічний поділ файлів між різними теками. Здійснимо короткий огляд трьох підходів у реальних проєтках та реалізуймо один з них:

source: storing QML files together with C++ files
ca: emmagatzematge de fitxers QML juntament amb fitxers C++
eo: konservante QML-dosierojn kune kun C++-dosieroj
nl: QML-bestanden samen met C++ bestanden opslaan
sl: shranjevanje datotek QML skupaj z datotekami C++
sv: lagra QML-filer tillsammans med C++ filer
uk: зберігання файлів QML разом із файлами C++

source: storing QML files in a different directory under the same module
ca: emmagatzematge de fitxers en QML en un directori diferent dins del mateix mòdul
eo: konservante QML-dosierojn en malsama dosierujo sub la sama modulo
nl: QML-bestanden in een andere map in dezelfde module opslaan
sl: shranjevanje datotek QML v drugem imeniku pod istim modulom
sv: lagra QML-filer i en annan katalog under samma modul
uk: зберігання файлів QML у іншому каталозі того самого модуля

source: storing QML files in a different directory under a different module
ca: emmagatzematge de fitxers QML en un directori diferent dins d'un mòdul diferent
eo: konservante QML-dosierojn en malsama dosierujo sub malsama modulo
nl: QML-bestanden in een andere map in een andere module opslaan
sl: shranjevanje datotek QML v drugem imeniku pod drugim modulom
sv: lagra QML-filer i en annan katalog under en annan modul
uk: зберігання файлів QML у окремому каталозі у іншому модулі

source: After the split, we will have [separation of concerns](https://en.wikipedia.org/wiki/Separation_of_concerns) between each file, and [implementation details will be abstracted](https://en.wikipedia.org/wiki/Abstraction_(computer_science)), making the code more readable.
ca: Després de la divisió, tindrem [separació de preocupacions](https://en.wikipedia.org/wiki/Separation_of_concerns) entre cada fitxer, i [els detalls d'implementació s'abstrauran](https://ca.wikipedia.org/wiki/Abstracció_(informàtica)), fent el codi més llegible.
eo: Post la disigo, ni havos [disigo de zorgoj](https://en.wikipedia.org/wiki/Separation_of_concerns) inter ĉiu dosiero, kaj [efektivigaj detaloj estos abstraktitaj](https://en.wikipedia.org/ wiki/Abstraction_(komputiko_scienco)), farante la kodon pli legebla.
nl: Na het uitsplitsen zullen we [separation of concerns](https://en.wikipedia.org/wiki/Separation_of_concerns) tussen elk bestand hebben, en [implementation details will be abstracted](https://en.wikipedia.org/wiki/Abstraction_(computer_science)), wat de code leesbaarder maakt.
sl: Po razcepu bomo imeli [ločitev pomislekov](https://en.wikipedia.org/wiki/Separation_of_concerns) med vsako datoteko in [podrobnosti o izvedbi bodo povzete](https://en.wikipedia.org/ wiki/Abstraction_(computer_science)), zaradi česar je koda bolj berljiva.
sv: Efter uppdelningen har vi [inkapsling](https://sv.wikipedia.org/wiki/Inkapsling_(Separation_of_Concerns)) mellan varje fil, och [implementeringsdetaljer blir abstraherade](https://en.wikipedia.org/wiki/Abstraction_(computer_science)), vilket gör koden mer läsbar.
uk: Після поділу ми [поділимо відповідальність](https://en.wikipedia.org/wiki/Separation_of_concerns) між файлами, а [реалізацію подробиць буде абстраговано](https://en.wikipedia.org/wiki/Abstraction_(computer_science)), що зробить код зручнішим для читання.

source: Storing QML files together with C++ files
ca: Emmagatzematge de fitxers QML juntament amb fitxers C++
eo: Konservante QML-dosierojn kune kun C++-dosieroj
nl: QML-bestanden samen met C++ bestanden opslaan
sl: Shranjevanje datotek QML skupaj z datotekami C++
sv: Lagra QML-filer tillsammans med C++ filer
uk: Зберігання файлів QML разом із файлами C++

source: This consists of keeping the project's QML files together with C++ files in `src/`. This sort of structure would look like this:
ca: Consisteix a mantenir els fitxers QML del projecte juntament amb els fitxers C++ a `src/`. Aquesta mena d'estructura es veuria així:
eo: Ĉi tio konsistas el konservi la QML-dosierojn de la projekto kune kun C++-dosieroj en `src/`. Tia strukturo aspektus jene:
nl: Dit bestaat uit bewaren van de QML-bestanden samen met de C++ bestanden in `src/`. Deze manier van structureren zou er als volgt moeten zien:
sl: To vključuje shranjevanje datotek QML projekta skupaj z datotekami C++ v `src/`. Takšna struktura bi izgledala takole:
sv: Det består av att låta projektets QML-filer vara tillsammans med C++-filer i `src/`. Den här typen av struktur skulle se ut så här:
uk: Це передбачає зберігання файлів QML проєкту разом із файлами C++ у `src/`. Такий різновид структури може виглядати ось так:

source: This is what we did previously. In the above case, you would just need to keep adding QML files to the existing `kirigami-tutorial/src/CMakeLists.txt`. There's no logical separation at all, and once the project gets more than a couple of QML files (and C++ files that create types to be used in QML), the folder can quickly become crowded.
ca: Això és el que vam fer anteriorment. En el cas anterior, només hauríeu de continuar afegint fitxers QML al `kirigami-tutorial/src/CMakeLists.txt` existent. No hi ha cap separació lògica, i una vegada que el projecte obté més d'un parell de fitxers QML (i fitxers C++ que creen tipus que es faran servir en el QML), la carpeta es pot omplir ràpidament.
eo: Jen kion ni faris antaŭe. En la ĉi-supra kazo, vi nur bezonus daŭre aldoni QML-dosierojn al la ekzistanta `kirigami-tutorial/src/CMakeLists.txt`. Tute ne ekzistas logika disiĝo, kaj post kiam la projekto ricevas pli ol kelkajn QML-dosierojn (kaj C++-dosieroj, kiuj kreas tipojn por esti uzataj en QML), la dosierujo povas rapide pleniĝi.
nl: Dit is wat we tot nu toe deden. In het geval hierboven, hoefde u alleen QML-bestanden aan de bestaande `kirigami-tutorial/src/CMakeLists.txt` toe te voegen. Er is helemaal geen logische separatie, en als het project eenmaal meer dan een paar QML-bestanden (en C++ bestanden die de typen creëert die worden gebruikt in QML) krijgt, dan kan de map al snel overbevolkt raken.
sl: To smo storili prej. V zgornjem primeru bi morali kar naprej dodajati datoteke QML v obstoječi `kirigami-tutorial/src/CMakeLists.txt`. Sploh ni logičnega ločevanja in ko projekt dobi več kot nekaj datotek QML (in datotek C++, ki ustvarjajo tipe za uporabo v QML), lahko mapa hitro postane natrpana.
sv: Det är vad vi gjorde tidigare. I ovanstående fall skulle man bara behöva fortsätta lägga till QML-filer i den befintliga `kirigami-tutorial/src/CMakeLists.txt`. Det finns ingen logisk separation alls, och när projektet väl får fler än ett par QML-filer (och C++-filer som skapar typer som ska användas i QML), kan katalogen snabbt bli full.
uk: Це те, що ми робили раніше. У наведеному вище випадку вам слід просто продовжити додавання файлів QML до наявного файла `kirigami-tutorial/src/CMakeLists.txt`. Логічного поділу взагалі немає, і щойно кількість файлів QML (і файлів C++, у яких створюватимуться типи, які буде використано у QML) стане більшою за пару-трійку, тека швидко почне переповнюватися файлами.

source: Storing QML files in a different directory under the same module
ca: Emmagatzematge de fitxers en QML en un directori diferent dins del mateix mòdul
eo: Konservante QML-dosierojn en malsama dosierujo sub la sama modulo
nl: QML-bestanden in een andere map in dezelfde module opslaan
sl: Shranjevanje datotek QML v drugem imeniku pod istim modulom
sv: Lagra QML-filer i en annan katalog under samma modul
uk: Зберігання файлів QML у іншому каталозі того самого модуля

source: This consists of keeping all QML files in a separate folder, usually `src/qml/`. This sort of structure would look like this:
ca: Consisteix a mantenir tots els fitxers QML en una carpeta separada, normalment `src/qml/`. Aquesta mena d'estructura es veuria així:
eo: Ĉi tio konsistas el konservi ĉiujn QML-dosierojn en aparta dosierujo, kutime `src/qml/`. Tia strukturo aspektus jene:
nl: Dit bestaat uit bewaren van de QML-bestanden in een aparte map, meestal `src/qml/`. Deze manier van structureren zou er als volgt moeten zien:
sl: To pomeni, da se vse datoteke QML hranijo v ločeni mapi, običajno `src/qml/`. Takšna struktura bi izgledala takole:
sv: Det består av att hålla alla QML-filer i en separat katalog, vanligtvis `src/qml/`. Den här typen av struktur skulle se ut så här:
uk: Це передбачає зберігання усіх файлів QML в окремій теці, зазвичай, `src/qml/`. Такий різновид структури може виглядати ось так:

source: This structure is very common in KDE projects, mostly to avoid having an extra CMakeLists.txt file for the `src/qml/` directory and creating a separate module. This method keeps the files themselves in a separate folder, but you would also need to add them in `kirigami-tutorial/src/CMakeLists.txt`. All created QML files would then belong to the same QML module as `Main.qml`.
ca: Aquesta estructura és molt habitual en els projectes KDE, principalment per a evitar tenir un fitxer CMakeLists.txt extra per al directori `src/qml/` i crear un mòdul separat. Aquest mètode manté els fitxers en una carpeta separada, però també hauríeu d'afegir-los a `kirigami-tutorial/src/CMakeLists.txt`. Tots els fitxers QML creats pertanyen al mateix mòdul QML que `Main.qml`.
eo: Ĉi tiu strukturo estas tre ofta en KDE-projektoj, plejparte por eviti havi kroman CMakeLists.txt-dosieron por la dosierujo `src/qml/` kaj krei apartan modulon. Ĉi tiu metodo konservas la dosierojn mem en aparta dosierujo, sed vi ankaŭ bezonus aldoni ilin en `kirigami-tutorial/src/CMakeLists.txt`. Ĉiuj kreitaj QML-dosieroj tiam apartenus al la sama QML-modulo kiel `Main.qml`.
nl: Deze structuur wordt veel gebruikt bij KDE projecten, voornamelijk om te voorkomen dat voor de src/qml/`-map een extra CMakeLists.txt-bestand met daarbij de creatie van een separate module nodig is. Deze methode houd de bestanden zelf in een separate map, maar ze moeten ook aan `kirigami-tutorial/src/CMakeLists.txt` toegevoegd worden. Alle gecreëerde QML-bestanden horen bij dezelfde QML module als `Main.qml`.
sl: Ta struktura je zelo pogosta v projektih KDE, predvsem zato, da bi se izognili dodatni datoteki CMakeLists.txt za imenik `src/qml/` in ustvarjanju ločenega modula. Ta metoda hrani same datoteke v ločeni mapi, vendar bi jih morali dodati tudi v `kirigami-tutorial/src/CMakeLists.txt`. Vse ustvarjene datoteke QML bi potem pripadale istemu modulu QML kot `Main.qml`.
sv: Strukturen är mycket vanlig i KDE-projekt, mest för att undvika att ha en extra CMakeLists.txt-fil för katalogen `src/qml/` och skapa en separat modul. Metoden har själva filerna i en separat katalog, men man måste också lägga till dem i `kirigami-tutorial/src/CMakeLists.txt`. Alla skapade QML-filer tillhör då samma QML-modul som `Main.qml`.
uk: Така структура є доволі типовою для проєктів KDE. Здебільшого, причиною є бажання уникнути використання додаткового файла CMakeLists.txt для каталогу `src/qml/` і створення окремого модуля. Це метод передбачає зберігання самих файлів в окремій теці, але вам все одно доведеться додати ці файли до файла `kirigami-tutorial/src/CMakeLists.txt`. Усі створені файли QML належатимуть до того самого модуля QML, що і `Main.qml`.

source: In practice, once the project gets more than a dozen QML files, while it won't crowd the `src/` directory, it will crowd the `src/CMakeLists.txt` file. It will become difficult to differentiate between traditional C++ files and C++ files that have types exposed to QML.
ca: A la pràctica, una vegada que el projecte té més d'una dotzena de fitxers QML, tot i que no s'omplirà el directori `src/`, s'atapeirà el fitxer `src/CMakeLists.txt`. Es farà difícil diferenciar entre fitxers C++ tradicionals i fitxers C++ que tenen tipus exposats al QML.
eo: En praktiko, post kiam la projekto ricevas pli ol dekduon QML-dosierojn, dum ĝi ne plenigos la dosierujon `src/`, ĝi plenigos la dosieron `src/CMakeLists.txt`. Malfaciliĝos diferenci inter tradiciaj C++-dosieroj kaj C++-dosieroj, kiuj havas tipojn elmontritajn al QML.
nl: In de praktijk, als het project meer dan een dozijn QML-bestanden heeft, zal het de `src/`-map niet overbevolken, zal het wel de `src/CMakeLists.txt`-map overbevolken. Het zal moeilijk om nog de traditionele C++ bestanden te onderscheiden van de C++ bestanden die de typen blootstellen aan QML.
sl: V praksi, ko projekt prejme več kot ducat datotek QML, čeprav ne bo napolnil imenika `src/`, bo napolnil datoteko `src/CMakeLists.txt`. Težko bo razlikovati med tradicionalnimi datotekami C++ in datotekami C++, katerih vrste so izpostavljene QML.
sv: I praktiken, när projektet väl får mer än ett dussintal QML-filer, även om det inte skapar trängsel i katalogen `src/`, leder det till trängsel i filen `src/CMakeLists.txt`. Det blir svårt att skilja mellan traditionella C++ filer och C++ filer som har typer exponerade för QML.
uk: На практиці, щойно кількість файлів QML у проєкті перевищить десяток, хоча каталог `src/` і не буде захаращено, захаращено буде файл `src/CMakeLists.txt`. Стане важко відрізняти традиційні файли C++ і файли C++, у яких містяться типи, які розкрито для QML.

source: It will also break the concept of locality (localisation of dependency details), where you would keep the description of your dependencies in the same place as the dependencies themselves.
ca: També trencarà el concepte de localitat (localització de detalls de dependència), on mantindríeu la descripció de les dependències en el mateix lloc que les mateixes dependències.
eo: Ĝi ankaŭ rompos la koncepton de loko (lokigo de dependecaj detaloj), kie vi konservus la priskribon de viaj dependecoj en la sama loko kiel la dependecoj mem.
nl: Het zal ook het concept van lokaliteit (localisation of dependency details) breken, waar u de omschrijving van uw afhankelijkheden (dependencies) op dezelfde plaats als de afhankelijkheden zelf bewaart.
sl: Prav tako bo prekinil koncept lokalnosti (lokalizacija podrobnosti odvisnosti), kjer bi opis vaših odvisnosti obdržali na istem mestu kot same odvisnosti.
sv: Det bryter också mot begreppet lokalitet (lokalisering av beroendedetaljer), där man håller beskrivningen av beroenden på samma plats som beroendena själva.
uk: Також це порушує принцип локальності (локалізації подробиць залежностей), за якого вам слід зберігатти опис ваших залежностей там же, де зберігаються самі залежності.

source: Storing QML files in a different directory under a different module
ca: Emmagatzematge de fitxers QML en un directori diferent dins d'un mòdul diferent
eo: Konservi QML-dosierojn en malsama dosierujo sub malsama modulo
nl: QML-bestanden in een andere map in een andere module opslaan
sl: Shranjevanje datotek QML v drugem imeniku pod drugim modulom
sv: Lagra QML-filer i en annan katalog under en annan modul
uk: Зберігання файлів QML в окремому каталозі в іншому модулі

source: This consists of keeping all QML files in a separate folder with its own CMakeLists.txt and own separate QML module. This sort of structure would look like this:
ca: Això consisteix a mantenir tots els fitxers QML en una carpeta separada amb el seu propi CMakeLists.txt i un mòdul QML propi separat. Aquesta mena d'estructura es veuria així:
eo: Ĉi tio konsistas el konservi ĉiujn QML-dosierojn en aparta dosierujo kun sia propra CMakeLists.txt kaj propra aparta QML-modulo. Tia strukturo aspektus jene:
nl: Dit bestaat uit bewaren van de QML-bestanden in een aparte map met zijn eigen CMakeLists.txt en zijn eigen QML-module. Deze manier van structureren zou er als volgt moeten zien:
sl: To vključuje shranjevanje vseh datotek QML v ločeni mapi z lastnim CMakeLists.txt in lastnim ločenim modulom QML. Takšna struktura bi izgledala takole:
sv: Det består av att hålla alla QML-filer i en separat katalog med sin egen CMakeLists.txt och en egen separat QML-modul. Den här typen av struktur skulle se ut så här:
uk: Це передбачає зберігання усіх файлів QML в окремій теці зі своїм власним CMakeLists.txt своїм власним модулем QML. Цей різновид структури може виглядати ось так:
