Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Since overlay sheets are designed to display vertical content, they can be especially useful when used in conjunction with components such as [ListViews](docs:qtquick;QtQuick.ListView). When displaying content longer than the application window itself, the overlay sheet becomes scrollable:
pt: Dado que as folhas sobrepostas são desenhadas para apresentar conteúdos na vertical, as mesmas poderão ser úteis em especial quando ferem usadas com componentes como as [ListView's](docs:qtquick;QtQuick.ListView). Ao mostrar conteúdo mais largo que a própria janela da aplicação, a folha sobreposta fica com opções de deslocamento:

source: ![Overlay sheet with a listview](/docs/getting-started/kirigami/components-overlaysheets/sheet_listview.png)
pt: ![Folha sobreposta com uma lista](/docs/getting-started/kirigami/components-overlaysheets/sheet_listview.png)

source: In general you'll want to use a `pageStack` rather than implement your own [PageRow](docs:kirigami2;PageRow), especially when your application gets bigger and you need your components living in separate files. If you create your window in your `main.qml` using a [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), a component residing in another file can still directly invoke the global `pageStack` by means of a call to the [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):
pt: De um modo geral, irá querer usar uma `pageStack` em vez de implementar a sua própria [PageRow](docs:kirigami2;PageRow), especialmente quando a sua aplicação fica cada vez maior e precisa que os seus componentes residam em ficheiros separados. Se criar a sua janela no seu `main.qml`, usando uma [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), um componente que resida noutro ficheiro consegue à mesma invocar directamente a `pageStack` global, através de uma chamada à [applicationWindow()](docs:kirigami2;AbstractApplicationWindow::applicationWindow):

source: ![A busy indicator](/docs/getting-started/kirigami/components-progressbars/busyindicator.png)
pt: ![Um indicador de ocupado](/docs/getting-started/kirigami/components-progressbars/busyindicator.png)

source: If you want the indicator to stop running, you can do so by setting the [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) property to false.
pt: Se quiser que o indicador pare de funcionar, podê-lo-á fazer se mudar a propriedade [running](https://doc.qt.io/qt-6/qml-qtquick-controls2-busyindicator.html#running-prop) para falsa.

source: Page actions on mobile
pt: Acções da página num dispositivo móvel

source: We are placing our Kirigami Action within our main page from our previous tutorials. If we wanted to, we could add more actions to our page (and even nest actions within actions!). [Kirigami.Action](docs:kirigami2;Action) components are used as contextual actions within Kirigami pages. We are setting it specifically to the [actions.main](docs:kirigami2;Page::actions) property of our [Kirigami.Page](docs:kirigami2;Page): the `actions` object has properties that let us set different actions in different positions, but since our "Add kountdown" action is central to our UI we are setting it as the main action of this page.
pt: Estamos a colocar a nossa acção do Kirigami dentro da nossa página principal com base nos nossos tutoriais. Se o quiséssemos, poderíamos adicionar mais acções à nossa página (e mesmo associar acções dentro de acções!). Os componentes [Kirigami.Action](docs:kirigami2;Action) são usados como acções de contexto dentro das páginas do Kirigami. Estamos a configurar esse valor de forma específica na propriedade [actions.main](docs:kirigami2;Page::actions) da [Kirigami.Page](docs:kirigami2;Page): o objecto `actions` tem propriedades que nos deixam definir acções diferentes em posições diferentes; contudo, dado que a nossa acção "Adicionar uma contagem" é algo tão central na nossa interface, estamos a configurá-lo como acção principal desta página.

source: The `id` and `text` properties should be familiar from previous tutorials. However, the inherited [Action.icon](https://doc.qt.io/qt-5/qml-qtquick-controls2-action.html#icon-prop) property should be interesting: it is an object with several properties letting you display certain icons for your actions. Fortunately, to use KDE icons all we need to do is provide the name property for the icon property, `icon.name`.
pt: As propriedades `id` e `text` deverão ser familiares dos tutoriais anteriores. Contudo, a nova propriedade [Action.icon](https://doc.qt.io/qt-5/qml-qtquick-controls2-action.html#icon-prop) deverá ser interessante: é um objecto com várias propriedades que lhe permitirão mostrar certos ícones para as suas acções. Felizmente, para usar os ícones do KDE, tudo o que é preciso fazer é configurar a propriedade 'name' com a propriedade do ícone, `icon.name`.

source: Did you notice those three lines next to the page title on the previous screenshot? That's a hamburger menu that opens a [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). Global drawers are useful for global navigation and actions: in other words, those things you might need to use throughout your application. We are going to create a simple global drawer that includes a "quit" button.
pt: Reparou nessas três linhas a seguir ao título da página na imagem anterior? Isso é um menu em hambúrguer que abre uma [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). As áreas globais são úteis para a navegação global e para as acções: por outras palavras, essas coisas que poderá precisar de usar em toda a sua aplicação. Iremos criar uma área global simples que inclua um botão para "sair".

source: First we create our project folder. We are going to call ours "helloworld".
pt: Em primeiro lugar, criamos a pasta do nosso projecto. Iremos chamar ao nosso "helloworld".

source: Within this folder we are going to create a `src/` folder and `CMakeLists.txt`. It is generally considered good practice to place all our main code files in a `src/` folder. Our `src/` folder in turn will contain a folder named `contents/`, which itself contains a folder called `ui/`. Here is where we will create our QML files.
pt: Dentro desta pasta iremos criar uma pasta `src/` e um ficheiro `CMakeLists.txt`. É uma boa prática generalizada colocar todos os nossos ficheiros de código numa pasta `src/`. A nossa pasta `src/` por sua vez irá conter uma pasta chamada `contents/`, que por sua vez irá conter uma pasta chamada `ui/`. Aqui é onde serão criados os nossos ficheiros em QML.

source: Alternatively, you may want to use the standard Kirigami template provided by [KDevelop](https://apps.kde.org/kdevelop/), KDE's main IDE for coding in C++ and QML. [KAppTemplate](https://apps.kde.org/kapptemplate/) is also available if you only need a quick template to start coding in your favorite IDE or text editor.
pt: Em alternativa poderá querer usar o modelo-padrão do Kirigami que é fornecido pelo [KDevelop](https://apps.kde.org/kdevelop/), o IDE principal do KDE para programar em C++ e QML. O [KAppTemplate](https://apps.kde.org/kapptemplate/) também está disponível se só precisar de um modelo rápido para começar a programar no seu IDE ou editor de texto favoritos.

source: This is a KDE convention, but not all KDE projects use this structure. You are free to set things up differently, but you will have to take this into account when creating your `CMakeLists.txt` and `resources.qrc` files.
pt: Esta é uma convenção do KDE, mas nem todos os projectos do KDE usam esta estrutura. Está à vontade para configurar as coisas de forma diferente, mas terá de ter isso em conta quando criar os seus ficheiros `CMakeLists.txt` e `resources.qrc`.

source: For now, let's focus on `main.qml`. First we [import](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) a number of important modules:
pt: Por agora, vamo-nos focar no `main.qml`. Primeiro iremos [importar](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) um conjunto de módulos importantes:

source: `main.cpp` handles the "business logic" of our application. C++ is handy because it is flexible and fast, even if it is more involved than other programming languages.
pt: O `main.cpp` lida com a "lógica de negócio" da nossa aplicação. O C++ é útil porque é flexível e rápido, mesmo que esteja mais envolvido que outras linguagens de programação.

source: For now, we don't need to go into too much detail regarding what our `main.cpp` code does, but its role will grow significantly more important once we decide to add more complex functionality to our application in the future. If you want to get ahead, you can read more about how this `main.cpp` works in [this page](/docs/getting-started/kirigami/advanced-maincpp).
pt: Por agora, não precisamos de entrar em grandes detalhes em relação ao que faz o código no nosso ficheiro `main.cpp`, mas o seu papel ficará cada vez mais importante assim que optarmos por adicionar funcionalidades mais complexas à nossa aplicação no futuro. Se quiser evoluir, poderá ler mais sobre o funcionamento deste `main.cpp` [nesta página](/docs/getting-started/kirigami/advanced-maincpp).

source: Our `resources.qrc` is a [Qt Resource file](https://doc.qt.io/qt-5/resources.html). It contains the list of all QML files as well as other files (like custom icons) that will be included in the binary.
pt: O `resources.qrc` é um [ficheiro de recursos do Qt](https://doc.qt.io/qt-5/resources.html). Ele contém a lista de todos os ficheiros QML, assim como de outros ficheiros (como os ícones personalizados) que serão incluídos no executável.

source: This resource file lets us use the "qrc:" + "/main.qml" path in our `main.cpp`, instead of needing to specify the whole "contents/ui/main.qml" path.
pt: Este ficheiro de recursos deixa-nos usar a localização "qrc:" + "/main.qml" no nosso `main.cpp`, em vez de ser necessário definir toda a localização "contents/ui/main.qml".

source: `CMakeLists.txt` files are needed to use KDE's build system of choice, [CMake](https://cmake.org/). The `CMakeLists.txt` file in our top-level folder is going to specify some of our application's characteristics. It also includes some of the dependencies we need in order to compile our project.
pt: Os ficheiros `CMakeLists.txt` são necessários para usar o sistema de compilação escolhido pelo KDE, o [CMake](https://cmake.org/). O ficheiro `CMakeLists.txt` na nossa pasta de topo vai definir algumas das características da nossa aplicação. Também inclui algumas das dependências que necessitamos para a compilar.

source: The most important thing to keep in mind is that the Qt and KDE Frameworks dependencies are managed with [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). You will have to modify these lines and include any additional components that you decide to use during the development of your application.
pt: O ponto mais importante a ter em mente é que as dependências do Qt e das Plataformas do KDE são geridas pelo [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html). Terá de modificar essas linhas e incluir os componentes adicionais que tiver decidido usar durante o desenvolvimento da sua aplicação.

source: The final line, `add_subdirectory(src)`, points CMake to the `helloworld/src/` directory, where our source code is located. Let's delve into the `helloworld/src/CMakeLists.txt` file in there.
pt: A linha final, o `add_subdirectory(src)`, aponta o CMake para a pasta `helloworld/src/`, onde se encontra o nosso código-fonte. Vamos percorrer o ficheiro `helloworld/src/CMakeLists.txt` aqui.

source: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) creates an executable from the given source files.
pt: O [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) cria um executável a partir dos ficheiros de código indicados.

source: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) links the libraries used in our code to our executable.
pt: O [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) liga de forma dinâmica as bibliotecas usadas no nosso código ao nosso executável.

source: Note that these libraries should match the components that we included in our previous `CMakeLists.txt` file—otherwise these components will not be included and our application won't compile.
pt: Lembre-se que estas bibliotecas deve corresponder aos componentes que incluímos no nosso ficheiro `CMakeLists`.txt anterior - caso contrário, estes componentes não serão incluídos e a aplicação não irá compilar.

source: [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/) is a helpful friend when developing a Kirigami application. It is an application that uses core Kirigami features, provides links to the source code, tips on how to use Kirigami components, and links to the corresponding HIG pages.
pt: A [Galeria do Kirigami](https://apps.kde.org/sdk/kirigami2.gallery/) é um amigo útil quando estiver a desenvolver uma aplicação em Kirigami. É uma aplicação que usa as funcionalidades do Kirigami, oferece ligações para o código-fonte, dicas de como usar os componentes, assim como referências para as páginas do HIG correspondentes.

source: Finding a card grid
pt: Procurar uma grelha de cartões

source: Navigating through the Kirigami Gallery application, we will stumble upon the "Grid view with cards" gallery component. This is an example that can be applied to multiple use cases, such as contact cards.
pt: Ao navegar pela aplicação da Galeria do Kirigami, iremos encontrar o componente da galeria da "Grelha de cartões". Este é um bom candidato por exemplo para mostrar uma grelha de cartões de contactos.

source: ![List of kirigami gallery components](components.webp)
pt: ![Lista de componentes da galeria do Kirigami](components.webp)

source: After selecting the "Grid view of cards" gallery component, if we click the "Info" button on the top right, we will get some useful information about the Card and Abstract Card types.
pt: Depois de seleccionar o componente da "Grelha de cartões", iremos carregar no botão "Informações" em cima e à direita, para obter algumas informações úteis sobre os tipos Card e AbstractCard.

source: ![Kirigami gallery grid view](cards.webp)
pt: ![Área de grelha da galeria do Kirigami](cards.webp)

source: In the bottom section of this information dialog we will also find a link to the source code of the "Cards Grid View". Let's navigate to this page.
pt: Na secção inferior desta janela de informações, iremos também encontrar uma referência para o código-fonte da "Área da Grelha de Cartões". Vejamos essa página.

source: Implementing a card grid
pt: Implementar uma grelha de cartões

source: We will reuse most of the code found in the [source code of the CardsGridViewGallery component](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/CardsGridViewGallery.qml). In particular, we will remove the extra parts of the [OverlaySheet](docs:kirigami2;OverlaySheet) (which is the pop-up we used to reach the kirigami-gallery source code repository).
pt: Iremos reutilizar a maioria do código encontrado na Galeria da Grelha de Cartões, na [página de código-fonte do CardsGridViewGallery](https://invent.kde.org/sdk/kirigami-gallery/~/blob/master/src/data/contents/ui/gallery/CardsGridViewGallery.qml). Em particular, iremos remover as partes extra da [OverlaySheet](docs:kirigami2;OverlaySheet) (que é a implementação da Galeria do Kirigami que nos ajudou a obter o repositório do código-fonte do 'kirigami-gallery').

source: So, we are going to substitute the [Page](docs:kirigami2;Page) component of `main.qml` of our skeleton app with the below [ScrollablePage](docs:kirigami2;ScrollablePage):
pt: Como tal, iremos substituir a componente [Page](docs:kirigami2;Page) do 'main.qml' da aplicação de esqueleto com a [ScrollablePage](docs:kirigami2;ScrollablePage) abaixo:

source: What we have done so far is to create a [ScrollablePage](docs:kirigami2;ScrollablePage) and put a [CardsGridView](docs:kirigami2;CardsGridView) into it, since we want to display a grid of Cards generated from a model. The data of each contact is provided by a [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html) while the card delegate is responsible for the presentation of the data. For more info about models and views in Qt Quick, see [here](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html).
pt: O que fizemos até agora foi criar uma [ScrollablePage](docs:kirigami2;ScrollablePage) e colocar uma [CardsGridView](docs:kirigami2;CardsGridView) nela, dado que queremos mostrar uma grelha de cartões gerada a partir de um modelo. Os dados de cada contacto são obtidos com um [ListModel](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html>) enquanto o delegado do cartão é responsável pela apresentação dos dados. Para mais informações sobre os modelos e vistas no Qt Quick, veja [aqui](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html).

source: Now let's populate the model that will feed our grid view with data. In the definition of [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), just after:
pt: Agora vamos preencher o modelo que irá alimentar a nossa grelha com dados. Na definição do [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), logo a seguir a:

source: add the following:
pt: adicione o seguinte abaixo:

source: Notice the `{}` that indicates we are appending a JavaScript object to our model.
pt: Repare no `{}` que indica que estamos a adicionar um objecto de JavaScript ao nosso modelo.

source: The model part of our implementation is ready. Let's proceed to defining a delegate that will be responsible for displaying the data. So, we add the following code to the `main.qml` page, just after the [Component.onCompleted](docs:qtqml;QtQml.Component::completed) definition:
pt: A componente de modelo da nossa implementação está pronta. Vamos prosseguir com a definição de um delegado que será responsável por mostrar os dados. Como tal, iremos adicionar o seguinte código à nossa página no 'main.qml', logo a seguir à definição do [Component.onCompleted](docs:qtqml;QtQml.Component::completed):

source: Following the related information on the [Kirigami.Card API page](docs:kirigami2;Card), we populate a "[banner](docs:kirigami2;Card::banner)" that will act as a header to display the name of the contact as well as a contact icon.
pt: A seguir à informação relacionada na [página da API do Kirigami.Card](docs:kirigami2;Card) iremos preencher um "[banner](docs:kirigami2;Card::banner)", que irá actuar como cabeçalho que apresentará o nome do contacto, assim como um ícone do contacto.

source: The main content of the card has been populated with the cell phone number and the email of the contact, structured as a [Column](docs:qtquick;QtQuick.Column) of [Labels](docs:qtquickcontrols;QtQuick.Controls.Label).
pt: O conteúdo principal do cartão foi preenchido com o número de telemóvel e o e-mail do contacto, estruturado como uma [Column](docs:qtquick;QtQuick.Column) de [Label's](docs:qtquickcontrols;QtQuick.Controls.Label).

source: As a last step we will add some dummy functionality to each card. In particular, a `call` [Action](docs:kirigami2;Action) will be added. Nevertheless, instead of a real call, a passive notification will be displayed. So, let's change the `card` component to the following:
pt: Como último passo, iremos adicionar alguma funcionalidade de testes a cada cartão. Em particular, será adicionada uma [Action](docs:kirigami2;Action) `call` (chamar). Contudo, em vez de uma chamada a sério, será apresentada uma notificação passiva. Como tal, iremos mudar o Component do `card` para o seguinte:

source: So, we added a [Kirigami.Action](docs:kirigami2;Action) that, as soon as it is triggered (by pressing the action button), displays a [passive notification](docs:kirigami2;AbstractApplicationWindow::showPassiveNotification).
pt: Assim, adicionámos uma [Kirigami.Action](docs:kirigami2;Action) que, assim que for desencadeada (ao carregar no botão da acção), irá apresentar uma [notificação passiva](docs:kirigami2;AbstractApplicationWindow::showPassiveNotification).

source: Result
pt: Resultado

source: We add our `kountdownModel` inside our [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) from the last tutorial.
pt: Iremos adicionar o nosso `kountdownModel` dentro da nossa [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) do último tutorial.

source: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) adds a JavaScript Object `yourobject` to the ListModel, and places it after the last item in the model. For this to happen correctly, you must provide a JavaScript Object with the correct properties and corresponding datatypes.
pt: O ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) adiciona um objecto em JavaScript fornecido por si ao ListModel, colocando-o a seguir ao último item no modelo. Para isto acontecer de forma correcta, terá de indicar um objecto em JavaScript com as propriedades e tipos de dados correctos e correspondentes.

source: While our `kountdownModel` contains the data that will be displayed, our `kountdownDelegate` will handle how the data will be displayed in the [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). [Kirigami.CardsListView](docs:kirigami2;CardsListView) was designed to display card-type delegates, and we have indeed used a [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) element as our delegate in the excerpt above.
pt: Embora o nosso `kountdownModel` contenha os dados que serão apresentados, o nosso `kountdownDelegate` irá lidar com a forma como os dados serão apresentados na [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). o [Kirigami.CardsListView](docs:kirigami2;CardsListView) foi desenhado para mostrar delegados do tipo cartão, e usámos de facto um elemento [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) como nosso delegado no excerto acima.

source: The [Component](docs:qtqml;QtQml.Component) that will represent our delegate can be added inside our [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). We will then proceed by checking what each part of our delegate component does.
pt: O [Component](docs:qtqml;QtQml.Component) que irá representar o nosso delegado poderá ser adicionado dentro da nossa [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Iremos então prosseguir, verificando o que cada parte do nosso componente delegado faz.
