Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The flag `--spec` determines the path to the source code or wheel package that has the program, and `kirigami_hello` is the executable script to be run.
ca: L'indicador `--spec` determina el camí al codi font o paquet «wheel» que té el programa, i `kirigami_hello` és l'script executable que s'ha d'executar.
sl: Zastavica `--spec` določa pot do izvorne kode ali kolesnega paketa, ki ima program, `kirigami_hello` pa je izvršljivi skript, ki naj bi tekel.

source: To build and install the Python package, run:
ca: Per a construir i instal·lar el paquet Python, executeu:
sl: Za izgradnjo in namestitev Pythonovega paketa, zaženite:

source: The package will be installed to `~/.local/share/pipx/venvs/kirigami-python`, and an executable script will be installed to `~/.local/bin/kirigami_hello`.
ca: El paquet s'instal·larà a `~/.local/share/pipx/venvs/kirigami-python`, i s'instal·larà un script executable a `~/.local/bin/kirigami_hello`.
sl: Paket bo nameščen v `~/.local/share/pipx/venvs/kirigami-python` in izvajalni skript bo nameščen v `~/.local/bin/kirigami_hello`.

source: Use of pipx versus pip
ca: Ús de «pipx» versus «pip»
sl: Uporaba pipx v primerjavi s pip

source: Unlike [Python with Kirigami: Creating a Python package](/docs/getting-started/python/python-package), this tutorial used `pipx` to make the project easier to run and install. The same steps can be done manually with `venv`, `build` and `pip` as in the more complete tutorial.
ca: A diferència del [Python amb el Kirigami: creació d'un paquet Python](/docs/getting-started/python/python-package), aquesta guia d'aprenentatge ha utilitzat `pipx` per a fer el projecte més fàcil d'executar i instal·lar. Els mateixos passos es poden fer manualment amb `venv`, `build` i `pip` com en el tutorial més complet.
sl: Za razliko od [Python s Kirigami: Ustvarjanje paketa Python - Python with Kirigami: Creating a Python package](/docs/getting-started/python/python-package), je ta vadnica uporablja `pipx` za lažjo izvedbo projekta in namestitev. Iste korake je mogoče izvesti ročno z `venv`, `build` in `pip` kot v popolnejši vadnici.

source: `pipx` is useful and recommended as per [PEP 668](https://peps.python.org/pep-0668/) for running Python applications, while `pip` is multi-purpose and can also be used for importable Python modules.
ca: El `pipx` és útil i recomanat segons el [PEP 668](https://peps.python.org/pep-0668/) per a executar aplicacions Python, mentre que el `pip` és multiús i també es pot utilitzar per a mòduls Python importables.
sl: `pipx` je uporaben in priporočljiv v skladu s [PEP 668](https://peps.python.org/pep-0668/) za izvajanje aplikacij v Pythonu, medtem ko je `pip` večnamenski inse lahko uporablja tudi za uvožene module Pythona.

source: After this, the application can be launched by running:
ca: Després d'això, l'aplicació es pot llançar executant:
sl: Po tem lahko aplikacijo startate tako, da zaženete:

source: Setup with Rust
ca: Configuració amb el Rust

source: Create your first Kirigami application with Rust
ca: Creeu la vostra primera aplicació Kirigami amb Rust

source: Before getting started, we will need to install Kirigami and Rust on our machine.
ca: Abans de començar, haurem d'instal·lar el Kirigami i el Rust a la nostra màquina.

source: First we create our project folder (you can use the commands below). We are going to call ours `kirigami_rust/`. This will be the project's structure:
ca: Primer crearem la nostra carpeta de projecte (podeu utilitzar les ordres de sota). L'anomenarem `kirigami_rust/`. Aquesta serà l'estructura del projecte:

source: This project will use CMake to call Cargo, which in turn will build the project.
ca: Aquest projecte utilitzarà el CMake per cridar el Cargo, que al seu torn construirà el projecte.

source: About CMake and Cargo
ca: Sobre el CMake i el Cargo

source: This is **not** the traditional way of building a Rust project: technically, only Cargo is needed to build it, usually with `cargo build` and `cargo run`.
ca: Aquesta és **no** la forma tradicional de construir un projecte Rust: tècnicament, només es necessita el Cargo per construir-lo, normalment amb `cargo build` i `cargo run`.

source: For desktop applications however, CMake (or an equivalent like [Meson](https://mesonbuild.com/) used by GNOME or [Just](https://just.systems/man/en/introduction.html) used by COSMIC) is needed to install because Cargo lacks the necessary features to install GUI desktop applications.
ca: Per a aplicacions d'escriptori, però, el CMake (o un equivalent com el [Meson](https://mesonbuild.com/) utilitzat pel GNOME o el [Just](https://just.systems/man/en/introduction.html) utilitzat pel COSMIC) és necessari per instal·lar perquè el Cargo no té les característiques necessàries per a instal·lar aplicacions IGU d'escriptori.

source: The project will be called `kirigami_rust` and it will generate an executable called `kirigami_hello`.
ca: El projecte s'anomenarà `kirigami_rust` i generarà un executable anomenat `kirigami_hello`.

source: 💡 Tip
ca: 💡 Consell

source: You can quickly create this file structure with: `mkdir -p kirigami_rust/src/qml/`.
ca: Podeu generar ràpidament aquesta estructura de fitxers amb: `mkdir -p kirigami_rust/src/qml/`.

source: It must follow a [reverse-DNS naming scheme](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) followed by the `.desktop` extension such as `org.kde.kirigami_rust.desktop`:
ca: Ha de seguir un [esquema de noms DNS invers](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) seguit de l'extensió `.desktop` com ara `org.kde.kirigami_rust.desktop`:

source: The `CMakeLists.txt` file is going to be used to run Cargo and to install the necessary files together with our application. It also provides certain quality of life features, such as making sure that Kirigami is installed during compilation and to signal Linux distributions to install the necessary dependencies with the application.
ca: El fitxer `CMakeLists.txt` s'utilitzarà per a executar el Cargo i instal·lar els fitxers necessaris juntament amb la nostra aplicació. També proporciona certes característiques de qualitat de vida, com assegurar-se que el Kirigami s'instal·la durant la compilació i senyalitzar distribucions de Linux per a instal·lar les dependències necessàries amb l'aplicació.

source: The first thing we do is add KDE's [Extra CMake Modules (ECM)](https://api.kde.org/ecm/manual/ecm.7.html) to our project so we can use [ecm_find_qml_module](https://api.kde.org/ecm/module/ECMFindQmlModule.html) to check that Kirigami is installed when trying to build the application, and if it's not, fail immediately. Another useful ECM feature is [ECMUninstallTarget](https://api.kde.org/ecm/module/ECMUninstallTarget.html), which allows to easily uninstall the application with CMake if desired.
ca: El primer que fem és afegir els [Mòduls extres del CMake (ECM) de KDE](https://api.kde.org/ecm/manual/ecm.7.html) al nostre projecte perquè puguem utilitzar el [ecm_find_qml_module](https://api.kde.org/ecm/module/ECMFindQmlModule.html) per a comprovar que el Kirigami està instal·lat quan s'intenta construir l'aplicació, i si no ho està, falla immediatament. Una altra característica útil de l'ECM és [ECMUninstallTarget](https://api.kde.org/ecm/module/ECMUninstallTarget.html), que permet desinstal·lar fàcilment l'aplicació amb el CMake si es desitja.

source: We also use CMake's [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) to make sure we have [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style), KDE's QML style for the desktop. This is one of the two reasons we use CMake in this tutorial.
ca: També utilitzem el [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) del CMake per assegurar-nos que tenim l'estil [qqc2-desktop-style](https://invent.kde.org/frameworks/qqc2-desktop-style), l'estil QML de KDE per a l'escriptori. Aquesta és una de les dues raons per les quals utilitzem el CMake en aquesta guia d'aprenentatge.

source: Typically Rust projects are built with Cargo, and it won't be different here. We create a target that will simply run Cargo when run, and mark it with `ALL` so it builds by default. Cargo will build the executable inside CMake's binary directory (typically `build/`).
ca: Normalment, els projectes Rust es construeixen amb el Cargo, i aquí no serà diferent. Creem un objectiu que simplement executarà el Cargo quan s'executi, i el marcarà amb `ALL` perquè es construeixi de manera predeterminada. El Cargo construirà l'executable dins del directori binari del CMake (normalment `build/`).

source: For more information about CMake, targets, and the binary directory, see [Building KDE software manually](/docs/getting-started/building/cmake-build).
ca: Per a més informació sobre el CMake, els objectius i el directori binari, vegeu [Construir manualment el programari KDE](/docs/getting-started/building/cmake-build).

source: After this, we simply install the `kirigami_rust` executable generated by Cargo in the binary directory and install it to the `BINDIR`, which is usually `/usr/bin`, `/usr/local/bin` or `~/.local/bin`. We also install the necessary desktop file to `APPDIR`, which is usually `/usr/share/applications` or `~/.local/share/applications`. This is the second reason we use CMake in this tutorial.
ca: Després d'això, simplement instal·lem l'executable `kirigami_rust` generat pel Cargo al directori binari i l'instal·lem al `BINDIR`, que sol ser `/usr/bin`, `/usr/local/bin` o `~/.local/bin`. També instal·lem el fitxer d'escriptori necessari a `APPDIR`, que sol ser `/usr/share/applications` o `~/.local/share/applications`. Aquesta és la segona raó per la qual utilitzem el CMake en aquesta guia d'aprenentatge.

source: For more information about where KDE software is installed, see [Building KDE software manually: The install step](/docs/getting-started/building/cmake-build/#install).
ca: Per a més informació sobre on s'instal·la el programari de KDE, vegeu [Construir manualment el programari de KDE: El pas d'instal·lació](/docs/getting-started/building/cmake-build/#install).

source: Next we have a very straightforward `Cargo.toml`:
ca: A continuació tenim un `Cargo.toml` molt senzill:

source: It consists of project metadata and a list of dependencies that will be pulled automatically by Cargo, namely `cxx` and `cxx-qt`, which are necessary to run Qt applications written in Rust.
ca: Consisteix en metadades del projecte i una llista de dependències que el Cargo extraurà automàticament, és a dir, `cxx` i `cxx-qt`, que són necessàries per a executar aplicacions Qt escrites en Rust.

source: Where in C++ you'd typically register QML elements with [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) and [ecm_add_qml_module](https://api.kde.org/ecm/module/ECMQmlModule.html) using [declarative registration](https://www.qt.io/blog/qml-type-registration-in-qt-5.15), with Rust you'll need to declare it in a [build script build.rs](https://doc.rust-lang.org/cargo/reference/build-scripts.html) file:
ca: On al C++ normalment registrareu elements QML amb [QML_ELEMENT](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) i el [ecm_add_qml_module](https://api.kde.org/ecm/module/ECMQmlModule.html) utilitzant el [registre declaratiu](https://www.qt.io/blog/qml-type-registration-in-qt-5.15), amb el Rust haureu de declarar-ho en un fitxer [build script build.rs](https://doc.rust-lang.org/cargo/reference/build-scripts.html):

source: This is necessary to make the QML file available in the entrypoint for our application, `main.rs`.
ca: Això és necessari per a fer que el fitxer QML estigui disponible en el punt d'entrada de la nostra aplicació, `main.rs`.

source: The file `kirigami_rust/src/main.rs` initializes the project and then loads the QML file, which will consist of the user interface for the application.
ca: El fitxer `kirigami_rust/src/main.rs` inicialitza el projecte i després carrega el fitxer QML, que consistirà en la interfície d'usuari per a l'aplicació.

source: The first part that is marked with the [#[cxx_qt::bridge]](https://kdab.github.io/cxx-qt/book/bridge/index.html) Rust macro just creates a dummy QObject out of a dummy Rust struct. This is needed just to complete the use of [QmlModule](https://docs.rs/cxx-qt-build/latest/cxx_qt_build/struct.QmlModule.html) in the previous build script `build.rs`. This will play a larger part in a future tutorial teaching how to expose Rust code to QML, but for now you can ignore it.
ca: La primera part que està marcada amb la macro del Rust [#[cxx_qt::bridge]](https://kdab.github.io/cxx-qt/book/bridge/index.html) només crea un QObject fictici a partir d'una estructura Rust fictícia. Això és necessari només per a completar l'ús del [QmlModule](https://docs.rs/cxx-qt-build/latest/cxx_qt_build/struct.QmlModule.html) a l'script de construcció anterior `build.rs`. Això jugarà un paper més important en una guia d'aprenentatge futura ensenyant com exposar el codi Rust al QML, però per ara el podeu ignorar.

source: After this starts the important part:
ca: Després d'això comença la part important:

source: Lines 12-13 import the needed Qt libraries exposed through cxx-qt.
ca: Les línies 12-13 importen les biblioteques Qt necessàries exposades a través de cxx-qt.

source: We first create a new instance of a `QApplication`, then perform a few integrations in lines 20-26.
ca: Primer creem una instància nova d'una `QApplication` i després realitzem algunes integracions en les línies 20-26.

source: Then comes the part that actually creates the application window:
ca: Després ve la part que realment crea la finestra de l'aplicació:

source: The long URL `qrc:/qt/qml/org/kde/tutorial/src/qml/Main.qml` corresponds to the `Main.qml` file according to the [Qt Resource System](https://doc.qt.io/qt-6/resources.html), and it follows this scheme: `<resource_prefix><import_URI><QML_dir><file>`.
ca: L'URL llarg `qrc:/qt/qml/org/kde/tutorial/src/qml/Main.qml` correspon al fitxer `Main.qml` d'acord amb el [Sistema de recursos Qt](https://doc.qt.io/qt-6/resources.html), i segueix aquest esquema: `<resource_prefix><import_URI><QML_dir><file>`.

source: In other words: the default resource prefix `qrc:/qt/qml/` + the import URI `org/kde/tutorial` (set in `build.rs`, separated by slashes instead of dots) + the QML dir `src/qml/` + the QML file `Main.qml`.
ca: En altres paraules: el prefix de recurs predeterminat `qrc:/qt/qml/` + l'URI d'importació `org/kde/tutorial` (establert a `build.rs`, separat per barres en lloc de punts) + el directori QML `src/qml/` + el fitxer QML `Main.qml`.

source: [Kirigami](docs:kirigami2), which provides a number of components suited for creating applications that work across devices of different shapes and sizes.
ca: El [Kirigami](docs:kirigami2), que proporciona una sèrie de components adequats per a crear aplicacions que funcionen en dispositius de formes i mides diferents.
eo: [Kirigami](docs:kirigami2), kiu provizas kelkajn komponantojn taŭgajn por krei aplikojn, kiuj funkcias trans aparatoj de malsamaj formoj kaj grandecoj.
es: [Kirigami](docs:kirigami2), que proporciona cierto número de componentes adecuados para crear aplicaciones que funcionan en dispositivos de diferentes formas y tamaños.
nl: [Kirigami](docs:kirigami2), die een aantal componenten levert geschikt voor het aanmaken van toepassingen die werken over apparaten met verschillende vormen en groottes.
pt: O [Kirigami](docs:kirigami2), que oferece um conjunto de componentes adequados para criar aplicações que funcionam bem entre dispositivos de formas e tamanhos diferentes.
sv: [Kirigami](docs:kirigami2), som tillhandahåller ett antal komponenter lämpade för att skapa program som fungerar över apparater av olika form och storlek.
uk: [Kirigami](docs:kirigami2), яка містить декілька компонентів, які пристосовано для створення програм, що можуть працювати на різних пристроях і екранах з різними формами та розмірами.

source: We then come to our base element, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), which provides some basic features needed for all Kirigami applications. This is the window that will contain each of our pages, the main sections of our UI.
ca: Després arribem al nostre element base, la [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), que proporciona algunes característiques bàsiques necessàries per a totes les aplicacions escrites amb el Kirigami. Aquesta és la finestra que contindrà cadascuna de les nostres pàgines, les seccions principals de la nostra interfície d'usuari.
eo: Ni tiam venas al nia baza elemento, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), kiu provizas kelkajn bazajn funkciojn necesajn por ĉiuj Kirigami-aplikoj. Ĉi tiu estas la fenestro, kiu enhavos ĉiun el niaj paĝoj, la ĉefaj sekcioj de nia UI.
es: Luego llegamos a nuestro elemento base, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), que proporciona algunas funcionalidades básicas que son necesarias para todas las aplicaciones de Kirigami. Esta es la ventana que contendrá todas nuestras páginas, las secciones principales de nuestra interfaz de usuario.
nl: Daarna komen we bij ons basiselement, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) die enige basis functies levert nodig voor alle Kirigami toepassen. Dit is het venster dat elk van onze pagina's bevat, de hoofdsecties van onze UI.
pt: Iremos então voltar ao nosso elemento de base, o [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) que oferece algumas funcionalidades básicas necessárias para todas as aplicações de Kirigami. Esta é a janela que irá conter cada uma das nossas páginas, as secções principais da nossa interface.
sv: Sedan kommer vi till vårt baselement, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) som tillhandahåller några grundfunktioner nödvändiga för alla Kirigami-program. Det är fönstret som kommer att innehålla alla våra sidor, huvuddelen av vårt användargränssnitt.
uk: Далі, ми перейдемо до нашого базового елемента, [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), який надає певні базові можливості, потрібні для усіх програм Kirigami. Це вікно, які міститиме усі наші сторінки, основні розділи нашого інтерфейсу користувача.

source: We then set the first page of our page stack. Most Kirigami applications are organised as a stack of pages, each page containing related components suited to a specific task. For now, we are keeping it simple, and sticking to a single page. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) is an initially empty stack of pages provided by [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), and with `pageStack.initialPage: Kirigami.Page {...}` we set the first page presented upon loading the application to a [Kirigami.Page](docs:kirigami2;Page). This page will contain all our content.
ca: Després establirem la primera pàgina de la nostra pila de pàgines. La majoria de les aplicacions escrites amb el Kirigami estan organitzades com una pila de pàgines, cada pàgina conté els components relacionats adequats per a una tasca específica. Per ara, el mantenim senzill i ens cenyim a una sola pàgina. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) és una pila inicialment buida de pàgines proporcionades per [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), i amb `pageStack.initialPage: Kirigami.Page{...}` establim la primera pàgina presentada en carregar l'aplicació a una [Kirigami.Page](docs:kirigami2;Page). Aquesta pàgina contindrà tot el nostre contingut.
eo: Ni tiam starigas la unuan paĝon de nia paĝa stako. Plej multaj Kirigami-aplikoj estas organizitaj kiel stako de paĝoj, ĉiu paĝo enhavante rilatajn komponentojn taŭgajn por specifa tasko. Nuntempe, ni tenas ĝin simpla, kaj algluiĝas al ununura paĝo. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) estas komence malplena stako de paĝoj provizita de [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), kaj kun `pageStack.initialPage: Kirigami.Page {...} ` ni agordas la unuan paĝon prezentitan post ŝargo de la aplikaĵo al [Kirigami.Paĝo](docs:kirigami2;Paĝo). Ĉi tiu paĝo enhavos nian tutan enhavon.
nl: Daarna zetten we de eerste pagina van onze pagina stapel. De meeste Kirigami toepassingen zijn georganiseerd als een stapel pagina's, elke pagina bevat gerelateerde componenten passend bij een specifieke taak. Voor nu houden we het eenvoudig en blijven bij een enkele pagina. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) is een initieel lege stapel pagina's geleverd door [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) en met `pageStack.initialPage: Kirigami.Page {...}` zetten we de eerste pagina op gepresenteerd bij het laden van de toepassing op een [Kirigami.Page](docs:kirigami2;Page). Deze pagina zal al onze inhoud zal bevatten.
pt: Definimos então a primeira página da nossa pilha de páginas. A maioria das aplicações do Kirigami são organizadas como uma pilha de páginas, contendo cada uma os componentes relacionados e adequados para uma dada tarefa. Por agora, iremos mantê-la simples e ficaremos apenas com uma única página. A [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) é uma pilha inicialmente vazia de páginas fornecidas pelo [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), e com a `pageStack.initialPage: Kirigami.Page {...}`, iremos configurar a primeira página apresentada ao carregar a aplicação como uma [Kirigami.Page](docs:kirigami2;Page), a qual irá conter todo o nosso conteúdo.
sv: Därefter anger vi första sidan i vår sidstapel. Del flesta Kirigami-program är organiserade som en stapel av sidor, där varje sida innehåller relaterade komponenter anpassade för en viss uppgift. För närvarande låter vi det vara enkelt, och håller oss till en enda sida. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) är en sidstapel som initialt är tom som [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) tillhandahåller, och med `pageStack.initialPage: Kirigami.Page {...}` ställer vi in den första sidan som presenteras när programmet laddas i en [Kirigami.Page](docs:kirigami2;Page). Sidan står för allt vårt innehåll.
uk: Далі, ми визначаємо першу сторінку нашого стосу сторінок. Більшість програм Kirigami упорядковано як стос сторінок — кожну сторінку призначено для виконання окремого завдання. У нашому прикладі ми створимо простий стос, який складатиметься із однієї сторінки. [pageStack](docs:kirigami2;AbstractApplicationWindow::pageStack) є початково порожнім стосом сторінок, роботу якого забезпечує [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow), і за допомогою `pageStack.initialPage: Kirigami.Page{...}` ми задаємо для першої сторінки, яку буде показано після завантаження програми, значення [Kirigami.Page](docs:kirigami2;Page). Відповідна сторінка міститиме усі наші дані.
