Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) is a delegate intended to support extra actions. When using a mouse, its actions will always be shown. On a touch device, they can be shown by dragging the item with the handle. In the following pictures, these are the icons to the right.
eo: [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) estas delegito intencita por subteni kromajn agojn. Kiam vi uzas muson, ĝiaj agoj ĉiam estos montritaj. Sur tuŝa aparato, ili povas esti montritaj trenante la objekton per la tenilo. En la sekvaj bildoj, ĉi tiuj estas la piktogramoj dekstre.
es: Un [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) es un delegado diseñado para permitir acciones adicionales. Cuando se usa un ratón, siempre se mostrarán sus acciones. En un dispositivo táctil, se mostrará al arrastrar el elemento mediante un asa. En las siguientes imágenes, son los iconos de la derecha.
nl: Een [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) is een gedelegeerde bedoeld om extra acties te ondersteunen. Bij gebruik van een muis zullen ze altijd getoond worden. Op een aanraakscherm kunnen ze getoond worden door het item met de hendel te verslepen. In de volgende plaatjes zijn dit de pictogrammen rechts.
pt: Um [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) é um objecto-delegado que pretende dar suporte a acções extras. Ao usar um rato, as mesmas irão aparecer à passagem. Num dispositivo táctil, as mesmas poderão aparecer se arrastar o item com a pega. Nas seguintes imagens, estes são os ícones à direita.
sv: En [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) är en delegat avsedd att stödja extra åtgärder. När en mus används, visas dess åtgärder alltid. På en pekskärm kan de visas genom att dra objektet med greppet. På följande bilder är det ikonerna till höger.
uk: [Kirigami.SwipeListItem](docs:kirigami2;SwipeListItem) представником об'єкта, який призначено для забезпечення підтримки додаткових дій. Якщо використовується миша, його дії буде показано завжди. На сенсорному пристрої доступ до дій можна отримати перетягуванням пункту за допомогою елемента керування. На наведених нижче зображеннях ці піктограми показано праворуч.

source: A [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) is a toolbar built out of a list of actions. By default, each action that will fit in the toolbar will be represented by a [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), with those that do not fit being moved into a menu at the end of the toolbar.
eo: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) estas ilobreto konstruita el listo de agoj. Defaŭlte, ĉiu ago kiu konvenos en la ilobreto estos reprezentita per [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), kun tiuj kiuj ne taŭgas estos movitaj en menuon ĉe la fino de la ilobreto.
es: Una [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) es una barra de herramientas creada a partir de una lista de acciones. De forma predeterminada, cada acción que quepa en la barra de herramientas se representará mediante un [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), mientras que las que no quepan se moverán a un menú en un extremo de la barra de herramientas.
nl: Een [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) is een werkbalk opgebouwd uit een lijst met acties. Standaard zal elke actie die past in de werkbalk gerepresenteerd worden door een [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), met diegenen die niet passen op de werkbalk verplaatst naar een menu aan het eind van de werkbalk.
pt: Uma [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) é uma barra de ferramentas construída com base numa lista de acções. Por omissão, cada acção que caiba na barra de ferramentas será representada como um [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), sendo que as que não caibam irão para um menu no fim da barra de ferramentas.
sv: En [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) är en verktygsrad byggd av en lista över åtgärder. Normalt representeras varje åtgärd som får plats på verktygsraden med en [verktygsknapp](docs:qtquickcontrols;QtQuick.Controls.ToolButton), medan de som inte får plats flyttas till en meny i slutat på verktygsraden.
uk: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) — панель інструментів, яку побудовано на основі списку дій. Типово, кожен пункт дії, який вміщується на панель інструментів, буде представлено [ToolButton](docs:qtquickcontrols;QtQuick.Controls.ToolButton), а ті, які не вмістилися, буде пересунуто до меню у кінцевій частині панелі інструментів.

source: Like [ActionTextField](docs:kirigami2;ActionTextField), you may not need to use [ActionToolBar](docs:kirigami2;ActionToolBar) directly as it is used by page headers and cards to provide their action display.
eo: Same kiel [ActionTextField](docs:kirigami2;ActionTextField), vi eble ne bezonos uzi [ActionToolBar](docs:kirigami2;ActionToolBar) rekte ĉar ĝi estas uzata de paĝaj kaplinioj kaj kartoj por provizi ilian agomontron.
es: Como [ActionTextField](docs:kirigami2;ActionTextField), no necesita usar [ActionToolBar](docs:kirigami2;ActionToolBar) directamente, ya que la usan las cabeceras de las páginas y de las tarjetas para mostrar sus acciones.
nl: Net als [ActionTextField](docs:kirigami2;ActionTextField), hoeft u [ActionToolBar](docs:kirigami2;ActionToolBar) niet noodzakelijk direct, zoals het wordt gebruikt door paginakoppen en kaarten, te gebruiken om hun actiescherm te leveren.
pt: Como o [ActionTextField](docs:kirigami2;ActionTextField), poderá não necessitar de usar o [ActionToolBar](docs:kirigami2;ActionToolBar) directamente, dado que é usado pelos cabeçalhos das páginas e cartões para fornecer a sua apresentação das acções.
sv: Liksom [ActionTextField](docs:kirigami2;ActionTextField), behöver du nog inte använda [ActionToolBar](docs:kirigami2;ActionToolBar) direkt, eftersom den används av sidhuvuden och kort för att tillhandahålla deras egen åtgärdsvisning.
uk: Подібно до [ActionTextField](docs:kirigami2;ActionTextField), [ActionToolBar](docs:kirigami2;ActionToolBar) не варто використовувати безпосередньо, оскільки він використовується заголовками сторінок і картками для забезпечення показу їхніх пунктів дій.

source: You can read more about [ActionToolBar](docs:kirigami2;ActionToolBar) components in their [dedicated documentation page](../components-actiontoolbar/).
eo: Vi povas legi pli pri [ActionToolBar](docs:kirigami2;ActionToolBar) komponantoj en ilia [dediĉita dokumentadopaĝo](../components-actiontoolbar/).
es: Puede leer más sobre los componentes [ActionToolBar](docs:kirigami2;ActionToolBar) en su [propia página de documentación](../components-actiontoolbar/).
nl: U kunt meer over [ActionToolBar](docs:kirigami2;ActionToolBar) componenten lezen in hun [daaraan gewijde documentatiepagina](../components-actiontoolbar/).
pt: Poderá ler mais sobre os componentes [ActionToolBar](docs:kirigami2;ActionToolBar) na sua [página de documentação dedicada](../components-actiontoolbar/).
sv: Du kan läsa mer om komponenter i [ActionToolBar](docs:kirigami2;ActionToolBar) på deras [dedicerade dokumentationssida](../components-actiontoolbar/).
uk: Із докладнішим описом компонентів [ActionToolBar](docs:kirigami2;ActionToolBar) можна ознайомитися за допомогою [спеціалізованої сторінки документації](../components-actiontoolbar/).

source: A [Kirigami.Card](docs:kirigami2;Card) is used to display a collection of information or actions together. These actions can be added to the `actions` group, similarly to previous components.
eo: [Kirigami.Karto](docs:kirigami2;Karto) estas uzata por montri kolekton de informoj aŭ agoj kune. Ĉi tiuj agoj povas esti aldonitaj al la grupo `agoj', simile al antaŭaj komponantoj.
es: Una [Kirigami.Card](docs:kirigami2;Card) se usa para mostrar una colección de información o acciones juntas. Dichas acciones se pueden añadir al grupo `actions`, del mismo modo que los componentes anteriores.
nl: Een [Kirigami.Card](docs:kirigami2;Card) wordt gebruikt om een verzameling informatie of acties tezamen te tonen. Deze acties kunnen toegevoegd worden aan de groep `actions`, vergelijkbaar met eerdere componenten.
pt: Um [Kirigami.Card](docs:kirigami2;Card) é usado para apresentar uma colecção de informações ou acções em conjunto. Estas acções poderão ser adicionadas ao grupo `actions`, de forma semelhante aos componentes anteriores.
sv: En [Kirigami.Card](docs:kirigami2;Card) används för att visa en samling av information eller åtgärder tillsammans. Åtgärderna kan läggas till i gruppen `actions`, på liknande sätt som för tidigare komponenter.
uk: [Kirigami.Card](docs:kirigami2;Card) використовують для показу збірки відомостей або набору кнопок. Ці кнопки можна додати до групи `actions`, подібно до попередніх компонентів.

source: Kirigami provides the component [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). It displays a list of [Kirigami.Action](docs:kirigami2;Action) objects and will display as many of them as possible, providing an overflow menu for the ones that don't fit. The ActionToolBar is dynamic and will move actions in and out of the overflow menu depending on the size available to it.
eo: Kirigami provizas la komponanton [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). Ĝi montras liston de [Kirigami.Action](docs:kirigami2;Action) objektoj kaj montros kiel eble plej multajn el ili, disponigante superfluan menuon por tiuj, kiuj ne taŭgas. La ActionToolBar estas dinamika kaj movos agojn en kaj el la superflua menuo depende de la grandeco disponebla al ĝi.
es: Kirigami proporciona el componente [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). Muestra una lista de objetos [Kirigami.Action](docs:kirigami2;Action) que contendrá tantos como sea posible, proporcionando un menú de sobrantes para los que no quepan en ella. La ActionToolBar es dinámica y moverá acciones dentro y fuera del menú de sobrantes dependiendo del tamaño disponible para ella.
nl: Kirigami levert de component [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). Het zal een lijst met objecten [Kirigami.Action]docs:kirigami2;Action) tonen en zal er zoveel als mogelijk tonen, en een overflow-menu tonen voor diegenen die niet passen. De ActionToolBar is dynamisch en zal acties in en uit het overflow-menu plaatsen afhankelijk van de er voor beschikbare grootte.
pt: O Kirigami oferece o componente [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). O mesmo irá mostrar uma lista de objectos [Kirigami.Action](docs:kirigami2;Action) e irá mostrar o máximo possível, oferecendo um menu com o excedente para os que não couberem. O ActionToolBar é dinâmico e irá mover as acções para dentro e para fora do menu excedentário, dependendo do tamanho disponível para ele.
sv: Kirigami tillhandahåller komponenten [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). Den visar en lista över [Kirigami.Action](docs:kirigami2;Action) objekt och visar så många av dem som möjligt, och tillhandahåller en överflödesmeny för de som inte får plats. ActionToolBar är dynamisk och flyttar åtgärderna in och ut från överflödesmenyn beroende på tillgänglig storlek.
uk: До складу Kirigami включено компонент [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar). Він показує список об'єктів [Kirigami.Action](docs:kirigami2;Action) так, щоб область перегляду вмістила якомога більше об'єктів, надаючи меню переповнення із тими об'єктами, які не вмістилися до області перегляду. ActionToolBar є динамічним об'єктом — пересуває пункти до меню переповнення і з меню переповнення, залежно від доступного розміру.

source: This page assumes you are familiar with [Kirigami.Action](docs:kirigami2;Action) objects. If you are not, you can learn all about them in our beginner tutorial or in [the dedicated documentation page for them](../components-actions/).
eo: Ĉi tiu paĝo supozas, ke vi konas [Kirigami.Action](docs:kirigami2;Action) objektojn. Se vi ne estas, vi povas lerni ĉion pri ili en nia komencanta lernilo aŭ en [la dediĉita dokumentadopaĝo por ili](../components-actions/).
es: Esta página supone que está familiarizado con los objetos [Kirigami.Action](docs:kirigami2;Action). En caso contrario, puedes aprender todo lo necesario sobre ellos en nuestro tutorial para principiantes o en [la página de documentación dedicada a los mismos](../components-actions/).
nl: Deze pagina neemt aan dat u bekend bent met [Kirigami.Action](docs:kirigami2;Action) objecten. Zo niet, u kunt er alles over leren in onze inleiding voor beginners of in [de toegewijde documentatiepagina voor hen](../components-actions/).
pt: Esta página assume que está familiarizado com os objectos [Kirigami.Action](docs:kirigami2;Action). Se não estiver, poderá aprender tudo sobre eles no nosso tutorial para principiantes ou na [página dedicada da documentação sobre eles](../components-actions/).
sv: Sidan antar att du är bekant med objekten i [Kirigami.Action](docs:kirigami2;Action). Om det inte är fallet, kan du lära dig allt om dem i vår nybörjarhandledning eller på [dokumentationssidan tillägnad till dem](../components-actions/).
uk: На цій сторінці ми припускаємо, що ви вже познайомилися із об'єктами [Kirigami.Action](docs:kirigami2;Action). Якщо це не так, ви можете дізнатися про них усе у нашому початковому підручнику або на [спеціальній сторінці документації щодо них](../components-actions/).

source: The layout and location of your [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) are really up to you, though for the sake of user-friendliness it is usually a good idea to stick to UI conventions and put your toolbar near the top or bottom of your page and to have it spread width wise.
eo: La aranĝo kaj loko de via [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) vere dependas de vi, kvankam pro facileco de uzado estas kutime bona ideo aliĝi al UI-konvencioj kaj meti vian ilobreton proksime al la supro. aŭ malsupro de via paĝo kaj havi ĝin disvastigi larĝeco.
es: El diseño y la ubicación de su [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) dependen realmente de usted, aunque en aras de la facilidad de uso, suele ser una buena idea ceñirse a las convenciones de interfaces de usuario y colocar la barra de herramientas cerca de la parte superior o inferior de la página y que se extienda a lo ancho.
nl: De indeling en locatie van uw [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) zijn echt aan u, hoewel voor gebruikersvriendelijkheid is het gewoonlijk een goed idee om bij UI-conventies te blijven en uw werkbalk boven of onderaan uw pagina te te plaatsen in om het in de breedte te spreiden.
pt: A disposição e localização do seu [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) são realmente à sua escolha se bem que, por questões de usabilidade, é normalmente uma boa ideia seguir as convenções de interfaces e colocar a sua barra de ferramentas perto do topo ou do fundo da sua página, tendo-a disposta em toda a largura do ecrã.
sv: Layout och plats för din [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) är helt upp till dig, även om för att vara användarvänlig är det oftast en bra idé att hålla sig till konventioner för användargränssnittet och placera verktygsraden nära toppen och längst ner på sidan och låta den sprida sig på bredden.
uk: Компонування і розташування вашого [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) визначається лише вами, хоча з міркувань зручності у користуванні, зазвичай, варто користуватися традиційними принципами і розташовувати панель інструментів у верхній або нижній частині сторінки, розтягнувши її на усю ширину області перегляду.

source: Like most other action-holding components, [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) has an [actions](docs:kirigami2;ActionToolBar::actions) property. We can assign an array of [Kirigami.Action](docs:kirigami2;Action) components to this property.
eo: Kiel plej multaj aliaj ag-tenantaj komponentoj, [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) havas [actions](docs:kirigami2;ActionToolBar::actions) proprecon. Ni povas asigni tabelon de [Kirigami.Action](docs:kirigami2;Action) komponantoj al ĉi tiu propreco.
es: Como la mayoría del resto de componentes que contienen acciones, [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) tiene una propiedad [actions](docs:kirigami2;ActionToolBar::actions). Podemos asignar una matriz de componentes [Kirigami.Action](docs:kirigami2;Action) a dicha propiedad.
nl: Zoals de meeste andere actiehoudende componenten, heeft [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) een eigenschap [actions](docs:kirigami2;ActionToolBar::actions). We kunnen een array met componenten [Kirigami.Action](docs:kirigami2;Action) aan deze eigenschap toekennen.
pt: Como na maioria dos componentes que contêm acções, o [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) tem uma propriedade [actions](docs:kirigami2;ActionToolBar::actions). Podemos atribuir uma lista de componentes [Kirigami.Action](docs:kirigami2;Action) a esta propriedade.
sv: Liksom de flesta andra komponenter som innehåller åtgärder, har [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) egenskapen [actions](docs:kirigami2;ActionToolBar::actions). Vi kan tilldela ett fält av [Kirigami.Action](docs:kirigami2;Action) komponenter till egenskapen.
uk: Подібно до більшості компонентів, які містять пункти дій, [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) має властивість [actions](docs:kirigami2;ActionToolBar::actions). Пов'язати із цією властивістю можна масив компонентів [Kirigami.Action](docs:kirigami2;Action).

source: By default, actions in the [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) will be left aligned. This might not be desirable in all situations. Thankfully we can change this with the [alignment](docs:kirigami2;ActionToolBar::alignment) property. We can set this property to a range of values, but the three most relevant ones are `Qt.AlignLeft`, `Qt.AlignCenter`, and `Qt.AlignRight` (which deal with [horizontal alignment](docs:qtcore;Qt::Alignment)).
eo: Defaŭlte, agoj en la [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) restos vicigitaj. Ĉi tio eble ne estas dezirinda en ĉiuj situacioj. Feliĉe ni povas ŝanĝi ĉi tion per la proprieto [alignment](docs:kirigami2;ActionToolBar::alignment). Ni povas agordi ĉi tiun proprecon al gamo da valoroj, sed la tri plej gravaj estas `Qt.AlignLeft`, `Qt.AlignCenter`, kaj `Qt.AlignRight` (kiuj traktas [horizontala vicigo](docs:qtcore;Qt). ::Alineado)).
es: Por omisión, las acciones de una [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) estarán alineadas a la izquierda. Es posible que esto no sea deseable en todas las situaciones. Afortunadamente, podemos cambiar esto con la propiedad [alignment](docs:kirigami2;ActionToolBar::alignment). Podemos definir esta propiedad con diversos valores, pero los tres más relevantes son `Qt.AlignLeft`, `Qt.AlignCenter` y `Qt.AlignRight` (que se ocupan del [alineamiento horizontal](docs:qtcore;Qt::Alignment)).
nl: Standaard worden acties in de [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) links uitgelijnd. Dit kan niet in alle situaties gewenst zijn. Gelukkig kunnen we dit wijzigen met de eigenschap [alignment](docs:kirigami2;ActionToolBar::alignment). We kunnen deze eigenschap instellen op een reeks van waarden, maar de drie meest relevante zijn `Qt.AlignLeft`, `Qt.AlignCenter` en `Qt.AlignRight` (die met [horizontale uitlijning](docs:qtcore;Qt::Alignment) zich bezig houden).
pt: Por omissão, as acções na [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) estarão alinhadas à esquerda. Isto poderá não ser o desejável em todas as situações. Felizmente, podemos alterar isto com a propriedade [alignment](docs:kirigami2;ActionToolBar::alignment). Podemos configurar esta propriedade com um conjunto de valores, mas os três mais relevantes para uma ActionToolBar são o `Qt.AlignLeft`, `Qt.AlignCenter` e `Qt.AlignRight` (que lidam com o [alinhamento horizontal](docs:qtcore;Qt::Alignment)).
sv: Normalt är åtgärder i en [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) vänsterjusterade. Det kanske inte är önskvärt i alla situationer. Som tur är kan vi ändra det med egenskapen [alignment](docs:kirigami2;ActionToolBar::alignment). Vi kan ställa in egenskapen till ett intervall av olika värden, men de tre mest relevanta för ActionToolBar är `Qt.AlignLeft`, `Qt.AlignCenter` och `Qt.AlignRight` (som hanterar [horisontell justering](docs:qtcore;Qt::Alignment)).
uk: Типово, пункти дій на [ActionToolBar]([Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar)) буде вирівняно ліворуч. Таке вирівнювання є не завжди бажаним. На щастя, ми можемо змінити це за допомогою властивості [alignment](docs:kirigami2;ActionToolBar::alignment). Для цієї властивості ви можете встановити діапазон значень, але трьома найпоширенішими для ActionToolBar є `Qt.AlignLeft`, `Qt.AlignCenter` і `Qt.AlignRight` (які стосуються [горизонтального вирівнювання](docs:qtcore;Qt::Alignment)).

source: The Kirigami types [AbstractCard](docs:kirigami2;AbstractCard) and [Card](docs:kirigami2;Card) are used to implement the popular card component used on many mobile and web platforms. Cards can be used to display a collection of information or actions in an attractive and distinctive way.
eo: La Kirigami-tipoj [AbstractCard](docs:kirigami2;AbstractCard) kaj [Karto](docs:kirigami2;Karto) estas uzataj por efektivigi la popularan kartkomponenton uzatan en multaj moveblaj kaj retplatformoj. Kartoj povas esti uzataj por montri kolekton de informoj aŭ agoj laŭ alloga kaj karakteriza maniero.
es: Los tipos de Kirigami [AbstractCard](docs:kirigami2;AbstractCard) y [Card](docs:kirigami2;Card) se usan para implementar el popular componente de tarjeta que se usa en muchas plataformas móviles y web. Las tarjetas se pueden usar para mostrar una recopilación de información o acciones de una forma atractiva y distintiva.
nl: De Kirigami typen [AbstractCard](docs:kirigami2;AbstractCard) en [Card](docs:kirigami2;Card) worden gebruikt om de populaire kaartcomponent gebruikt op vele mobiele en webplatforms te implementeren. Kaarten kunnen gebruikt worden om een hoeveelheid information of acties op een attractieve en kenmerkende manier te tonen.
pt: Os tipos do Kirigami [AbstractCard](docs:kirigami2;org::kde::kirigami::AbstractCard) e [Card](docs:kirigami2;org::kde::kirigami::Card) são usados para implementar o conhecido componente de cartões que é usado por várias plataformas móveis e da Web. Os cartões poderão ser usados para mostrar uma colecção de informações ou acções de uma forma atractiva e distinta.
sv: Kirigami-typerna [AbstractCard](docs:kirigami2;AbstractCard) och [Card](docs:kirigami2;Card) används för att implementera den populära komponenten card som används av många mobil- och webbplattformar. Kort kan användas för att visa samlad information eller samlade åtgärder på ett attraktivt och distinkt sätt.
uk: Типи Kirigami [AbstractCard](docs:kirigami2;AbstractCard) і [Card](docs:kirigami2;Card) використовують для реалізації популярного компонента картки, який використовується на багатьох мобільних платформах та інтернет-платформах. Картками можна скористатися для показу збірки відомостей або пунктів дій у привабливий та виразний спосіб.

source: AbstractCard
eo: Abstrakta Karto
pl: Abstrakcyjna karta
