Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: On a desktop, when a window has enough space, contextual actions show up as part of the `actions` group in the top toolbar. When space is limited, such as on a mobile device or in a narrow window, contextual actions are hidden behind a hamburger menu on the right side. This is different from other actions in the `actions` group, namely `actions.main`, `actions.left` and `actions.right`; these do not get hidden in space-constrained windows, and are instead collapsed into their respective icons.
eo: Sur labortablo, kiam fenestro havas sufiĉe da spaco, kuntekstaj agoj aperas kiel parto de la grupo "agoj" en la supra ilobreto. Kiam spaco estas limigita, kiel ĉe poŝtelefono aŭ en mallarĝa fenestro, kontekstaj agoj estas kaŝitaj malantaŭ hamburgera menuo dekstre. Tio diferencas de aliaj agoj en la grupo `actions`, nome `actions.main`, `actions.left` kaj `actions.right`; tiuj ne estas kaŝitaj en spac-limigitaj fenestroj, kaj estas anstataŭe kolapsitaj en siajn respektivajn piktogramojn.
nl: Op een bureaublad, wanneer een venster genoeg ruimte heeft, verschijnen contextuele acties als deel van de groep `acties` in de werkbalk boven. Wanneer ruimte beperkt is, zoals op een mobiel apparaat of in een nauw venster, worden contextuele acties verborgen achter een hamburgermenu rechts. Dit is anders uit andere acties in de groep `acties`, namelijk `actions.main`, `actions.left` en `actions.right`; dezen worden niet verborgen in vensters met beperkte ruimte en worden in plaats daarvan ingevouwen in hun respectievelijke pictogrammen.
pt: Num computador, quando uma janela tem espaço suficiente, as acções de contexto aparecem como parte do grupo `actions` na barra de ferramentas de topo. Quando o espaço é limitado, como acontece num dispositivo móvel ou numa janela estreita, as acções de contexto ficam escondidas num menu em hambúrguer do lado direito. Isto é diferente das outras acções no grupo `actions`, nomeadamente as `actions.main`, `actions.left` e `actions.right`; estas não ficam escondidas nas janelas bastante reduzidas, sendo sim reduzidas nos seus respectivos ícones.
sl: Na namizju, ko ima okno dovolj prostora, se kontekstna dejanja prikažejo kot del skupine `actions` v zgornji orodni vrstici. Kadar je prostor omejen, na primer na mobilni napravi ali v ozkem oknu, se kontekstna dejanja skrivajo za hamburger menijem na desni strani. To se razlikuje od drugih dejanj v skupini `actions`, in sicer `actions.main`, `actions.left` in `actions.right`; Te se ne skrivajo v prostoru omejenih oken in se namesto tega strnijo v njihove ikone.
sv: På en skrivbordsdator, när ett fönster har tillräckligt med utrymme, visas sammanhangsberoende åtgärder som en del av gruppen `actions` på det övre verktygsraden. När utrymmet är begränsat, till exempel på en mobil eller i ett smalt fönster, döljs sammanhangsberoende åtgärder bakom en hamburgermeny på höger sida. Det skiljer sig från andra åtgärder i gruppen `actions`, nämligen `actions.main`, `actions.left` och `actions.right`; de göms inte i fönster med begränsat utrymme, utan dras istället ihop till sina respektive ikoner.
uk: На робочій станції, якщо у вікна достатньо місця, пункти контекстних дій буде показано як частину групи `actions` на верхній панелі інструментів. Якщо місце обмежено, зокрема на мобільних пристроях або у вузьких вікнах, пункти контекстних дій буде приховано за меню-гамбургером у правій частині вікна. Ця поведінка є відмінною від інших пунктів дій у групі `actions`, зокрема `actions.main`, `actions.left` і `actions.right`; ці пункти дій не буде приховано у вікнах із обмеженим розміром. Замість того, їх буде згорнуто до відповідних піктограм.

source: These two drawers are so similar because they can, in fact, be implemented using the same Kirigami component: [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer). Here are a few important inherited properties of this component to keep in mind:
eo: Ĉi tiuj du tirkestoj estas tiel similaj ĉar ili povas, fakte, esti efektivigitaj uzante la saman Kirigami-komponenton: [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer). Jen kelkaj gravaj hereditaj propraĵoj de ĉi tiu ero por memori:
nl: Deze twee schuifladen zijn zo gelijk omdat ze, in feite, met gebruik van dezelfde Kirigami component: [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer) zijn geïmporteerd. Hier zijn enkele belangrijke geërfde eigenschappen van deze component om te onthouden:
pt: Estas das áreas são muito parecidas porque, de facto, são o mesmo componente do Kirigami: o [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer). Algumas propriedades deste componente a ter em mente:
sv: De två lådorna är så lika eftersom de i själva verket kan implementeras med samma komponent i Kirigami: [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer). Här är några viktiga egenskaper i komponenten att hålla i minnet:
uk: Ці дві висувні панелі є подібними, оскільки вони, фактично, можуть бути реалізовані за допомогою одного компонента — [Kirigami.OverlayDrawer](docs:kirigami2;OverlayDrawer). Ось декілька важливих успадкованих властивостей цього компонента, про які слід пам'ятати:

source: [Kirigami.FormLayout](docs:kirigami2;FormLayout) components make it easy for you to create forms that conform to the [KDE Human Interface Guidelines](https://develop.kde.org/hig/). They are optimal for settings dialogs and for large groups of controls and input fields that are related to each other.
eo: [Kirigami.FormLayout](docs:kirigami2;FormLayout) komponantoj faciligas al vi krei formojn konformajn al la [KDE-Homa Interfaco-Gvidlinioj](https://develop.kde.org/hig/). Ili estas optimumaj por agordaj dialogoj kaj por grandaj grupoj de regiloj kaj enigkampoj kiuj rilatas unu al la alia.
es: Los componentes [Kirigami.FormLayout](docs:kirigami2;FormLayout) le facilitan la creación de formularios que se ajusten a las [Directrices de interfaces humanas de KDE](https://develop.kde.org/hig/). Son óptimos para los cuadros de diálogo de configuración y para grandes grupos de controles y campos de entrada que están relacionados entre sí.
nl: De componenten [Kirigami.FormLayout](docs:kirigami2;FormLayout) maken het gemakkelijk voor u om formulieren te maken die zich conformeren aan de [KDE Human Interface Guidelines](https://develop.kde.org/hig/). Ze zijn optimaal voor dialogen voor instellingen en voor grote groepen besturingselementen en invoervelden die bij elkaar horen.
pt: Os componentes [Kirigami.FormLayout](docs:kirigami2;FormLayout) tornam simples para si a criação de formulários em conformidade com as [Linhas-Mestras de Interface Humana do KDE](https://develop.kde.org/hig/). São óptimas para janelas de configuração e para grandes grupos de controlos e campos de entrada relacionados entre si.
sv: [Kirigami.FormLayout](docs:kirigami2;FormLayout) komponenter gör det enkelt för dig att skapa formulär som uppfyller KDE:s [Human Interface Guidelines](https://develop.kde.org/hig/). De är optimala för inställningsdialogrutor och för stora grupper av kontroller och inmatningsfält som är relaterade till varandra.
uk: Компоненти [Kirigami.FormLayout](docs:kirigami2;FormLayout) спрощують для вас створення форм, які відповідають [настановам зі створення зручних інтерфейсів KDE](https://develop.kde.org/hig/). Вони є оптимальними для вікон параметрів роботи програми або великих груп елементів керування та полів введення, які пов'язано між собою.

source: [Kirigami.FormLayout](docs:kirigami2;FormLayout) components are similar in use to [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) components such as [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) or [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). The child components will be automatically arranged according to the size available to the form layout.
eo: [Kirigami.FormLayout](docs:kirigami2;FormLayout) komponantoj estas similaj en uzo al [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) komponantoj kiel [ColumnLayout]( https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) aŭ [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout .html). La infanaj komponantoj estos aŭtomate aranĝitaj laŭ la grandeco disponebla al la formo-aranĝo.
es: El uso de los componentes [Kirigami.FormLayout](docs:kirigami2;FormLayout) es similar al de los componentes de [diseño de QtQuick](https://doc.qt.io/qt-6/qtquicklayouts-index.html), como [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) o [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). Los componentes hijos se organizarán automáticamente según el espacio disponible para el diseño del formulario.
nl: [Kirigami.FormLayout](docs:kirigami2;FormLayout) componenten zijn in gebruik gelijk aan de componenten [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) zoals [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) of [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). De kindcomponenten zullen automatisch gearrangeerd worden volgens de grootte beschikbaar in de formulierindeling.
pt: Os componentes [Kirigami.FormLayout](docs:kirigami2;FormLayout) são semelhantes aos componentes [Layout do QtQuick](https://doc.qt.io/qt-6/qtquicklayouts-index.html), como o [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) ou o [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). Os componentes filhos serão organizados automaticamente de acordo com o tamanho disponível na disposição do formulário.
sv: [Kirigami.FormLayout](docs:kirigami2;FormLayout) komponenter har liknande användning som [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) komponenter såsom [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) eller [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). De underliggande komponenterna arrangeras automatiskt enligt storleken tillgänglig för formulärlayouten.
uk: Компоненти [Kirigami.FormLayout](docs:kirigami2;FormLayout) подібні у використанні до компонентів [компонування QtQuick](https://doc.qt.io/qt-6/qtquicklayouts-index.html), зокрема [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) або [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). Дочірні компоненти буде автоматично упорядковано відповідно до розміру, який доступний до компонування форми.

source: Children of a [Kirigami.FormLayout](docs:kirigami2;FormLayout) have a property named [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). This property lets you set the label that will be provided for the child component in question.
eo: Infanoj de [Kirigami.FormLayout](docs:kirigami2;FormLayout) havas proprecon nomitan [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Ĉi tiu propreco ebligas al vi agordi la etikedon, kiu estos provizita por la koncerna infana komponanto.
es: Los hijos de [Kirigami.FormLayout](docs:kirigami2;FormLayout) tienen una propiedad llamada [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Esta propiedad le permite definir la etiqueta que se proporcionará a los componentes hijos en cuestión.
nl: Kinderen van een [Kirigami.FormLayout](docs:kirigami2;FormLayout) hebben een eigenschap genaamd [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Deze eigenschap laat u het label instellen die geleverd zal worden voor de betreffende kindcomponent.
pt: Os filhos de um [Kirigami.FormLayout](docs:kirigami2;FormLayout) têm uma propriedade chamada [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Esta propriedade permite-lhe mudar o texto que será apresentado no componente-filho em questão.
sv: Underliggande komponenter till [Kirigami.FormLayout](docs:kirigami2;FormLayout) har en egenskap som heter [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Egenskapen låter dig ange beteckningen som tillhandahålls för den underliggande komponenten i fråga.
uk: Дочірні компоненти [Kirigami.FormLayout](docs:kirigami2;FormLayout) мають властивість із назвою [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label). Ця властивість надає вам змогу встановити мітку, яку буде надано для відповідного дочірнього компонента.

source: FormLayouts can also be divided into sections. Setting where a section starts is as easy as setting a child component's [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) to true. This will provide the component with some extra margin at the top to demarcate the start of the new section.
eo: FormLayouts ankaŭ povas esti dividitaj en sekciojn. Agordi kie sekcio komenciĝas estas tiel facila kiel agordi [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) de infana komponanto al vera. Ĉi tio provizos la komponanton per iom da ekstra marĝeno ĉe la supro por limi la komencon de la nova sekcio.
es: Los formularios también se pueden dividir en secciones. Definir dónde empieza una sección es tan fácil como asignar el valor `true` a [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) de un componente hijo. Esto proporcionará un poco de margen adicional en la parte superior del componente para denotar el inicio de la nueva sección.
nl: FormLayouts kunnen ook opgedeeld worden in secties. Instellen waar een sectie begint is net zo gemakkelijk als instellen van een kindcomponent van [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) op true. Dit zal de component leveren met enige extra marges bovenaan om het begin van de nieuwe sectie aan te geven.
pt: Os FormLayouts também podem ser divididos em secções. Definir onde começa uma secção é tão simples como configurar o [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) de um componente-filho como verdadeiro. Isto irá fornecer ao componente alguma margem-extra no topo para demarcar o início da secção nova.
sv: En FormLayout kan också delas upp i sektioner. Att ange var en sektion börjar är så enkelt som att ställa in en underliggande komponents [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) till `true`. Det ger komponenten en del extra marginal längst upp för att avgränsa början på den nya sektionen.
uk: Крім того, компонування форм може бути поділено на розділи. Встановлення місця, де починається розділ, зводиться до встановлення значення властивості [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) компонента `true`. Це надасть компоненту додаткове поле згори для позначення початку нового розділу.

source: [Kirigami.Separator](docs:kirigami2;Separator) components are best suited for starting new sections. Separators are used to draw a thin horizontal line, demarcating the end of a section. If you would rather not have a line drawn between sections, you can use a standard QML [Item](docs:qtquick;QtQuick.Item) property. Alternatively you could use the [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) property on any other component.
eo: [Kirigami.Separator](docs:kirigami2;Separator) komponantoj plej taŭgas por komenci novajn sekciojn. Apartigiloj etas uzataj por desegni maldikan horizontalan linion, limigante la finon de sekcio. Se vi preferus ne havi linion desegnita inter sekcioj, vi povas uzi norman QML [Item](docs:qtquick;QtQuick.Item) proprecon. Alternative vi povus uzi la proprecon [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) ĉe iu ajn alia ero.
nl: [Kirigami.Separator](docs:kirigami2;Separator) componenten zijn het best geschikt voor het beginnen van nieuwe secties. Scheidingen worden gebruikt om een dunne horizontale lijn te tekenen, die het einde van een sectie aangeeft. Als u liever geen lijn, getekend tussen secties, wilt hebben, dan kunt u een standaard QML-eigenschap [Item](docs:qtquick;QtQuick.Item) gebruiken. Alternatief zou u de eigenschap [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) kunnen gebruiken op elke andere component.
pt: Os componentes [Kirigami.Separator](docs:kirigami2;Separator) são mais adequados para iniciar secções novas. Um `Kirigami.Separator` irá desenhar uma linha horizontal fina, marcando o fim de uma secção. Se não quiser ter uma linha desenhada entre secções, poderá usar uma propriedade [Item](docs:qtquick;QtQuick.Item) normal do QML. Em alternativa, poderá usar a propriedade [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) em qualquer outro componente.
sv: [Kirigami.Separator](docs:kirigami2;Separator) komponenter är bäst lämpade att börja nya sektioner. En `Kirigami.Separator` ritar en tunn horisontell linje, som avgränsar slutet på en sektion. Om du hellre inte vill att en linje ska ritas mellan sektioner, kan du använda den vanliga QML- egenskapen [Item](docs:qtquick;QtQuick.Item). Som alternativ skulle du kunna använda egenskapen [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) med vilken annan komponent som helst.
uk: Компоненти [Kirigami.Separator](docs:kirigami2;Separator) найкраще підходять для початку нових розділів. Роздільники використовують для малювання тонкої горизонтальної лінії, яка позначатиме кінець розділу. Якщо ви не хочете, щоб між розділами було намальовано лінію, ви можете скористатися стандартною властивістю [Item](docs:qtquick;QtQuick.Item) QML. Крім того, ви можете скористатися властивістю [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) для будь-якого іншого компонента.

source: However, this is not recommended. On components where [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) is set to `true`, the label text provided for this component's [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) property will be displayed as the section's header text.
eo: Tamen ĉi tio ne estas rekomendinda. Ĉe komponantoj kie [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) estas agordita al `vera`, la etikedo teksto provizita por la [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) de ĉi tiu komponanto ) propreco estos montrata kiel la kapteksto de la sekcio.
nl: Dit is echter niet aanbevolen. Op componenten waar [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) is gezet op `true`, zal het label tekst geleverd voor deze eigenschap [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) getoond worden als de koptekst van de sectie.
pt: Contudo, isto não é recomendado. Nos componentes em que o [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) é igual a `true`, o texto da legenda indicado para a propriedade [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) deste componente serão apresentados como o texto do cabeçalho da secção.
sv: Dock rekommenderas inte det. För komponenter där [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) är inställd till `true`, visas beteckningen och texten som tillhandahålls för komponentens egenskap [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) som sektionens sidhuvudtext.
uk: Втім, не рекомендуємо це робити. Для компонентів, для яких для властивості [Kirigami.FormData.isSection](docs:kirigami2;FormLayoutAttached::isSection) встановлено значення true, текст мітки властивості компонента [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) буде показано як текст заголовка розділу.

source: This does not apply to every component, hence the recommendation that you use [Kirigami.Separator](docs:kirigami2;Separator) or [Item](docs:qtquick;QtQuick.Item) components in places where you would like to use a header text.
eo: Ĉi tio ne validas por ĉiu komponanto, tial la rekomendo, ke vi uzu [Kirigami.Separator](docs:kirigami2;Separator) aŭ [Item](docs:qtquick;QtQuick.Item) komponantojn en lokoj kie vi ŝatus uzi kaplinion. teksto.
es: Esto no se aplica a todos los componentes, de ahí la recomendación de que use los componentes [Kirigami.Separator](docs:kirigami2;Separator) o [Item](docs:qtquick;QtQuick.Item) en los lugares donde desee usar un texto de cabecera.
nl: Dit is niet van toepassing op elke component, dus de aanbeveling dat u componenten [Kirigami.Separator](docs:kirigami2;Separator) of [Item](docs:qtquick;QtQuick.Item) gebruikt op plaatsen waar u liever een koptekst zou gebruiken.
pt: Isto não se aplica a todos os componentes, daí a recomendação de que use os componentes [Kirigami.Separator](docs:kirigami2;Separator) ou [Item](docs:qtquick;QtQuick.Item) nos locais onde gostaria de usar um texto de cabeçalho.
sv: Det gäller inte för alla komponenter, därav rekommendationen att du använder komponenterna [Kirigami.Separator](docs:kirigami2;Separator) eller [Item](docs:qtquick;QtQuick.Item) på ställen där du vill använda en sidhuvudtext.
uk: Це стосується не кожного компонента, отже рекомендуємо використовувати [Kirigami.Separator](docs:kirigami2;Separator) або [Item](docs:qtquick;QtQuick.Item) там, де вам потрібно скористатися текстом заголовка.

source: Checkable children
eo: Markeblaj infanoj
es: Hijos con casillas de verificación
fr: Fils à cocher
nl: Activeerbare kinderen
pl: Zaznaczalne rzeczy podrzędne
pt: Filhos com marcações
sl: Podrejeni, ki jih je mogoče odkljukati
sv: Markeringsbara underliggande objekt
uk: Дочірній елемент — пункт для позначення
