Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: initialize the theming facilities of [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) on platforms where icon themes aren't part of the system (like Windows or MacOS) with `KIconTheme::initTheme()`
eo: pravalorigi la etosajn instalaĵojn de [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) sur platformoj kie piktogrametosoj ne estas parto de la sistemo (kiel Vindozo aŭ MacOS) kun `KIconTheme::initTheme()`
es: iniciar el servicio de tematización de [KIconThemes](https://invent.kde. org/frameworks/kiconthemes) en las plataformas en las que los temas de iconos no forman parte del sistema (como Windows o macOS) con `KIconTheme::initTheme()`,
nl: De thema-faciliteiten van [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) initialiseren voor platforms waar icon thema's geen onderdeel zijn van het systeem (zoals Windows of MacOS) met `KIconTheme::initTheme()`
sl: inicializirati možnosti tematiziranja [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) na platformah, kjer teme ikon niso del sistema (na primer Windows ali MacOS) s `KIconTheme::initTheme()`
sv: initiera temafunktionerna i [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) på plattformar där ikonteman inte är en del av systemet (som Windows eller MacOS) med `KIconTheme::initTheme()`
uk: ініціалізувати можливості роботи з темами [KIconThemes](https://invent.kde.org/frameworks/kiconthemes) на платформах, де теми піктограм не є частиною системи (наприклад, у Windows або MacOS), за допомогою `KIconTheme::initTheme()`

source: The call to `KIconTheme::initTheme()` needs to be done before creating the QApplication and lets the app find Breeze icons to use. Setting the QStyle to Breeze is needed because we used QApplication for our app instead of [QGuiApplication](docs:qtgui;QGuiApplication). Actual interface controls in the window like buttons and checkboxes will follow Breeze by using `qqc2-desktop-style`.
eo: La alvoko al `KIconTheme::initTheme()` devas esti farita antaŭ ol krei la QApplication kaj lasas la apon trovi Breeze-piktogramojn por uzi. Agordi la QStyle al Breeze estas necesa ĉar ni uzis QApplication por nia programo anstataŭ [QGuiApplication](docs:qtgui;QGuiApplication). Faktaj interfacaj regiloj en la fenestro kiel butonoj kaj markokestoj sekvos Breeze uzante `qqc2-desktop-style`.
es: La llamada a `KIconTheme::initTheme()` se debe hacer antes de crear la QApplication y permite que la aplicación encuentre los iconos de Brisa para poder usarlos. Definir el QStyle a Brisa es necesario porque hemos usado QApplication para nuestra aplicación en lugar de [QGuiApplication](docs:qtgui;QGuiApplication). Los controles reales de la interfaz de la ventana, como botones y casillas de verificación, usarán Brisa mediante `qqc2-desktop-style`.
nl: Het aanroepen van `KIconTheme::initTheme()` moet gedaan worden voor de initialisatie van QApplication zodat het programma de Breeze-pictogrammen kan vinden die het wil gebruiken. Het omschakelen van de QStyle naar Breeze is nodig omdat we QApplication voor ons programma gebruiken in plaats van [QGuiApplication](docs:qtgui;QGuiApplication). De gebruikte interface regelt dat in het venster dingen zoals knoppen en keuzevakjes de Breeze toepassen door `qqc2-desktop-style` te gebruiken.
sl: Klic `KIconTheme::initTheme()` je treba opraviti pred ustvarjanjem QApplication in aplikaciji omogoči najti ikone Sapice za uporabo. Nastavitev QStyle na Breeze je potrebna, ker smo za našo aplikacijo uporabili QApplication namesto [QGuiApplication](docs:qtgui;QGuiApplication). Dejanski kontrolniki vmesnika v oknu, kot so gumbi in potrditvena polja, bodo sledili Sapici z uporabo `qqc2-desktop-style`.
sv: Anropet till `KIconTheme::initTheme()` måste göras innan QApplication skapas och låter programmet hitta Breeze-ikoner att använda. Att ställa in QStyle till Breeze behövs eftersom vi använde QApplication för vårt program istället för [QGuiApplication](docs:qtgui;QGuiApplication). De verkliga gränssnittsobjekten i fönstret som knappar och kryssrutor följer Breeze genom att använda `qqc2-desktop-style`.
uk: Виклик `KIconTheme::initTheme()` має бути виконано до створення QApplication. Він дозволяє програмі знайти піктограми Breeze, які слід використати. Для QStyle слід встановити значення Breeze, оскільки для нашої програми ми використали QApplication замість [QGuiApplication](docs:qtgui;QGuiApplication). Справжні елементи керування інтерфейсу у вікні, зокрема кнопки і пункти, використовуватимуть Breeze через використання `qqc2-desktop-style`.

source: If you are looking to add any components listed in the [KDE API documentation](https://api.kde.org/) to your application, you may check the right sidebar for how to add the component with CMake. For instance, for [Kirigami](docs:kirigami2;), you will find something like `find_package(KF6Kirigami)`, which with the addition of ECM becomes:
eo: Se vi celas aldoni iujn ajn komponantojn listigitajn en la [KDE-API-dokumentado](https://api.kde.org/) al via aplikaĵo, vi povas kontroli la dekstran flankan stangon kiel aldoni la komponanton kun CMake. Ekzemple, por [Kirigami2](docs:kirigami2;), vi trovos ion kiel `find_package(KF6Kirigami)`, kiu kun la aldono de ECM fariĝas:
es: Si desea añadir alguno de los componentes que se muestran en la [documentación de la API de KDE](https://api.kde.org/) a la aplicación, puede consultar en la barra lateral derecha cómo se añade el componente con CMake. Por ejemplo, para [Kirigami](docs:kirigami2;), encontrará algo semejante a `find_package(KF6Kirigami)`, que, con la adición de ECM, se convierte en:
nl: Als u zoekt om componenten in de lijst in de [KDE API documentation](https://api.kde.org/) aan uw toepassing toe te voegen, dan zou u de rechter zijbalk kunnen controleren op hoe de component met CMake toe te voegen. Bijvoorbeeld, voor [Kirigami](docs:kirigami2;) zult u iets vinden zoals `find_package(KF6Kirigami2)`, dat met de toevoeging van ECM wordt:
sv: Om du funderar på att lägga till några komponenter som listas i [KDE:s dokumentation över programmeringsgränssnittet](https://api.kde.org/) i ditt program, kan du titta i höger sidorad om hur komponenten läggs till med CMake. Till exempel, för [Kirigami](docs:kirigami2;), hittar du något som liknar `find_package(KF6Kirigami)`, som med tillägg av ECM blir:
uk: Якщо ви хочете додати будь-які компоненти зі списку у [документації до програмного інтерфейсу KDE](https://api.kde.org/) до вашої програми, ви можете звернутися до коду правої бічної панелі, щоб ознайомитися зі способом додавання компонента за допомогою CMake. Наприклад, для [Kirigami](docs:kirigami2;) ви побачите щось подібне до `find_package(KF6Kirigami)`, що з додаванням ECM стає чимось подібним до такого:

source: These are additions provided by extra-cmake-modules to make the use of [Qt declarative registration](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) (the [replacement to Qt resource files](https://doc.qt.io/qt-5/resources.html)) easier.
eo: Ĉi tiuj estas aldonoj provizitaj de ekstra-cmake-moduloj por uzi [Qt-deklara registrado](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) (la [anstataŭaĵo al Qt-resursaj dosieroj](https://doc.qt.io/qt-5/resources.html)) pli facile.
es: Son adiciones proporcionadas por extra-cmake-modules para hacer que el uso del [registro declarativo de Qt](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) (el [reemplazo de los archivos de recursos de Qt](https://doc.qt.io/qt-5/resources.html)) sea más fácil.
nl: Dit zij toevoegingen geleverd door extra-cmake-modules om het gebruik van [Qt declarative registration](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) (de [vervanging van Qt hulpbronbestanden](https://doc.qt.io/qt-5/resources.html)) gemakkelijker te maken.
sl: To so dodatki, ki jih zagotavljajo extra-cmake-modules za lažjo uporabo [deklarativne registracije Qt](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) ([zamenjavo za Datoteke virov Qt](https://doc.qt.io/qt-5/resources.html)).
sv: De är tillägg som tillhandahålls av extra-cmake-modules för att göra användning av [Qt deklarativ registrering](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) ([ersättning av Qt:s resursfiler](https://doc.qt.io/qt-5/resources.html)) enklare.
uk: Ці доповнення, які містяться у extra-cmake-modules, призначено для спрощення використання [декларативної реєстрації Qt](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) ([заміни файлів ресурсів Qt](https://doc.qt.io/qt-5/resources.html)).

source: A [Kirigami.Action](docs:kirigami2;Action) consists of a clickable action whose appearance depends on where it is added. Typically it is a button with an icon and text.
eo: [Kirigami.Ago](docs:kirigami2;Ago) konsistas el klakebla ago, kies aspekto dependas de kie ĝi estas aldonita. Kutime ĝi estas butono kun piktogramo kaj teksto.
es: Una [Kirigami.Action](docs:kirigami2;Action) consiste en una acción sobre la que se puede hacer clic y cuya apariencia depende de donde se añada. Por lo general es un botón con un icono y un texto.
nl: Een [Kirigami.Action](docs:kirigami2;Action) bestaat uit een aan te klikken actie waarvan het uiterlijk afhangt van waar het is toegevoegd. Standaard is het een knop met een pictogram en tekst.
sv: En [Kirigami.Action](docs:kirigami2;Action) består av en klickbar åtgärd vars utseende beror på var den läggs till. Typiskt är det en knapp med en ikon och text.
uk: [Kirigami.Action](docs:kirigami2;Action) складається із придатного до натискання пункту, вигляд якого залежить від того, де його додано. Типово, це кнопка із піктограмою та текстом.

source: The [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) property takes names for system-wide icons following the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application which comes with [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
eo: La propreco [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) prenas nomojn por tutsistemaj piktogramoj laŭ la FreeDesktop-specifo. Ĉi tiuj piktogramoj kaj piktogramnomoj povas esti viditaj per la aplikaĵo CuttleFish de KDE, kiu venas kun [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), aŭ vizitante [la specifo pri piktogramoj de FreeDesktop](https: //specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
es: La propiedad [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) usa nombres de iconos del sistema siguiendo la especificación de FreeDesktop. Estos iconos y nombres de iconos se pueden ver con la aplicación CuttleFish de KDE, incluida en [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), o visitando la [especificación de nombres de iconos de FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
nl: De eigenschap [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) neemt namen voor systeem-brede pictogrammen volgens de FreeDesktop-specificatie. Deze pictogrammen en pictogramnamen kunnen bekeken worden met de toepassing CuttleFish van KDE, die komt met [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) of door [Specificatie van pictogrambenaming van FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pt: A propriedade [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) recebe os nomes dos ícones de sistema de acordo com a especificação do FreeDesktop. Estes ícones e nomes de ícones podem ser vistos com a aplicação Cuttlefish, que vem com o pacote [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), ou indo à [especificação de nomes de ícones do FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
sl: Lastnost [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) pobere imena za sistemske ikone, skladno s specifikacijo FreeDesktop. Te ikone in imena ikon si lahko ogledate s KDE-jevo aplikacijo CuttleFish, ki pride z [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), ali z obiskom strani [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-imenovanje-spec/icon-naming-spec-latest.html).
sv: Egenskapen [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) accepterar namn för systemomfattande ikoner enligt FreeDesktop-specifikationen. Ikonerna och ikonnamnen kan visas med KDE:s program CuttleFish, som levereras med [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), eller genom att besöka [FreeDesktop's icon naming specification](https: //specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
uk: Властивість [icon.name](https://doc.qt.io/qt-6/qml-qtquick-controls2-action.html#icon.name-prop) визначає назву загальносистемної піктограми за специфікацією FreeDesktop. Піктограми і назви піктограм можна переглянути за допомогою програми CuttleFish KDE, яка є частиною [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk), або відвідавши [сторінку специфікації назв піктограм FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: Another feature of Kirigami Actions is to provide various hints to items using actions about how they should display the action. These are primarily handled by the [displayHint](docs:kirigami2;Action::displayHint) and [displayComponent](docs:kirigami2;Action::displayComponent) properties.
eo: Alia trajto de Kirigami Agoj estas provizi diversajn sugestojn al eroj uzante agojn pri kiel ili devus montri la agon. Ĉi tiuj estas ĉefe pritraktataj de la proprietoj [displayHint](docs:kirigami2;Action::displayHint) kaj [displayComponent](docs:kirigami2;Action::displayComponent).
es: Otra de las funcionalidades de las acciones de Kirigami es la de proporcionar diversas sugerencias a los elementos que usan acciones sobre cómo deben mostrar la acción. Esto se controla principalmente mediante las propiedades `[displayHint](docs:kirigami2;Action::displayHint) y [displayComponent](docs:kirigami2;Action::displayComponent).
nl: Een andere functie van acties van Kirigami is het leveren van verschillende tips aan items net acties over hoe ze de actie zouden moeten tonen. Deze worden primair behandeld door de eigenschappen [displayHint](docs:kirigami2;Action::displayHint) en [displayComponent](docs:kirigami2;Action::displayComponent).
pt: Outra funcionalidade das acções do Kirigami é fornecer várias dicas aos itens que usam acções, sobre a forma como devem mostra a acção. Estas são tratadas principalmente pelas propriedades [displayHint](docs:kirigami2;Action::displayHint) and [displayComponent](docs:kirigami2;Action::displayComponent).
sv: En annan funktion för åtgärder i Kirigami är att tillhandahålla olika tips för objekt som använder åtgärder om hur de ska visa åtgärden. De hanteras i huvudsak av egenskaperna [displayHint](docs:kirigami2;Action::displayHint) och [displayComponent](docs:kirigami2;Action::displayComponent) .
uk: Ще однією можливістю дій Kirigami є надання різноманітних настанов щодо показу дії для пунктів, для яких використовуються дії. В основному, за ці настанови відповідають властивості [displayHint](docs:kirigami2;Action::displayHint) і [displayComponent](docs:kirigami2;Action::displayComponent).

source: A [Kirigami.Page](docs:kirigami2;Page) shows Actions on the right of the top header in desktop mode, and on a footer in mobile mode.
eo: [Kirigami.Paĝo](docs:kirigami2;Paĝo) montras Agojn dekstre de la supra kaplinio en labortabla reĝimo, kaj sur piedpiedo en movebla reĝimo.
es: Una [Kirigami.Page](docs:kirigami2;Page) muestra Actions a la derecha de la cabecera superior en modo escritorio, o en el pie de página en modo móvil.
nl: Een [Kirigami.Page](docs:kirigami2;Page) toont Acties rechts van de bovenste kop in modus bureaublad en aan de onderkant in modus mobiel.
sv: En [Kirigami.Page](docs:kirigami2;Page) visar åtgärder till höger om det övre sidhuvudet i skrivbordsläge och på en sidfot i mobilläge.
uk: [Kirigami.Page](docs:kirigami2;Page) показує пункти дій праворуч від верхнього заголовка у режимі робочої станції та на нижній панелі у режимі мобільного пристрою.

source: The [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) is a menu-like sidebar that provides an action based navigation to your application. This is where nested actions are useful because it is possible to create nested navigation:
eo: La [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) estas menu-simila flanka kolumno kiu disponigas ag-bazitan navigadon al via aplikaĵo. Jen kie nestitaj agoj estas utilaj ĉar eblas krei nestitan navigadon:
es: El [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) es una barra lateral semejante a un menú que proporciona navegación basada en acciones para su aplicación. Aquí es donde las acciones anidadas resultan útiles, ya que permiten crear navegación anidada:
nl: De [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) levert een actie gebaseerd op navigatie naar uw toepassing. Dit waar geneste acties nuttig zijn omdat het mogelijk is geneste navigatie te maken:
sv: Den globala lådan [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) är en menylikande sidorad som tillhandahåller en åtgärdsbaserad navigering i programmet. Det är där nästlade åtgärder är användbara eftersom det är möjligt att skapa nästlad navigering:
uk: [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer) є подібною до меню бічною панеллю, яка забезпечує роботу навігації на основі дій у вашій програмі. Це місце, де корисними є вкладені дії, оскільки воно уможливлює створення вкладеної навігації:

source: A [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) consists of an additional set of actions that are hidden behind a three-dots menu on the top right in desktop mode or on the bottom right in mobile mode if there is no space. It is used to display actions that are only relevant to a specific page. You can read more about them in our [Kirigami Drawers](/docs/getting-started/kirigami/components-drawers) tutorial.
eo: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) konsistas el plia aro da agoj, kiuj estas kaŝitaj malantaŭ tri-punkta menuo supre dekstre en labortabla reĝimo aŭ malsupre dekstre en movebla reĝimo se mankas spaco. Ĝi estas uzata por montri agojn, kiuj rilatas nur al specifa paĝo. Vi povas legi pli pri ili en nia [Kirigami Drawers](/docs/getting-started/kirigami/components-drawers) lernilo.
nl: Een [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) bestaat uit een additionele set acties die verborgen zijn achter een drie-puntenmenu rechtsboven in modus bureaublad of rechtsonder in modus mobiel als er geen ruimte is. Het wordt gebruikt om acties te tonen die alleen relevant zijn voor een specifieke pagina. U kunt er meer over lezen in onze handleiding [Kirigami schuifladen](/docs/getting-started/kirigami/components-drawers).
sv: En [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) består av ytterligare en uppsättning åtgärder som är gömda bakom en meny med tre punkter uppe till höger i skrivbordsläge eller nere till höger i mobilläge om det inte finns något utrymme. Den används för att visa åtgärder som endast är relevanta för en specifik sida. Du kan läsa mer om dem i vår handledning om [Kirigami-lådor](/docs/getting-started/kirigami/components-drawers).
uk: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) складається з додаткового набору дій, які приховано за меню з трьох крапок у верхньому правому куті вікна у режимі робочої станції або у нижньому правому куті у режимі мобільного пристрою, якщо у вікні недостатньо місця. Його використовують для показу пунктів дій, які стосуються лише певної сторінки. Докладніше про такі висувні панелі можна прочитати у нашому [підручнику з висувних панелей Kirigami](/docs/getting-started/kirigami/components-drawers).

source: A [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) is used to add some contextual actions to a text field, for example to clear the text, or to search for the text.
eo: [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) estas uzata por aldoni kelkajn kontekstajn agojn al tekstkampo, ekzemple por purigi la tekston, aŭ serĉi la tekston.
es: Una [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) se usa para añadir algunas acciones de contexto a un campo de teto. Por ejemplo, para borrar el texto o para buscar dicho texto.
nl: Een [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) wordt gebruikt om enige contextuele acties aan een tekstveld toe te voegen, bijvoorbeeld om de tekst te wissen of naar tekst te zoeken.
pt: Um [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) é usado para adicionar algumas acções de contexto a um campo de texto, como por exemplo limpar o texto ou procurar pelo mesmo.
sv: Ett [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) används för att lägga till några sammanhangsberoende åtgärder i ett textfält, exempelvis för att rensa texten eller söka efter texten.
uk: [Kirigami.ActionTextField](docs:kirigami2;ActionTextField) використовується для додавання контекстних дій до поля для введення тексту, наприклад, для вилучення тексту або пошуку за введеним текстовим критерієм.

source: You should rarely use an ActionTextField directly. [SearchField](docs:kirigami2;SearchField) and [PasswordField](docs:kirigami2;PasswordField) both inherit from `ActionTextField` and are likely to cover your desired use-case.
eo: Vi malofte uzu ActionTextField rekte. [SearchField](docs:kirigami2;SearchField) kaj [PasswordField](docs:kirigami2;PasswordField) ambaŭ heredas de `ActionTextField` kaj verŝajne kovros vian deziratan uzkazon.
es: Raramente debería usar un ActionTextField directamente. Tanto [SearchField](docs:kirigami2;SearchField) como [PasswordField](docs:kirigami2;PasswordField) heredan de `ActionTextField` y es probable que cubran sus necesidades.
nl: U zou zelden een ActionTextField direct moeten gebruiken. [SearchField](docs:kirigami2;SearchField) en [PasswordField](docs:kirigami2;PasswordField) beiden geërfd van `ActionTextField` en zijn waarschijnlijk genoeg om uw gewenst gebruiksgeval te dekken.
pt: Raramente deverá usar um ActionTextField directamente. O [SearchField](docs:kirigami2;SearchField) e o [PasswordField](docs:kirigami2;PasswordField) herdam ambos de `ActionTextField` e provavelmente irão cobrir o seu caso de uso desejado.
sv: Du måste sällan använda ActionTextField direkt. [SearchField](docs:kirigami2;SearchField) och [PasswordField](docs:kirigami2;PasswordField) ärver båda från `ActionTextField` och täcker troligen önskat användarfall.
uk: Потреба у безпосередньому використанні ActionTextField виникає дуже нечасто. І [SearchField](docs:kirigami2;SearchField), і [PasswordField](docs:kirigami2;PasswordField) успадковують від `ActionTextField` і, ймовірно, пасують до усіх випадків використання.
