Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: This structure is not as common in KDE projects and requires writing an additional CMakeLists.txt, but it is the most flexible. In our case, we name our folder "components" since we are creating two new QML components out of our previous `Main.qml` file, and keep information about them in `kirigami-tutorial/src/components/CMakeLists.txt`. The `Main.qml` file itself stays in `src/` so it's automatically used when running the executable, as before.
ca: Aquesta estructura no és tan habitual en els projectes KDE i requereix escriure un CMakeLists.txt addicional, però és la més flexible. En el nostre cas, donem nom a la nostra carpeta «components» ja que estem creant dos components QML nous a partir del fitxer `Main.qml` anterior, i mantenim la informació sobre ells a `kirigami-tutorial/src/components/CMakeLists.txt`. El fitxer `Main.qml` es manté a `src/` de manera que s'utilitza automàticament quan s'executa l'executable, com abans.
eo: Ĉi tiu strukturo ne estas tiel ofta en KDE-projektoj kaj postulas verki plian CMakeLists.txt, sed ĝi estas la plej fleksebla. En nia kazo, ni nomas nian dosierujon "components" ĉar ni kreas du novajn QML-komponentojn el nia antaŭa dosiero `Main.qml`, kaj konservas informojn pri ili en `kirigami-tutorial/src/components/CMakeLists.txt. `. La dosiero `Main.qml` mem restas en `src/` do ĝi estas aŭtomate uzata dum rulado de la rulebla, kiel antaŭe.
nl: Deze structuur wordt niet zoveel veel gebruikt bij KDE projecten en het vereist de creatie van een extra CMakeLists.txt, maar het is het meest flexibel. In ons geval noemen we onze map "components" omdat we twee nieuwe QML-componenten uit onze vorig `Main.qml`-bestand creëren, en we bewaren de informatie daarover in `kirigami-tutorial/src/components/CMakeLists.txt`. Het bestand `Main.qml` zelf blijft in `src/` zodat het automatisch net als voorheen word gebruikt als de uitvoerbare bestand opstarten.
sl: Ta struktura ni tako pogosta v projektih KDE in zahteva pisanje dodatnega CMakeLists.txt, vendar je najbolj prilagodljiva. V našem primeru poimenujemo našo mapo "components", ker ustvarjamo dve novi komponenti QML iz naše prejšnje datoteke `Main.qml`, informacije o njih pa hranimo v `kirigami-tutorial/src/components/CMakeLists.txt`. Sama datoteka `Main.qml` ostane v `src/`, tako da se samodejno uporablja pri izvajanju izvršljive datoteke, kot prej.
sv: Strukturen är inte lika vanlig i KDE-projekt och kräver att man skriver ytterligare en CMakeLists.txt, men den är den mest flexibla. I vårt fall kallar vi vår katalog "components" eftersom vi skapar två nya QML-komponenter från vår tidigare `Main.qml`, och behåller information om dem i `kirigami-tutorial/src/components/CMakeLists.txt`. Själva filen `Main.qml` förblir i `src/` så den används automatiskt när den körbara filen körs, som tidigare.
uk: Ця структура не є аж надто поширеною у проєктах KDE і потребує написання додаткового файла CMakeLists.txt, але вона є найгнучкішою. У нашому випадку ми назвали нашу теку «components», оскільки ми створюємо два нових компоненти QML з нашого попереднього файла `Main.qml` і зберігаємо дані щодо компонентів у `kirigami-tutorial/src/components/CMakeLists.txt`. Сам файл `Main.qml` лишається у `src/`, отже його автоматично буде використано при запуску виконуваного файла, як і раніше.

source: Later on, it would be possible to create more folders with multiple QML files, all grouped together by function, such as "models" and "settings", and C++ files that have types exposed to QML (like models) could be kept together with other QML files where it makes sense.
ca: Més tard, seria possible crear més carpetes amb diversos fitxers QML, tots agrupats per funcions, com ara «models» i «configuració», i els fitxers C++ que tenen tipus exposats al QML (com els models) es podrien mantenir juntament amb altres fitxers QML on tingui sentit.
eo: Pli poste, eblus krei pliajn dosierujojn kun pluraj QML-dosieroj, ĉiuj grupigitaj laŭ funkcio, kiel "modeloj" kaj "agordoj", kaj C++-dosieroj kiuj havas tipojn elmontritajn al QML (kiel modeloj) povus. estu konservita kune kun aliaj QML-dosieroj kie ĝi havas sencon.
nl: Later is het mogelijk om meer mappen te creëren met meerdere QML-bestanden, allen gegroepeerd bij functie, zoals "models" en "settings", en C++ bestanden die types blootstellen aan QML (zoals modellen) kunnen waar het zinvol is samen met andere QML-bestanden worden gehouden.
sl: Kasneje bi bilo mogoče ustvariti več map z več datotekami QML, vse združene po funkcijah, kot so "models" in "settings", in datoteke C++, katerih tipi so izpostavljeni QML (kot so modeli), bi lahko hranili skupaj z druge datoteke QML, kjer je to smiselno.
sv: Senare vore det möjligt att skapa fler kataloger med flera QML-filer, alla grupperade enligt funktion, såsom "modeller" och "inställningar", och C++ filer som har typer exponerade i QML (som modeller) skulle kunna vara tillsammans med andra QML-filer när det är vettigt.
uk: Пізніше можна буде створити додаткові теки із декількома файлами QML, згрупованих разом за призначенням, наприклад, «models» і «settings», і файли C++, де міститимуться типи, які відкриваються QML (зокрема моделі) можна зберігати разом із іншими файлами QML там, де це має сенс.

source: We will be using this structure in this tutorial.
ca: Utilitzarem aquesta estructura en aquesta guia d'aprenentatge.
eo: Ni uzos ĉi tiun strukturon en ĉi tiu lernilo.
es: Usaremos esta estructura en este tutorial.
nl: We zullen in deze instructie deze structuur gebruiken.
sl: To strukturo bomo uporabili v tem učbeniku.
sv: Vi använder den här strukturen i handledningen.
uk: Ми використаємо цю структуру у нашому підручнику.

source: Preparing CMake for the new files
ca: Preparar el CMake per als fitxers nous
eo: Preparante CMake por la novaj dosieroj
nl: CMake voorbereiden voor de nieuwe bestanden
sl: Priprava CMake za nove datoteke
sv: Förbereda CMake för de nya filerna
uk: Приготування CMake для нових файлів

source: First, create the file `kirigami-tutorial/src/components/CMakeLists.txt` with the following contents:
ca: Primer, creeu el fitxer `kirigami-tutorial/src/components/CMakeLists.txt` amb el contingut següent:
eo: Unue, kreu la dosieron `kirigami-tutorial/src/components/CMakeLists.txt` kun la jena enhavo:
nl: Creëer eerst het bestand `kirigami-tutorial/src/components/CMakeLists.txt` met de volgende inhoud:
sl: Najprej ustvarite datoteko `kirigami-tutorial/src/components/CMakeLists.txt` z naslednjo vsebino:
sv: Skapa först filen `kirigami-tutorial/src/components/CMakeLists.txt` med följande innehåll:
uk: Спершу, створимо файл `kirigami-tutorial/src/components/CMakeLists.txt` із таким вмістом:

source: Because the target is different from the executable, it will function as a different QML module, in which case we will need to do two things: make it *generate* code for it to work as a Qt plugin with [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html), and *finalize* it with [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). We then install it exactly like in previous lessons.
ca: Com que l'objectiu és diferent de l'executable, funcionarà com un mòdul QML diferent, en aquest cas el necessitarem fer dues coses: fer que *generi* el codi perquè funcioni com a un connector Qt amb [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html), i *finalitzar-lo* amb [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Després l'instal·lem exactament igual que en les lliçons anteriors.
eo: Ĉar la celo estas diferenca de la rulebla, ĝi funkcios kiel malsama QML-modulo, en kiu kazo ni devos fari du aferojn: fari ĝin *generi* kodon por ke ĝi funkciu kiel Qt-kromaĵo kun [GENERATE_PLUGIN_SOURCE](https: //api.kde.org/ecm/module/ECMQmlModule.html), kaj *finaligu* ĝin per [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Ni tiam instalas ĝin ĝuste kiel en antaŭaj lecionoj.
nl: Omdat het doel afwijkt van het uitvoerbarebestand, zal het functioneren als een andere QML module, zodat in dat geval we twee dingen moeten doen: er voor zorgen dat het code *genereert* met [GENERATE_PLUGIN_SOURCE] (https://api.kde.org/ecm/module/ECMQmlModule.html) zodat het werkt als een Qt plugin, en het *afmaken* met [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Daarna installeren we het op precies dezelfde manier als in de vorige lessen.
sl: Ker je cilj drugačen od izvršljive datoteke, bo deloval kot drug modul QML, v tem primeru bomo morali narediti dve stvari: omogočiti *generiranje* kode, da bo deloval kot vtičnik Qt z [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html) in ga *finalizirajte* z [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Nato ga namestimo natanko tako kot v prejšnjih lekcijah.
sv: Eftersom målet skiljer sig från den körbara filen fungerar det som en annan QML-modul, vilket leder till att vi måste göra två saker: få det att *generera* kod för att det ska fungera som ett Qt-insticksprogram med [GENERATE_PLUGIN_SOURCE](https: //api.kde.org/ecm/module/ECMQmlModule.html), och *slutföra* det med [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Vi installerar det sedan precis som i tidigare lektioner.
uk: Оскільки ціль є відмінною від виконуваного файла, вона працюватиме як інший модуль QML, що означає, що нам потрібно буде виконати дві речі: наказати *створити* код, щоб усе працювало як додаток Qt, за допомогою [GENERATE_PLUGIN_SOURCE](https://api.kde.org/ecm/module/ECMQmlModule.html) і *завершити* обробку за допомогою [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html). Потім ми встановлюємо їх так само, як на попередніх уроках.

source: We needed to use [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) so that we can link `kirigami-hello-components` to the executable in the [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) call in `kirigami-tutorial/src/CMakeLists.txt`:
ca: Necessitàvem utilitzar [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) perquè puguem enllaçar `kirigami-hello-components` amb l'executable a la crida [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) a `kirigami-tutorial/src/CMakeLists.txt`:
eo: Ni bezonis uzi [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) por ke ni povu ligi `kirigami-hello-components` al la plenumebla en la [target_link_libraries( )](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) voku en `kirigami-tutorial/src/CMakeLists.txt`:
nl: We moeten [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) gebruiken zodat we `kirigami-hello-components` kunnen koppelen met het uitvoerbare bestand in de [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) aanroep call in `kirigami-tutorial/src/CMakeLists.txt`:
sl: Uporabiti smo morali [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), da smo lahko povezali `kirigami-hello-components` z izvršljivo datoteko v [target_link_libraries( )](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) ter klic v `kirigami-tutorial/src/CMakeLists.txt`:
sv: Vi behövde använda [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) så att vi kan länka `kirigami-hello-components` till den körbara filen med anropet [target_link_libraries( )](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) i `kirigami-tutorial/src/CMakeLists.txt`:
uk: Нам довелося скористатися [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), щоб ми могли скомпонувати `kirigami-hello-components` із виконуваним файлом у виклику [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) у `kirigami-tutorial/src/CMakeLists.txt`:

source: We also need to use [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html) so CMake will find the `kirigami-tutorial/src/components/` directory.
ca: També necessitem utilitzar [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html) perquè el CMake trobi el directori `kirigami-tutorial/src/components/`.
eo: Ni ankaŭ devas uzi [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html) do CMake trovos la dosierujon `kirigami-tutorial/src/components/`.
nl: We moeten ook [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html) gebruiken zodat CMake de `kirigami-tutorial/src/components/` map kan vinden.
sl: Uporabiti moramo tudi [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html), da bo CMake našel imenik `kirigami-tutorial/src/components/`.
sv: Vi behöver också använda [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html) så CMake hittar katalogen `kirigami-tutorial/src/components/`.
uk: Нам також потрібно скористатися [add_subdirectory()](https://cmake.org/cmake/help/latest/command/add_subdirectory.html), щоб CMake знайшов каталог `kirigami-tutorial/src/components/`.

source: In the previous lessons, we did not need to add the `org.kde.tutorial` import to our `Main.qml` because it was not needed: being the entrypoint for the application, the executable would run the file immediately anyway. Since our components are in a separate QML module, the a new import in `kirigami-tutorial/src/Main.qml` is necessary, the same one defined earlier, `org.kde.tutorial.components`:
ca: En les lliçons anteriors, no calia afegir la importació `org.kde.tutorial` al nostre `Main.qml` perquè no era necessari: sent el punt d'entrada de l'aplicació, l'executable executaria el fitxer immediatament de totes maneres. Com que els nostres components es troben en un mòdul QML separat, és necessària una importació nova a `kirigami-tutorial/src/Main.qml`, la mateixa definida anteriorment, `org.kde.tutorial.components`:
eo: En la antaŭaj lecionoj, ni ne bezonis aldoni la importon `org.kde.tutorial` al nia `Main.qml` ĉar ĝi ne estis bezonata: estante la enirpunkto por la aplikaĵo, la efektivigebla ĉiuokaze rulus la dosieron tuj. Ĉar niaj komponantoj estas en aparta QML-modulo, la nova importo en `kirigami-tutorial/src/Main.qml` estas necesa, la sama difinita antaŭe, `org.kde.tutorial.components`:
nl: In de eerdere lessen, hoefden we de `org.kde.tutorial` import naar onze `Main.qml` toe te voegen omdat dit niet nodig was: omdat dat het startpunt voor het programma is, zal het uitvoerbare bestand dit bestand toch onmiddellijk uitvoeren. Omdat onze componenten in een separate QML module geplaatst zijn, is de nieuwe import in `kirigami-tutorial/src/Main.qml` noodzakelijk, dezelfde eerder gedefinieerd, `org.kde.tutorial.components`:
sl: V prejšnjih lekcijah nam ni bilo treba dodati uvoza `org.kde.tutorial` v naš `Main.qml`, ker ni bil potreben: ker je vstopna točka za aplikacijo, bi izvršljiva datoteka vseeno takoj zagnala datoteko. Ker so naše komponente v ločenem modulu QML, je potreben nov uvoz v `kirigami-tutorial/src/Main.qml`, enak prej definiranemu, `org.kde.tutorial.components`:
sv: I de tidigare lektionerna behövde vi inte lägga till import av `org.kde.tutorial` i vår `Main.qml`, beroende på att det inte behövdes. Eftersom det är programmets startpunkten startades den körbara filen omedelbart ändå. Nu när våra komponenter finns i en separat QML-modul, blir en ny import nödvändig i `kirigami-tutorial/src/Main.qml`, likadan som definierats tidigare, `org.kde.tutorial.components`:
uk: На попередніх уроках нам не потрібно було додавати `org.kde.tutorial` до нашого `Main.qml`, оскільки у цьому не було потреби: будучи вхідною точкою програми, виконуваний файл за будь-яких умов запустить файл негайно. Оскільки наші компоненти зберігаються в окремому модулі QML, потрібне нове імпортування у `kirigami-tutorial/src/Main.qml`, те саме, яке було визначено раніше, `org.kde.tutorial.components`:

source: The rest of the code...
ca: La resta del codi...
eo: La resto de la kodo...
es: El resto del código...
nl: De rest van de code...
sl: Preostanek kode...
sv: Resten av koden ...
uk: Решта коду...

source: And we are ready to go.
ca: I ja estem preparats per a continuar.
eo: Kaj ni estas pretaj iri.
es: Y ya estamos listos.
nl: En we zijn klaar.
sl: In smo pripravljeni na odhod.
sv: Och vi är redo att starta.
uk: І ми готові рухатися далі.

source: Splitting Main.qml
ca: Divisió de Main.qml
eo: Spliting Main.qml
es: División de Main.qml
nl: Main.qml opsplitsen
sl: Razcepljanje Main.qml
sv: Dela Main.qml
uk: Поділ Main.qml

source: Let's take a look once again at the original `Main.qml`:
ca: Tornem a fer un cop d'ull a l'original `Main.qml`:
eo: Ni rigardu denove la originalan `Main.qml`:
nl: Laten we nog een keer kijken naar de originele `Main.qml`:
sl: Oglejmo si še enkrat originalni `Main.qml`:
sv: Låt oss återigen ta en titt på den ursprungliga `Main.qml`:
uk: Погляньмо ще раз на початковий `Main.qml`:

source: The custom delegate with `id: kountdownDelegate` can be split completely because it is already enveloped in a [QML Component type](docs:qtqml;QtQml.Component). We use a Component to be able to define it without needing to instantiate it; separate QML files work the same way.
ca: El delegat personalitzat amb `id: kountdownDelegate` es pot dividir completament perquè ja està embolcallat en un [tipus de component QML](docs:qtqml;QtQml.Component). Utilitzem un component per a poder definir-lo sense necessitat d'instanciar-lo; els fitxers QML separats funcionen de la mateixa manera.
eo: La propra delegito kun `id: kountdownDelegate` povas esti tute dividita ĉar ĝi jam estas envolvita en [QML Component-tipo](docs:qtqml;QtQml.Component). Ni uzas Komponaĵon por povi difini ĝin sen bezoni instantiigi ĝin; apartaj QML-dosieroj funkcias same.
nl: De eigengemaakte gedelegeerde met `id: kountdownDelegate` kan compleet gesplitst worden omdat het al ingepakt is in een [QML Component type](docs:qtqml;QtQml.Component). We gebruiken een Component zodat we het kunnen definiëren zonder dat het hoeven te creëren; separate QML-bestanden werken op dezelfde manier.
sl: Delegat po meri z `id: kountdownDelegate` je mogoče v celoti razdeliti, ker je že zavit v [vrsto komponente QML](docs:qtqml;QtQml.Component). Komponento uporabljamo, da jo lahko definiramo, ne da bi jo morali instancirati; ločene datoteke QML delujejo na enak način.
sv: Den anpassade delegaten med `id: kountdownDelegate` kan delas helt eftersom den redan är inkapslad i en [QML Component typ](docs:qtqml;QtQml.Component). Vi använder en komponent för att kunna definiera den utan att behöva instansiera den. Separata QML-filer fungerar på samma sätt.
uk: Нетиповий делегат з `id: kountdownDelegate` можна поділити повністю, оскільки його вже загорнуто у [тип Component QML](docs:qtqml;QtQml.Component). Ми використовуємо Component, щоб мати змогу визначити його без потреби у створенні екземпляра; окремі файли QML працюють так само.

source: If we move the code to a separate files, then, there is no point in leaving it enveloped in a Component: we can split just the [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) in the separate file. Here is the resulting `KountdownDelegate.qml`:
ca: Si movem el codi a fitxers separats, llavors no té sentit deixar-lo embolcallat en un component: podem dividir només la [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) en el fitxer separat. Aquest és el `KountdownDelegate.qml` resultant:

source: Our dialog with `id: addDialog` is not enveloped in a Component, and it is not a component that is visible by default, so the code can be copied as is into the `AddDialog.qml`:
ca: El nostre diàleg amb `id: addDialog` no està embolcallat en un component, i no és un component que sigui visible de manera predeterminada, així que el codi es pot copiar tal com està en el `AddDialog.qml`:
eo: Nia dialogo kun `id: addDialog` ne estas envolvita en Komponento, kaj ĝi ne estas komponento kiu estas videbla defaŭlte, do la kodo povas esti kopiita kiel estas en la `AddDialog.qml`:
nl: Onze dialoogvenster met `id: addDialog` is niet ingepakt in een Component, en het is niet een component dat standaard zichtbaar is, zodat de code zoals het gekopieerd kan worden naar `AddDialog.qml`:
sl: Naše pogovorno okno z `id: addDialog` ni ovito v komponento in ni komponenta, ki je privzeto vidna, zato je kodo mogoče kopirati takšno, kot je, v `AddDialog.qml`:
sv: Vår dialogruta med `id: addDialog` är inte inkapslad i en komponent, och det är inte en komponent som är normalt synlig, så koden kan kopieras som den är till `AddDialog.qml`:
uk: Наше діалогове вікно із `id: addDialog` не загорнуто у Component, і не є компонентом, який є типово видимим, отже код можна скопіювати без змін до `AddDialog.qml`:

source: With the code split, `Main.qml` thus becomes much shorter:
ca: Amb la divisió del codi, `Main.qml` es fa molt més curt:
eo: Kun la koddivido, `Main.qml` tiel fariĝas multe pli mallonga:
nl: Nu de code is uitgesplitst, wordt `Main.qml` dus veel korter:
sl: Z razcepom kode postane `Main.qml` tako veliko krajši:
sv: Med den delade koden blir `Main.qml` således mycket kortare:
uk: Таким чином, після поділу коду `Main.qml` стане набагато коротшим:

source: We now have two extra QML files, `AddDialog.qml` and `KountdownDelegate`, and we need to find some way of using them in `Main.qml`. The way to add the contents of the new files to `Main.qml` is by *instantiating* them.
ca: Ara tenim dos fitxers QML addicionals, `AddDialog.qml` i `KountdownDelegate`, i necessitem trobar alguna manera d'utilitzar-los a `Main.qml`. La manera d'afegir el contingut dels fitxers nous a `Main.qml` és *instanciant-los*.
eo: Ni nun havas du kromajn QML-dosierojn, `AddDialog.qml` kaj `KountdownDelegate`, kaj ni devas trovi ian manieron uzi ilin en `Main.qml`. La maniero aldoni la enhavon de la novaj dosieroj al `Main.qml` estas *instanciante* ilin.
nl: We hebben nu twee extra QML-bestanden, `AddDialog.qml` en `KountdownDelegate`, en we moeten een manier vinden om ze in `Main.qml` te gebruiken. De manier om de inhoud van de nieuwe bestanden aan `Main.qml` toe te voegen is door ze *aan te roepen*.
sl: Zdaj imamo dve dodatni datoteki QML, `AddDialog.qml` in `KountdownDelegate`, in najti moramo način, kako ju uporabiti v `Main.qml`. Način dodajanja vsebine novih datotek v `Main.qml` je tako, da jih *instanciiramo*.
sv: Vi har nu två extra QML-filer, `AddDialog.qml` och `KountdownDelegate`, och vi måste hitta något sätt att använda dem i `Main.qml`. Sättet att lägga till innehållet i de nya filerna i `Main.qml` är genom att *instansiera* dem.
uk: Тепер у нас є два додаткових файли QML, `AddDialog.qml` і `KountdownDelegate`, і нам потрібно винайти спосіб використання їх у `Main.qml`. Способом додавання вмісту нових файлів до `Main.qml` є *створення екземплярів* цих файлів.

source: `AddDialog.qml` becomes `AddDialog {}`:
ca: `AddDialog.qml` esdevé `AddEditDialog {}`:
eo: `AddDialog.qml` fariĝas `AddDialog {}`:
es: `AddDialog.qml` se convierte en `AddDialog {}`:
nl: `AddDialog.qml` wordt `AddDialog {}`:
sl: `AddDialog.qml` postane `AddDialog {}``:
sv: `AddDialog.qml` blir `AddDialog {}`:
uk: `AddDialog.qml` стає `AddDialog {}`:
