Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Here, we put our global drawer inside our application window. The main property we need to pay attention to is [GlobalDrawer.actions](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#actions-prop), which takes the form of an array of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) components. This action has an appropriate icon and executes the [Qt.quit()](docs:qtqml;QtQml.Qt::quit) function when triggered, closing the application.
ca: Aquí, col·locarem el nostre calaix global dins de la finestra de la nostra aplicació. La propietat principal a la qual hem de parar atenció és [GlobalDrawer.actions](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#actions-prop), que pren la forma d'una matriu de components [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action). Aquesta acció té una icona adequada i executa la funció [Qt.quit()](docs:qtqml;QtQml.Qt::quit) quan s'activa, tancant l'aplicació.

source: Since we are keeping our global drawer simple for now, we are setting the [GlobalDrawer.isMenu](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop) property to `true`. This displays our global drawer as a normal application menu, taking up less space than the default global drawer pane.
ca: Atès que, per ara, mantenim senzill el nostre calaix global, establim la propietat [GlobalDrawer.isMenu](https://api.kde.org/qml-org-kde-kirigami-globaldrawer.html#isMenu-prop) a `true`. Això mostrarà el nostre calaix global com un menú normal d'aplicació, ocupant menys espai que la subfinestra predeterminada del calaix global.

source: Global drawer as a menu
ca: Calaix global com a menú
eo: Ĉiea tirkesto kiel menuo
es: Cajón global como menú
nl: Globale schuiflade als menu
pt: Área global como um menu
sl: Globalni predal kot meni
sv: Global låda som en meny
uk: Загальна панель як меню

source: The [Actions based components](/docs/getting-started/kirigami/components-actions/) page of these docs provides further detail on Kirigami Actions and how they can be used.
ca: La pàgina [components basats en Actions](/docs/getting-started/kirigami/components-actions/) d'aquesta documentació, proporciona més detalls sobre les accions del Kirigami i com es poden utilitzar.
eo: La paĝo [Agoj bazitaj komponantoj](/docs/getting-started/kirigami/components-actions/) de ĉi tiuj dokumentoj provizas pliajn detalojn pri Kirigami-Agoj kaj kiel ili povas esti uzataj.
nl: De pagina [op acties gebaseerde componenten](docs/getting-started/kirigami/components-actions/) van deze documenten levert verdere details over acties van Kirigami en hoe ze gebruikt kunnen worden.
pt: A página de [componentes baseados em Action's](/docs/getting-started/kirigami/components-actions/) da secção de 'Componentes' desta documentação oferece mais detalhes sobre as acções do Kirigami e como podem ser usadas.
sl: Stran [Actions based components](/docs/kirigami/components-actions/)v teh dokumentih vsebuje dodatne podrobnosti o dejanjih Kirigami in načinu, kako jih je mogoče uporabiti.
sv: Sidan [Actions based components](/docs/getting-started/kirigami/components-actions/) i den här dokumentationen ger ytterligare information om Kirigami åtgärder och hur de kan användas.
uk: Сторінка [заснованих на Actions компонентів](/docs/getting-started/kirigami/components-actions/) у розділі «Компоненти» цієї документації містить докладніші відомості щодо дій Kirigami та їхнього використання.

source: Actions are contextual
ca: Les accions són contextuals
eo: Agoj estas kontekstaj
es: Las acciones son contextuales
nl: De context van acties
sl: Dejanja so kontekstualna
sv: Åtgärder är sammanhangsberoende
uk: Дії є контекстними

source: Kirigami components are designed in such a way that the place where you put Kirigami Actions is relevant. As seen above, if you add actions to a [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page), [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) or any other derivative Page component, they will show up on the right side of the header in desktop mode, and on the bottom in mobile mode.
ca: Els components del Kirigami estan dissenyats de tal manera que el lloc on poseu les accions del Kirigami és rellevant. Com s'ha vist anteriorment, si afegiu accions a una [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page), [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage) o qualsevol altre component derivat de pàgina, es mostraran a la part dreta de la capçalera en el mode d'escriptori i a la part inferior en el mode de mòbil.

source: Similarly, if Kirigami Actions are added to a [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer), they will show up in the resulting drawer or menu.
ca: De manera similar, si les accions del Kirigami s'afegeixen a un [Kirigami.GlobalDrawer](docs:kirigami;org.kde.kirigami.GlobalDrawer), es mostraran al calaix o menú resultant.

source: Other examples of Kirigami Actions showing up differently depending on their parent component are:
ca: Altres exemples d'accions del Kirigami que es mostren de manera diferent depenent del seu component pare són:
eo: Aliaj ekzemploj de Kirigami-Agoj aperantaj alimaniere depende de sia gepatra komponento estas:
es: Otros ejemplos de acciones de Kirigami que se muestran de forma distinta dependiendo del componente padre que tengan son:
nl: Andere voorbeelden van Kirigami acties die op andere plekken verschijnen afhankelijk van hun oudercomponent zijn:
sl: Drugi primeri dejanj Kirigami, ki se prikazujejo drugače glede na njihovo nadrejeno komponento, so:
sv: Andra exempel på Kirigami Actions som visas olika beroende på överliggande komponent är:
uk: Інші приклади дій Kirigami, які показано по-різному, залежжжно від їхнього батьківського компонента:

source: [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) - [ContextDrawer tutorial here](/docs/getting-started/kirigami/components-drawers#context-drawers)
ca: [Kirigami.ContextDrawer](docs:kirigami;org.kde.kirigami.ContextDrawer) - [Aquí hi ha una guia d'aprenentatge de ContextDrawer](/docs/getting-started/kirigami/components-drawers#context-drawers)

source: [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) and derivatives - [Card tutorial here](/docs/getting-started/kirigami/components-card)
ca: [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) i derivats - [Aquí hi ha una guia d'aprenentatge de Card](/docs/getting-started/kirigami/components-card)

source: [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog) and derivatives - [Dialog tutorial here](/docs/getting-started/kirigami/components-dialogs)
ca: [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog) i derivats - [Aquí hi ha una guia d'aprenentatge de Dialog](/docs/getting-started/kirigami/components-dialogs)

source: [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) - [ActionToolBar tutorial here](/docs/getting-started/kirigami/components-actions#actiontoolbar)
ca: [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) - [Aquí hi ha una guia d'aprenentatge d'ActionToolBar](/docs/getting-started/kirigami/components-actions#actiontoolbar)

source: Among other Kirigami components.
ca: Entre altres components del Kirigami.
eo: Inter aliaj Kirigami-komponentoj.
es: Entre otros complementos de Kirigami
nl: Tussen andere Kirigami-componenten
sl: Med drugimi komponentami Kirigami.
sv: Bland andra komponenterna i Kirigami.
uk: Серед інших компонентів Kirigami.

source: Adding a dialog
ca: Afegir un diàleg
eo: Aldonante dialogon
es: Añadir un diálogo
nl: Een dialoog toevoegen
sl: Dodajanje pogovornega okna
sv: Lägga till en dialogruta
uk: Додавання діалогового вікна

source: Getting to grips with Kirigami dialogs.
ca: Abordar a fons els diàlegs del Kirigami.
eo: Ekkompreni dialogojn de Kirigami.
es: Familiarizarse con las diálogos de Kirigami.
nl: Grip krijgen op Kirigami dialogen.
sl: Spoznavanje pogovornih oken Kirigami.
sv: Att begripa Kirigami dialogs.
uk: Знайомимося із діалоговими вікнами Kirigami.

source: Making our app useful
ca: Fer que la nostra aplicació sigui útil
eo: Farante nian apon utila
es: Hacer que nuestra aplicación sea útil
fr: Rendre notre application utile
nl: Uw toepassing nuttig maken
pl: Czynienie naszej aplikacji użyteczną
pt: Tornar a nossa aplicação útil
sl: Izdelava naše aplikacije uporabne
sv: Göra vårt program användbart
uk: Робимо нашу програму корисною

source: We have a window, we have cards, and we have actions. Yet, we still need to find some way of inputting a name, description, and date of our choice.
ca: Tenim una finestra, tenim targetes i tenim accions. No obstant això, encara necessitem trobar alguna forma d'introduir un nom, una descripció i una data de la nostra elecció.
eo: Ni havas fenestron, ni havas kartojn, kaj ni havas agojn. Tamen, ni ankoraŭ bezonas trovi ian manieron enigi nomon, priskribon kaj daton de nia elekto.
es: Tenemos una ventana, tenemos tarjetas y tenemos acciones. Sin embargo, todavía necesitamos encontrar alguna forma de introducir un nombre, una descripción y una fecha de nuestra elección.
fr: Nous avons une fenêtre, nous avons des cartes et nous avons des actions. Pourtant, nous devons encore trouver un moyen de saisir un nom, une description et une date de notre choix.
nl: We hebben een venster, we hebben kaarten en we hebben acties. Nu moeten we nog steeds een manier vinden voor het invoeren van een naam, beschrijving en datum van uw keuze.
pl: Mamy okno, mamy karty oraz mamy działania. Teraz, nadal potrzebujemy jakiegoś sposobu na wpisanie nazwy, opisu oraz daty.
pt: Temos uma janela, temos cartões e temos acções. Contudo, ainda precisamos de descobrir uma forma de introduzir um nome, descrição e data à nossa escolha.
sl: Imamo okno, kartice in akcije. Vendar moramo še vedno najti način vnosa imena, opisa in datuma po naši izbiri.
sv: Vi har ett fönster, vi har kort, och vi har åtgärder. Vi behöver ändå komma på något sätt att mata in ett namn, en beskrivning och ett datum vi väljer.
uk: У нас є вікно, у нас є картки і у нас є дії. Але нам усе ще потрібне спосіб введення назви, опису та вибраної дати.

source: One way we could do this is by creating a new page where we place the required input elements. However, a whole page dedicated to providing a name, description, and date seems a bit excessive.
ca: Una manera en què podríem fer això és creant una pàgina nova on col·loquem els elements d'introducció requerits. No obstant això, una pàgina sencera dedicada a proporcionar un nom, una descripció i una data sembla una mica excessiu.
eo: Unu maniero, kiel ni povus fari tion, estas kreante novan paĝon, kie ni metas la postulatajn enigelementojn. Tamen tuta paĝo dediĉita al liverado de nomo, priskribo kaj dato ŝajnas iom troa.
es: Una forma de hacerlo sería crear una nueva página para colocar los elementos de entrada necesarios. Sin embargo, una página entera dedicada a proporcionar un nombre, una descripción y una fecha parece un poco excesiva.
fr: Une façon d'y parvenir est de créer une nouvelle page où nous plaçons les éléments d'entrée requis. Cependant, une page entière dédiée à la fourniture d'un nom, une description et une date semble un peu excessive.
nl: Een manier waarop we dit zouden kunnen doen is met het maken van een nieuwe pagina waar we de vereiste invoerelementen in plaatsen. Een gehele pagina bestemd om een naam, beschrijving en datum te leveren lijkt een beetje teveel.
pl: Jednym ze sposobów wykonania tego, jest stworzenie nowej strony, na której umieścimy wymagane rzeczy do wprowadzania. Jednakże, cała strona przeznaczona do podania nazwy, opisu oraz daty wydaje się być przesadą.
pt: Uma forma de o fazermos é criar uma nova página onde colocamos os elementos de entrada necessários. Contudo, uma página inteira dedicada apenas a solicitar um nome, descrição e data parece um pouco excessivo.
sl: To lahko storimo tako, da ustvarimo novo stran, kjer postavimo zahtevane vhodne elemente. Vendar pa se zdi cela stran, namenjena zagotavljanju imena, opisa in datuma, nekoliko pretirana.
sv: Ett sätt vi skulle kunna göra det är genom att skapa en nya sida där vi placerar inmatningselement. Dock verkar en hel sida tillägnad för att tillhandahålla namn, beskrivning och datum lite överdrivet.
uk: Одним зі способів досягти потрібного результату є створення сторінки, на якій ми розташуємо потрібні нам елементи для введення даних. Втім, надавати цілу сторінку для введення назви, опис та дати забагато.

source: Instead, we'll be using a dialog.
ca: En el seu lloc, utilitzarem un diàleg.
eo: Anstataŭe, ni uzos dialogon.
es: En lugar de ello, vamos a usar un diálogo.
nl: In plaats daarvan zullen we een dialoog gebruiken.
sl: Namesto tega bomo uporabili pogovorno okno.
sv: Istället använder vi en dialogruta.
uk: Замість цього ми скористаємося діалоговим вікном.

source: ![Dialog appearing in the middle of the application](dialog.webp)
ca: ![Diàleg que apareix al mig de l'aplicació](dialog.webp)
eo: ![Dialogo aperanta meze de la aplikaĵo](dialog.webp)
es: ![Diálogo que aparece en medio de la aplicación](dialog.webp)
nl: ![Dialoog die verschijnt in het midden van de toepassing](dialog.webp)
sl: ![Pogovorno okno se pojavi na sredini aplikacije](dialog.webp)
sv: ![Dialogruta som visas mitt i programmet](dialog.webp)
uk: ![Діалогове вікно, що з'являється посередині вікна програми](dialog.webp)

source: Opening the dialog
ca: Obrir el diàleg
eo: Malfermante la dialogon
es: Apertura del diálogo
nl: Het dialoogvenster openen
sl: Odpiranje pogovornega okna
sv: Öppna dialogrutan
uk: Відкриття діалогового вікна

source: First we edit the action from the previous tutorial: just a [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) that triggers the dialog's [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) function.
ca: Primer editarem l'acció de la guia d'aprenentatge anterior: només una [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) que activi la funció [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) del diàleg.

source: Countdown-adding dialogs
ca: Diàlegs que afegeixen un compte enrere
eo: Retronombrado-aldonado de dialogoj
es: Diálogos para añadir una cuenta regresiva
nl: Dialogen die aftellen toevoegen
sl: Pogovorna okna za dodajanje odštevanja
sv: Nedräkning: lägga till dialogrutor
uk: Зворотний відлік — додавання діалогових вікон

source: The new component we add is a [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog). Dialogs appear at the center of the window and can be used to provide extra information relevant to the current content. They can't be moved, but they adapt their own size to the window.
ca: El component nou que afegim és un [Kirigami.Dialog](docs:kirigami;org.kde.kirigami.dialogs.Dialog). Els diàlegs apareixen al centre de la finestra i es poden utilitzar per a proporcionar informació addicional rellevant per al contingut actual. No es poden moure, però adapten la seva mida a la finestra.

source: Form layouts help align and structure a layout with several inputs
ca: Les disposicions de formulari ajuden a alinear i estructurar una disposició amb diverses entrades
eo: Formaranĝoj helpas vicigi kaj strukturi aranĝon kun pluraj enigaĵoj
nl: Formulierindelingen helpen met het uitlijnen en structuren van een layout met meerdere invoervelden
sl: Postavitve obrazcev pomagajo uskladiti in strukturirati postavitev z več vnosi
sv: Formulärlayouter hjälper till att justera och strukturera en layout med mer indata
uk: Компонування форми допомагають вирівняти і структурувати компонування із декількома елементами введення

source: Textfields let you input text in a thin textbox
ca: Els camps de text permeten introduir text en un quadre de text fi
eo: Tekstaj kampoj permesas vin enigi tekston en maldika tekstujo
es: Los Textfields permiten introducir texto en un cuadro
nl: Tekstvelden laten u tekst invoeren in een tekstvak
sl: Textfields vam omogočajo vnos besedila v tanko besedilno polje
sv: Textfält låter dig mata in text i en smal textruta
uk: Об'єкти Textfield надають вам змогу вводити текст у вузькому полі для введення тексту

source: Provides a label attached to the textfield
ca: Proporciona una etiqueta adjuntada al camp de text
eo: Disponigas etikedon alfiksitan al la tekstokampo
es: Proporciona una etiqueta adjunta a un campo de texto
nl: Plaatst een label bij het tekstveld
sl: Zagotavlja oznako, pripeto besedilnemu polju
sv: Tillhandahåller en beteckning kopplad till textfältet
uk: Надає доступ до мітки, яку пов'язано із текстовим полем

source: What to do after input is accepted (i.e. pressed Enter) In this case, it moves the focus to the next field
ca: Què s'ha de fer després d'acceptar l'entrada (p. ex. es prem Retorn) En aquest cas, mou el focus al camp següent
eo: Kion fari post kiam enigo estas akceptita (t.e. premita Enigu) En ĉi tiu kazo, ĝi movas la fokuson al la sekva kampo
nl: Wat te doen nadat de invoer is geaccepteerd (d.w.z. Enter is ingedrukt). In dit geval wordt de focus verplaatst naar het volgende veld
sl: Kaj storiti, ko je vnos sprejet (tj. pritisnjen Enter) V tem primeru premakne fokus na naslednje polje
sv: Vad du ska göra efter att inmatning har accepterats (dvs. tryckt på returtangenten), i det här fallet flyttas fokus till nästa fält
uk: Що робити після прийняття вхідних даних (тобто натискання клавіші Enter)? У цьому випадку фокусування буде пересунуто на наступне поле

source: Again, it moves the focus to the next field
ca: De nou, mou el focus al camp següent
eo: Denove, ĝi movas la fokuson al la sekva kampo
es: De nuevo, mueve el foco al siguiente campo
nl: Opnieuw wordt de focus verplaatst naar het volgende veld
sl: Spet premakne fokus na naslednje polje
sv: Återigen flyttar det fokus till nästa fält
uk: Знову ж таки, пересуває фокусування до наступного поля

source: D means a required number between 1-9, 9 means a required number between 0-9
ca: D significa un nombre necessari entre 1-9, 9 significa un nombre necessari entre 0-9
eo: D signifas postulatan nombron inter 1-9, 9 signifas postulatan nombron inter 0-9
es: D indica que se requiere un número entre 1 y 9, 9 indica que se requiere un número entre 0 y 9
nl: D betekent een vereist cijfer tussen 1-9, 9 betekent een vereist cijfer tussen 0-9
sl: D pomeni zahtevano število med 1-9, 9 pomeni zahtevano število med 0-9
sv: D betyder ett obligatoriskt värde mellan 1-9, 9 betyder ett obligatoriskt värde mellan 0-9
uk: D означає обов'язкове число у діапазоні 1-9, 9 — обов'язкове число у діапазоні 0-9

source: Here we confirm the operation just like clicking the OK button
ca: Aquí confirmem l'operació igual que fer clic al botó D'acord
eo: Ĉi tie ni konfirmas la operacion same kiel klaki la OK butonon
es: Aquí confirmamos la operación con solo pulsar el botón «Aceptar»
nl: Hier accepteren we de wijziging door gewoon op de OK-knop te klikken
sl: Tukaj potrdimo operacijo tako kot s klikom na gumb V redu
sv: Här bekräftar vi operationen precis som att klicka på knappen Ok
uk: Тут ми підтверджуємо дію, подібно до натискання кнопки «Гаразд»

source: The dialog logic goes here
ca: La lògica del diàleg va aquí
eo: La dialoglogiko iras ĉi tie
es: Aquí va la lógica del diálogo
nl: De dialoog-code komt hier
sl: Logika dialoga gre sem
sv: Dialogrutans logik ska finnas här
uk: Тут маємо логіку діалогового вікна

source: Dialogs by default have a [header](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) and a [footer](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), both inherited from [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
ca: De manera predeterminada, els diàlegs tenen una [header (capçalera)](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) i un [footer (peu)](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), tots dos heretats de [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
eo: Dialogoj defaŭlte havas [header](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) kaj [footer](https://doc.qt .io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), ambaŭ hereditaj de [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
nl: Standaard hebben dialogen een [Kop (header)](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) en een [Voet (footer)](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), beide geërfd van [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
sl: Pogovorna okna imajo privzeto glavo [header](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) in nogo [footer](https://doc.qt .io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), oba podedovana iz [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
sv: Dialogrutor har normalt en [header](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) och en [footer](https://doc.qt .io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), båda ärvda från [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).
uk: У діалогових вікон, типово, є [заголовок](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#header-prop) і [підвал](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#footer-prop), обидва успадковані від [Controls.Dialog](docs:qtquickcontrols;QtQuick.Controls.Dialog).

source: The header by default includes a [title](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) and a close button that can be disabled with [showCloseButton](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html#showCloseButton-prop). The footer by default includes a close button, and it can be overridden with [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).
ca: La capçalera per defecte inclou un [title (títol)](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) i un botó de tancament que es pot desactivar amb [showCloseButton](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html#showCloseButton-prop). El peu predeterminat inclou un botó de tancament, i es pot anul·lar amb [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).

source: We first set it to show an "Ok" button and a "Cancel" button, add some padding, and add a reasonable [preferredWidth](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html#preferredWidth-prop). The preferred width is the default expected size of the dialog, which can increase if needed. We can use standard [Kirigami.Units](https://api.kde.org/qml-org-kde-kirigami-platform-units.html) that we will revisit later on.
ca: Primer, l'establim per a mostrar un botó «Ok» i un botó «Cancel·la», afegir algun farciment i afegir una [preferredWidth](https://api.kde.org/qml-org-kde-kirigami-dialogs-dialog.html#preferredWidth-prop) raonable. L'amplada preferida és la mida esperada predeterminada del diàleg, que pot augmentar si cal. Podem utilitzar [Kirigami.Units](https://api.kde.org/qml-org-kde-kirigami-platform-units.html) que tornarem a revisar més endavant.

source: Then we come to a [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout). Unlike a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), the layout of its child components is automatic and centered, with optional labels. As the name implies, it is used to create input forms.
ca: Després arribem a un [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout). A diferència del [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), la disposició dels seus components fills és automàtica i centrada, amb etiquetes opcionals. Com el nom indica, s'utilitza per a crear formularis d'entrada.
