Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The main purpose of a FormCard is to serve as a container for other components while following a color different from the background, in a similar manner to a [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card), but for settings windows. You can have multiple FormCards in your application to indicate different sections. Your FormCard is also expected to be a direct child of a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).
ca: El propòsit principal d'un FormCard és servir com a contenidor per a altres components mentre segueix un color diferent del fons, de manera similar a un [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card), però per a les finestres de configuració. Podeu tenir múltiples FormCards a l'aplicació per a indicar seccions diferents. També s'espera que el FormCard sigui fill directe d'un [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html).

source: Importing `org.kde.kirigamiaddons.formcard` makes all FormCard components available to your QML file.
ca: La importació de `org.kde.kirigamiaddons.formcard` fa que tots els components de FormCard estiguin disponibles per al fitxer QML.
eo: Importi `org.kde.kirigamiaddons.formcard` disponigas ĉiujn komponantojn de FormCard al via QML-dosiero.
es: La importación de `org.kde.kirigamiaddons.formcard` hace que todos los componentes de FormCard estén disponibles para nuestro archivo QML.
nl: Importeren van `org.kde.kirigamiaddons.formcard` maakt alle FormCard-componenten beschikbaar aan ons QML-bestand.
sl: Uvažanje `org.kde.kirigamiaddons.formcard` naredi vse komponente FormCard razpoložljive vaši datoteki QML.
sv: Genom att importera `org.kde.kirigamiaddons.formcard` blir alla FormCard-komponenter tillgängliga i QML-filen.
uk: Імпортування `org.kde.kirigamiaddons.formcard` робить доступними для вашого файла QML усі компоненти FormCard.

source: We will have only a single section in our main page, so we add a single FormCard:
ca: Només tindrem una secció única a la pàgina principal, per la qual cosa afegirem una FormCard única:
eo: Ni havos nur unu sekcion en nia ĉefa paĝo, do ni aldonas ununuran FormCard:
es: Solo tendremos una única sección en nuestra página principal, por lo que añadimos una única FormCard:
nl: We zullen slechts een enkele sectie hebben in onze hoofdpagina, dus voegen we een enkele FormCard toe:
sl: Na glavni strani bomo imeli samo en razdelek, zato dodamo enega FormCard:
sv: Vi har bara en enda sektion på vår huvudsida, så vi lägger till ett enda FormCard:
uk: У нас буде лише один розділ на нашій головній сторінці, тому ми додамо одну FormCard:

source: The great thing about FormCard is that it does automatic layouting for you. In other words, just the order of its components is enough to indicate their position inside the FormCard, no [Layout attached properties](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) are necessary and you are expected not to use [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) or [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html).
ca: El millor del FormCard és que fa una maquetació automàtica. En altres paraules, només l'ordre dels seus components és suficient per a indicar la seva posició dins del FormCard, no són necessàries les [propietats adjuntes a la disposició](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) i s'espera que no utilitzeu les [àncores](https://doc.qt.io/qtquick-positioning-anchors.html) o els [posicionadors](https://doc.qt.io/qtquick-positioning-layouts.html).
eo: La bonega afero pri FormCard estas, ke ĝi faras aŭtomatan aranĝon por vi. Alivorte, nur la ordo de ĝiaj komponantoj sufiĉas por indiki ilian pozicion ene de la FormCard, neniu [Layout attached properties](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html ) estas necesaj kaj vi atendas ne uzi [ankrojn](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) aŭ [poziciigilojn](https://doc.qt.io /qt-6/qtquick-positioning-layouts.html).
es: Lo mejor de una FormCard es que organiza automáticamente su contenido. En otras palabras, basta con indicar el orden de sus componentes para definir su posición dentro de la FormCard, por lo que no se necesitan [propiedades adjuntas de diseño](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) ni el uso de [anclajes](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) o [posicionadores](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html).
nl: Het geweldige van een FormCard is dat het automatische indeling voor u doet. Met andere woorden, alleen de volgorde van zijn componenten is genoeg om hun positie in de FormCard aan te geven, geen [aangehangen indelingseigenschappen](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) zijn nodig en van u wordt verwacht geen [ankers](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) of [positionering](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) te gebruiken.
sl: Odlična stvar pri FormCardu je, da namesto vas naredi samodejno postavitev. Z drugimi besedami, samo vrstni red njegovih komponent je dovolj, da navede njihov položaj znotraj FormCard, brez [lastnosti priložene postavitve](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) so potrebni in od vas se pričakujene uporabljajte [sider](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) ali [pozicionerji](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html).
sv: Det fina med FormCard är att det automatiskt gör en layout åt dig. Med andra ord, bara ordningen på dess komponenter räcker för att indikera deras position inne i ett FormCard, inga [bifogade egenskaper för Layout](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html) är nödvändiga och det förväntas att [förankring](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) eller [positionering](https://doc.qt.io) /qt-6/qtquick-positioning-layouts.html) inte används.
uk: Чудова особливість FormCard полягає в тому, що вона виконує автоматичне компонування за вас. Іншими словами, лише порядку його компонентів достатньо, щоб вказати їхнє розташування всередині FormCard — не потрібно ніяких [прикріплених властивостей компонування](https://doc.qt.io/qt-6/qml-qtquick-layouts-layout.html), і немає потреби у використанні [прив'язок](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html) або [позиціонерів](https://doc.qt.io /qt-6/qtquick-positioning-layouts.html).

source: We can simply add a few buttons inside our FormCard:
ca: Simplement podem afegir uns quants botons dins de la FormCard:
eo: Ni povas simple aldoni kelkajn butonojn ene de nia FormCard:
es: Podemos añadir algunos botones dentro de nuestra FormCard:
nl: We kunnen eenvoudig een paar knoppen in onze FormCard toevoegen:
sl: V našo FormCard lahko preprosto dodamo nekaj gumbov:
sv: Vi kan helt enkelt lägga till några knappar inne i vårt FormCard:
uk: Ми можемо просто додати декілька кнопок всередину нашого FormCard:

source: That's it! The buttons are not usable just yet, but we are now set up to play with our About pages!
ca: Això és tot! Els botons encara no es poden utilitzar, però ara estem preparats per a jugar amb les nostres pàgines «Quant al»!
eo: Jen ĝi! La butonoj ankoraŭ ne estas uzeblaj, sed ni nun estas aranĝitaj por ludi kun niaj Pri paĝoj!
es: ¡Ya está! Los botones todavía no se pueden usar, pero ya están preparados para lanzar nuestras páginas «Acerca de».
nl: Dat is het! De knoppen zijn nog niet te gebruiken, maar we zijn nu zover om te spelen met onze pagina's Informatie over!
sl: To je to! Gumbi še niso uporabni, vendar smo pripravljeniigrajte se z stranmi O strani!
sv: Det är allt! Knapparna är inte användbara än, men vi är nu klara att leka med våra About-sidor.
uk: Ось і все! Кнопками ще не можна скористатися, але ми налаштували усе для користування нашими сторінками «Про програму»!

source: We then build and run it like so:
ca: Després la construïm i l'executem així:
eo: Ni tiam konstruas kaj rulas ĝin tiel:
es: Ahora compilamos y ejecutamos:
nl: We bouwen en voeren het uit zoals:
sl: Nato ga zgradimo in izvajamo takole:
sv: Vi bygger och kör det sedan så här:
uk: Тепер можна зібрати і запустити усе ось так:

source: To see other ways to build your application (for example, on Windows), see the [Getting Started with Kirigami](/docs/getting-started/kirigami/introduction-getting_started) page.
ca: Per a veure altres maneres de construir la vostra aplicació (per exemple, al Windows), vegeu la pàgina [Com començar amb el Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
eo: Por vidi aliajn manierojn konstrui vian aplikaĵon (ekzemple en Vindozo), vidu la paĝon [Komenco kun Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
es: Para ver otras formas de compilar la aplicación (por ejemplo, en Windows), consulte la página [Primeros pasos con Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
nl: Om andere manieren te zien om uw toepassing te bouwen (bijvoorbeeld, op Windows), zie de pagina [Beginnen met Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
sl: Če si želite ogledati druge načine za izdelavo vaše aplikacije (na primer v sistemu Windows), glejte stran [Začetek uporabe Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
sv: För att se andra sätt att bygga program (till exempel på Windows), se sidan [Komma igång med Kirigami](/docs/getting-started/kirigami/introduction-getting_started).
uk: Щоб ознайомитися із іншими способами зібрати нашу програму (наприклад, у Windows), прочитайте сторінку [Вступ до Kirigami](/docs/getting-started/kirigami/introduction-getting_started).

source: About page
ca: Pàgina «Quant al»
eo: Pri paĝo
es: Página acerca de
nl: Pagina Info over
sl: Stran o programu
sv: Om-sida
uk: Сторінка «Про програму»

source: Information about your application
ca: Informació sobre la vostra aplicació

source: [Kirigami.AboutPage](docs:kirigami;org.kde.kirigami.AboutPage) allows you to have a page that shows the copyright notice of the application together with the list of contributors and some information of which platform it's running on.
ca: La [Kirigami.AboutPage](docs:kirigami;org.kde.kirigami.AboutPage) permet tenir una pàgina que mostra les notes dels drets d'autor de l'aplicació juntament amb la llista dels col·laboradors i certa informació sobre la plataforma en la qual s'està executant.
sl: [Kirigami.AboutPage](docs:kirigami2;AboutPage) vam omogoča, da imate stran, ki prikazuje obvestilo o avtorski pravici aplikacije skupaj z navedbo avtorjev prispevkov in nekaterih informacij, na kateri platformi se izvaja.

source: First, we are going to edit our `main.cpp` file from previous tutorials.
ca: Primer, editarem el nostre fitxer `main.cpp` de les guies d'aprenentatge anteriors.
eo: Unue, ni redaktos nian `main.cpp` dosieron de antaŭaj lerniloj.
es: En primer lugar, vamos a editar nuestro archivo `main.cpp` de los tutoriales anteriores.
nl: Eerst gaan we ons bestand `main.cpp` uit de vorige inleidingen bewerken.
pt: Primeiro, vamos editar o nosso ficheiro `main.cpp` dos tutoriais anteriores.
sl: Najprej bomo uredili svojo datoteko `main.cpp` iz prejšnjih vaj.
sv: Först ska vi redigera vår fil, `main.cpp`, från tidigare handledningar.
uk: Спочатку, ми внесемо зміни до нашого файла `main.cpp` з попередніх частин підручника.

source: In the `main.cpp` file we include [KAboutData](docs:kcoreaddons;KAboutData), a core KDE frameworks component that lets us store information about our application. This information can then be reused by many other KDE Frameworks components. We instantiate a new `aboutData` object with its fairly complete default constructor and add author information.
ca: En el fitxer `main.cpp` incloem [KAboutData](docs:kcoreaddons;KAboutData), un component central dels Frameworks de KDE que permet emmagatzemar la informació sobre l'aplicació. Aquesta informació després pot ser reutilitzada per molts altres components dels Frameworks del KDE. Instanciem un objecte `aboutData` nou amb el seu constructor predeterminat força complet i afegim la informació de l'autor.
eo: En la `main.cpp`-dosiero ni inkluzivas [KAboutData](docs:kcoreaddons;KAboutData), kerna KDE-kadra komponanto, kiu ebligas al ni konservi informojn pri nia aplikaĵo. Ĉi tiuj informoj tiam povas esti reuzataj de multaj aliaj komponantoj de KDE Frameworks. Ni kreas novan objekton `aboutData` kun ĝia sufiĉe kompleta defaŭlta konstrukciisto kaj aldonas informojn pri aŭtoro.
es: En el archivo `main.cpp` incluimos [KAboutData](docs:kcoreaddons;KAboutData), un componente principal de KDE Frameworks que nos permite guardar información sobre nuestra aplicación. Esta información la pueden reutilizar otros componentes de KDE Frameworks. Creamos una instancia de un nuevo objeto `aboutData` con su constructor predeterminado, que es bastante completo, y añadimos información sobre el autor.
nl: In het bestand `main.cpp` voegen we [KAboutData](docs:kcoreaddons;KAboutData) is een kerncomponent van KDE Frameworks die ons informatie over onze toepassing laat opslaan. Deze informatie kan daarna opnieuw gebruikt worden door vele andere KDE Frameworks-componenten. We maken een nieuw exemplaar van een object `aboutData` met zijn tamelijk volledige standaard constructor en voegen informatie over de auteur toe.
pt: No ficheiro `main.cpp`, incluímos o [KAboutData](docs:kcoreaddons;KAboutData), um componente das Plataformas do KDE de base que guarda informações sobre uma aplicação, as quais poderão ser reutilizadas por muitos componentes das Plataformas do KDE. Iremos instanciar um novo objecto `aboutData` com o seu construtor predefinido e relativamente completo, e depois adicionar a informação do autor.
sl: V datoteko `main.cpp` vključimo [KAboutData](docs:kcoreaddons;KAboutData), jedrno komponento Ogrodja KDE, ki shrani informacije o aplikaciji. Te informacije lahko nato ponovno uporabijo številne druge komponente Ogrodja KDE. Nov predmet `aboutData` iniciramo z dokaj popolnim privzetim konstruktorjem in dodamo informacije o avtorju.
sv: I filen `main.cpp` inkluderar vi [KAboutData](docs:kcoreaddons;KAboutData), en huvudkomponent i KDE Ramverk som lagrar information om ett program. Informationen kan sedan återanvändas av många andra komponenter i KDE Ramverk. Vi instansierar ett nytt `aboutData` objekt med dess ganska fullständiga förvalda konstruktor och lägger till information om upphovsmän.
uk: У файлі «main.cpp» ми включаємо [KAboutData](docs:kcoreaddons;KAboutData), який є основним компонентом KDE Frameworks, який надає нам змогу зберігати відомості щодо програми, які згодом можна повторно використати у багатьох інших компонентах KDE Frameworks. Ми створюємо екземпляр нового об'єкта `aboutData` із його очевидно повним типовим конструктором та додаємо дані щодо авторства.

source: After all the required information has been set, we call [KAboutData::setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) to initialize the properties of the [QApplication ](docs:qtwidgets;QApplication) object.
ca: Una vegada s'ha establert tota la informació requerida, cridem a [KAboutData::setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) per a inicialitzar les propietats de l'objecte [QApplication ](docs:qtwidgets;QApplication).

source: We then create a [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). This is used to allow us to import the C++ code as a module in our `main.qml` with `import org.kde.example 1.0`.
ca: Després creem un [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Això s'utilitza per a permetre importar el codi C++ com un mòdul en el nostre `main.qml` amb `import org.kde.example 1.0`.
eo: Ni tiam kreas [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Ĉi tio estas uzata por permesi al ni importi la C++-kodon kiel modulon en nia `main.qml` kun `import org.kde.example 1.0`.
es: A continuación creamos un [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Esto se usa para permitirnos importar el código C++ como un módulo en nuestro `main.qml` con `import org.kde.example 1.0`.
nl: Daarna maken we een [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Deze wordt gebruikt om ons toe te staan de C++ code als een module in onze `main.qml` met `import org.kde.example 1.0` te importeren.
pt: Iremos criar então um [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Este é usado para nos permitir importar o código em C++ como um módulo no nosso `main.qml` com o `import org.kde.example 1.0`.
sl: Nato ustvarimo [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). To je uporabljeno za uvoz kode C++ kot modula v naši `main.qml` z `import org.kde.example 1.0`.
sv: Vi skapar sedan en [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Den används för att låta oss importera C++ koden som en modul i vår `main.qml` med `import org.kde.example 1.0`.
uk: Потім ми створюємо [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType). Ця функція надає нам змогу імпортувати код C++ як модуль у нашому `main.qml` за допомогою інструкції `import org.kde.example 1.0`.

source: Its first argument is the URI that will be used for the import, the second and third arguments are major and minor versions respectively, the fourth is the type name, the name that we will call when accessing our `About` type, and the last is a reference to the C++ object that is exposed to QML. In the latter's case, we use a [lambda](https://en.cppreference.com/w/cpp/language/lambda) to instantiate the `aboutData` of our application in place.
ca: El seu primer argument és l'URI que s'utilitzarà per a la importació, el segon i el tercer són les versions majors i menors respectivament, el quart és el nom del tipus, el nom que cridarem quan accedim al nostre tipus `About`, i l'últim és una referència a l'objecte C++ que està exposat al QML. En el cas d'aquest últim, utilitzem una [lambda](https://en.cppreference.com/w/cpp/language/lambda) per a instanciar l'`aboutData` de la nostra aplicació en el seu lloc.
eo: Ĝia unua argumento estas la URI, kiu estos uzata por la importo, la dua kaj tria argumentoj estas plej grandaj kaj malgravaj versioj respektive, la kvara estas la tipnomo, la nomo kiun ni nomos kiam ni aliros nian `Pri` tipo, kaj la lasta. estas referenco al la C++ objekto kiu estas elmontrita al QML. En ĉi-lasta kazo, ni uzas [lambda](https://en.cppreference.com/w/cpp/language/lambda) por krei la `aboutData` de nia aplikaĵo en loko.
es: Su primer argumento es el URI que se usará para la importación; el segundo y tercer argumentos son, respectivamente, las versiones mayor y menor; el cuarto es el nombre del tipo, el nombre que llamaremos para acceder a nuestro tipo `About`; y el último es una referencia al objeto de C++ que se expone a QML. En el caso de este último, usamos una [lambda](https://en.cppreference.com/w/cpp/language/lambda) para instanciar el `aboutData` de nuestra aplicación en el mismo lugar.
nl: Zijn eerste argument is de URI die gebruikt zal worden voor het importeren, het tweede en het derde argument zijn respectievelijk majeure en mineure versies, het vierde is het type naam, de naam die we zullen aanroepen bij toegang tot ons type `About` en het laatste is een referentie naar het C++ object dat wordt blootgesteld aan QML. In het laatste geval gebruiken we een [lambda](https://en.cppreference.com/w/cpp/language/lambda) om ter plekke en exemplaar te maken van de `aboutData` van onze toepassing.
pt: O seu primeiro argumento é o URI que será usado para a importação, sendo os segundo e terceiro argumentos as versões principais e secundárias, respectivamente, o quarto o nome do tipo - o nome que iremos invocar ao aceder ao nosso tipo `About` e o último é uma referência ao objecto em C++ que está exposto no QML. No caso do último, iremos usar uma função [lambda](https://en.cppreference.com/w/cpp/language/lambda) para instanciar o `aboutData` da nossa aplicação no local.
sl: Njen prvi argument je URI, ki bo uporabljen za uvoz, drugi in tretji argumenti sta glavna in manjša različica, četrta je ime vrste, nato ime, ki ga bomo poklicali pri dostopu vrste `About` in zadnje je sklicevanje na objekt C++, ki je izpostavljen do QML. V slednjem primeru uporabljamo [lambda](https://en.cppreference.com/w/cpp/language/lambda), da postavimo `AboutData" v prostor naše aplikacije.
sv: Dess första argument är webbadressen som kommer att användas för import, det andra och tredje argumentet är huvudversion respektive delversion, det fjärde är typnamnet, namnet som vi kommer att anropa när vi använder vår "Om"-typ, och det sista är en referens till C++-objektet som är exponerat för QML. I det senare fallet använder vi en [lambda](https://en.cppreference.com/w/cpp/language/lambda) för att instansiera vår applikations "aboutData" på plats.
uk: Першим аргументом є адреса, яку буде використано для імпортування, другим і третім аргументами є основна і проміжна версії, відповідно, четвертим аргументом є назва типу, назва, яку ми викликатимемо при доступі до методів нашого типу `About`. Останнім аргументом є посилання на об'єкт C++, доступ до якого буде відкрито для QML. В останньому випадку ми використовуємо [лямбду](https://en.cppreference.com/w/cpp/language/lambda) для створення екземпляра `aboutData` нашої програми на місці.

source: First, we use the import we defined in the `main.cpp` file, namely `org.kde.example`. We then add a [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) to our [global drawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) that will send us to the About page, and create a component with a [Kirigami.AboutPage](docs:kirigami;org.kde.kirigami.AboutPage) in it, which expects a [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData) object. We exposed precisely that in our `main.cpp` and called it `About`, so we can pass it here.
ca: Primer, utilitzarem la importació que hem definit al fitxer `main.cpp`, és a dir `org.kde.example`. Després s'afegeix [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) al nostre [calaix global](docs:kirigami;org.kde.kirigami.GlobalDrawer) que ens enviarà a la pàgina «Quant al», i crearà un component amb un [Kirigami.AboutPage](docs:kirigami;org.kde.kirigami.AboutPage) en ell, que espera un objecte [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData). Hem exposat precisament això en el nostre `main.cpp` i l'hem anomenat `About`, de manera que el podem passar aquí.
sl: Najprej uporabimo uvoz, ki smo ga določili v datoteki `main.cpp`, in sicer `org.kde.example`. Nato dodamo [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) v naš [global drawer](docs:kirigami;org.kde.kirigami.GlobalDrawer) ki nas bo poslala na stran About in v njej ustvarila komponento [Kirigami.AboutPage](docs:kirigami;org.kde.kirigami.AboutPage), ki pričakuje predmet [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData). Izpostavili smo točno to v naši datoteki `main.cpp` in jo poimenovali `About`, tako, da jo lahko prenesemo sem.
