Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/) provides a code example showcasing [all colors available for Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) through [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme). This includes all their states: if you click outside the window, the colors change to their inactive state, and if you switch your system to a dark theme, the dark variants of the colors should show up in real time.
eo: [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/) disponigas kodekzemplon montrantan [ĉiujn kolorojn disponeblajn por Kirigami](https://invent.kde.org/sdk/kirigami-gallery/- /blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) tra [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme). Ĉi tio inkluzivas ĉiujn iliajn statojn: se vi alklakas ekster la fenestro, la koloroj ŝanĝas al sia neaktiva stato, kaj se vi ŝanĝas vian sistemon al malhela temo, la malhelaj variantoj de la koloroj aperu en reala tempo.
nl: [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/) levert een codevoorbeeld die [alle beschikbare kleuren voor Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) presenteert via [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme). Dit omvat alle hun statussen: als u buiten het venster klikt, wijzigen de kleuren naar hun inactieve status en als u uw systeem omschakelt naar een donker thema, zouden de donkere varianten van de kleuren direct moeten verschijnen.
sv: [Kirigami galleri](https://apps.kde.org/kirigami2.gallery/) tillhandahåller ett kodexempel som visar upp [alla färger tillgängliga för Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) genom [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme). Det omfattar alla deras tillstånd: om du klickar utanför fönstret ändras färgerna till sitt inaktiva tillstånd, och om du byter till ett mörkt tema på systemet ska de mörka varianterna av färgerna dyka upp i realtid.
uk: У [Галереї Kirigami](https://apps.kde.org/kirigami2.gallery/) наведено зразок коду із прикладами [усіх кольорів, які доступні для Kirigami](https://invent.kde.org/sdk/kirigami-gallery/-/blob/master/src/data/contents/ui/gallery/ColorsGallery.qml) через [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme). До цього прикладу включено усі стани кольорів: якщо ви клацнете поза вікном, кольори буде переведено у неактивний стан, а якщо ви перемкнете вашу систему на темну тему кольорів, буде показано темні варіанти кольорів у режимі реального часу.

source: If you define a color set for an item, all of its child items will recursively inherit it automatically (unless the property [inherit](docs:kirigami2;Kirigami::Platform::PlatformTheme::inherit) has explicitly been set to `false`, which should always be done when the developer wants to force a specific color set) so it is easy to change colors for an entire hierarchy of items without touching any of the items themselves.
eo: Se vi difinas koloraron por ero, ĉiuj ĝiaj filaj eroj rekursie heredos ĝin aŭtomate (krom se la propreco [heredaĵo](docs:kirigami2;Kirigami::Platform::PlatformTheme::hered) eksplicite estis agordita al `false`, kio ĉiam devas esti farita kiam la programisto volas devigi specifan koloraron) do estas facile ŝanĝi kolorojn por tuta hierarkio de eroj sen tuŝi iun ajn el la eroj mem.
nl: Als u een kleurenset voor een item definieert, zullen alle kind-items recursief het automatisch erven (tenzij de eigenschap [inherit](docs:kirigami2;Kirigami::Platform::PlatformTheme::inherit) expliciet is ingesteld op `false`, wat altijd gedaan zou moeten worden wanneer de ontwikkelaars een specifieke kleurenset wil afdwingen) het is dus gemakkelijk kleuren te wijzigen voor een gehele hiërarchie van items zonder de items zelf aan te raken.
sv: Om du definierar ett objekts färguppsättning, ärver alla dess underliggande objekt den automatiskt rekursivt (om inte egenskapen [inherit](docs:kirigami2;Kirigami::Platform::PlatformTheme::inherit) explicit har tilldelats `false`, vilket alltid bör göras när utvecklaren vill tvinga användning av en viss färguppsättning) så att det är enkelt att ändra färger för en hel objekthierarki utan att röra något av objekten själva.
uk: Якщо ви визначаєте набір кольорів для запису, усі його дочірні записи (рекурсивно) успадкують його автоматично (якщо для властивості [inherit](docs:kirigami2;Kirigami::Platform::PlatformTheme::inherit) не буде явним чином встановлено значення `false`, що завжди слід робити, коли розробник хоче примусово встановити певний набір кольорів), тому дуже просто змінити кольори для усієї ієрархії записів без безпосередньої зміни кольорів для кожного із записів цієї ієрархії.

source: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) supports 5 different color sets:
eo: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) subtenas 5 malsamajn kolorajn arojn:
es: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) permite 5 conjuntos de colores distintos:
nl: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) ondersteunt 5 verschillende kleurensets:
sv: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) stöder fem olika färguppsättningar:
uk: У [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) передбачено підтримку 5 різних наборів кольорів:

source: Kirigami provides a [Heading](docs:kirigami2;Heading) that can be used for page or section titles.
eo: Kirigami disponigas [Titolon](docs:kirigami2;Titolo) kiu povas esti uzata por paĝo aŭ sekciotitoloj.
es: Kirigami proporciona una [Heading](docs:kirigami2;Heading) que se puede usar para títulos de páginas o de secciones.
nl: Kirigami biedt een [Heading](docs:kirigami2;Heading) dat gebruikt kan worden voor pagina- of sectietitels.
pt: O Kirigami fornece um [Heading](docs:kirigami2;Heading) que pode ser usado para títulos de páginas ou secções.
sv: Kirigami tillhandahåller [Heading](docs:kirigami2;Heading) som kan användas för sid- eller sektionstitlar.
uk: У Kirigami передбачено [елемент заголовка](docs:kirigami2;Heading), яким можна скористатися для заголовків сторінок або розділів.

source: The font size of the [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) is available as `Kirigami.Theme.defaultFont.pointSize` in your application.
eo: La tiparo de la [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) estas disponebla kiel `Kirigami.Theme.defaultFont.pointSize` en via aplikaĵo.
es: El tamaño del texto del [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) está disponible como `Kirigami.Theme.defaultFont.pointSize` en su aplicación.
nl: De tekengrootte van het [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) is beschikbaar als `Kirigami.Theme.defaultFont.pointSize` in uw toepassing.
sv: Teckenstorleken på [Kirigami Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme)är tillgänglig som `Kirigami.Theme.defaultFont.pointSize` i ditt program.
uk: Доступ до розміру шрифту [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) у вашій програмі можна отримати за допомогою `Kirigami.Theme.defaultFont.pointSize`.

source: The application's AboutPage is slightly more complex, but it's still very simple to use.
es: La página AboutPage de la aplicación es ligeramente más complicada, aunque sigue siendo muy sencilla de usar.
nl: De AboutPage van de toepassing is iets complexer, maar het is nog steeds erg eenvoudig te gebruiken.
sl: AboutPage aplikacije je nekoliko bolj zapletena, vendar je še vedno zelo preprosta za uporabo.
uk: Сторінка AboutPage програми є дещо складнішою, але і нею дуже просто користуватися.

source: Each new button we created in the previous step should open a new page. You can add new pages by instantiating them as [Components](docs:qtqml;QtQml.Component) and then using `pageStack.layers.push()` for each button to load that page in our `main.qml`:
sv: Varje ny knapp som vi skapade i föregående steg ska öppna en ny sida. Du kan lägga till nya sidor genom att instansiera dem som [Components](docs:qtqml;QtQml.Component) och sedan använda `pageStack.layers.push()` för varje knapp för att ladda den sidan i vår `main.qml`:

source: The application's AboutPage is slightly more complex, but it's still very simple to use. We will be adding a new QML file that will contain the information needed for our about page. First in our `resources.qrc` file:
sv: Programmets AboutPage är något mer komplex, men den är fortfarande väldigt enkel att använda. Vi lägger till en ny QML-fil som innehåller den information som behövs för vår Om-sida. Först i vår `resources.qrc`-fil:

source: And our `contents/ui/MyAboutPage.qml` should have the following:
sv: Och vår `contents/ui/MyAboutPage.qml` ska ha följande:

source: Here we use the information we set using [KAboutData](docs:kcoreaddons;KAboutData) in our `main.cpp`. Here's a brief reminder of what is in `main.cpp`:
sv: Här använder vi informationen vi ställer in med [KAboutData](docs:kcoreaddons;KAboutData) i vår `main.cpp`. Här är en kort påminnelse om vad som finns i `main.cpp`:

source: <========== used in the import
sv: <========== använt i import

source: <========== C++ object exported as a QML type
sv: <========== C++ objekt exporterade som en QML-typ

source: The `About` object we exported to the QML side using [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) contains the data from [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData), and that is what we pass to the `aboutData` property.
sv: Objektet `About` som vi exporterade till QML-sidan med [qmlRegisterSingletonType()](docs:qtqml;QQmlEngine::qmlRegisterSingletonType) innehåller data från [KAboutData::applicationData()](docs:kcoreaddons;KAboutData::applicationData), och det är vad vi skickar till egenskapen `aboutData`.

source: Lastly, we add our new MyAboutPage to our `main.qml`:
sv: Till sist lägger vi till vår nya MyAboutPage i vår `main.qml`:

source: If you were wondering why the About page was kept separate rather than embedded in `main.qml`, that is because it allows to set a custom model for the `aboutData` property.
sv: Om du undrade varför sidan Om hölls separat snarare än inbäddad i `main.qml`, så beror det på att den tillåter att ange en anpassad modell för egenskapen `aboutData`.

source: Change your `MyAboutPage.json` to something like this:
sv: Ändra `MyAboutPage.json` till något som liknar det här:

source: Add a new line to our `resources.qrc`:
sv: Lägg till en ny rad i vår `resources.qrc`:

source: And change `main.qml` to include our new Settings page:
sv: Och ändra `main.qml` för att inkludera vår nya inställningssida:

source: Create a new `contents/ui/SettingsPage.qml` file:
sv: Skapa en ny fil, `contents/ui/SettingsPage.qml`:

source: Since this example is for simple illustrative purposes, we don't delve deep into what would be done once the button is clicked: it just prints "Clicked!" to the terminal. We _could_ make a new page for account creation that adds another user to a model, then push the page into view, similarly to what we did in `main.qml`.
sv: Eftersom exemplet är för enkla illustrativa syften, går vi inte djupt in på vad som skulle göras när man väl klickar på knappen: den skriver bara ut "Clicked!" på terminalen. Vi _kan_ göra en ny sida för att skapa ett konto som lägger till en annan användare till en modell, och sedan visar sidan, på samma sätt som vi gjorde i `main.qml`.

source: A standard `resources.qrc`:
sv: En vanlig `resources.qrc`:

source: Initially, our `contents/ui/main.qml` should look like this:
sv: Från början ska vår `contents/ui/main.qml` se ut så här:

source: [Building Kirigami with kdesrc-build](#kdesrc-build)
sv: [Bygga Kirigami med kdesrc-build](#kdesrc-build)

source: If you wish to build Kirigami with Qt6, it is recommended to use [kdesrc-build](#kdesrc-build) instead, especially for Linux installations using Plasma 5.
sv: Om du vill bygga Kirigami med Qt6, rekommenderas att använda [kdesrc-build](#kdesrc-build) istället, speciellt för Linux-installationer som använder Plasma 5.

source: Building Kirigami with kdesrc-build
sv: Bygga Kirigami med kdesrc-build

source: KDE has a custom tool to easily build all of its libraries and programs: **kdesrc-build**. It can be used to build Kirigami on Linux and FreeBSD.
sv: KDE har ett eget verktyg för att enkelt bygga alla dess bibliotek och program: **kdesrc-build**. Det kan användas för att bygga Kirigami på Linux och FreeBSD.

source: For this tutorial, you will need to follow the [setup instructions for kdesrc-build](/docs/getting-started/building/kdesrc-build-setup).
sv: För den här handledningen måste du följa [installationsinstruktionerna för kdesrc-build](/docs/getting-started/building/kdesrc-build-setup).

source: In case you want to automatically build the project with kde-builder/kdesrc-build, custom module name should be the same as the project root folder (in our case it will be "kirigami-tutorial"), otherwise you would need to customize the `source-dir` or `dest-dir` for the module. We will assume the path to your `main.cpp` will be `~/kde/src/kirigami-tutorial/src/main.cpp`.
sv: Om projektet ska byggas automatiskt med kde-builder/kdesrc-build, bör det egna modulnamnet vara detsamma som projektets rotkatalog (i vårt fall är det "kirigami-tutorial"), annars skulle man behöva ange "source-dir" eller "dest-dir" för modulen. Vi antar att sökvägen till `main.cpp` är `~/kde/src/kirigami-tutorial/src/main.cpp`.

source: Window and taskbar icons will work in a Wayland session only if apps' desktop files are placed in `~/.local/share/applications` or `/usr/share/applications`. To get icons working in this tutorial, either copy the app's desktop file there or switch to a development session as instructed in [kdesrc-build tutorial](/docs/getting-started/building/kdesrc-build-compile). Some KDE applications might have working icons if they were already installed on the system.
sv: Fönster- och aktivitetsradsikoner fungerar bara i en Wayland-session om programmens skrivbordsfiler placeras i `~/.local/share/applications` eller `/usr/share/applications`. För att få ikoner att fungera i den här handledningen kopiera antingen programmets skrivbordsfil dit eller byt till en utvecklingssession enligt instruktionerna i [kdesrc-build tutorial](/docs/getting-started/building/kdesrc-build-compile). Vissa KDE-program kan ha fungerande ikoner om de redan har installerats på systemet.

source: If you want kdesrc-build to handle building and installation of your project, you need to specify a custom module in your `~/.config/kdesrc-buildrc`:
sv: Om du vill att kdesrc-build ska hantera att bygga och installera projektet, måste du specificera en egen modul i `~/.config/kdesrc-buildrc`:

source: Then you can build and install it with the command:
sv: Därefter kan du bygga och installera det med kommandot:

source: In case you want to handle building and installation manually without kdesrc-build, you will need to specify the place where the program will be installed. To do that, we need to change directories to our `kirigami-tutorial/` folder in our terminal application of choice and run the following commands:
sv: Om du vill hantera att bygga och installera manuellt utan kdesrc-build, måste du ange platsen där programmet ska installeras. För att göra det måste vi gå till vår katalog "kirigami-tutorial/" i valfritt terminalprogram och köra följande kommandon:

source: On Linux, with kde-builder
sv: På Linux, med kde-builder

source: On Linux, with kdesrc-build
sv: På Linux, med kdesrc-build

source: 4px
pl: 4 piks.
sv: 4 bildpunkter

source: 8px
pl: 8 piks.
sv: 8 bildpunkter

source: 18px
pl: 18 piks.
sl: 18 tč
sv: 18 bildpunkter

source: <img src="org.kde.kdeconnect.png" width="50" height="50"><br />KDE Connect
sv: <img src="org.kde.kdeconnect.png" width="50" height="50"><br />KDE-anslut

source: To display the text, add a heading to `main.qml` under the `title` property of the [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) element already contained in the template.
sl: Za prikaz besedila dodajte glavo v `main.qml` pod lastnostjo `title` v elementu [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page) že vsebovanem v predlogi.

source: Another feature of Kirigami Actions is to provide various hints to items using actions about how they should display the action. These are primarily handled by the [displayHint](https://api-staging.kde.org/qml-org-kde-kirigami-action.html#displayHint-prop) and [displayComponent](https://api-staging.kde.org/qml-org-kde-kirigami-action.html#displayComponent-prop) properties.
sl: Druga zmožnost dejanj Kirigami je zagotavljanje različnih namigov elementom, ki uporabljajo dejanja, o tem, kako naj prikažejo dejanje. S temi v prvi vrsti ravnata lastnosti [displayHint](https://api-staging.kde.org/qml-org-kde-kirigami-action.html#displayHint-prop) in [displayComponent](https://api-staging.kde.org/qml-org-kde-kirigami-action.html#displayComponent-prop).

source: You should rarely use an ActionTextField directly. [SearchField](docs:kirigami;org.kde.kirigami.SearchField) and [PasswordField](docs:kirigami;org.kde.kirigami.PasswordField) both inherit from `ActionTextField` and are likely to cover your desired use-case.
sl: Le poredko bi uporabili neposredno ActionTextField. Oba [SearchField](docs:kirigami;org.kde.kirigami.SearchField) in [PasswordField](docs:kirigami;org.kde.kirigami.PasswordField) dedujeta iz `ActionTextField` in verjetno pokrivata vašo zaželeno rabo.

source: A [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) is used to display a collection of information or actions together. These actions can be added to the `actions` group, similarly to previous components.
sl: [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) se skupaj uporablja za prikaz zbirke informacij ali dejanj. Ta dejanja je mogoče dodati v skupino `actions", podobno kot v prejšnje komponente.

source: Like most other action-holding components, [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) has an [actions](https://api-staging.kde.org/qml-org-kde-kirigami-actiontoolbar.html#actions-prop) property. We can assign an array of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) components to this property.
sl: Kot večina drugih komponent, ki držijo dejanja, ima tudi [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) lastnost [actions](https://api-staging.kde.org/qml-org-kde-kirigami-actiontoolbar.html#actions-prop). Tej lastnosti lahko dodelimo polje komponent [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action).

source: By default, actions in the [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) will be left aligned. This might not be desirable in all situations. Thankfully we can change this with the [alignment](https://api-staging.kde.org/qml-org-kde-kirigami-actiontoolbar.html#alignment-prop) property. We can set this property to a range of values, but the three most relevant ones are `Qt.AlignLeft`, `Qt.AlignCenter`, and `Qt.AlignRight` (which deal with [horizontal alignment](docs:qtcore;Qt::Alignment)).
sl: Privzeto bodo dejanja v vrstici [Kirigami.ActionToolBar](docs:kirigami;org.kde.kirigami.ActionToolBar) levo poravnana. To morda ni zaželeno v vseh situacijah. K sreči lahko to spremenimo z lastnostjo [alignment](https://api-staging.kde.org/qml-org-kde-kirigami-actiontoolbar.html#alignment-prop)`. To lastnost lahko nastavite na vrsto vrednosti, vendar so tri najpomembnejše za vrstico ActionToolBar `Qt.AlignLeft`, `Qt.AlignCenter` in `Qt.AlignRight` (ki obravnavajo horizontalno poravnavo [horizontal alignment](docs:qtcore;Qt::Alignment)).

source: A [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) is the simplest type of card. It's just a rectangle with a shadow, which can contain any [Item](docs:qtquick;QtQuick.Item) in it. It can also have Items assigned to its [header](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) or [footer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) properties. In this case a [Kirigami.Heading](docs:kirigami;org.kde.kirigami.Heading) is its `header` and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) is the card's [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).
sl: [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) je najenostavnejši tip kartice. To je samo pravokotnik s senco, ki lahko vsebuje katerokoli postavko [Item](docs:qtquick;QtQuick.Item) v njem. Lahko ima tudi postavke, dodeljene lastnostim [header](docs:kirigami;org.kde.kirigami.AbstractCard) ali [footer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-propr). V tem primeru je njegova glava [Kirigami.Heading](docs:kirigami;org.kde.kirigami.Heading) oznaka kontrole [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) vsebine kartice [contentItem](https://doc.qt.io/Qt-6/qml-qtquick-controls-control.html#contentItem-prop).

source: A [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) inherits from [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) and provides more features out of the box. Cards inherit the same [header](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) and [footer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) from an Abstract Card, but you are encouraged to use a [banner](https://api-staging.kde.org/qml-org-kde-kirigami-card.html#banner-prop) and a set of [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) in the `actions` group instead.
sl: [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card) deduje od [AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) in neposredno nudi več zmožnosti. Kartice dedujejo isto glavo [header](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#header-prop) in nogo [footer](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#footer-prop) iz abstraktne kartice, ampak spodbujamo rabo pasice [banner](https://api-staging.kde.org/qml-org-kde-kirigami-card.html#banner-prop) iz zbirko [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) namesto skupine `actions`.

source: A [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) will stretch child cards to its own width. This component should therefore only be used with cards which will look good at any horizontal size. Use of a [Card](docs:kirigami;org.kde.kirigami.Card) component inside it is discouraged, unless it has [Qt.Horizontal](docs:qtcore;Qt::Orientation) as its [headerOrientation](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#headerOrientation-prop) property.
sl: [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) bo raztegnil otroške kartice na lastno širino. To komponento se zato sme uporabiti samo s karticami, ki bodo dobro videti v kateri koli vodoravni velikosti. Uporaba komponente [Card](docs:kirigami2;Card) znotraj odsvetujemo, razen če ima orientacijo [Qt.Horizontal](docs:qtcore;Qt::Orientation) kot lastnost glave [headerOrientation](https://api-staging.kde.org/qml-org-kde-kirigami-abstractcard.html#headerOrientation-prop).
