Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), the standard library used in QML applications.
ca: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), la biblioteca estàndard utilitzada en les aplicacions QML.
eo: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), la norma biblioteko uzata en QML-aplikoj.
es: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), la biblioteca estándar que usan las aplicaciones en QML.
nl: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), de standaard bibliotheek gebruikt in QML toepassingen.
pt: O [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), a biblioteca-padrão usada nas aplicações em QML.
sl: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html) je standardna knjižnica, ki se uporablja v aplikacijah QML.
sv: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), standardbiblioteket som används i QML-program.
uk: [QtQuick](https://doc.qt.io/qt-6/qtquick-index.html), стандартну бібліотеку, яку використовують програми QML.

source: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), which provides a number of standard controls we can use to make our applications interactive.
ca: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), que proporciona una sèrie de controls estàndard que podem utilitzar perquè les nostres aplicacions siguin interactives.
eo: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), kiu provizas kelkajn normajn regilojn, kiujn ni povas uzi por fari niajn aplikaĵojn interagaj.
es: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), que proporciona cierto número de controles estándares que podemos usar para hacer que nuestras aplicaciones sean interactivas.
nl: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), die een aantal standaard besturingen levert die we kunnen gebruiken om onze toepassingen interactief te maken.
pt: O [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), que oferece um conjunto de controlos-padrão que poderemos usar para tornar as nossas aplicações interactivas.
sl: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), ki zagotavlja številne standardne kontrole, s katerimi lahko naše aplikacije naredimo interaktivne.
sv: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), som tillhandahåller ett antal standardkontroller som vi kan använda för att göra vårt program interaktivt.
uk: [QtQuick Controls](https://doc.qt.io/qt-6/qtquickcontrols-index.html), які забезпечують роботу декількох стандартних засобів керування, якими ми можемо скористатися для того, щоб зробити наші програми інтерактивними.

source: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), which provides tools for placing components within the application window.
ca: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), que proporciona eines per a col·locar els components dins de la finestra de l'aplicació.
eo: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), kiu disponigas ilojn por meti komponentojn ene de la aplika fenestro.
es: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), que proporciona herramientas para situar componentes dentro de la ventana de la aplicación.
nl: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), die hulpmiddelen voor het plaatsen van componenten in de toepassingsvensters levert.
pt: O [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), que oferece ferramentas para colocar os componentes dentro da janela da aplicação.
sl: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), ki ponuja orodja za postavitev komponent v okno aplikacij.
sv: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), som tillhandahåller verktyg för att placera komponenter inom programmets fönster.
uk: [QtQuick Layouts](https://doc.qt.io/qt-6/qtquicklayouts-index.html), які містять інструменти для розташовування компонентів у вікні програм.

source: [Kirigami](docs:kirigami;kirigami-index.html), which provides a number of components suited for creating applications that work across devices of different shapes and sizes.
ca: El [Kirigami](docs:kirigami;kirigami-index.html), que proporciona una sèrie de components adequats per a crear aplicacions que funcionen en dispositius de formes i mides diferents.

source: Putting the QtQuick Controls and Kirigami imports into separate namespaces using the `as` keyword is a best practice that ensures no components with the same name can conflict. You might see different names for QtQuick Controls in the wild, such as "QQC" or "QQC2". We will be using "Controls" in this tutorial for clarity.
ca: Posar els QtQuick Controls i les importacions del Kirigami en espais de noms separats utilitzant la paraula clau `as` és una millor pràctica que assegura que cap component amb el mateix nom pugui entrar en conflicte. Podreu trobar diferents noms per als controls QtQuick en els textos, com ara «QQC» o «QQC2». Utilitzarem "Controls" en aquesta guia d'aprenentatge per a més claredat.
eo: Meti la QtQuick-Regilojn kaj Kirigami-importaĵojn en apartajn nomspacojn uzante la ŝlosilvorton `as` estas plej bona praktiko, kiu certigas, ke neniuj komponantoj kun la sama nomo povas konflikti. Vi eble vidos malsamajn nomojn por QtQuick Controls en natura medio, kiel "QQC" aŭ "QQC2". Ni uzos "Regiloj" en ĉi tiu lernilo por klareco.
nl: De QtQuick Controls en Kirigami imports in aparte naamruimten stoppen met het gebruik van sleutelwoord `as` is een beste praktijk die verzekert dat er geen componenten zijn met dezelfde naam die in conflict kunnen zijn. U zou verschillende namen voor QtQuick Controls in het wild kunnen zien, zoals "QQC" of "QQC2". We zullen "Controls" in deze handleiding gebruiken voor alle helderheid.
pt: Colocar as importações do QtQuick Controls e do Kirigami em espaços de nomes separados com a palavra-chave `as` é uma boa prática que garante que os componentes que tenham o mesmo nome não entrem em conflito. Poderá ver diferentes nomes para os controlos do QtQuick por aí, como por exemplo "QQC" ou "QQC2". Iremos usar "Controls" neste tutorial por questões de clareza.
sl: Če postavite kontrole QtQuick in uvoze Kirigamija v ločene imenske prostore z uporabo ključne besede `as je najboljša praksa, ki zagotavlja, da nobene komponente z istim imenom ne morejo biti v sporu. Morda boste videli različna imena za QtQuick Controls na terenu, kot sta "QQC" ali "QQC2". Zaradi jasnosti bomo v tej vaji uporabljali "Controls".
sv: Att placera QtQuick-kontroller och Kirigami-import i separata namnrymder med nyckelordet `as` är bästa praxis för att säkerställa att inga komponenter med samma namn kan orsaka konflikt. Du kan se olika namn för QtQuick Controls i verkligheten, såsom "QQC" eller "QQC2". Vi använder "Controls" i handledningen för tydlighetens skull.
uk: Розташування імпортування елементів керування QtQuick і Kirigami в окремих просторах назв за допомогою ключового слова `as` є найкращим способом, який забезпечує усування можливих конфліктів між компонентами з однаковими назвами. У різних програмах ви можете бачити різні назви для елементів керування QtQuick, зокрема «QQC» або «QQC2». У цьому підручнику ми використовуватимемо термін «Controls».

source: We then come to our base element, [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), which provides some basic features needed for all Kirigami applications. This is the window that will contain each of our pages, the main sections of our UI.
ca: Després arribem al nostre element base, la [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), que proporciona algunes característiques bàsiques necessàries per a totes les aplicacions escrites amb el Kirigami. Aquesta és la finestra que contindrà cadascuna de les nostres pàgines, les seccions principals de la nostra interfície d'usuari.

source: We then set the window's `id` property to "root". IDs are useful because they let us uniquely reference a component, even if we have several of the same type.
ca: Després, establim la propietat `id` de la finestra a "root". Els ID són útils perquè ens permeten fer referència de forma única a un component, fins i tot si en tenim diversos del mateix tipus.
eo: Ni tiam starigas la `id`-proprecon de la fenestro al "radiko". ID-oj estas utilaj ĉar ili lasas nin unike referenci komponenton, eĉ se ni havas plurajn de la sama tipo.
nl: Daarna zetten we de eigenschap `id` van het venster op 'root'. ID's zijn nuttig omdat ze ons uniek verwijzen naar een component, zelfs als we er verschillende hebben van hetzelfde type.
pt: Iremos então configurar a propriedade `id` da janela como 'root'. Os ID's são úteis porque nos ajudam a referenciar um componente de forma unívoca, mesmo que tenhamos vários do mesmo tipo.
sl: Nato določimo lastnost okna določilnik 'id' na 'root'. Določilniki so uporabni, ker nam dovolijo edinstveno sklicevanje na komponento, tudi če jih imamo več iste vrste.
sv: Vi ställer sedan in fönstrets egenskap `id` till 'root'. Identifierare är användbara eftersom de låter oss referera till en komponent unikt, även om vi har flera av samma typ.
uk: Далі, ми встановимо для властивості `id` вікна значення 'root'. Ідентифікатори є корисними, оскільки за їх допомогою ми отримуємо унікальну прив'язку до компонента, навіть коли у нас є декілька компонентів одного типу.

source: We also set the window [title](https://doc.qt.io/qt-6/qml-qtquick-window.html#title-prop) property to "Hello World". You'll notice that we have wrapped our "Hello World" string in a function called `i18nc()`, where we detail the context of the string as well as the string itself.
ca: També establirem la propietat [title](https://doc.qt.io/qt-6/qml-qtquick-window.html#title-prop) de la finestra a "Hello World". Us adonareu que hem embolcallat la nostra cadena "Hello World" amb una funció amb la crida `i18nc()`, on detallem el context de la cadena, així com la cadena en si.

source: [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) functions make your app more easily translatable, as they return a version of the provided string in the user's language (as long as your app has been localised for that language). While an English user might see our window title as "Hello World", a Spanish user would see "Hola Mundo".
ca: Les funcions [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) fan que la vostra aplicació sigui traduïble amb més facilitat, ja que retornen una versió de la cadena proporcionada en l'idioma de l'usuari (sempre que l'aplicació estigui localitzada per a aquest idioma). Mentre que un usuari anglès pot veure el títol de la finestra com «Hello World», un usuari català veurà «Hola món».
eo: [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) funkcioj igas vian apon pli facile tradukebla, ĉar ili resendas version de la provizita ĉeno en la lingvo de la uzanto ( kondiĉe ke via aplikaĵo estas lokalizita por tiu lingvo). Dum angla uzanto eble vidos nian fenestrotitolon kiel "Saluton Mondo", hispana uzanto vidos "Hola Mundo".
es: Las funciones [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) hacen que nuestra aplicación sea más fácil de traducir, ya que devuelven una versión de la cadena proporcionada en el idioma del usuario (si la aplicación ha sido traducida a dicho idioma). Si un usuario inglés vería el título de nuestra ventana como «Hello World», un usuario español vería «Hola, mundo».
nl: [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) functies maken uw toepassing gemakkelijker te vertalen, omdat ze een versie van de geleverde tekenreeks leveren in de taal van de gebruiker (voor zover uw toepassing gelokaliseerd is voor die taal). Terwijl een Engelse gebruiker onze venstertitel als "Hello World" zal zien, zou een Nederlandse gebruiker "Hallo wereld" te zien krijgen.
pt: As funções [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) tornam a sua aplicação mais fácil de ser traduzida, dado que devolvem uma versão do texto indicado na língua do utilizador (desde que a sua aplicação tenha sido traduzida para essa língua). Enquanto um utilizador inglês poderá ver o nosso título da janela como "Hello World", um utilizador português iria ver "Olá Mundo".
sl: Funkcije [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) naredijo vašo aplikacijo lažje prevedljivo, saj vrnejo različico zagotovljenega niza v jeziku uporabnika (če je bila aplikacija lokalizirana za ta jezik). Medtem ko bi angleški uporabnik lahko naš naslov okna videl kot "Hello World", bi španski uporabnik videl "Hola Mundo".
sv: [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n())-funktioner gör programmet lättare att översätta, eftersom de returnerar en version av den tillhandahållna strängen på användarens språk (under förutsättning att vårt program har översatts till det språket). Även om en engelskspråkig användare ser vår fönstertitel som 'Hello World', skulle en spansk användare kunna se "Hola Mundo".
uk: Функції [i18n()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n()) роблять вашу програму придатною до перекладу, оскільки вони повертають версію переданого їм рядка мовою користувача (якщо вашу програму перекладено відповідною мовою). Користувач із англійською мовою інтерфейсу бачитиме заголовок вікна «Hello World», а користувач із іспанською мовою інтерфейсу — «Hola Mundo».

source: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) builds on the `i18n()` function by allowing developers to provide some context to translators working on the app. Here we clarify that the UI component is the title of the application window, so we have included the string "@title:window" before "Hello World". See the [Ki18n Programmer's guide](https://invent.kde.org/frameworks/ki18n/-/blob/master/docs/programmers-guide.md#writing-good-contexts) for more details.
ca: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) construeix la funció `i18n()` que permet als desenvolupadors proporcionar un context als equips de traducció que treballen en l'aplicació. És per això que hem inclòs la cadena "@title:window" abans de "Hello World". Vegeu la [Guia del programador Ki18n](https://invent.kde.org/frameworks/ki18n/-/blob/master/docs/programmers-guide.md#writing-good-contexts) per a més detalls.

source: We then set the first page of our page stack. Most Kirigami applications are organised as a stack of pages, each page containing related components suited to a specific task. For now, we are keeping it simple, and sticking to a single page. [pageStack](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) is an initially empty stack of pages provided by [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), and with `pageStack.initialPage: Kirigami.Page {...}` we set the first page presented upon loading the application to a [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). This page will contain all our content.
ca: Després establirem la primera pàgina de la nostra pila de pàgines. La majoria de les aplicacions escrites amb el Kirigami estan organitzades com una pila de pàgines, cada pàgina conté els components relacionats adequats per a una tasca específica. Per ara, el mantenim senzill i ens cenyim a una sola pàgina. [pageStack](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) és una pila inicialment buida de pàgines proporcionades per [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), i amb `pageStack.initialPage: Kirigami.Page {...}` establim la primera pàgina presentada en carregar l'aplicació a una [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Aquesta pàgina contindrà tot el nostre contingut.

source: Finally, we include in our page a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) that lets us place text on our page. We use `anchors.centerIn: parent` to center our label horizontally and vertically within our parent element. In this case, the parent component of our label is [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). The last thing we need to do is set its text: `text: i18n("Hello World!")`.
ca: Finalment, incloem en la nostra pàgina un [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) que ens permetrà inserir text a la nostra pàgina. Utilitzarem `anchors.centerIn: parent` per a centrar la nostra etiqueta horitzontalment i verticalment dins de l'element pare. En aquest cas, el component principal de la nostra etiqueta és [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). L'últim que hem de fer és configurar el text: `text: i18n("Hello World!")`.

source: The primary purpose of [Desktop Entry files](https://specifications.freedesktop.org/desktop-entry-spec) is to show your app on the application launcher on Linux. Another reason to have them is to have window icons on Wayland, as they are required to tell the compositor "this window goes with this icon".
ca: El propòsit principal dels [fitxers Desktop Entry](https://specifications.freedesktop.org/desktop-entry-spec/) és mostrar la vostra aplicació al llançador d'aplicacions en el Linux. Una altra raó per a tenir-los és tenir icones de finestra al Wayland, ja que es requereixen per a dir al compositor «aquesta finestra va amb aquesta icona».

source: It must follow a [reverse-DNS naming scheme](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) followed by the `.desktop` extension such as `org.kde.tutorial.desktop`:
ca: Ha de seguir un [esquema de noms DNS invers](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) seguit de l'extensió `.desktop` com ara `org.kde.tutorial.desktop`:
eo: Ĝi devas sekvi [reverse-DNS-nomskemon](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) sekvita de la etendaĵo `.desktop` kiel ekzemple `org.kde.tutorial.desktop`:
nl: Het moet een [reverse-DNS naam-schema](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) volgen gevolgd door de `.desktop` extensie zoals `org.kde.tutorial.desktop`:
sl: Slediti mora [shemi poimenovanja povratnega DNS](https://en.wikipedia.org/wiki/Reverse_domain_name_notation), ki ji sledi končnica `.desktop`, kot je `org.kde.tutorial.desktop`:
sv: Det måste följa ett [omvänt domännamnsschema](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) följt av tillägget `.desktop` såsom `org.kde.tutorial.desktop`:
uk: Має виконуватися [схема іменування зворотного DNS](https://en.wikipedia.org/wiki/Reverse_domain_name_notation) з наступним суфіксом назви `.desktop`, наприклад `org.kde.tutorial.desktop`:

source: Window and taskbar icons will work in a Wayland session only if apps' desktop files are placed in `~/.local/share/applications` or `/usr/share/applications`. To get icons working in this tutorial, either copy the app's desktop file there or switch to a development session as instructed in [kde-builder tutorial](/docs/getting-started/building/kde-builder-compile). Some KDE applications might have working icons if they were already installed on the system.
ca: Les icones de les finestres i de la barra de tasques només funcionaran en una sessió del Wayland si els fitxers «desktop» de les aplicacions es col·loquen a `~/.local/share/applications` o `/usr/share/applications`. Per a aconseguir icones que funcionin en aquesta guia d'aprenentatge, copieu el fitxer «desktop» de l'aplicació o canvieu a una sessió de desenvolupament com s'indica en la [guia d'aprenentatge del «kde-builder»](/docs/getting-started/building/kde-builder-compile). Algunes aplicacions de KDE podrien tenir icones funcionant si ja estaven instal·lades al sistema.
nl: Venster- en werkbalkpictogrammen zullen in een Wayland sessie alleen werken als bureaublad bestanden van toepassingen geplaatst zijn in `~/.local/share/applications` of `/usr/share/applications`. Om pictogrammen in deze handleiding werkend te krijgen, ofwel kopieer het desktop-bestand van de toepassing daar of schakel om naar een ontwikkelsessie zoals geïnstrueerd in [inleiding van kde-builder](/docs/getting-started/building/kde-builder-compile). Sommige KDE toepassingen zouden werkende pictogrammen kunnen hebben als ze al zijn geïnstalleerd in het systeem.
sl: Ikone oken in opravilne vrstice bodo delovale v seji Wayland le, če so namizne datoteke aplikacij nameščene v `~/.local/share/applications` ali `/usr/share/applications`. Če želite, da bodo ikone delovale v tem učbeniku, bodisi kopirajte datoteko namizja aplikacije tja ali preklopite na razvojno sejo, kot je opisano v [učbeniku za kde-builder - kde-builder tutorial(/docs/getting-started/building/kde-builder-compile). Nekatere aplikacije KDE imajo morda delujoče ikone, če so že nameščene v sistemu.
uk: Піктограми вікна та панелі завдань працюватимуть у сеансі Wayland, лише якщо файл desktop програми зберігаються у `~/.local/share/applications` або `/usr/share/applications`. Щоб працювали піктограми з цього розділу підручника, або скопіюйте файл desktop до одного з цих каталогів, або перемкніться на сеанс розробника, як описано у [підручнику з kde-builder](/docs/getting-started/building/kde-builder-compile). Піктограми деяких програм KDE працюватимуть, якщо їх вже встановлено у системі.
