Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: As shown from the [previous tutorial](/docs/getting-started/kirigami/advanced-connect_backend/), you can connect C++ code to QML by creating a class that will be treated as just another component in QML. However, you may want to represent more complicated data, such as data that needs to act as a custom [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) or in some way needs to be delegated from a [Repeater](docs:qtquick;qml-qtquick-repeater.html).
eo: Kiel montrite de la [antaŭa lernilo](/docs/getting-started/kirigami/advanced-connect_backend/), vi povas konekti C++-kodon al QML kreante klason, kiu estos traktata kiel nur alia komponanto en QML. Tamen, vi eble volas reprezenti pli komplikajn datumojn, kiel datumojn, kiuj devas funkcii kiel propra [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) aŭ iel devas esti delegitaj de [ Ripetilo](docs:qtquick;qml-qtquick-repeater.html).
es: Como se muestra en el [tutorial anterior](/docs/getting-started/kirigami/advanced-connect_backend/), se puede conectar código C++ con QML creando una clase que se tratará como otro componente en QML. No obstante, es posible que quiera representar datos más complicados, como datos que deben actuar como un [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) personalizado o que, de alguna manera, se deben delegar de un [Repeater](docs:qtquick;qml-qtquick-repeater.html).
nl: Zoals getoond in de [vorige inleiding](/docs/getting-started/kirigami/advanced-connect_backend/), kunt u C++ code verbinden met QML door een klasse aan te maken die behandeld zal worden als nog een component in QML. U zou echter meer gecompliceerde gegevens willen representeren, zoals gegevens die moeten acteren als een klant [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) of op de een of andere manier gedelegeerd moeten worden uit een [Repeater](docs:qtquick;qml-qtquick-repeater.html).
sl: Kot je prikazano v [prejšnjem učbeniku](/docs/getting-started/kirigami/advanced-connect_backend/), lahko kodo C++ povežete s QML tako, da ustvarite arazred, ki bo obravnavan kot le še ena komponenta v QML. Vendar pa morda želite predstaviti bolj zapletene podatke, kot so podatki, ki morajo delovati kot [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) ali jih je potrebno nek način je treba delegirati iz [Repeater](docs:qtquick;qml-qtquick-repetitor.html).
sv: Som framgår av [föregående handledning](/docs/getting-started/kirigami/advanced-connect_backend/), kan C++-kod anslutas till QML genom att skapa en klass som behandlas som bara en annan komponent i QML. Däremot kanske man vill representera mer komplicerad data, till exempel data som måste fungera som en anpassad [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html) eller på något sätt måste delegeras från en [ Repeater](docs:qtquick;qml-qtquick-repeater.html).
uk: Як показано у [попередньому розділі підручника](/docs/getting-started/kirigami/advanced-connect_backend/), ви можете з'єднати код мовою C++ із кодом QML шляхом створення класу, який буде оброблено як ще один компонент у QML. Втім, може виникнути потреба у представленні складніших даних, зокрема даних, які мають працювати як нетипова [ListModel](docs:qtquick;qml-qtqml-models-listmodel.html), або даних, які має бути делеговано з [Repeater](docs:qtquick;qml-qtquick-repeater.html).

source: In this tutorial, we will create a class that contains a QMap, where a QString is used as a key and QStringList objects are used as values. The frontend will be able to read and display the keys and values and be simple to use just like a one-dimensional array. It should look similar to a QML ListModel.
eo: En ĉi tiu lernilo, ni kreos klason, kiu enhavas QMap, kie QString estas uzata kiel ŝlosilo kaj QStringList-objektoj estas uzataj kiel valoroj. La fasado povos legi kaj montri la ŝlosilojn kaj valorojn kaj esti simpla uzebla same kiel unudimensia tabelo. Ĝi devus aspekti simila al QML ListModel.
es: En este tutorial crearemos una clase que contiene un QMap, donde se usa un QString como clave y objetos QStringList como valores. La interfaz será capaz de leer y mostrar las claves y los valores, y será tan fácil de usar como una matriz de una dimensión. Debería parecerse a un ListModel de QML.
nl: In deze inleiding zullen we een klasse aanmaken die een QMap bevat, waar een QString wordt gebruikt als een sleutel en QStringList objecten gebruikt worden als waarden. De frontend zal in staat zijn de sleutels en de waarden te lezen en te tonen en eenvoudig te gebruiken net als een een-dimensionaal array. Het zou er uit moeten zien als een QML-ListModel.
sl: V tem učbeniku bomo ustvarili razred, ki vsebuje QMap, kjer se QString uporablja kot ključ, objekti QStringList pa kot vrednosti. Začelje bo lahko prebralo in prikazalo ključe in vrednosti ter bo preprosto za uporabo kot enodimenzionalni niz. Videti mora biti podobno kot QMLListModel.
sv: I den här handledningen skapar vi en klass som innehåller en QMap, där en QString används som nyckel och ett QStringList-objekt används som värde. Gränssnittet kan läsa och visa nycklar och värden och vara enkelt att använda precis som ett endimensionellt fält. Det liknar en ListModel i QML.
uk: У цих настановах ми створимо клас, який містить QMap, де як ключ буде використано QString, а як значення буде використано об'єкти QStringList. Оболонка зможе читати і показувати ключі і значення і буде простою у використанні, зовсім як одновимірний масив. Усе це має виглядати подібним до ListModel у QML.

source: To do this, we need to declare a class that inherits from [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Let's also add in some add data to the QMap. These declarations will be located in `model.h`.
eo: Por fari tion, ni devas deklari klason, kiu heredas de [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Ni ankaŭ aldonu kelkajn aldonajn datumojn al la QMap. Ĉi tiuj deklaroj troviĝos en `model.h`.
es: Para ello, necesitamos declarar una clase que herede de [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). También añadiremos datos al QMap. Estas declaraciones estarán en `model.h`.
nl: Om dit te doen moeten we een klasse declareren die erft van [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Laten we ook enige toegevoegde gegevens invoegen in de QMap. Deze declaraties zullen gelokaliseerd zijn in `model.h`.
sl: Da bi to naredili, moramo deklarirati razred, ki deduje od[QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Dodajmo še nekatere dodatne podatke v QMap. Te deklaracije se bodo nahajale v `model.h`.
sv: För att göra det måste vi deklarera en klass som ärver från [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Låt oss också lägga till lite data i vår QMap. Deklarationerna finnas i `model.h`.
uk: Для цього нам потрібно оголосити клас, який успадковує властивості від [QAbstractListModel](docs:qtcore;qabstractlistmodel.html). Давайте також додамо якісь дані до QMap. Ці оголошення будуть зберігатися у `model.h`.

source: If you are following along, please remember to update your `CMakeLists.txt` file!
eo: Se vi sekvas, bonvolu memori ĝisdatigi vian `CMakeLists.txt` dosieron!
es: Si está siguiendo las instrucciones, recuerde actualizar su archivo `CMakeLists.txt`.
nl: Als u dit volgt, onthoud om uw bestand `CMakeLists.txt` bij te werken!
sl: Če sledite, ne pozabite posodobiti svoje datoteke `CMakeLists.txt`!
sv: Om du följer med, kom ihåg att uppdatera filen `CMakeLists.txt`.
uk: Якщо ви послідовно виконуєте наші настанови, будь ласка, не забудьте оновити ваш файл `CMakeLists.txt`!

source: Of course, we can't just display this class as is. We also need to tell QML on how to represent this data in the class. We can do this by overriding three virtual functions that are essential at doing this, all of which do their own tasks.
eo: Kompreneble, ni ne povas simple montri ĉi tiun klason kiel estas. Ni ankaŭ devas diri al QML pri kiel reprezenti ĉi tiujn datumojn en la klaso. Ni povas fari tion per superregado de tri virtualaj funkcioj, kiuj estas esencaj por fari ĉi tion, kiuj ĉiuj faras siajn proprajn taskojn.
es: Por supuesto, no podemos mostrar esta clase como está. También necesitamos decirle a QML cómo se representan estos datos en la clase. Podemos hacerlo sobrescribiendo tres funciones virtuales que son esenciales para ello, cada una de las cuales realiza su propia tarea.
nl: Natuurlijk kunnen we deze klasse niet gewoon tonen zoals deze is. We moeten aan QML ook vertellen hoe deze gegevens in de klasse te representeren. We kunnen dit doen door drie virtuele functies te overschrijven die essentieel zijn om dit te doen, allen zullen hun eigen taken doen.
sl: Seveda tega razreda ne moremo prikazati takšnega, kot je. Povedati moramo tudi QML o tem, kako te podatke predstaviti v razredu. To lahko storimo s preglasitvijo treh virtualnih funkcij, ki so bistvenega pomena za to, in za vse svoje naloge.
sv: Naturligtvis kan vi inte bara visa klassen som den är. Vi måste också tala om för QML hur man representerar data i klassen. Vi kan göra det genom att överskrida tre virtuella funktioner som är viktiga för att göra det, vilka alla har sina egna uppgifter.
uk: Звичайно ж, ми не можемо показати цей клас без обробки. Нам також слід повідомити QML про те, як представити ці дані у класі. Зробити це можна перевизначенням трьох віртуальних функцій, які є критичними для нашого завдання, і кожна з яких виконує власні завдання.

source: `rowCount()` - Think of this function as a way to tell QML how many items are in the model to represent.
eo: `rowCount()` - Pensu pri ĉi tiu funkcio kiel maniero diri al QML kiom da eroj estas en la modelo por reprezenti.
es: `rowCount()`: Piense en esta función como un modo de decirle a QML cuántos elementos hay en el modelo que se va a representar.
nl: `rowCount()` - denk aan deze functie als een manier om QML te vertellen hoeveel items er in het model zijn om te representeren.
sl: `rowCount()` – Zamislite si to funkcijo kot način, kako QML povedati, koliko elementovje v modelu, ki ga predstavljajo.
sv: `rowCount()`: Se den här funktionen som ett sätt att tala om för QML hur många objekt som ska representeras i modellen.
uk: `rowCount()` — цю функцію можна уявляти як спосіб повідомити QML про те, скільки записів представляє модель.

source: `roleNames()` - You can think of role names as property names attached to data in QML. This function allows you to create those roles.
eo: `roleNames()` - Vi povas pensi pri rolnomoj kiel proprecnomoj ligitaj al datumoj en QML. Ĉi tiu funkcio permesas krei tiujn rolojn.
es: `roleNames()`: Se puede decir que los nombres de los roles son nombres de propiedades adjuntados a los datos en QML. Esta función le permite crear dichos roles.
nl: `roleNames()` - u kunt denken aan rolnamen als eigenschapnamen gekoppeld aan gegevens in QML. Deze functie biedt u het aanmaken van die rollen.
sl: `roleNames()` – Imena vlog si lahko predstavljate kot imena lastnosti, priloženapodatkom v QML. Ta funkcija vam omogoča ustvarjanje teh vlog.
sv: `roleNames()`: Du kan tänka på rollnamn som egenskapsnamn kopplade till data i QML. Funktionen låter dig skapa dessa roller.
uk: `roleNames()` — назви ролей можна уявляти як назви властивостей, які пов'язано із даними у QML. За допомогою цієї функції можна створювати такі ролі.

source: `data()` - This function is called when you want to retrieve the data that corresponds to the role names from the model.
eo: `data()` - Ĉi tiu funkcio estas vokita kiam vi volas preni la datumojn kiuj respondas al la rolnomoj de la modelo.
es: `data()`: Esta función se llama cuando necesite obtener los datos que corresponden a los nombres de roles del modelo.
nl: `data()` - deze functie wordt aangeroepen wanneer u de gegevens, die corresponderen met de rolnamen uit het model, wilt ophalen.
sl: `data()` – Ta funkcija se pokliče, ko želite pridobiti podatke, ki ustrezajo imenom vlog iz modela.
sv: `data()`: Funktionen anropas när man vill hämta data som motsvarar rollnamnen från modellen.
uk: `data()` — цю функцію буде викликано, коли ви захочете отримати дані, які відповідають назвам ролей з моделі.

source: Let's override the function in the header file. The `rowCount()` comes with its own parameter, but will not be used in this example and is excluded.
eo: Ni superregu la funkcion en la kapdosiero. La `rowCount()` venas kun sia propra parametro, sed ne estos uzata en ĉi tiu ekzemplo kaj estas ekskludita.
es: Sobrescribamos la función en el archivo de cabecera. `rowCount()` viene con su propio parámetro, pero no se usará en este ejemplo, por lo que se excluye.
nl: Laten we de functie in het kopbestand overschrijven. De `rowCount()` komt met zijn eigen parameter, maar zal niet gebruikt worden in dit voorbeeld en wordt uitgesloten.
sl: Preglasimo funkcijo v datoteki glave. Funkciji `rowCount()` je priloženlasten parameter, vendar v tem primeru ne bo uporabljen in je izključen.
sv: Låt oss överskrida funktionen i deklarationsfilen. `rowCount()` har sin egen parameter, men användas inte i det här exemplet och exkluderas.
uk: Давайте перевизначимо функцію у файлів заголовків. `rowCount()` має власний параметр, але його не буде використано у цьому прикладі, і його буде виключено.

source: Then, let's declare how many rows are in this model in `model.cpp`.
eo: Tiam, ni deklaru kiom da vicoj estas en ĉi tiu modelo en `model.cpp`.
es: A continuación declaramos cuántas filas hay en este modelo en `model.cpp`.
nl: Laten we daarna declareren hoeveel rijen er in dit model in `model.cpp` zijn.
sl: Nato deklarirajmo, koliko vrstic je v tem modelu v `model.cpp`.
sv: Låt oss därefter deklarera hur många rader som finns i modellen i `model.cpp`.
uk: Тепер, давайте оголосимо, скільки рядків буде у цій моделі у `model.cpp`.

source: Before we override `roleNames()`, we need to declare what the roles are in the C++ side using an public `enum` variable. The reason for this is because these values from the `enum` variable are passed into `data()` every time QML accesses a corresponding role, and as such we can make `data()` return what we want.
eo: Antaŭ ol ni superregas `roleNames()`, ni devas deklari kiajn rolojn estas en la C++-flanko uzante publikan `enum` variablon. La kialo de tio estas ĉar ĉi tiuj valoroj de la variablo `enum` estas transdonitaj en `data()` ĉiufoje kiam QML aliras respondan rolon, kaj kiel tia ni povas fari `data()` redoni kion ni volas.
es: Antes de sobrescribir `roleNames()`, necesitamos declarar que los roles están en el lado C++ usando una variable `enum` pública. El motivo para ello es que dichos valores de la variable `enum` se pasan a `data()` cada vez que QML accede a un determinado rol y, como tal, podemos hacer que `data()` devuelva lo que queremos.
nl: Voordat we `roleNames()` overschrijven, moeten we declareren wat de rollen zijn aan de C++ kan met gebruik van een publieke `enum` variabele. De reden hiervoor is omdat deze waarden uit de variabele `enum` doorgegeven worden in `data()` elke keer dat QML toegang pakt tot een bijbehorende rol en als zodanig kunnen we `data()` terug laten geven wat we willen.
sl: Preden preglasimo `roleNames()`, moramo deklarirati, v čem so vloge strani C++ z uporabo javne spremenljivke `enum`. Razlog za to je, ker se te vrednosti iz spremenljivke `enum` vsakič posredujejo v `data()` kadar QML dostopa do ustrezne vloge in tako lahko vrnemo prek `data()` kar želimo.
sv: Innan vi överskrider `roleNames()` måste vi deklarera vad rollerna är på C++ sidan med hjälp av en öppen `enum`. Anledningen till det är att värdena från variabeln `enum` skickas till `data()` varje gång QML hämtar en motsvarande roll, och på så sätt kan vi få `data()` att returnera vad vi vill.
uk: До того, як ми перевизначимо `roleNames()`, нами потрібно оголосити ролі на боці C++ за допомогою відкритої змінної `enum`. Причиною цього є те, що ці значення зі змінної `enum` буде передано до `data()` під час кожного доступу QML до відповідної ролі, а тому ми можемо зробити так, що `data()` повертала потрібні нам дані.

source: Let's begin with creating the `enum` variable for roles, where each value is a role for the C++ side.
eo: Ni komencu kreante la variablon `enum` por roloj, kie ĉiu valoro estas rolo por la C++-flanko.
es: Empecemos creando la variable `enum` para los roles, donde cada valor es un rol para el lado C++.
nl: Laten we beginnen met de variabele `enum` voor rollen aan te maken, waar elke waarde is een rol is voor de C++ kant.
sl: Začnimo z ustvarjanjem spremenljivke `enum` za vloge, kjer je vsaka vrednost vloga za stran C++.
sv: Låt oss börja med att skapa variabeln `enum` för roller, där varje värde är en roll för C++ sidan.
uk: Почнімо зі створення змінної `enum` для ролей, де кожне значення буде роллю на боці C++.

source: Once we have that settled, we can finally create what these roles are in the QML side using a [QHash](docs:qtcore;qhash.html) where the keys are the enumerated values paired with [QByteArrays](docs:qtcore;qbytearray.html). The text in the QByteArray is what's used in the actual QML code.
eo: Post kiam ni havas tion aranĝita, ni povas finfine krei kiajn ĉi tiujn rolojn estas en la QML-flanko uzante [QHash](docs:qtcore;qhash.html) kie la ŝlosiloj estas la listigitaj valoroj parigitaj kun [QByteArrays](docs:qtcore;qbytearray). .html). La teksto en la QByteArray estas tio, kio estas uzata en la reala QML-kodo.
es: Una vez que tengamos esto resuelto, podremos crear lo que son dichos roles en el lado QML usando un [QHash](docs:qtcore;qhash.html) donde las claves son los valores de enumeración emparejados con [QByteArrays](docs:qtcore;qbytearray.html). El texto del QByteArray es lo que se usa en el código QML real.
nl: Nadat we dat hebben vastgesteld kunnen we tenslotte aanmaken wat deze rollen zijn aan de kant an QML met een [QHash](docs:qtcore;qhash.html) waar de sleutels de enumerated waarden zijn gepaard met [QByteArrays](docs:qtcore;qbytearray.html). De tekst in de QByteArray is wat wordt gebruikt in de actuele QML code.
sl: Ko bomo to uredili, lahko končno ustvarimo, v čem so te vloge strani QML z uporabo [QHash](docs:qtcore;qhash.html), kjer so ključi oštevilčene vrednosti v paru z [QByteArrays](docs:qtcore;qbytearray.html). Besedilo v QByteArray je tisto, kar se uporablja v dejanski kodi QML.
sv: När vi väl har löst det kan vi äntligen skapa vad rollerna är på QML-sidan med hjälp av [QHash](docs:qtcore;qhash.html) där nycklarna är uppräkningsvärdena parade med [QByteArrays](docs:qtcore;qbytearray .html). Texten i QByteArray är vad som används i den faktiska QML-koden.
uk: Щойно код буде написано, ми нарешті можемо визначити ці ролі на боці QML за допомогою [QHash](docs:qtcore;qhash.html), де ключі будуть нумерованими значеннями, які буде пов'язано із [QByteArrays](docs:qtcore;qbytearray.html). Текстом у QByteArray буде те, що буде використано у самому коді QML.

source: There are two parameters that are passed in `data()`: `index` and `role`. `index` is the location of where the data is when being delegated. As previously stated, `role` is used by QML to get specific data returned when it's accessing a role.
eo: Estas du parametroj kiuj estas pasigitaj en `data()`: `indekso` kaj `rolo`. `indekso` estas la loko de kie la datumoj estas delegitaj. Kiel antaŭe dirite, "rolo" estas uzata de QML por ricevi specifajn datumojn resenditajn kiam ĝi aliras rolon.
es: Existen dos parámetros que se pasan en `data()`: `index` y `role`. `index` es la posición donde están los datos cuando se delegan. Como se ha dicho anteriormente, QML usa `role` para devolver datos específicos cuando accede a un rol.
nl: Er zijn twee parameters die doorgegeven worden in `data()`: `index` en `role`. `index` is de locatie waar de gegevens zijn wanneer ze gedelegeerd worden. Zoals eerder gesteld, `role` wordt gebruikt door QML om specifieke gegevens terug te krijgen wanneer er toegang toe wordt gevraagd als rol.
sl: V `data()` sta posredovana dva parametra: `index` in `role`. `indeks` je lokacija, kjer so podatki, ko so delegirani. Kot kot je bilo že navedeno, QML uporablja `role - vlogo` za vrnitev določenih podatkov, kodostopa do vloge.
sv: Det finns två parametrar som skickas med `data()`: `index` och `role`. "index" är platsen där data finns vid delegering. Som tidigare nämnts används `role` av QML för att få specifik data returnerad när en roll används.
uk: У `data()` передаються два параметри: `index` і `role`. `index` — місце, де перебувають дані, коли їх делеговано. Як ми вже зазначали, `role` використовується у QML для отримання специфічних даних, які програма повертає, коли відбувається доступ до ролі.
