Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Next we specify the spacing between the rows and columns within our grid, so that our components don't bunch up. Kirigami provides a number of handy [predefined units](docs:kirigami2;Kirigami::Platform::Units) to use for this purpose:
eo: Poste ni specifas la interspacon inter la vicoj kaj kolumnoj ene de nia krado, por ke niaj komponantoj ne amasiĝas. Kirigami disponigas kelkajn oportunajn [antaŭdifinitajn unuojn](docs:kirigami2;Kirigami::Platform::Units) por uzi ĉi-cele:
nl: Vervolgens specificeren we de ruimte tussen de rijen en kolommen in ons raster, zodat onze componenten niet opeenstapelen. Kirigami biedt een aantal handige [voorgedefinieerde eenheden](docs:kirigami2;Kirigami::Platform::Units) om voor dit doel te gebruiken:
sv: Därefter anger vi mellanrummet mellan raderna och kolumnerna i vårt rutnät, så att våra komponenter inte trycks ihop. Kirigami tillhandahåller ett antal praktiska [fördefinierade enheter](docs:kirigami2;Kirigami::Platform::Units) att använda i detta syfte:
uk: Далі, ми вказали інтервал між рядками і стовпчиками у нашій таблиці, щоб наші компоненти не накладалися один на одного. У Kirigami передбачено декілька зручних [попередньо визначених одиниць](docs:kirigami2;Kirigami::Platform::Units) для використання з цією метою:

source: smallSpacing
eo: malgranda interspaco
fr: Petit espacement

source: largeSpacing
eo: granda interspaco
fr: Espacement large

source: As you might remember, `root` is the id of our [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). It provides the [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen) property, used to determine whether the current device screen is a widescreen (i.e. a computer monitor or a phone in landscape). We use a [ternary conditional](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) here to vary the number of columns in our grid depending on the screen we are using: if it's a widescreen, the grid will have 4 columns, else it will have 2.
eo: Kiel vi eble memoras, `radiko` estas la identigilo de nia [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Ĝi disponigas la [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen) proprecon, uzatan por determini ĉu la nuna aparatekrano estas larĝekrano (t.e. komputila ekrano aŭ telefono en pejzaĝo). Ni uzas [ternaran kondiĉon](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) ĉi tie por variigi la nombron da kolumnoj en nia krado depende de la ekrano, kiun ni estas. uzante: se ĝi estas larĝa ekrano, la krado havos 4 kolumnojn, alie ĝi havos 2.
nl: Zoals u zich misschien herinnert, `root` is de id van onze [KirigamipplicationWindow](docs:kirigami2;ApplicationWindow). Het levert de eigenschap [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen), gebruikt om te bepalen of het huidige apparaatscherm een breed scherm is (d.w.z. een computermonitor of een telefoon in landschap). We gebruiken hier een [drievoudige voorwaarde](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) om het aantal kolommen in ons raster te variëren afhankelijk van het scherm dat we gebruiken: als het een breed scherm is, zal het raster 4 kolommen hebben, anders zal het er 2 hebben.
sv: Som du kanske minns är `root` identifieraren för vårt [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Den tillhandahåller egenskapen [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen), som används för att avgöra om den aktuella enhetens skärm är en bred skärm (dvs. en datorskärm eller en telefon med liggande orientering). Vi använder ett [ternärt villkor](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) här för att variera antalet kolumner i vårt rutnät beroende på vilken skärm vi använder: om det är en bred skärm har rutnätet fyra kolumner, annars har det två.
uk: Як ви можливо пам'ятаєте, `root` є ідентифікатором нашого [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Він надає властивість [wideScreen](docs:kirigami2;AbstractApplicationWindow::wideScreen), яку використовують для визначення того, чи є поточний екран пристрою широкоформатним (тобто монітором комп'ютера або екраном телефону в альбомному режимі). Тут ми використовуємо [тернарну умову](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Conditional_operator) для зміни кількості стовпчиків у нашій таблиці залежно від використаного екрана: якщо він є широкоформатним, у таблиці буде 4 стовпчики, інакше їх буде 2.

source: Left, [Kirigami.Heading](docs:kirigami2;Heading): uses the `ListElement`'s `date` as a level 1 heading.
eo: Maldekstre, [Kirigami.Titolo](docs:kirigami2;Titolo): uzas la `daton' de `ListElement` kiel 1-nivelan titolon.
nl: Links, [Kirigami.Heading](docs:kirigami2;Heading): gebruikt de `date` van `ListElement` als een niveau 1 kop.
pt: À esquerda, o Kirigami.Heading](docs:kirigami2;Heading): usa o `date` do `ListElement` como cabeçalho de nível 1.
sv: Vänster, [Kirigami.Heading](docs:kirigami2;Heading): använder `date` i `ListElement` som första nivåns rubrik.
uk: Ліворуч, [Kirigami.Heading](docs:kirigami2;Heading): використовує `date` з `ListElement` як заголовок першого рівня.

source: Middle, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): has a [Kirigami.Heading](docs:kirigami2;Heading) that displays the task name; a [Kirigami.Separator](docs:kirigami2;Separator), which provides the horizontal line; and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), that displays a task's optional description. The latter two components have a [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop) property, which checks if the description is empty or not and displays the components depending on the result of `description.length > 0`.
eo: Meze, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): havas [Kirigami.Heading](docs:kirigami2;Heading) kiu montras la taskonomon ; a [Kirigami.Separator](docs:kirigami2;Separator), kiu provizas la horizontalan linion; kaj [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), kiu montras la laŭvolan priskribon de tasko. La lastaj du komponantoj havas [videblan](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop) proprecon, kiu kontrolas ĉu la priskribo estas malplena aŭ ne kaj montras la komponantoj depende de la rezulto de `priskribo.length > 0`.
nl: Midden, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): heeft een [Kirigami.Heading](docs:kirigami2;Heading) die de taaknaam toont; een [Kirigami.Separator](docs:kirigami2;Separator), die de horizontale lijn levert; en een [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), die een optionele beschrijving van de taak toont. De laatste twee componenten hebben een eigenschap [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop), die controleert of de beschrijving leeg is of niet en de componenten toont afhankelijk van het resultaat van `description.length > 0`.
pt: Ao centro, o [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): tem um [Kirigami.Heading](docs:kirigami2;Heading) que mostra o nome da tarefa; um [Kirigami.Separator](docs:kirigami2;Separator), que fornece a linha horizontal, e um [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), que mostra uma descrição opcional para a tarefa. Os dois últimos componentes têm uma propriedade [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop), que verifica se a descrição está vazia ou não e que mostra os componentes, dependendo do resultado de `description.length > 0`.
sv: Mitten, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): Har en [Kirigami.Heading](docs:kirigami2;Heading) som visar aktivitetsnamnet, en [Kirigami.Separator](docs:kirigami2;Separator) som tillhandahåller den horisontella linjen, och en [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) som visar en uppgifts valfria beskrivning. De senare två komponenterna har egenskapen [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop) som kontrollerar om beskrivningen är tom eller inte och visar komponenten beroende på resultatet av `description.length > 0`.
uk: Посередині, [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html): містить [Kirigami.Heading](docs:kirigami2;Heading), де показано назву завдання; [Kirigami.Separator](docs:kirigami2;Separator), який додає горизонтальну лінію; і [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), який показу необов'язковий опис завдання. Останні два компоненти мають властивість [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop), значення якої визначається перевіркою того, чи є порожнім опис, — компоненти буде показано, залежно від результату перевірки`description.length > 0`.

source: We have several pieces of documentation that can help guide you towards becoming a contributor. We recommend you take a look at the developer-specific section of our [Development Guide](/docs/getting-started/building/help-dependencies) which can help you learn more about the KDE Community's development workflow. We also recommend you take a look at our documentation for KDE's GitLab instance, called [Invent](https://community.kde.org/Infrastructure/GitLab), as you will likely need to interact with it during the development process. The KDE Community interacts mainly through Matrix, and we also have [a page on the community wiki](https://community.kde.org/Matrix) that will guide you through setting up with your very own account.
eo: Ni havas plurajn dokumentojn, kiuj povas helpi vin gvidi vin fariĝi kontribuanto. Ni rekomendas, ke vi rigardu la program-specifan sekcion de nia [Disvolva Gvidilo](/docs/getting-started/building/help-dependencies) kiu povas helpi vin lerni pli pri la disvolva laborfluo de la KDE-Komunumo. Ni ankaŭ rekomendas, ke vi rigardu nian dokumentaron por la GitLab-instanco de KDE, nomata [Invent](https://community.kde.org/Infrastructure/GitLab), ĉar vi verŝajne devos interagi kun ĝi dum la evoluprocezo. La KDE-Komunumo interagas ĉefe per Matrix, kaj ni ankaŭ havas [paĝon en la komunuma vikio](https://community.kde.org/Matrix) kiu gvidos vin per agordo per via propra konto.
nl: We hebben verschillende stukken documentatie die u kunnen leiden naar het worden van een bijdrager. We bevelen u aan een kijkje te nemen in de specifieke voor ontwikkelaars gemaakte sectie onze [Ontwikkelgids](/docs/getting-started/building/help-dependencies) die u kan helpen om meer over de werkmethode voor ontwikkelen van de KDE gemeenschap. We bevelen u ook aan om een kijkje te nemen in onze documentatie voor het GitLab exemplaar van KDE, genaamd [Invent](https://community.kde.org/Infrastructure/GitLab), omdat het waarschijnlijk is dat u die nodig hebt gedurende het ontwikkelproces. De KDE gemeenschap werkt hoofdzakelijk via Matrix en we hebben ook [een pagina in de wiki van de gemeenschap](https://community.kde.org/Matrix) die u zal leiden bij het opzetten van uw zeer eigen account.
sl: Imamo več delov dokumentacije, ki vam lahko pomagajo pri usmerjanju k temu, da postanete sodelavec. Priporočamo vam, da si pogledate razdelek za razvijalce v vodniku [Development Guide](/docs/getting-started/building/help-dependencies), ki vam lahko pomaga izvedeti več o poteku razvojnega dela skupnosti KDE. Priporočamo vam tudi, da si pogledate našo dokumentacijo za pojavek KDE GitLab, imenovan [Invent](https://community.kde.org/Infrastructure/GitLab), saj boste morali z njo med razvojnim procesom interaktivno sodelovati. Skupnost KDE sodeluje predvsem preko storitve Matrix, prav tako pa imamo [stran na wikiju skupnosti](https://community.kde.org/Matrix), ki vas bo vodila pri vzpostavljanju nastavitev z vašim lastnim računom.
sv: Vi har flera delar av dokumentationen som kan hjälpa till att leda dig till att bli en bidragsgivare. Vi rekommenderar att du tar en titt på den utvecklarspecifika sektionen av vår [utvecklingshandledning](/docs/getting-started/building/help-dependencies) som kan hjälpa dig lära dig mer om KDE-gemenskapens utvecklingsflöde. Vi rekommenderar också att du tar en titt på vår dokumentation om KDE:s GitLab-instans, benämnd [Invent](https://community.kde.org/Infrastructure/GitLab), eftersom du troligen behöver använda dig av den under utvecklingsprocessen. KDE-gemenskapen samarbetar huvudsakligen via Matrix, och vi har också [en sida på gemenskapens wiki](https://community.kde.org/Matrix) som leder dig igenom processen att skapa ditt eget konto.
uk: Маємо декілька джерел документації, які можуть допомогти вам зробити перші кроки. Ми рекомендуємо переглянути призначений для розробників розділ [наших настанов щодо початку роботи над проєктом](/docs/getting-started/building/help-dependencies). Ці настанови можуть розширити ваші знання щодо принципів розробки у спільноті KDE. Ми також рекомендуємо вам ознайомитися із документацією до екземпляра GitLab KDE, який має назву [Invent](https://community.kde.org/Infrastructure/GitLab), оскільки вам, ймовірно, доведеться працювати із ним під час процесу розробки. Учасники спільноти KDE спілкуються переважно у Matrix, також у нас є [сторінка у вікі спільноти](https://community.kde.org/Matrix), на якій наведено настанови щодо налаштовування середовища із вашим власним обліковим записом.

source: [KDE Apps page](https://apps.kde.org/en/calindori)<br />[KDE Invent page](https://invent.kde.org/plasma-mobile/calindori)
eo: [KDE Apps-paĝo](https://apps.kde.org/en/calindori)<br />[KDE Invent-paĝo](https://invent.kde.org/plasma-mobile/calindori)
es: [Página de KDE Apps](https://apps.kde.org/en/calindori)<br />[Página de KDE Invent](https://invent.kde.org/plasma-mobile/calindori)
fr: [Page de KDE Apps](https://apps.kde.org/en/calindori)<br />[Page de KDE Invent](https://invent.kde.org/plasma-mobile/calindori)
nl: [KDE Apps pagina](https://apps.kde.org/en/calindori)<br />[KDE Invent pagina](https://invent.kde.org/plasma-mobile/calindori)
pl: [Strona Aplikacji KDE](https://apps.kde.org/en/calindori)<br />[Strona KDE Invent](https://invent.kde.org/plasma-mobile/calindori)
pt: [Página das Aplicações do KDE](https://apps.kde.org/en/calindori)<br />[Página do KDE Invent](https://invent.kde.org/plasma-mobile/calindori)
sl: [Stran KDE aplikacije] (https://apps.kde.org/en/calindori)<br />[KDE Invent page](https://invent.kde.org/plasma-mobile/calindori)
sv: [KDE-programsida](https://apps.kde.org/en/calindori)<br />[KDE Invent-sida](https://invent.kde.org/plasma-mobile/calindori)
uk: [Сторінка на KDE Apps](https://apps.kde.org/en/calindori)<br />[Сторінка на KDE Invent](https://invent.kde.org/plasma-mobile/calindori)

source: [Userbase page](https://userbase.kde.org/Koko)<br />[KDE Invent page](https://invent.kde.org/graphics/koko)
eo: [Uzantbaza paĝo](https://userbase.kde.org/Koko)<br />[KDE Invent-paĝo](https://invent.kde.org/graphics/koko)
es: [Página de Userbase](https://userbase.kde.org/Koko)<br />[Página de KDE Invent](https://invent.kde.org/graphics/koko)
fr: [Page de Userbase](https://userbase.kde.org/Koko)<br />[Page de KDE Invent](https://invent.kde.org/graphics/koko)
nl: [Userbase pagina](https://userbase.kde.org/Koko)<br />[KDE Invent pagina](https://invent.kde.org/graphics/koko)
pl: [Strona bazy użytkowników](https://userbase.kde.org/Koko)<br />[Strona KDE Invent](https://invent.kde.org/graphics/koko)
pt: [Página da Base de Utilizadores](https://userbase.kde.org/Koko)<br />[Página do KDE Invent](https://invent.kde.org/graphics/koko)
sl: [Stran uporabniške baze](https://userbase.kde.org/Koko)<br />[KDE Invent page](https://invent.kde.org/graphics/koko)
sv: [Användarbassida](https://userbase.kde.org/Koko)<br />[KDE Invent-sida](https://invent.kde.org/graphics/koko)
uk: [Сторінка у Userbase](https://userbase.kde.org/Koko)<br />[Сторінка на KDE Invent](https://invent.kde.org/graphics/koko)

source: [KDE Apps page](https://apps.kde.org/en/kontrast)<br />[KDE Invent page](https://invent.kde.org/accessibility/kontrast)
eo: [KDE Apps-paĝo](https://apps.kde.org/en/kontrast)<br />[KDE Invent-paĝo](https://invent.kde.org/accessibility/kontrast)
es: [Página de KDE Apps](https://apps.kde.org/en/kontrast)<br />[Página de KDE Invent](https://invent.kde.org/accessibility/kontrast)
fr: [Page de KDE Apps](https://apps.kde.org/en/kontrast)<br />[Page de KDE Invent](https://invent.kde.org/accessibility/kontrast)
nl: [KDE Apps pagina](https://apps.kde.org/en/kontrast)<br />[KDE Invent pagina](https://invent.kde.org/accessibility/kontrast)
pl: [Strona Aplikacji KDE](https://apps.kde.org/en/kontrast)<br />[Strona KDE Invent](https://invent.kde.org/accessibility/kontrast)
pt: [Página das Aplicações do KDE](https://apps.kde.org/en/kontrast)<br />[Página do KDE Invent](https://invent.kde.org/accessibility/kontrast)
sl: [Stran KDE aplikacij](https://apps.kde.org/en/kontrast)<br />[KDE Invent page](https://invent.kde.org/accessibility/kontrast)
sv: [KDE-programsida](https://apps.kde.org/en/kontrast)<br />[KDE Invent-sida](https://invent.kde.org/accessibility/kontrast)
uk: [Сторінка на KDE Apps](https://apps.kde.org/en/kontrast)<br />[Сторінка на KDE Invent](https://invent.kde.org/accessibility/kontrast)

source: <img src="org.kde.licentia.png" width="50" height="50"><br />Licentia
eo: <img src="org.kde.licentia.png" width="50" height="50"><br />Licentio

source: <img src="start-here-kde.png" width="50" height="50"><br />Plasma Welcome
eo: <img src="start-here-kde.png" width="50" height="50"><br />Plasma Bonvenon
es: <img src="start-here-kde.png" width="50" height="50"><br />Bienvenida a Plasma
nl: <img src="start-here-kde.png" width="50" height="50"><br />Plasma welkom
pt: <img src="start-here-kde.png" width="50" height="50"><br />Boas-Vindas do Plasma
sv: <img src="start-here-kde.png" width="50" height="50"><br />Plasma Välkommen
uk: <img src="start-here-kde.png" width="50" height="50"><br />Вітання Плазми

source: <img src="org.kde.discover.png" width="50" height="50"><br />Discover
eo: <img src="org.kde.discover.png" width="50" height="50"><br />Malkovru
nl: <img src="org.kde.discover.png" width="50" height="50"><br />Ontdekken

source: [KDE Apps page](https://apps.kde.org/en/discover)<br />[KDE Userbase page](https://userbase.kde.org/Discover)<br />[KDE Invent page](https://invent.kde.org/plasma/discover)
eo: [KDE Apps-paĝo](https://apps.kde.org/en/discover)<br />[KDE-Uzantbazo-paĝo](https://userbase.kde.org/Discover)<br />[KDE Invent-paĝo ](https://invent.kde.org/plasma/discover)
es: [Página de KDE Apps](https://apps.kde.org/en/discover)<br />[Página de KDE Userbase](https://userbase.kde.org/Discover)<br />[Página de KDE Invent](https://invent.kde.org/plasma/discover)
fr: [Page de KDE Apps](https://apps.kde.org/en/discover)<br />[Page de KDE Userbase](https://userbase.kde.org/Discover)<br />[Page de KDE Invent](https://invent.kde.org/plasma/discover)
nl: [KDE Apps pagina](https://apps.kde.org/en/discover)<br />[KDE Userbase pagina](https://userbase.kde.org/Discover)<br />[KDE Invent pagina](https://invent.kde.org/plasma/discover)
pl: [Strona Aplikacji KDE](https://apps.kde.org/en/discover)<br />[Strona bazy użytkowników KDE](https://userbase.kde.org/Discover)<br />[Strona KDE Invent](https://invent.kde.org/plasma/discover)
pt: [Página das Aplicações do KDE](https://apps.kde.org/en/discover)<br />[Página da Base de Utilizadores do KDE](https://userbase.kde.org/Discover)<br />[Página do KDE Invent](https://invent.kde.org/plasma/discover)
sl: [Stran KDE aplikacij](https://apps.kde.org/en/discover)<br />[Stran uporabniške baze KDE](https://userbase.kde.org/Discover)<br />[KDE Invent page](https://invent.kde.org/plasma/discover)
sv: [KDE-programsida](https://apps.kde.org/en/discover)<br />[KDE-användarbassida](https://userbase.kde.org/Discover)<br />[KDE Invent-sida](https://invent.kde.org/plasma/discover)
uk: [Сторінка на KDE Apps](https://apps.kde.org/en/discover)<br />[Сторінка у KDE Userbase](https://userbase.kde.org/Discover)<br />[Сторінка на KDE Invent](https://invent.kde.org/plasma/discover)

source: [Home page](https://elisa.kde.org/)<br />[KDE Apps page](https://apps.kde.org/en/elisa)<br />[KDE Community Wiki page](https://community.kde.org/KDEConnect)<br />[KDE Invent page](https://invent.kde.org/multimedia/elisa)
eo: [Hejmpaĝo](https://elisa.kde.org/)<br />[KDE-Aplika paĝo](https://apps.kde.org/en/elisa)<br />[KDE-Komunuma Vikio-paĝo] (https://community.kde.org/KDEConnect)<br />[KDE Invent-paĝo](https://invent.kde.org/multimedia/elisa)
es: [Página web](https://elisa.kde.org/)<br />[Página de KDE Apps](https://apps.kde.org/en/elisa)<br />[Página wiki de KDE Community](https://community.kde.org/KDEConnect)<br />[Página de KDE Invent](https://invent.kde.org/multimedia/elisa)
fr: [Page d'accueil](https://elisa.kde.org/)<br />[Page de KDE Apps](https://apps.kde.org/en/elisa)<br />[Page de wiki de la communauté KDE](https://community.kde.org/KDEConnect)<br />[Page de KDE Invent](https://invent.kde.org/multimedia/elisa)
nl: [Homepagina](https://elisa.kde.org/)<br />[KDE Apps pagina](https://apps.kde.org/en/elisa)<br />[KDE Community Wiki pagina](https://community.kde.org/KDEConnect)<br />[KDE Invent pagina](https://invent.kde.org/multimedia/elisa)
pl: [Strona domowa](https://elisa.kde.org/)<br />[Strona Aplikacji KDE](https://apps.kde.org/en/elisa)<br />[Strona Wiki Społeczności KDE](https://community.kde.org/KDEConnect)<br />[Strona KDE Invent](https://invent.kde.org/multimedia/elisa)
pt: [Página Web](https://elisa.kde.org/)<br />[Página das Aplicações do KDE](https://apps.kde.org/en/elisa)<br />[Página da Wiki da Comunidade do KDE](https://community.kde.org/KDEConnect)<br />[Página do KDE Invent](https://invent.kde.org/multimedia/elisa)
sl: [Domača stran](https://elisa.kde.org/)<br />[Stran KDE Aplikacij](https://apps.kde.org/en/elisa)<br />[Wiki stran KDE Skupnosti](https://community.kde.org/KDEConnect)<br />[KDE Invent page](https://invent.kde.org/multimedia/elisa)
sv: [Hemsida](https://elisa.kde.org/)<br />[KDE-programsida](https://apps.kde.org/en/elisa)<br />[KDE-gemenskapens wikisida](https://community.kde.org/KDEConnect)<br />[KDE Invent-sida](https://invent.kde.org/multimedia/elisa)
uk: [Домашня сторінка](https://elisa.kde.org/)<br />[Сторінка на KDE Apps](https://apps.kde.org/en/elisa)<br />[Сторінка у вікі спільноти KDE](https://community.kde.org/KDEConnect)<br />[Сторінка на KDE Invent](https://invent.kde.org/multimedia/elisa)

source: <img src="org.kde.kongress.png" width="50" height="50"><br />Kongress
eo: <img src="org.kde.kongress.png" width="50" height="50"><br />Kongreso
