Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Some of those components allow you to credit your work and the work of other contributors in your project, as well as mention the frameworks being used in your application: [AboutKDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) and AboutPage.
eo: Kelkaj el tiuj komponantoj permesas vin krediti vian laboron kaj la laboron de aliaj kontribuantoj en via projekto, kaj ankaŭ mencii la kadrojn uzatajn en via aplikaĵo: [Pri KDE](https://api.kde.org/frameworks/kirigami- addons/html/classAboutKDE.html) kaj AboutPage.
es: Algunos de estos componentes le permiten mostrar los créditos de su trabajo y del de los colaboradores de su proyecto, así como hacer mención de las infraestructuras que usa su aplicación: [AboutKDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) y AboutPage.
nl: Sommige van die componenten bieden u om dankbetuigingen voor uw werk en het werk van anderen die hebben bijgedragen aan uw project, evenals het noemen van de frameworks die in uw toepassing worden gebruikt: [AboutKDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) en AboutPage.
sl: Nekatere od teh komponent vam omogočajo, da si pripišete priznanje svojemu delu in delu drugih sodelujočih v vašem projektu ter omenite uporabljena ogrodja v vaši aplikaciji: [O KDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) in AboutPage.
sv: Visa av komponenterna gör att du kan ge information om ditt arbetet och andra bidragsgivare till projektet, samt nämna ramverken som används av programmet: [AboutKDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) och AboutPage.
uk: Деякі з цих компонентів надають змогу показати вашу роботу та роботу інших учасників у вашому проєкті, а також згадати бібліотеки, які використовуються у вашій програмі: [Про KDE](https://api.kde.org/frameworks/kirigami-addons/html/classAboutKDE.html) і AboutPage.

source: That's it really! All it takes is instantiating `FormCard.AboutKDE`. You should see something like this after clicking the AboutKDE button:
eo: Tio estas vere! Necesas nur instantiigi `FormCard.Pri KDE`. Vi devus vidi ion tian post klakado de la butono Pri KDE:
es: ¡Eso es todo! Todo lo que se necesita es crear una instancia de `FormCard.AboutKDE`. Debería ver algo parecido a esto tras pulsar el botón «AboutKDE»:
nl: Dat is het helemaal! Al wat er gedaan moet worden is een exemplaar maken van `FormCard.AboutKDE`. U zou iets moeten zien als dit na klikken op de knop AboutKDE:
sl: To je res to! Vse kar je potrebno je instanciranje `FormCard.AboutKDE`. Po kliku gumba AboutKDE bi morali videti nekaj takega:
sv: Det är faktiskt det hela! Allt som krävs är att instansiera `FormCard.AboutKDE`. Du ska se något som liknar det här efter att ha klickat på knappen AboutKDE:
uk: Ось і справді! Усе, що потрібно, це створити екземпляр `FormCard.AboutKDE`. Ви маєте побачити щось подібне після натискання кнопки AboutKDE:

source: Instead of letting your about page get information from [KAboutData](docs:kcoreaddons;KAboutData), it is possible to pass a JSON object directly. You will still need to use [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) in your `main.cpp` in order for your application icon to show up.
eo: Anstataŭ lasi vian pri paĝo ricevi informojn de [KAboutData](docs:kcoreaddons;KAboutData), eblas rekte transdoni JSON-objekton. Vi ankoraŭ bezonos uzi [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) en via `main.cpp` por ke via aplikaĵa piktogramo aperu.
es: En lugar de dejar que la página «acerca de» obtenga información de [KAboutData](docs:kcoreaddons;KAboutData), se puede pasar un objeto JSON directamente. Seguirá necesitando usar [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) en `main.cpp` para que se muestre el icono de la aplicación.
nl: In plaats van dat uw pagina about informatie krijgt uit [KAboutData](docs:kcoreaddons;KAboutData), is het mogelijk om een JSON-object direct door te geven. U zult nog steeds [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) in uw `main.cpp` moeten gebruiken om in uw toepassing het pictogram te laten tonen.
sl: Namesto da bi vaši strani z informacijami omogočili, da pridobi informacije iz [KAboutData](dokumenti:kcoreaddons;KAboutData), je mogoče objekt JSON posredovati neposredno. Še vedno boste morali uporabiti [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) v vašem `main.cpp`, da se prikaže ikona aplikacije.
sv: Istället för att låta Om-sidan hämta information från [KAboutData](docs:kcoreaddons;KAboutData), är det möjligt att skicka ett JSON-objekt direkt. Du behöver fortfarande använda [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) i `main.cpp` för att programikonen ska dyka upp.
uk: Замість того, щоб надавати вашій сторінці «Про програму» інформації з [KAboutData](docs:kcoreaddons;KAboutData), можна передати об'єкт JSON безпосередньо. Вам все одно потрібно буде використовувати [QApplication::setWindowIcon()](docs:qtwidgets;QApplication::setWindowIcon) у вашому `main.cpp`, щоб було показано піктограму вашої програми.

source: You have learned how to add About and AboutKDE pages to your application. Now you will be able to use their same inner components to create your settings pages.
eo: Vi lernis kiel aldoni Pri kaj Pri KDE-paĝojn al via aplikaĵo. Nun vi povos uzi iliajn samajn internajn komponantojn por krei viajn agordajn paĝojn.
es: Ha aprendido a añadir las páginas «Acerca de» y «Acerca de KDE» a su aplicación. Ahora podrá usar los mismos componentes internos para crear sus páginas de preferencias.
nl: U hebt geleerd hoe de pagina's About en AboutKDE toe te voegen aan uw toepassing. Nu zult u in staat zijn om hun zelfde innerlijke componenten te gebruiken om uw instellingenpagina's aan te maken.
sl: Naučili ste se, kako svoji aplikaciji dodati strani About in AboutKDE. Zdaj boste lahko uporabili njihove iste notranje komponente za ustvarjanje svoje strani z nastavitvami.
sv: Du har lärt dig hur man lägger till About- och AboutKDE-sidor i programmet. Nu kan du använda samma inre komponenter för att skapa inställningssidor.
uk: Ви навчилися додавати сторінки About та AboutKDE до вашої програми. Тепер ви зможете використовувати їхні внутрішні компоненти для створення сторінок налаштувань.

source: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) is the main component we will be using to group all its child components, the Delegates.
eo: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) estas la ĉefa ero, kiun ni uzos por grupigi ĉiujn ĝiajn infanajn komponantojn, la Delegitojn.
es: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) es el componente principal que usaremos para agrupar todos sus componentes hijos, los «delegados».
nl: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) is de hoofdcomponent die we zullen gebruiken om alle zijn dochtercomponenten, de Gedelegeerden, te groeperen.
sl: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) je glavna komponenta, ki jo bomo uporabili za združevanje vseh svojihpodrejenih komponent, delegatov.
sv: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) är huvudkomponenten vi använder för att gruppera alla dess underordnade komponenter, delegaterna.
uk: [FormCard.FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) є головним компонентом, яким ми користуватимемося для групування його дочірніх компонентів, делегатів.

source: We used a form card in the [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) before. Its main purpose is to serve as a container for other components while following a color different from the background, in a similar manner to a [Kirigami.Card](docs:kirigami2;Card).
eo: Ni antaŭe uzis formularkarton en la [Kirigami Addons-enkonduko](/docs/getting-started/kirigami/addons-introduction) antaŭe. Ĝia ĉefa celo estas servi kiel ujo por aliaj komponantoj sekvante diferencan koloron de la fono, en simila maniero al [Kirigami.Karto](docs:kirigami2;Karto).
es: Ya hemos usado una tarjeta de formulario en la [introducción a los complementos de Kirigami](/docs/getting-started/kirigami/addons-introduction). Su propósito principal es el de servir como contenedor para otros componentes con un color distinto al del fondo, de un modo similar a una [Kirigami.Card](docs:kirigami2;Card).
nl: We gebruikten eerder een formulier-card in de [Kirigami Addons introductie](/docs/getting-started/kirigami/addons-introduction). Het hoofddoel hiervan is te dienen als een container voor andere componenten tijdens het volgen van een kleurverschil met de achtergrond, op een vergelijkbare manier met een [Kirigami.Card](docs:kirigami2;Card).
sl: Kartico obrazca smo uporabili v [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) že prej. Njen glavni namen je služiti kot vsebnik zadruge komponente, medtem ko sledi barvi, ki se razlikuje od ozadja, na podoben način kot [Kirigami.Card](docs:kirigami2;Card).
sv: Vi använde ett formulärkort tidigare i [Kirigami Addons introduktion](/docs/getting-started/kirigami/addons-introduction). Dess huvudsakliga syfte är att fungera som en behållare för andra komponenter samtidigt som det följer en färg som skiljer sig från bakgrunden, på ett liknande sätt som ett [Kirigami.Card](docs:kirigami2;Card).
uk: Раніше ми скористалися карткою форми у [вступі до додатків Kirigami](/docs/getting-started/kirigami/addons-introduction). Її основним призначенням є робота контейнером для інших компонентів, маючи колір, який відрізняється від кольору тла, подібно до [Kirigami.Card](docs:kirigami2;Card).

source: Since we are making a separate QML file for our Settings page, and since we need to prepare for potential scrolling in our page, we use a `FormCard.FormCardPage`, which inherits [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
eo: Ĉar ni faras apartan QML-dosieron por nia Agorda paĝo, kaj ĉar ni devas prepari por eventuala movo en nia paĝo, ni uzas `FormCard.FormCardPage', kiu heredas [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
es: Como estamos creando un archivo QML distinto para nuestra página de «Preferencias», y como posiblemente necesitaremos prepararla para que permita usar desplazamiento en la página, usamos una `FormCard.FormCardPage`, que hereda de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
nl: Omdat we een apart QML-bestand gaan maken voor onze pagina Instellingen en omdat we voor potentieel schuiven in onze pagina ons willen voorbereiden, gebruiken we een `FormCard.FormCardPage`, die [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) erft.
sl: Ker izdelujemo ločeno datoteko QML za našo stran z nastavitvami in ker smo se pripraviti na morebitno drsenje po naši strani, uporabljamo `FormCard.FormCardPage`, ki podeduje [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
sv: Eftersom vi gör en separat QML-fil för vår inställningssida, och eftersom vi behöver förbereda oss för eventuell panorering av vår sida, använder vi `FormCard.FormCardPage`, som ärver [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).
uk: Оскільки ми створюємо окремий файл QML для нашої сторінки налаштувань і оскільки нам потрібно підготуватися до можливого гортання нашої сторінки, ми використовуємо `FormCard.FormCardPage`, який успадковує [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage).

source: For every [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) you want to create, you can create a [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html) just before it. The header uses bold text and shows up right above the form card.
eo: Por ĉiu [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) kiun vi volas krei, vi povas krei [FormHeader](https://api.kde.org /frameworks/kirigami-addons/html/classFormHeader.html) tuj antaŭ ĝi. La kaplinio uzas grasan tekston kaj aperas ĝuste super la formularkarto.
es: Para cada [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) que quiera crear, puede crear una [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html) antes. La cabecera usa texto en negrita y se muestra justo encima de la tarjeta de formulario.
nl: Voor elke [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) die u wilt aanmaken kunt u een [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html) ervoor aanmaken. De kop gebruikt vette tekst en toont omhoog bovenaan de formcard.
sl: Za vsako [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html), ki jo želite ustvariti, lahko ustvarite [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html)tik pred njo. Glava uporablja krepko besedilo in se prikaže tik nad obrazcem kartice.
sv: För varje [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) som ska skapas, kan man skapa en [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html) precis innan den. Huvudet använder text med fetstil och visas precis ovanför formulärkortet.
uk: Для кожної [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html), яку ви хочете створити, ви можете створити [FormHeader](https://api.kde.org /frameworks/kirigami-addons/html/classFormHeader.html) безпосередньо перед ним. У заголовку використовується напівжирний текст, який буде показано безпосередньо над карткою форми.

source: `FormSectionText` simply adds a thin delegate containing a label. `FormTextDelegate` has text and a grayed out description.
eo: `FormSectionText` simple aldonas maldikan delegiton enhavantan etikedon. `FormTextDelegate` havas tekston kaj grizigitan priskribon.
es: `FormSectionText` añade un fino delegado que contiene una etiqueta. `FormTextDelegate` tiene texto y una descripción desactivada.
nl: `FormSectionText` voegt eenvoudig een dunne gedelegeerde toe die een label bevat. `FormTextDelegate` heeft tekst en een grijs gemaakte beschrijving.
sl: `FormSectionText` preprosto doda tankega delegata, ki vsebuje oznako.`FormTextDelegate` ima besedilo in siv opis.
sv: `FormSectionText` lägger helt enkelt till en enkel delegat som innehåller en beteckning. `FormTextDelegate` har text och en nedtonad beskrivning.
uk: `FormSectionText` просто додає тонкий делегат, що містить мітку. `FormTextDelegate` містить текст і показаний сірим опис.

source: We add some dummy text for the hypothetical theme detection. If we wanted to have actual color scheme detection, in the future it could be done similarly to [Neochat](https://apps.kde.org/neochat) ([code here](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), making use of a C++ model with [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
eo: Ni aldonas iom da falsa teksto por la hipoteza temo-detekto. Se ni volus havi efektivan kolorskemon detekton, estonte ĝi povus esti farita simile al [Neochat](https://apps.kde.org/neochat) ([kodo ĉi tie](https://github.com/KDE /neochat/blob/master/src/colorschemer.cpp)), uzante C++-modelon kun [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
es: Añadimos un texto de relleno para una hipotética detección de tema. Si queremos que se detecte realmente el esquema de color, se puede hacer posteriormente de forma similar a como se hace en [Neochat](https://apps.kde.org/neochat) ([aquí tiene el código](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), que usa un modelo de C++ con [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
nl: We voegen enige dummy tekst toe voor de hypothetische detectie van het thema. Als we echt detectie van het kleurschema willen hebben, kan dat in de toekomst op dezelfde manier gedaan worden aan [Neochat](https://apps.kde.org/neochat) ([code hier](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), gebruik makend van een C++ model met [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
sl: Dodamo nekaj navideznega besedila za zaznavanje hipotetične teme. Če bi želeliimajo dejansko zaznavanje barvne sheme, bi lahko v prihodnosti naredili podobnov [Neochat](https://apps.kde.org/neochat) ([koda tukaj](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), ki uporablja model C++z [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
sv: Vi lägger till lite text som platsmarkering för den hypotetiska temadetekteringen. Om vi ​​ville ha verklig färgschemadetektering skulle det i framtiden kunna göras på samma sätt som i [Neochat](https://apps.kde.org/neochat) ([code here](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), med användning av en C++ modell med [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).
uk: Ми додаємо деякий фіктивний текст для виявлення гіпотетичної теми. Якби ми хотіли мати фактичне визначення схеми кольорів, у майбутньому це можна було б зробити подібно до [Neochat](https://apps.kde.org/neochat) ([код тут](https://github.com/KDE/neochat/blob/master/src/colorschemer.cpp)), використовуючи модель C++ із [KColorSchemeManager](docs:kconfigwidgets;KColorSchemeManager).

source: In the Online Accounts section, we see an additional property, `leading`. We can add an [Item](docs:qtquick;Item) to it so that it appears before the text. Its opposite property, `trailing`, would be able to show an Item after the text, but we won't use it in our program.
eo: En la sekcio de Interretaj Kontoj, ni vidas plian proprecon, `ĉefa`. Ni povas aldoni [Item](docs:qtquick;Item) al ĝi por ke ĝi aperu antaŭ la teksto. Ĝia kontraŭa propreco, `trailing`, povus montri Eron post la teksto, sed ni ne uzos ĝin en nia programo.
es: En la sección de «Cuentas en línea», vemos una propiedad adicional: `leading`. Podemos añadir un [Item](docs:qtquick;Item) a ella para que aparezca antes del texto. La propiedad opuesta, `trailing`, permite mostrar un Item tras el texto, aunque no la usaremos en nuestro programa.
nl: In de sectie Online accounts zien we een extra eigenschap, `leading`. We kunnen een [Item](docs:qtquick;Item) er aan toevoegen zodat het verschijnt voor de tekst. Zijn tegengestelde eigenschap, `trailing`, zou in staat zijn een Item achter de tekst te tonen, maar we zullen dat niet in ons programma gebruiken.
sl: V razdelku Online Accounts vidimo dodatno lastnost, `leading`. Lahko mu dodamo [Element](docs:qtquick;Element), tako da se pojavi pred besedilom. Njegova nasprotna lastnost, `trailing`, bi lahko prikazala element za njegovim besedilom, vendar ga v našem programu ne bomo uporabili.
sv: I sektionen Online Accounts ser vi en ytterligare egenskap, `leading`. Vi kan lägga till ett [Item](docs:qtquick;Item) i den så att den visas före texten. Dess omvända egenskap, `trailing`, skulle kunna visa ett objekt efter texten, men vi använder inte den i programmet.
uk: У розділі «Облікові записи в інтернеті» ми бачимо додаткову властивість `leading`. Ми можемо додати до нього [Item](docs:qtquick;Item), щоб він з'являвся перед текстом. Його протилежна властивість, `trailing`, надає можливість показувати елемент після тексту, але ми не будемо використовувати його у нашій програмі.

source: We use a [Kirigami.Icon](docs:kirigami2;Icon) here for simplicity, but this could also be implemented using a [Kirigami.Avatar](docs:kirigami2;Avatar) that grabs the information from a model, as is done in Neochat [here](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
eo: Ni uzas [Kirigami.Icon](docs:kirigami2;Icon) ĉi tie por simpleco, sed ĉi tio ankaŭ povus esti efektivigita per [Kirigami.Avatar](docs:kirigami2;Avatar) kiu prenas la informojn de modelo, kiel estas farita. en Neochat [ĉi tie](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
es: Aquí usamos un [Kirigami.Icon](docs:kirigami2;Icon) por simplicidad, aunque también se puede usar un [Kirigami.Avatar](docs:kirigami2;Avatar) que obtiene la información de un modelo, como se hace en Neochat [aquí](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
nl: We gebruiken hier eenvoudig een [Kirigami.Icon](docs:kirigami2;Icon), maar dit zou ook geïmplementeerd kunnen worden met een [Kirigami.Avatar](docs:kirigami2;Avatar) die de informatie pakt uit een model, zoals gedaan is in Neochat [hier](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
sl: Za poenostavitev uporabljamo [Kirigami.Icon](docs:kirigami2;Icon), toda ta se lahko izvede tudi z uporabo [Kirigami.Avatar](docs:kirigami2;Avatar), ki zajema informacije iz modela, kot je storjeno v Neochatu [tukaj](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
sv: Vi använder en [Kirigami.Icon](docs:kirigami2;Icon) här för enkelhetens skull, med det skulle också kunna implementeras genom att använda [Kirigami.Avatar](docs:kirigami2;Avatar) som hämtar information från en modell, vilket görs [här](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml) i Neochat.
uk: Ми використовуємо тут [Kirigami.Icon](docs:kirigami2;Icon) для простоти, але це також можна реалізувати за допомогою [Kirigami.Avatar](docs:kirigami2;Avatar), який збирає інформацію з моделі, як це робиться у Neochat [тут](https://invent.kde.org/network/neochat/-/blob/master/src/qml/Settings/AccountsPage.qml).
