Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: With the checkbox, our Settings page should look like this:
ca: Amb la casella de selecció, la pàgina Configuració s'hauria de veure així:
eo: Kun la markobutono, nia paĝo de Agordoj devus aspekti jene:
es: Con la casilla de verificación, nuestra página de «Preferencias» debería parecerse a esto:
nl: Met het keuzevakje zou de pagina Instellingen er uitzien zoals deze:
sl: S potrditvenim poljem bi morala biti naša stran z nastavitvami videti takole:
sv: Med kryssrutan ska inställningssidan se ut så här:
uk: З пунктом для позначки наша сторінка «Параметри» має виглядати так:

source: Our Settings page is taking shape, but each section is starting to get long. We can add a few [FormDelegateSeparator](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html) instances to make our page tidier:
ca: La nostra pàgina de configuració està prenent forma, però cada secció està començant a fer-se llarga. Podem afegir algunes instàncies de [FormDelegateSeparator](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html)s per a fer que la nostra pàgina sigui més ordenada:

source: Generally, you may use separators whenever you see major distinctions between components, although the choice of where to place them is ultimately yours. For example, in the General section, the checkbox differs from its previous components as it doesn't start with text; in the Autosave section, the separator groups the radio buttons together; and in the Accounts section, adding a separator between the last account and the button provides some additional focus to the button.
ca: Generalment, podeu utilitzar separadors sempre que veieu distincions importants entre components, encara que l'elecció d'on col·locar-los és en última instància vostra. Per exemple, a la secció General, la casella de selecció difereix dels seus components anteriors, ja que no comença per text; a la secció Desament automàtic, el separador agrupa els botons d'opció; i a la secció Comptes, afegir un separador entre l'últim compte i el botó proporciona algun focus addicional al botó.
eo: Ĝenerale, vi povas uzi apartigilojn kiam ajn vi vidas gravajn distingojn inter komponantoj, kvankam la elekto de kie meti ilin finfine estas via. Ekzemple, en la sekcio Ĝenerala, la markobutono diferencas de siaj antaŭaj komponantoj ĉar ĝi ne komenciĝas per teksto; en la Aŭtomatkonserva sekcio, la apartigilo grupigas la radiobutonojn kune; kaj en la sekcio Kontoj, aldoni apartigilon inter la lasta konto kaj la butono provizas iom da plia fokuso al la butono.
es: Generalmente, puede usar separadores siempre que observe distinciones importantes entre los componentes, aunque la decisión de dónde colocarlos es, en última instancia, suya. Por ejemplo, en la sección «General», la casilla de verificación se diferencia de componentes anteriores en que no comienza con texto; en la sección «Guardar automáticamente», el separador agrupa los botones de opciones; y en la sección «Cuentas», si añade un separador entre la última cuenta y el botón, proporcionará un enfoque adicional para el botón.
nl: In het algemeen kunt u scheidingen gebruiken wanneer u belangrijk onderscheid ziet tussen componenten, hoewel de keuze waar deze te plaatsen uiteindelijk aan u is. Bijvoorbeeld, in de sectie General, verschilt het keuzevakje van zijn vorige componenten omdat het niet met tekst begint; in de sectie Autosave, groepeert de scheiding de keuzerondjes; en in sectie Accounts, levert een scheiding tussen het laatste account en de knop toevoegen enige extra focus op de knop.
sl: Na splošno lahko uporabite ločila, kadar koli opazite večje razlike med komponentami, čeprav je izbira, kje jih postaviti, na koncu vaše. Na primer, v razdelku General se potrditveno polje razlikuje od njegove prejšnje komponente, ker se ne začne z besedilom; v razdelku Autosave, ločilo združuje radijske gumbe; in v Accounts dodajanje ločila med zadnjim računom in gumbom, ki ga ponuja nekaj dodatnega poudarka na gumbu.
sv: I allmänhet kan avskiljare användas när det finns stora skillnader mellan komponenter, även om valet av var du ska placera dem i slutändan är fritt. Till exempel, i sektionen General, skiljer sig kryssrutan från de tidigare komponenterna eftersom den inte börjar med text, i sektionen Autosave grupperar avskiljaren alternativknapparna, och i sektionen Accounts, ger tillägg av en avskiljare mellan det sista kontot och knappen lite extra fokus på knappen.
uk: Як правило, ви можете використовувати роздільники щоразу, коли бачите великі відмінності між компонентами, хоча вибір місця їх розміщення залишається за вами. Наприклад, у розділі «Загальні» пункт варіанта відрізняється від попередніх компонентів тим, що він не починається з тексту; у розділі автозбереження роздільник об'єднує перемикачі; а в розділі «Облікові записи» додавання роздільника між останнім обліковим записом і кнопкою забезпечує додатковий акцент на кнопці.

source: The [above](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html#above-prop) and [below](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html#below-prop) properties are rather self-explanatory when it comes to their use: you pass the `id` of the components above and below the separator. When they are set, the separator will swiftly disappear whenever the above or below item is highlighted/hovered. They are most useful, for instance, when you need to generate components dynamically and you can't automatically assume which item will come immediately before or after the separator. That would be the case in the Accounts section of our application once the logic to add new accounts were actually implemented, in which case we could always grab the last item in the model to do so.
ca: Les propietats [above](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html#above-prop) i [below](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formdelegateseparator.html#below-prop) són bastant autoexplicatives pel que fa al seu ús: es passa el `id` dels components per sobre i per sota del separador. Quan s'estableixin, el separador desapareixerà ràpidament cada vegada que es ressalti o es passi per sobre de l'element anterior o inferior. Són més útils, per exemple, quan necessiteu generar components dinàmicament i no podeu assumir automàticament quin element vindrà immediatament abans o després del separador. Aquest seria el cas a la secció de Comptes de la nostra aplicació una vegada que s'hagi implementat realment la lògica d'afegir comptes nous, i en aquest cas sempre podríem agafar l'últim element del model per a fer-ho.

source: Notice how the separator above the tray icon setting does not appear while it is hovered.
ca: Observeu com el separador que hi ha a sobre de la configuració de la icona de la safata no apareixerà mentre es passa per sobre.
eo: Rimarku kiel la apartigilo super la pleta piktograma agordo ne aperas dum ĝi ŝvebas.
es: Observe cómo el separador sobre la preferencia del icono de la bandeja del sistema no aparece mientras está sobre él.
nl: Merk op hoe de scheider boven de instelling van het pictogram in het systeemvak niet verschijnt bij er boven zweven.
sl: Upoštevajte, da se ločilo nad nastavitvijo ikone na pladnju ne prikaže, ko miška lebdi nad njim.
sv: Lägg märke till hur avskiljaren ovanför brickikonens inställning inte visas när musen hålls över den.
uk: Зверніть увагу на те, що роздільник над налаштуванням піктограми у лотку не з'являється, якщо на нього навести вказівник.

source: Introduction to Kirigami Addons
ca: Introducció als complements del Kirigami
eo: Enkonduko al Kirigami Addons
es: Introducción a los complementos de Kirigami
nl: Introductie tot Kirigami add-ons
sl: Uvod v Kirigami Addons
sv: Introduktion av Kirigami Addons
uk: Вступ до додатків Kirigami

source: Get acquainted with Kirigami Addons components
ca: Coneixeu els components dels complements del Kirigami
eo: Konatiĝu kun Kirigami Addons-komponentoj
es: Familiarícese con los componentes de los complementos de Kirigami
nl: Wordt vertrouwd met Kirigami add-on-componenten
sl: Spoznajte komponente Kirigami Addons
sv: Bekanta dig med komponenterna i Kirigami Addons
uk: Знайомимося із компонентами додатків Kirigami

source: Here you will be setting up your new Kirigami Addons project and be introduced to a few useful components.
ca: Aquí configurareu el vostre projecte nou de complements del Kirigami i es presentaran alguns components útils.
eo: Ĉi tie vi starigos vian novan Kirigami Addons-projekton kaj estos prezentita al kelkaj utilaj komponantoj.
es: Aquí configurará su nuevo proyecto de los complementos de Kirigami y conocerá algunos componentes útiles.
nl: Hier zult u uw nieuwe Kirigami add-on-project opzetten en geïntroduceerd worden tot een paar nuttige componenten.
sl: Tukaj boste nastavili svoj novi projekt Kirigami Addons in vam bomo predstavili nekaj uporabnih komponent.
sv: Här ställer du in det nya Kirigami Addons-projektet och får en introduktion av några användbara komponenter.
uk: Тут ви налаштуєте свій новий проєкт додатків Kirigami і познайомитеся з кількома корисними компонентами.

source: These components make use of KDE's localization facilities, so before we start using these, we will need to set a little project that makes use of [KLocalizedContext](docs:ki18n;KLocalizedContext).
ca: Aquests components fan ús de les ajudes de localització del KDE, de manera que abans de començar a utilitzar-les, haurem d'establir un petit projecte que faci ús del [KLocalizedContext](docs:ki18n;KLocalizedContext).
eo: Ĉi tiuj komponantoj uzas la lokalizinstalaĵojn de KDE, do antaŭ ol ni ekuzi ĉi tiujn, ni devos agordi etan projekton kiu uzas [KLocalizedContext](docs:ki18n;KLocalizedContext).
es: Estos componentes hacen uso de las funciones de localización de KDE, por lo que, antes de empezar a usarlos, necesitaremos configurar un pequeño proyecto que haga uso de [KLocalizedContext](docs:ki18n;KLocalizedContext).
nl: Deze componenten maken gebruik van de lokalisatie faciliteiten, dus voordat we beginnen met deze te gebruiken, is het nodig een opzet voor een klein project te maken die gebruik maakt van [KLocalizedContext](docs:ki18n;KLocalizedContext).
sl: Te komponente uporabljajo lokalizacijske zmogljivosti KDE, zato bomo morali nastaviti majhen projekt preden jih začnemo uporabljati, ki bo izkoristil [KLocalizedContext](docs:ki18n;KLocalizedContext).
sv: Komponenterna använder sig av KDE:s faciliteter för landsinställningar, så innan vi börjar använda dem måste vi skapa ett litet projekt som använder [KLocalizedContext](docs:ki18n;KLocalizedContext).
uk: Ці компоненти використовують засоби локалізації KDE, тому перед тим, як ми почнемо ними користуватися, нам потрібно буде налаштувати невеликий проєкт, який використовує [KLocalizedContext](docs:ki18n;KLocalizedContext).

source: Setting up your project
ca: Configurar el projecte
eo: Agordi vian projekton
es: Configuración del proyecto
nl: Uw project opzetten
sl: Nastavitev vašega projekta
sv: Skapa projektet
uk: Налаштовування вашого проекту

source: The initial project structure will look like so:
ca: L'estructura inicial del projecte s'hauria de veure així:
eo: La komenca projektstrukturo aspektos tiel:
es: La estructura inicial del proyecto será parecida a esto:
nl: De initiële projectstructuur zal er zo uitzien:
sl: Začetna struktura projekta bo videti takole:
sv: Den ursprungliga projektstrukturen ser ut så här:
uk: Початкова структура проєкту має бути такою:

source: Tip
ca: Consell
eo: Konsileto
es: Consejo
fr: Infobulle
pl: Podpowiedź
pt: Sugestão
sl: Nasvet
sv: Tips
uk: Підказка

source: You can quickly create this file structure with:
ca: Podeu crear ràpidament aquesta estructura de fitxers amb:
eo: Vi povas rapide krei ĉi tiun dosierstrukturon per:
es: Puede crear esta estructura rápidamente con:
nl: U kunt deze bestandsstructuur snel aanmaken met:
pt: Pode criar rapidamente esta estrutura de ficheiros com:
sl: Hitro lahko ustvarite to datotečno strukturo z:
sv: Du kan snabbt skapa filstrukturen med:
uk: Ви можете швидко створити цю файлову систему ось так:

source: We start by using a very standard `CMakeLists.txt`:
ca: Comencem utilitzant un `CMakeLists.txt` molt estàndard:
eo: Ni komencas uzante tre norman `CMakeLists.txt`:
es: Empezamos usando un `CMakeLists.txt` bastante estándar:
nl: We beginnen door een erge standaard `CMakeLists.txt` te gebruiken:
sl: Začnemo z zelo standardnim `CMakeLists.txt`:
sv: Vi börjar med att använda en mycket vanlig `CMakeLists.txt`:
uk: Ми почнемо з використання зовсім стандартного `CMakeLists.txt`:

source: The interesting part will be the `main.cpp`:
ca: La part interessant serà el `main.cpp`:
eo: La interesa parto estos la `main.cpp`:
es: La parte interesante será el `main.cpp`:
nl: Het interessante deel zal de `main.cpp` zijn:
sl: Zanimiv del bo `main.cpp`:
sv: Den intressanta delen är `main.cpp`:
uk: Цікавою частиною буде `main.cpp`:

source: If you have read our [KXmlGui tutorial](/docs/getting-started/kxmlgui) or the last Kirigami tutorial on the [Kirigami About page](/docs/getting-started/kirigami/advanced-add_about_page), much of this will seem familiar to you.
ca: Si heu llegit la nostra [guia d'aprenentatge del KXmlGui](/docs/getting-started/kxmlgui) o l'última guia d'aprenentatge del Kirigami a la [pàgina sobre el Kirigami](/docs/getting-started/kirigami/advanced-add_about_page), gran part d'això us semblarà familiar.
eo: Se vi legis nian [KXmlGui-lerniilon](/docs/getting-started/kxmlgui) aŭ la lastan Kirigami-lerniilon sur la [Kirigami Pri paĝo](/docs/getting-started/kirigami/advanced-add_about_page), granda parto de ĉi tio estos ŝajnas al vi konata.
es: Si ha leído nuestro [tutorial de KXmlGui](/docs/getting-started/kxmlgui) o el último tutorial de Kirigami en la [página acerca de Kirigami](/docs/getting-started/kirigami/advanced-add_about_page), gran parte de todo esto ya debería serle familiar.
nl: Als u onze [KXmlGui-handleiding](/docs/getting-started/kxmlgui) hebt gelezen of de laatste Kirigami handleiding over de [Kirigami pagina Info over](/docs/getting-started/kirigami/advanced-add_about_page), zal veel hiervan bekend zijn voor u.
sl: Če ste prebrali našo [vadnico za KXmlGui](/docs/getting-started/kxmlgui) ali zadnjo vadnico o Kirigami na [strani o Kirigami](/docs/getting-started/kirigami/advanced-add_about_page), se bo marsikaj od tega zdelo že znano.
sv: Om du har läst vår [KXmlGui-handledning](/docs/getting-started/kxmlgui) eller den senaste Kirigami-handledningen på [Kirigami About-sidan](/docs/getting-started/kirigami/advanced-add_about_page), kommer mycket av det här verka bekant.
uk: Якщо ви вже прочитали наш [підручник з KXmlGui](/docs/getting-started/kxmlgui) або останній підручник з Kirigami на [сторінці про Kirigami](/docs/getting-started/kirigami/advanced-add_about_page), ви вже знайомі зі значною частиною цього розділу.

source: We create our application and use [KAboutData](docs:kcoreaddons;KAboutData)'s default constructor to add the metadata of our application, add ourselves as an author, and then use [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) to finish the process. For later, we also set an application icon that comes from the system theme.
ca: Creem la nostra aplicació i utilitzem el constructor predeterminat del [KAboutData](docs:kcoreaddons;KAboutData) per a afegir les metadades de la nostra aplicació, afegir-nos com a autor i després utilitzar [setApplicationData()](docs:kcoreaddons;KAboutData::setApplicationData) per a acabar el procés. Per a més endavant, també s'ha establert una icona d'aplicació que prové del tema del sistema.

source: We then use a lambda in [qmlRegisterSingletonType()](https://doc.qt.io/qt-6/qqml-h.html#qmlRegisterSingletonType) to directly send the metadata of our application to the QML side, exposing its properties.
ca: Després utilitzem una lambda en [qmlRegisterSingletonType()](https://doc.qt.io/qt-6/qqml-h.html#qmlRegisterSingletonType) per a enviar directament les metadades de la nostra aplicació a la part del QML, exposant les seves propietats.

source: We then instantiate our QML engine, and set its [context](docs:qtqml;QQmlContext) to use KDE's [KLocalizedContext](docs:ki18n;KLocalizedContext), used to integrate translated strings, passing the just created engine as a parameter.
ca: Després, instanciem el nostre motor QML i establim el seu [context](docs:qtqml;QQmlContext) per a utilitzar el [KLocalizedContext](docs:ki18n;KLocalizedContext) de KDE, que s'utilitza per a integrar cadenes traduïdes, passant el motor que s'acaba de crear com a paràmetre.
eo: Ni tiam kreas nian QML-motoron, kaj agordas ĝian [kuntekston](docs:qtqml;QQmlContext) por uzi la [KLocalizedContext](docs:ki18n;KLocalizedContext) de KDE, uzatan por integri tradukitajn ĉenojn, pasante la ĵus kreitan motoron kiel parametron.
es: A continuación creamos una instancia de nuestro motor QML y definimos su [contexto](docs:qtqml;QQmlContext) para que use [KLocalizedContext](docs:ki18n;KLocalizedContext) de KDE, que sirve para integrar los mensajes traducidos, pasando el motor recién creado como parámetro.
nl: We maken dan een exemplaar van onze QML-engine en zetten zijn [context](docs:qtqml;QQmlContext) om [KLocalizedContext](docs:ki18n;KLocalizedContext) van KDE te gebruiken, gebruikt om vertaalde tekenreeksen te integreren, en de zojuist gemaakte engine als een parameter door te geven.
sl: Nato ustvarimo primerek našega mehanizma QML in nastavimo njegov [kontekst](docs:qtqml;QQmlContext) za uporabo KDE-jevega [KLocalizedContext](docs:ki18n;KLocalizedContext), ki se uporablja za integracijo prevedenih nizov, pri čemer posreduje pravkar ustvarjeni stroj kot parameter.
sv: Vi instansierar sedan vårt QML-gränssnitt och ställer in [context](docs:qtqml;QQmlContext) för att använda KDE:s [KLocalizedContext](docs:ki18n;KLocalizedContext), som används för att integrera översatta strängar och skickar det nyskapade gränssnittet som en parameter.
uk: Потім ми створюємо екземпляр нашого рушія QML і встановлюємо його [контекст](docs:qtqml;QQmlContext) на використання [KLocalizedContext](docs:ki18n;KLocalizedContext) KDE, який використовується для інтеграції перекладених рядків, передаючи щойно створений рушій як параметр.

source: We simply load our QML file from the resource file, and now we just need to take care of our initial QML file.
ca: Simplement carreguem el fitxer QML des del fitxer de recursos, i ara només cal tenir cura del fitxer QML inicial.
eo: Ni simple ŝargas nian QML-dosieron el la rimeda dosiero, kaj nun ni nur bezonas zorgi pri nia komenca QML-dosiero.
es: Solo tenemos que cargar nuestro archivo QML del archivo de recursos y ya solo tenemos que ocuparnos de nuestro archivo QML inicial.
nl: We laden eenvoudig ons QML-bestand uit het hulpbronbestand en nu we hoeven alleen nog zorg te dragen voor ons initiële QML-bestand.
sl: Preprosto naložimo našo datoteko QML iz datoteke virov in zdaj moramo samo še poskrbeti za našo začetno datoteko QML.
sv: Vi läser helt enkelt in vår QML-fil från resursfilen, och nu behöver vi bara ta hand om vår ursprungliga QML-fil.
uk: Ми просто завантажуємо наш файл QML із файла ресурсів, і тепер нам потрібно лише подбати про наш початковий файл QML.

source: FormCard and FormButtonDelegate
ca: FormCard i FormButtonDelegate
eo: FormCard kaj FormButtonDelegate
es: FormCard y FormButtonDelegate
nl: FormCard en FormButtonDelegate
sl: FormCard in FormButtonDelegate
sv: FormCard och FormButtonDelegate
uk: FormCard і FormButtonDelegate

source: The idea for our app is to design our own Kirigami Addons gallery, showcasing multiple components, one per page. The main page will contain a simple list of buttons in a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), each opening a separate page.
ca: La idea de l'aplicació és dissenyar la nostra pròpia galeria de complements del Kirigami, mostrant múltiples components, un per pàgina. La pàgina principal contindrà una llista senzilla de botons en un [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), cada un obrint una pàgina separada.
eo: La ideo por nia programo estas desegni nian propran Kirigami Addons-galerion, montrante plurajn komponantojn, unu po paĝo. La ĉefpaĝo enhavos simplan liston de butonoj en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), ĉiu malfermante apartan paĝon.
es: La idea para nuestra aplicación es diseñar nuestra propia galería de complementos de Kirigami, mostrando múltiples componentes, uno por página. La página principal contendrá una sencilla lista de botones en un [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), cada uno de los cuales abre una página separada.
nl: Het idee voor onze app is het ontwerpen van onze eigen Kirigami add-ons galerij, die meerdere componenten etaleert, één per pagina. De hoofdpagina zal een eenvoudige lijst met knoppen bevatten in een [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), elk een aparte pagina openend.
sl: Ideja za našo aplikacijo je oblikovati lastno galerijo Kirigami Addons, ki prikazuje več komponent po eno na stran. Glavna stran bo vsebovala preprost seznam gumbov v [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), pri čemer vsak odpre ločeno stran.
sv: Tanken med vårt program är att konstruera vårt eget Kirigami Addons-galleri, som visar upp flera komponenter, en per sida. Huvudsidan ska innehålla en enkel lista med knappar i en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), där var och en öppnar en separat sida.
uk: Ідея нашого додатка полягає в тому, щоб розробити власну галерею додатків Kirigami, демонструючи кілька компонентів, по одному на сторінку. Головна сторінка міститиме простий список кнопок у [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), кожна з яких відкриватиме окрему сторінку.

source: Initially, our `Main.qml` should look like this:
ca: Inicialment, el nostre `Main.qml` s'hauria de veure així:
eo: Komence, nia `Main.qml` devus aspekti jene:
es: Al principio, nuestro `Main.qml` debería parecerse a esto:
nl: Initieel zou onze `Main.qml` er uit moeten zien als deze:
sl: Na začetku naj bi naš `Main.qml` izgledal takole:
uk: Спочатку, наш `Main.qml` має виглядати так:

source: We use our handy [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) to set the initial page to a [Kirigami.ScrollablePage](https://api.kde.org/qml-org-kde-kirigami-scrollablepage.html).
ca: Utilitzem la nostra útil [pageStack](/docs/getting-started/kirigami/components-pagerow_pagestack) per a establir la pàgina inicial a [Kirigami.ScrollablePage](https://api.kde.org/qml-org-kde-kirigami-scrollablepage.html).

source: While we could use a [FormLayout](/docs/getting-started/kirigami/components-formlayouts) together with [QtQuick Controls components](components-controls) to achieve our goal, here you will be introduced to [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html).
ca: Tot i que podríem utilitzar un [FormLayout](/docs/getting-started/kirigami/components-formlayouts) juntament amb els [components de QtQuick Controls](components-controls) per a assolir el nostre objectiu, aquí us presentarem un [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html).
