Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Inline messages
ca: Missatges inclosos
eo: Enliniaj mesaĝoj
es: Mensajes en línea
fr: Messages en ligne
nl: Inline berichten
pl: Wiadomości w treści
pt: Mensagens incorporadas
sl: Znotrajvrstična sporočila
sv: Meddelanden på plats
uk: Вбудовані повідомлення

source: Display messages related to the content in your application
ca: Mostrant en la vostra aplicació els missatges relacionats amb el contingut
eo: Montru mesaĝojn rilatajn al la enhavo en via aplikaĵo
es: Mostrar mensajes relacionados con el contenido de la aplicación
fr: Afficher les messages relatifs au contenu de votre application
nl: Berichten gerelateerd aan de inhoud in uw toepassing
pl: Wyświetl wiadomości związane z treścią twojej aplikacji
pt: Mostrar mensagens relacionadas com o conteúdo na sua aplicação
sl: Prikaži sporočila, povezana z vsebino, v programu
sv: Visa meddelanden relaterade till innehållet i programmet
uk: Показ повідомлень, які пов'язано із вмістом у вашій програмі

source: Inline messages provide an immediate way for you to notify your users about something that happened while using the application.
ca: Els missatges inclosos proporcionen una forma immediata de notificar als usuaris sobre alguna cosa que ha succeït mentre utilitzaven l'aplicació.
eo: Enliniaj mesaĝoj disponigas tujan manieron por vi sciigi viajn uzantojn pri io, kio okazis dum uzado de la aplikaĵo.
es: Los mensajes en línea proporcionan un modo inmediato para que pueda notificar a los usuarios sobre algo que haya ocurrido durante el uso de la aplicación.
fr: Les messages intégrés constituent un moyen immédiat d'informer vos utilisateurs d'un évènement survenu lors de l'utilisation de l'application.
nl: Inline berichten leveren een onmiddellijke manier voor u op om uw gebruikers te informeren over iets wat gebeurde tijdens het gebruik van de toepassing.
pl: Wiadomości w wierszu dają bezpośredni sposób na powiadamianie twoich użytkowników o czymś, co się stało, podczas używania aplikacji.
pt: As mensagens incorporadas oferece uma forma imediata de você notificar os seus utilizadores sobre algo que aconteceu ao usar a aplicação.
sl: Znotrajvrstična sporočila zagotavljajo takojšen način, da uporabnike obvestite o nečem, kar se je zgodilo med uporabo aplikacije.
sv: Meddelanden på plats tillhandahåller ett omedelbart sätt för dig att underrätta användare om någonting som hände medan programmet användes.
uk: За допомогою вбудованих повідомлень реалізовано спосіб негайного сповіщення користувача щодо того, що сталося під час користування програмою.

source: Basic inline message
ca: Missatge bàsic inclòs
eo: Baza enlinia mesaĝo
es: Mensaje en línea básico
fr: Message basique intégré
nl: Basis inline bericht
pl: Podstawowa wiadomość w treści
pt: Mensagem incorporada básica
sl: Osnovno znotrajvrstično sporočilo
sv: Grundläggande meddelande på plats
uk: Базове вбудоване повідомлення

source: [Kirigami.InlineMessage](docs:kirigami;org.kde.kirigami.InlineMessage) components have two important properties to be mindful of:
ca: Els components de [Kirigami.InlineMessage](docs:kirigami;org.kde.kirigami.InlineMessage) tenen dues propietats importants a tenir en compte:
sl: Komponente [Kirigami.InlineMessage](docs:kirigami;org.kde.kirigami.InlineMessage) imajo dve pomembni lastnosti, na kateri je treba paziti:

source: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): by default this is set to false, so that the message only appears when you explicitly want it to. This can be overridden if you wish by setting it to true. When a hidden inline message is set to be visible, you get a nice animation.
ca: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): de manera predeterminada s'estableix a «false», de manera que el missatge només apareixerà quan ho vulgueu explícitament. Això es pot anul·lar si ho voleu establint-la a «true». Quan un missatge inclòs ocult està establert per a ser visible, s'obtindrà una animació bonica.
eo: [videbla](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): defaŭlte ĉi tio estas agordita al falsa, tiel ke la mesaĝo aperas nur kiam vi eksplicite volas ĝin al. Ĉi tio povas esti anstataŭita, se vi volas, agordante ĝin al vera. Kiam kaŝita enlinia mesaĝo estas agordita por esti videbla, vi ricevas belan animacion.
es: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): tiene el valor `false` de forma predeterminada, por lo que el mensaje solo aparece cuando se indique de forma explícita. Este comportamiento se puede modificar asignándole el valor `true`. Cuando un mensaje en línea oculto se define como visible, se mostrará con una bonita animación.
nl: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): dit is standaard gezet op false, zodat het bericht alleen verschijnt wanneer u het expliciet wilt. Indien gewenst kan dit aangepast worden door het op true te zetten. Wanneer een verborgen inline bericht op zichtbaar is gezet, krijgt u een leuke animatie.
pt: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): por omissão, este valor está configurado como falso, pelo que a mensagem só irá aparecer quando quiser que o faça de forma explícita. Este comportamento poderá ser substituído se quiser configurá-lo como verdadeiro. Quando uma mensagem incorporada escondida for configurada para aparecer visível, irá obter uma animação bonita.
sl: Lastnost vidno [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): je privzeto nastavljeno na false, tako da se sporočilo prikaže le, ko to izrecno želite. To je mogoče preglasiti, tako da ga nastavite na true. Ko je skrito znotrajvrstično sporočilo nastavljeno na vidno, dobite lepo animacijo.
sv: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): Normalt är den inställd till `false`, så att meddelandet bara visas när du explicit vill det. Det kan överskridas om du vill genom att ställa in den till `true`. När ett dolt meddelande på plats ställs in att vara synligt, får du en snygg animering.
uk: [visible](https://doc.qt.io/qt-6/qml-qtquick-item.html#visible-prop): типово, для цієї властивості встановлено значення false, отже повідомлення буде показано, лише якщо ви явно цього захочете. Якщо хочете, таку поведінку можна змінити встановленням значення true. Якщо для вбудованого повідомлення увімкнути видимість, користувач побачить чудову анімацію.

source: [text](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#text-prop): here is where you set the text of your inline message.
ca: [text](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#text-prop): aquí és on establireu el text del missatge inclòs.

source: ![A window showing a button which when clicked makes an inline message with light blue background pop up with text above it, near the top of the application](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)
ca: ![Una finestra que mostra un i botó que quan s'hi fa clic fa que emergeixi un missatge inclòs amb fons blau clar amb text a sobre, a prop de la part superior de l'aplicació](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)
eo: ![Fenestro montranta butonon kiu, kiam oni alklakas, ekaperas enlinian mesaĝon kun helblua fono kun teksto super ĝi, proksime de la supro de la aplikaĵo](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple. png)
nl: ![Een venster die een knop toont die bij klikken een inline bericht laat verschijnen met lichtblauwe achtergrond met tekst erboven, nabij de bovenkant van de toepassing](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)
pt: ![Uma janela que mostra um botão que, quando for carregado, faz com que uma mensagem incorporada com fundo azul claro apareça com texto em cima, perto do topo da aplicação](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)
sl: ![Okno, ki prikazuje gumb, ki ob kliku naredi vgrajeno sporočilo z svetlo modrim ozadjem, se pojavi z besedilom nad njim blizu vrha aplikacije](/docs/use/kirigami/components-inlinemessages/inlinemessages-simple.png)
sv: ![Ett fönster som visar en knapp som när du klickar på den skapar ett infogat meddelande med ljusblå bakgrund som dyker upp med text ovanför, nära programmets övre del](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)
uk: ![Вікно, у якому показано кнопку, яка після натискання піднімає вбудоване повідомлення зі світло-синім тлом і текстом над ним у верхній частині вікна програми](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-simple.png)

source: Different types
ca: Tipus diferents
eo: Malsamaj tipoj
es: Diferentes tipos
fr: Types différents
nl: Verschillende typen
pl: Różne rodzaje
pt: Tipos diferentes
sl: Različne vrste
sv: Olika typer
uk: Інші типи

source: Standard inline messages are like the ones above: they have a blue background and a default icon. We can change that with the [type](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#type-prop) property, which lets us set our inline message to a different type. There are four types we can choose from:
ca: Els missatges inclosos estàndard són com els anteriors: tenen un fons blau i una icona predeterminada. Podem canviar-ho amb la propietat [type](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#type-prop), la qual ens permet establir el nostre missatge inclòs a un tipus diferent. Hi ha quatre tipus entre els quals podem triar:

source: **Information** (`Kirigami.MessageType.Information`): the default. Has a blue background, an 'i' icon, and is used to announce a result or tell the user something general. It is not necessary to manually set it.
ca: **Informació** (`Kirigami.MessageType.Information`): el predeterminat. Té un fons blau, una icona *i* i s'utilitza per a anunciar un resultat o dir-li a l'usuari alguna cosa general. No cal establir-lo manualment.
eo: **Informo** (`Kirigami.MessageType.Information`): la defaŭlta. Havas bluan fonon, piktogramon "i", kaj estas uzata por anonci rezulton aŭ diri al la uzanto ion ĝeneralan. Ne necesas mane agordi ĝin.
es: **Información** (`Kirigami.MessageType.Information`): el predeterminado. Tiene un fondo azul, un icono 'i' y se usa para anunciar un resultado o para comunicarle al usuario algo general. No es necesario definirlo manualmente.
fr: **Information** (« Kirigami.MessageType.Information ») : la valeur par défaut, possédant un fond bleu, une icône « i ». Elle est utilisée pour annoncer un résultat ou dire quelque chose de général à l'utilisateur.
nl: **Informatie** (`Kirigami.MessageType.Information`): de standaard. Heeft een blauwe achtergrond, een 'i' pictogram en wordt gebruikt om een resultaat te melden of aan de gebruiker iets algemeens te vertellen. Het is niet nodig om het handmatig te zetten.
pl: **Informacja** (`Kirigami.MessageType.Information`): domyślnie ma niebieskie tło, ikonę 'i' i jest używane do ogłoszenia wyniku lub powiedzenia czegoś ogólnego. Nie jest wymagane jej ręczne ustawienie.
pt: **Informação** (`Kirigami.MessageType.Information`): o predefinido. Tem um fundo azul, um ícone 'i' e é usado para anunciar um resultado ao dizer ao utilizador algo de genérico. Não é necessário configurá-lo manualmente.
sl: **Informacije** ('Kirigami.MessageType.Information'): privzeto. Ima modro ozadje, ikono "i" in se uporablja za napoved rezultata ali povedati uporabniku nekaj splošnega. Ni ga treba ročno nastaviti.
sv: **Information** (`Kirigami.MessageType.Information`): förval. Har en blå bakgrund, en 'i' ikon, och används för att kungöra ett resultat eller tala om något generellt för användaren. Det är inte nödvändigt att ställa in det manuellt.
uk: **Інформування** (`Kirigami.MessageType.Information`): стандартний. Має синє тло, піктограму «i» і використовується для оголошення про результат або сповіщення користувача про щось загальне. Цей тип не потрібно встановлювати вручну.

source: **Positive** (`Kirigami.MessageType.Positive`): has a green background, tick icon, and indicates that something went well.
ca: **Positiu** (`Kirigami.MessageType.Positive`): té un fons verd, icona de marca i indica que alguna cosa ha sortit bé.
eo: **Pozitiva** (`Kirigami.MessageType.Positive`): havas verdan fonon, tick-piktogramon, kaj indikas ke io iris bone.
es: **Positivo** (`Kirigami.MessageType.Positive`): tiene un fondo verde, un icono con una marca de verificación e indica que algo ha ido bien.
fr: **Positif** (« Kirigami.MessageType.Positive ») : possède un arrière-plan vert, une icône en forme de coche et indique que quelque chose s'est bien passé.
nl: **Positief** (`Kirigami.MessageType.Positive`): heeft een groene achtergrond, pictogram met vinkje, en geeft aan dat iets goed ging.
pl: **Pozytyw** (`Kirigami.MessageType.Positive`): ma zielone tło, ikonę ptaszka i wskazuje na to, że coś poszło dobrze.
pt: **Positivo** (`Kirigami.MessageType.Positive`): tem um fundo verde, um ícone de aprovação e diz que algo decorreu com sucesso.
sl: **Pozitivno** ('Kirigami.MessageType.Positive'): ima zeleno ozadje, ikono kljukice in označuje, da je šlo nekaj dobro.
sv: **Positiv** (`Kirigami.MessageType.Positive`): har en grön bakgrund, bockikon, och anger att något gick bra.
uk: **Позитивний** (`Kirigami.MessageType.Positive`): має зелене тло, піктограму позначки і вказує на те, що щось виконано вдало.

source: **Warning** (`Kirigami.MessageType.Warning`): has an orange background, an exclamation-mark icon, and can be used to warn the user about something they should be mindful of.
ca: **Avís** (`Kirigami.MessageType.Warning`): té un fons taronja, una icona de signe d'exclamació i es pot utilitzar per a avisar a l'usuari sobre alguna cosa que ha de tenir en compte.
eo: **Averto** (`Kirigami.MessageType.Warning`): havas oranĝan fonon, ekkrio-signon, kaj povas esti uzata por averti la uzanton pri io, pri kio ili devus atenti.
es: **Advertencia** (`Kirigami.MessageType.Warning`): tiene un fondo naranja, un icono con un signo de exclamación y se puede usar para advertir al usuario sobre algo que debería tener en cuenta.
fr: **Avertissement** (« Kirigami.MessageType.Warning »): possède un fond orange, une icône en forme de point d'exclamation et peut être utilisé pour avertir l'utilisateur de quelque chose dont il doit d'occuper.
nl: **Waarschuwing** (`Kirigami.MessageType.Warning`): heeft een oranje achtergrond, een pictogram met uitroepteken, en kan gebruikt worden om de gebruiker te waarschuwen voor iets waar deze aan moet denken.
pl: **Uwaga** (`Kirigami.MessageType.Warning`): ma pomarańczowe tło, ikonę wykrzyknika i może być użyte, aby ostrzec użytkownika o czymś, na co powinien zwrócić uwagę.
pt: **Aviso** (`Kirigami.MessageType.Warning`): tem um fundo laranja, um ícone de exclamação e pode ser usado para avisar o utilizador sobre algo que eles deverão ter atenção.
sl: **Opozorilo** ('Kirigami.MessageType.Warning'): ima oranžno ozadje, ikono z znakom klicaja in se lahko uporablja za opozarjanje uporabnika na nekaj, kar bi morali biti pozorni.
sv: **Varning** (`Kirigami.MessageType.Warning`): har en orange background, en utropsteckenikon, och kan användas för att varna användaren för någonting de bör vara medvetna om.
uk: **Попередження** (`Kirigami.MessageType.Warning`): має помаранчеве тло, піктограму знака оклику; можна скористатися для попередження користувача про те, що на щось слід звернути увагу.

source: **Error** (`Kirigami.MessageType.Error`): has a red background, a cross icon, and can be used to tell the user that something has gone wrong.
ca: **Error** (`Kirigami.MessageType.Error`): té un fons vermell, una icona de creu i es pot utilitzar per a dir-li a l'usuari que alguna cosa ha sortit malament.
eo: **Eraro** (`Kirigami.MessageType.Error`): havas ruĝan fonon, krucan piktogramon, kaj povas esti uzata por diri al la uzanto ke io misfunkciis.
es: **Error** (`Kirigami.MessageType.Error`): tiene un fondo rojo, un icono con una equis y se puede usar para comunicar al usuario que algo ha ido mal.
fr: **Erreur** (« Kirigami.MessageType.Error ») : possède un fond rouge, une icône en forme de croix et peut être utilisé pour dire à l'utilisateur que quelque chose a mal tourné.
nl: **Fout** (`Kirigami.MessageType.Error`): heeft een rode achtergrond, een pictogram met een kruis, en kan gebruikt worden om de gebruiker te vertellen dat er iets verkeerd ging.
pl: **Błąd** (`Kirigami.MessageType.Error`): ma czerwone tło, ikonę krzyża i może być użyty, aby powiedzieć użytkownikowi, że coś poszło nie tak.
pt: **Erro** (`Kirigami.MessageType.Error`): tem um fundo vermelho, um ícone em cruz e poderá ser usado para avisar o utilizador que aconteceu algo de errado.
sl: **Error** ('Kirigami.MessageType.Error'): ima rdečo ozadje, ikono križa in se lahko uporabi za to, da se uporabniku pove, da je šlo nekaj narobe.
sv: **Fel** (`Kirigami.MessageType.Error`): har en röd bakgrund, en korsikon, och kan användas för att tala om för användaren att någonting har gått fel.
uk: **Помилка** (`Kirigami.MessageType.Error`): має червоне тло, піктограму-хрест; можна скористатися для повідомлення користувачеві про те, що щось не так.

source: ![A window showcasing all four inline message types in blue, green, orange and red](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
ca: ![Una finestra que mostra tots els quatre tipus de missatges inclosos en blau, verd, taronja i vermell](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
eo: ![Fenestro montranta ĉiujn kvar enliniajn mesaĝspecojn en blua, verda, oranĝa kaj ruĝa](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
nl: ![Een venster die alle vier inline typen melding in blauw, groen, oranje en rood laat zien](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
pt: ![Uma janela que demonstra todos os quatro tipos de mensagens incorporadas, a azul, verde, laranja e vermelho](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
sl: ![Okno, ki prikazuje vse štiri vrste znotrajvrstičnih sporočil v modri, zeleni, oranžni in rdeči barvi](/docs/use/kirigami/components-inlinemessages/inlinemessages-types.png)
sv: ![Ett fönster som visar alla fyra meddelandetyper på plats i blått, grönt, orange och rött](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)
uk: ![Вікно, у якому показано усі чотири типи вбудованих повідомлень синім, зеленим, помаранчевим та червоним кольором](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-types.png)

source: Customising text and icons
ca: Personalitzar el text i les icones
eo: Agordo de teksto kaj piktogramoj
es: Personalización de texto y de iconos
fr: Personnalisation du texte et des icônes
nl: Tekst en pictogrammen aanpassen
pl: Dostosowywanie tekstu i ikon
pt: Personalizar o texto e os ícones
sl: Prilagajanje besedila in ikon
sv: Anpassa text och ikoner
uk: Налаштовування тексту і піктограм

source: Inline messages support rich text, which can be defined with simple HTML-like markup. This allows you to add some formatting to your inline message's text or even include an external web link if you want to.
ca: Els missatges inclosos admeten text enriquit, el qual es pot definir amb un marcatge senzill similar a HTML. Això permet afegir algun format al text del missatge inclòs o fins i tot incloure un enllaç web extern si ho voleu.
eo: Enliniaj mesaĝoj subtenas riĉan tekston, kiu povas esti difinita per simpla HTML-simila markado. Ĉi tio ebligas al vi aldoni iom da formatado al la teksto de via enlinia mesaĝo aŭ eĉ inkluzivi eksteran retligilon se vi volas.
es: Los mensajes en línea permiten el uso de texto enriquecido, que puede constar de etiquetas sencillas de tipo HTML. Esto le permite añadir cierto formato al texto de los mensajes en línea e incluso insertar enlaces web externos, si así lo desea.
fr: Les messages intégrés prennent en charge le texte enrichi, pouvant être défini à l'aide de balises simples de type « HTML ». Cela vous permet d'ajouter certaines mises en forme de texte pour votre texte intégré de message ou même d'inclure un lien Internet externe si vous le souhaitez.
nl: Inline meldingen ondersteunen opgemaakte tekst, die gedefinieerd kan worden met eenvoudige HTML-regelopmaak. Dit biedt u het toevoegen van enige formattering aan uw inline berichttekst of zelfs invoegen van een externe webkoppeling als u dat wilt.
pl: Wiadomości w treści obsługują formatowany tekst, który można określić tak prosto jak HTML. Umożliwia to dodanie formatowania do twoich wiadomości w treści, a nawet umieszczenie odnośnika na zewnątrz do sieci.
pt: As mensagens incorporadas suportam texto formato, o qual poderá ser configurado com alguma formatação simples e semelhante ao HTML. Isto permite-lhe adicionar alguma formatação ao texto da sua mensagem incorporada ou ainda incluir uma hiperligação externa se o desejar.
sl: Znotrajvrstična sporočila podpirajo obogateno besedilo, ki ga lahko določite s preprostim html-podobnim označevanjem. To vam omogoča, da dodate nekaj oblikovanja v besedilo v vrstici sporočila ali celo vključite zunanjo spletno povezavo, če to želite.
sv: Meddelande på plats stöder rich text, som kan definieras med enkel HTML-liknande taggar. Det låter oss lägga till viss formatering i dina meddelandetexter eller till och med inkludera en extern webblänk om du vill.
uk: У вбудованих повідомленнях передбачено підтримку форматування тексту, яку можна визначити за допомогою простої HTML-подібної розмітки. Це надає вам змогу додавати певне форматування до тексту ваших вбудованих повідомлень або навіть, якщо хочете, включити зовнішнє інтернет-посилання.

source: Note that when you use quotes in a string you will have to escape them!
ca: Cal tenir en compte que, quan utilitzeu cometes en una cadena, les haureu d'escapar.
eo: Notu, ke kiam vi uzas citaĵojn en ĉeno, vi devos eskapi ilin!
es: Tenga en cuenta que cuando use comillas en una cadena de texto, tendrá que usar secuencias de escape con ellas.
fr: Veuillez noter que lorsque vous utilisez des guillemets dans une chaîne de caractères, vous devez utiliser des caractère d'échappement !
nl: Merk op dat wanneer u aanhalingstekens in een tekenreeks wilt gebruiken u escape moet gebruiken!
pl: Pamiętaj, że jeśli chcesz użyć cudzysłowów w ciągu znaków, to będziesz musiał je wykluczyć z przetwarzania!
pt: Lembre-se que quando usar aspas no texto terá de as escapar!
sl: Upoštevajte, da boste morali pri uporabi narekovajev v nizu uporabiti ubežni znak!
sv: Observera att när du använder citationstecken i en sträng måste de undantas.
uk: Зауважте, що якщо ви використовуєте лапки у рядку, вам слід їх екранувати!
