Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Hardcoded colors in QML, such as `#32b2fa` or `red` should usually be avoided; if it is really necessary to have elements with custom colors, it should be an area where only custom colors are used (usually in the content area of the app, and never in the chrome such as toolbars or dialogs), for instance a hardcoded `black` foreground cannot be used over a `Kirigami.Theme.backgroundColor` background, because if the platform uses a dark color scheme the result will look poor contrasting black over almost black.
fr: Les couleurs codées en dur dans QML, telles que « #32b2fa » ou « red », doivent généralement être évitées. S'il est vraiment nécessaire d'avoir des éléments avec des couleurs personnalisées, il doit s'agir d'une zone dans laquelle ces couleurs sont utilisées (généralement dans la zone de contenu de l'application et jamais dans les éléments chromatiques tels que les barres d'outils ou les dialogues). Par exemple, il est impossible d'utiliser un premier-plan noir codé en dur « noir » sur un arrière-plan « Kirigami.Theme.backgroundColor ». Car, si la plate-forme utilise un thème de couleurs sombres, le résultat sera pauvre en contrastes entre le noir et le presque noir.
pl: Powinieneś unikać barw zakodowanych w QML na sztywno, takich jak `#32b2fa` lub `red`; jeśli konieczne jest posiadanie rzeczy o własnych barwach, to powinien to być obszar, w którym używane są tylko własne barwy (zazwyczaj w obszarze aplikacji z treścią i nigdy w miejscach takich jak paski narzędzi, czy okna dialogowe), na przykład zakodowanej na sztywno barwy pierwszoplanowej dla `black` nie można użyć w tle `Kirigami.Theme.backgroundColor`, bo gdy platforma używa ciemnego trybu, to wynikiem będzie słabo kontrastujący czarny na prawie czarnym.

source: For more information about the Kirigami Theme class, see the [API docs](docs:kirigami2;Kirigami::PlatformTheme)
fr: Pour plus d'informations sur la classe de thème de Kirigami, consultez la page de [documentation sur l'API](docs:kirigami2;Kirigami::PlatformTheme)
pl: Po więcej szczegółów o klasie Kirigami Theme, zajrzyj do [dokumentacji API](docs:kirigami2;Kirigami::PlatformTheme)

source: `Kirigami.Theme` is an attached property, therefore is available to use in any QML item. It contains as properties all the colors available in the palette, and what palette to use, as the `colorSet` property.
fr: « Kirigami.Theme » est une propriété attachée, elle est donc disponible pour être utilisée dans tout élément QML. Elle contient comme propriétés toutes les couleurs disponibles de la palette et quelle palette utiliser, comme la propriété « colorSet ».
pl: `Kirigami.Theme` jest dołączoną właściwością, strąd jest dostępna do użytku z dowolnej rzeczy QML. Zawiera, jako właściwości, wszystkie barwy dostępne w palecie i to jakiej palety użyć jako właściwości `colorSet`.

source: Example:
fr: Exemple :
pl: Przykład:
pt: Exemplo:

source: <!-- TODO screenshot of a qml file with an annotated UI showing all the available color -->
fr: <!-- TODO capture d'écran d'un fichier « qml » avec une interface utilisateur annotée montrant toutes les couleurs disponibles -->
pl: <!-- ZADANIE zrzut ekranu pliku qml z opisanym interfejsem użytkownika, pokazujący wszystkie dostępne barwy -->

source: Depending on where a control is located, it should use a different color set: for instance, (with the Breeze light color theme) in itemviews, the normal background is almost white, while in other regions, such as toolbars or dialogs, the normal background color is gray.
fr: Selon l'emplacement d'un contrôle, celui-ci doit utiliser un jeu de couleurs différent : par exemple, (avec le thème de couleurs claires Breeze) dans les affichages d'éléments, l'arrière-plan normal est presque blanc, tandis que dans d'autres régions, comme les barres d'outils ou les boîtes de dialogue, la couleur d'arrière-plan normale est le gris.
pl: W zależności od tego, gdzie rzecz obsługująca jest umieszczona, to powinna mieć nadaną inną barwę: na przykład, (przy jasnym trybie Bryzy) w itemviews, zwyczajne tło jest prawie białe, podczas gdy w innych obszarach, takich jak paski narzędzi lub okna, zwyczajne tło jest szare.

source: If you set a color set for an item, all of its child items (recursively) will inherit it automatically (unless the property `inherit` has explicitly been set to `false`, which should always be done when the developer wants to force a specific color set) so it is easy to change colors for an entire hierarchy of items without touching any of the items themselves.
fr: Si vous définissez un jeu de couleurs pour un élément, tous ses éléments fils (de manière récursive) en hériteront automatiquement (à moins que la propriété « inherit » n'ait été explicitement définie à « False », ce qui devrait toujours être fait lorsque le développeur veut forcer un jeu de couleurs spécifique). Ainsi, il est donc facile de changer les couleurs de toute une hiérarchie d'éléments sans toucher aux éléments eux-mêmes.
pl: Jeśli nadasz zestaw barw dla rzeczy, to wszystkie jej podrzędne rzeczy (wgłąb) odziedziczą ją samoczynnie (chyba, że właściwość `inherit` została jednoznacznie ustawiona na `false`, co należy zawsze robić, gdy programista, chce wymusić dany zestaw barw), więc łatwo jest zmieniać barwy dla całej hierarchii rzeczy bez dotykania samych rzeczy po kolei.

source: `Kirigami.Theme` supports 5 different color sets:
fr: « Kirigami.Theme » prend en charge 5 jeux de couleurs différents :
pl: `Kirigami.Theme` obsługuje 5 różnych zestawów barw:

source: Window: **Default** Color set for windows and "chrome" areas
fr: Fenêtre : **Défaut** Couleur définie pour les fenêtres et les zones « chrome ».
pl: Okno: **Domyślny** zestaw barw dla okien oraz obszarów "chromowanych"

source: Complementary: Color set meant to be complementary to Window: usually is dark even in light themes. May be used for "emphasis" in small areas of the application
fr: En addition : un ensemble de couleurs destinées à être complémentaires de la fenêtre : généralement, elles sont foncées même dans les thèmes clairs. Peut être utilisé pour « mettre en valeur » de petites zones de l'application.
pl: Uzupełnienie: Zestaw barw stanowi uzupełnienie do Okna: zazwyczaj jest ciemny nawet w jasnym trybie. Może być używany do "uwypuklenia" czegoś w małych obszarach aplikacji

source: The comments assume the system uses the Breeze Light color theme
fr: Les commentaires supposent que le système utilise le thème de couleurs « Breeze Light ».
pl: Uwagi zakładają, że system używa zestawu barw Jasnej Bryzy

source: A gray color will be used, as the default color set is Window
fr: Une couleur grise sera utilisée, car la couleur par défaut est « Window ».
pl: Zostanie użyta szara barwa, bo domyślnym zestawem barw jest ten z okien

source: The text will be near-black, as is defined in the Window color set
fr: Le texte sera presque noir, tel que défini dans le jeu de couleurs de la fenêtre.
pl: Tekst będzie niemal czarny tak, jak jest to określone w zestawie barw okien

source: Use the set for ItemViews
fr: Utiliser l'ensemble pour les ItemViews
pl: Użyj zestawu dla widoków ItemViews

source: Do not inherit from the parent
fr: N'héritent pas du parent
pl: Nie dziedzicz z nadrzędnego

source: This will be a near-white color
fr: Ce sera une couleur presque blanche.
pl: To będzie niemal biała barwa

source: This will be a near-white color too, as the colorSet is inherited from the parent and will be View
fr: Il s'agira également d'une couleur proche du blanc, car l'ensemble de couleurs est hérité du parent et sera celui de l'affichage.
pl: Będzie to także barwa niemal białą, bo colorSet jest dziedziczony z rzeczy nadrzędnej, a to będzie widok.

source: The text will be near-black, as is defined in the View color set
fr: Le texte sera presque noir, tel que défini dans le jeu de couleurs pour l'affichage.
pl: Tekst będzie niemal czarny tak, jak jest to określone w zestawie barw widoków

source: Use the Complementary set
fr: Utiliser l'ensemble complémentaire
pl: Użyj uzupełniającego zestawu

source: This will be near-black as in the Complementary color set the background color is dark.
fr: Ce sera presque noir car dans le jeu complémentaire de couleurs, la couleur de fond est sombre.
pl: To będzie niemal czarne jako iż w zestawie barw uzupełniających, barwa tła jest ciemna.

source: The text will be near-white, as is defined in the Complementary color set
fr: Le texte sera presque blanc, tel que défini dans le jeu complémentaire de couleurs.
pl: Tekst będzie niemal biały tak, jak jest to określone w uzupełniającym zestawie barw

source: Some components such as Labels will automatically inherit by default the color set, some other components have a fixed color set, for instance Buttons are fixed to the `Button` color set. If it's desired for the button to inherit the parent color set, the `inherit` property should be explicitly set to `true`:
fr: Certains composants, comme les étiquettes, hériteront automatiquement par défaut du jeu de couleurs, tandis que d'autres composants ont un jeu fixe de couleurs, par exemple. Les boutons sont fixés sur le jeu de couleurs « Button ». Si l'on souhaite que le bouton hérite du jeu de couleurs de son parent, la propriété « inherit » doit être explicitement définie à « True » :
pl: Niektóre ze składników, takie jak etykiety, samoczynnie odziedziczą zestaw barw, niektóre ze składników mają zestaw barw ustawiony na sztywno, np. przyciski są usztywnione względem zestawu barw `Button`. Aby przycisk odziedziczył zestaw barw rzeczy nadrzędnej, to właściwość `inherit` powinna być jednoznacznie ustawiona na `true`:

source: ![Screenshot of a comparison between a button that inherits and one that does not](buttonsinherit.png)
fr: ! [Une capture d'écran d'une comparaison entre un bouton héritant et un autre n'héritant pas](buttonsinherit.png)
pl: ![Zrzut ekranu zestawiający przycisk, który dziedziczy i który nie dziedziczy](buttonsinherit.png)

source: Although it's discouraged to use hardcoded colors, Kirigami offers a more maintainable way to assign a custom hardcoded palette to an item and all its children, that will allow to define such custom colors in one place and one only:
fr: Bien qu'il soit déconseillé d'utiliser des couleurs codées en dur, Kirigami offre un moyen plus facile pour la maintenance en attribuant une palette personnalisée codée en dur à un élément et à tous ses fils, ce qui permettra de définir de telles couleurs personnalisées à un seul et unique endroit :
pl: Mimo, że odradza się używania barw zakodowanych na sztywno, Kirigami trochę bardziej niezawodny sposób na przypisanie własnej zakodowanej na sztywno palety do rzeczy i ich rzeczy podrzędnych, która umożliwi określenie takich własnych barw w jednym miejscu i tylko w jednym miejscu:

source: ![Screenshot showing the code above with qmlscene, we can see two rectangles with two different colors](customcolors.png)
fr: ! [Une capture d'écran montrant le code ci-dessus avec « qmlscene ». On peut voir deux rectangles avec deux couleurs différentes](customcolors.png)
pl: ![Zrzut ekranu, pokazujący kod powyżej w qmlscene, widzimy dwa prostokąty w dwóch różnych barwach](customcolors.png)

source: Kirigami provides an [heading element](docs:kirigami2;Heading) that can be used for page or section titles.
fr: Kirigami fournit un [élément d'en-tête](docs:kirigami2;Heading) pouvant être utilisé pour les titres de pages ou de sections.
pl: Kirigami daje [nagłówek](docs:kirigami2;Heading), którego można użyć do tytułów stron lub obszarów.

source: Heading
fr: En-tête
pl: Nagłówek

source: Text elements should use the Label element from QtQuick Controls 2.
fr: Les éléments de texte doivent utiliser l'élément « Label » de QtQuick Controls 2.
pl: Składniki tekstowe powinny używać składników etykiet z QtQuick Controls 2.

source: You can align your text elements using the horizontalAlignment property of the text element.
fr: Vous pouvez aligner vos éléments de texte en utilisant la propriété « horizontalAlignment » de l'élément de texte.
pl: Możesz wyrównać swoje teksty przy użyciu właściwości horizontalAlignment tekstu.

source: Text centered
fr: Texte centré
pl: Wyśrodkowany tekst

source: Text right aligned
fr: Texte aligné à droite
pl: Tekst wyrównany do prawej

source: QML allows you to display (and edit) rich text. The behavior can be controlled via the [textFormat](https://doc.qt.io/qt-5/qml-qtquick-text.html#textFormat-prop) property.
fr: QML vous permet d'afficher (et de modifier) du texte enrichi. Le comportement peut être contrôlé par la propriété [textFormat](https://doc.qt.io/qt-5/qml-qtquick-text.html#textFormat-prop).
pl: QML umożliwia ci wyświetlenie (oraz zmianę) tekstu formatowanego. Zachowaniem można sterować poprzez właściwość [textFormat](https://doc.qt.io/qt-5/qml-qtquick-text.html#textFormat-prop).

source: Displaying rich text
fr: Affichage de texte enrichi
pl: Wyświetlanie formatowanego tekstu

source: The font size of the Kirigami [Theme](docs:kirigami2;Theme) is available as `Kirigami.Theme.defaultFont.pointSize` in your application.
fr: La taille de la police du [Thème] de Kirigami (docs:kirigami2;Theme) est disponible sous la forme de la propriété « Kirigami.Theme.defaultFont.pointSize » dans votre application.
pl: Rozmiar czcionki [wyglądu](docs:kirigami2;Theme) Kirigami jest dostępny jako `Kirigami.Theme.defaultFont.pointSize` w twojej aplikacji.

source: Right after creating the [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), add the [type registration](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html) to `main.cpp` as follows:
pt: Logo depois de criar o [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), adicione o [registo do tipo](https://doc.qt.io/qt-5/qtqml-cppintegration-definetypes.html) no `main.cpp`, da seguinte forma:

source: First we must include a number of Qt [header files](https://www.learncpp.com/cpp-tutorial/header-files/), allowing us to use their functions. In this case, we include a number of Qt headers that handle application logic, reading QML files, and accessing files defined in `resources.qrc`.
pt: Em primeiro lugar, devemos incluir um conjunto de [ficheiros de inclusão](https://www.learncpp.com/cpp-tutorial/header-files/) do Qt que nos permite usar as funções do mesmo. Neste casos, iremos incluir um conjunto de ficheiros de inclusão do Qt que lidam com a lógica aplicacional, a leitura de ficheiros QML e o acesso aos ficheiros definidos no `resources.qrc`.

source: We then create a [QApplication](docs:qtwidgets;QApplication) instance which we call `app`. We then pass [argc and argv](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) to the constructor, letting Qt parse and use arguments.
pt: Iremos então criar uma instância de [QApplication](docs:qtwidgets;QApplication) que será chamada de `app`. Iremos passar o ['argc' e o 'argv'](https://www.learncpp.com/cpp-tutorial/command-line-arguments/) ao construtor aqui, permitindo ao Qt processar e usar os argumentos.

source: The [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) lets us load an application from a QML file, which we do in the next line. In `engine.load(QUrl(QStringLiteral("qrc:/main.qml")));` we load our QML from a URL in our [Qt Resource File](https://doc.qt.io/qt-6/resources.html) (`resources.qrc`).
pt: O [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine) permite-nos carregar uma aplicação a partir de um ficheiro QML, o que será feito na linha seguinte. Em `engine.load(QUrl(QStringLiteral("qrc:/main.qml")));` iremos carregar o nosso QML a partir de um URL no nosso [Ficheiros de Recursos do Qt](https://doc.qt.io/qt-6/resources.html) (`resources.qrc`).

source: Then we get to a section where we include a number of necessary CMake and KDE settings by using [extra-cmake-modules](https://api.kde.org/ecm/). You shouldn't worry too much about these lines for now and we won't need to change them in this tutorial.
pt: Depois chegamos a um secção onde incluímos um conjunto de definições necessárias do CMake e KDE, usando o [extra-cmake-modules](https://api.kde.org/ecm/). Não se deverá preocupar demasiado com estas linhas por agora e não será necessário alterá-las neste tutorial.

source: [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) finds and loads the external component.
pt: O [find_package()](https://cmake.org/cmake/help/latest/command/find_package.html) procura e carrega o componente externo.

source: If you are looking to add any components listed in the [KDE API documentation](https://api.kde.org/) to your application, you may check the right sidebar for how to add the component with CMake. For instance, for [Kirigami2](docs:kirigami2;), you will find something like `find_package(KF5Kirigami2)`, which with the addition of [extra-cmake-modules](https://api.kde.org/ecm/) becomes something like `find_package(KF5 COMPONENTS Kirigami2)`.
pt: Se estiver a precisar de adicionar algum dos componentes indicados na [documentação da API do KDE](https://api.kde.org/) à sua aplicação, poderá verificar a barra lateral direita para ver como adicionar o componente com o CMake. Por exemplo, para o [Kirigami2](docs:kirigami2;), irá encontrar algo do tipo `find_package(KF5Kirigami2)` o qual, com a adição dos [extra-cmake-modules](https://api.kde.org/ecm/), fica algo semelhante a `find_package(KF5 COMPONENTS Kirigami2)`.

source: Note that these libraries should match the components that we included in our previous `CMakeLists.txt` file - otherwise these components will not be included and our application won't compile.
pt: Lembre-se que estas bibliotecas deve corresponder aos componentes que incluímos no nosso ficheiro `CMakeLists.txt` anterior - caso contrário, estes componentes não serão incluídos e a aplicação não irá compilar.

source: Kirigami actions inherit from [QtQuick Controls Action](docs:qtquickcontrols;QtQuick.Controls.Action) and can be assigned shortcuts.
pt: As acções do Kirigami herdam do [Action do QtQuick Controls](docs:qtquickcontrols;QtQuick.Controls.Action) e podem ter atribuídos atalhos de teclado.

source: One feature offered by Kirigami Actions on top of [QtQuick Actions](docs:qtquickcontrols;QtQuick.Controls.Action) is the possibility to nest actions.
pt: Uma funcionalidade oferecida pelas Acções do Kirigami sobre as [Action's do QtQuick](docs:qtquickcontrols;QtQuick.Controls.Action) é a possibilidade de encadear acções.

source: One of [Kirigami.Page](docs:kirigami2;Page)'s features is that Actions can be added to it.
pt: Uma das funcionalidades do [Kirigami.Page](docs:kirigami2;Page) é que poderá adicionar Action's a elas.

source: You can add a `actions.main` action, a `actions.left` and `actions.right` action and additional [context actions](../components-drawers#context-drawers) that are displayed on the toolbar if there is enough place or in a hamburger menu on smaller screens.
pt: Poderá adicionar uma acção `actions.main`, uma `action.left` e uma `action.right` e [acções de contexto](../components-drawers#context-drawers) adicionais que aparecem na barra de ferramentas, caso exista espaço suficiente, ou num menu em hambúrguer nos ecrãs mais pequenos.

source: To make the context actions work on mobile, you need to add a [ContextDrawer](docs:kirigami2;ContextDrawer) to your [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow).
pt: Para fazer com que as acções do contexto funcionem em dispositivos móveis, precisa de adicionar uma [ContextDrawer](docs:kirigami2;ContextDrawer) na sua [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow).

source: The global drawer provides an action based navigation to your application. This is where nested actions are useful because it is possible to create nested navigation:
pt: A área global oferece uma navegação baseada em acções à sua aplicação. Este é o local em que as acções encadeadas são úteis, porque lhe permite criar uma navegação encadeada:

source: Global Drawer actions on a mobile device
pt: Acções das Áreas Globais num dispositivo móvel

source: ![ActionToolBar with children center-aligned](/docs/getting-started/kirigami/components-actiontoolbar/actiontoolbar-alignment.png)
pt: ![O ActionToolBar com os filhos centrados](/docs/getting-started/kirigami/components-actiontoolbar/actiontoolbar-alignment.png)

source: A [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) is the simplest type of card. It's just a rectangle with a shadow, which can contain any [Item](docs:qtquick;QtQuick.Item) in it. It can also have Items assigned to its [header](docs:kirigami2;templates::AbstractCard::header) or [footer](docs:kirigami2;templates::AbstractCard::footer) properties. In this case a [Kirigami.Heading](docs:kirigami2;Heading) is its `header` and a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) is the card's [contentItem](docs:qtquickcontrols;QtQuick.Controls.Item::contentItem).
pt: Um [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) é o tipo mais simples de cartão. É apenas um rectângulo com uma sombra, a qual poderá conter qualquer [Item](docs:qtquick;QtQuick.Item) dentro dela. Também poderá ter itens atribuídos às suas propriedades [header](docs:kirigami2;templates::AbstractCard::header) ou [footer](docs:kirigami2;templates::AbstractCard::footer). Nesse caso, o cabeçalho será um [Kirigami.Heading](docs:kirigami2;Heading) e será atribuído um [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) com o `wrapMode` configurado como `Text.WordWrap` no [contentItem](docs:qtquickcontrols;QtQuick.Controls.Item::contentItem) do cartão.

source: [`CardsListView`](docs:kirigami2;CardsListView) or [`CardsGridView`](docs:kirigami2;CardsGridView) are better suited for larger models.
pt: O [`CardsListView`](docs:kirigami2;CardsListView) ou o [`CardsGridView`](docs:kirigami2;CardsGridView) são mais adequados para modelos maiores.

source: Use a [Kirigami.CardsGridView](docs:kirigami2;CardsGridView) to display cards in a grid.
pt: Use um [Kirigami.CardsGridView](docs:kirigami2;CardsGridView) para mostrar os cartões numa grelha.

source: Its behavior is the same as a [CardsLayout](docs:kirigami2;CardsLayout), and it allows cards to be put in one or two columns depending on the available width.
pt: O seu comportamento é o mesmo que um [CardsLayout](docs:kirigami2;CardsLayout), e permite que os cartões sejam dispostos numa ou duas colunas, dependendo da largura disponível.

source: [CardsGridView](docs:kirigami2;CardsGridView) has the limitation that every card must have the same exact height, so [cellHeight](https://doc.qt.io/qt-6/qml-qtquick-gridview.html#cellHeight-prop) must be manually set to a value for which the content must fit for every child card.
pt: O [CardsGridView](docs:kirigami2;CardsGridView) tem a limitação que cada cartão tem de ter a mesma altura exacta, pelo que o [cellHeight](https://doc.qt.io/qt-6/qml-qtquick-gridview.html#cellHeight-prop) deverá ser definido manualmente com um dado valor, pelo que o conteúdo deverá ser suficiente para todos os cartões-filhos.

source: If possible use [CardsGridView](docs:kirigami2;CardsGridView) only when you need to instantiate many cards. If you are only going to instantiate a few cards, opt for a [CardsLayout](docs:kirigami2;CardsLayout) with a [Repeater](docs:qtquick;QtQuick.Repeater) instead.
pt: É possível usar o [CardsGridView](docs:kirigami2;CardsGridView) apenas quando precisar de inicializar vários cartões. Se só for criar instâncias de apenas alguns cartões, opte por um [CardsLayout](docs:kirigami2;CardsLayout) com um [Repeater](docs:qtquick;QtQuick.Repeater) em alternativa.
