Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) creates the executable target we will use to run our project.
ca: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) crea l'objectiu executable que farem servir per a executar el projecte.
eo: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) kreas la ruleblan celon kiun ni uzos por efektivigi nian projekton.
es: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) crea el ejecutable de destino que usaremos para ejecutar nuestro proyecto.
nl: [add_executable](https://cmake.org/cmake/help/latest/command/add_executable.html) maakt het uitvoerbare doel dat we willen gebruiken om het project te runnen.
sl: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) ustvari izvršljivo tarčo, ki jo bomo uporabili za izvajanje našega projekta.
sv: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) skapar det körbara programmet vi använder för att köra vårt projekt.
uk: [add_executable()](https://cmake.org/cmake/help/latest/command/add_executable.html) створює виконуваний файл, яким ми користуватимемося для запуску результатів нашого проєкту.

source: `ecm_add_qml_module()` creates a QML module target that will be accessible via the "org.kde.tutorial" import.
ca: `ecm_add_qml_module()` crea un objectiu de mòdul QML al qual es podrà accedir via la importació «org.kde.tutorial».
eo: `ecm_add_qml_module()` kreas celon de QML-modulo kiu estos alirebla per la importo "org.kde.tutorial".
es: `ecm_add_qml_module()` crea un módulo QML de destino que será accesible mediante la importación de «org.kde.tutorial».
nl: `ecm_add_qml_module()` maakt een QML-moduledoel aan die toegankelijk zal zijn via het importeren van "org.kde.tutorial".
sl: `ecm_add_qml_module()` ustvari cilj modula QML, ki bo dostopen prek uvoza "org.kde.tutorial".
sv: `ecm_add_qml_module()` skapar ett mål för QML-modulen som är tillgängligt via import av "org.kde.tutorial".
uk: `ecm_add_qml_module()` створює ціль — модуль QML, — доступ до якої здійснюватиметься за допомогою імпортування «org.kde.tutorial».

source: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) adds C++ source files to the executable target.
ca: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) afegeix fitxers de codi font C++ a l'objectiu executable.
eo: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) aldonas C++ fontdosierojn al la rulebla celo.
es: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) añade los archivos de código fuente C++ al ejecutable de destino.
nl: [target_sources()](https://cmake.org/cmake/help/latest/command/targsources.html) voegt C++ bronbestanden toe aan het uitvoerbare doel.
sl: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) doda izvorne datoteke C++ izvršljivemu cilju.
sv: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) lägger till C++ källkodsfiler i det körbara målet.
uk: [target_sources()](https://cmake.org/cmake/help/latest/command/target_sources.html) додає файли початкового коду мовою C++ до виконуваної цілі проєкту.

source: `ecm_target_qml_sources()` adds QML files to the module.
ca: `ecm_target_qml_sources()` afegeix fitxers QML al mòdul.
eo: `ecm_target_qml_sources()` aldonas QML-dosierojn al la modulo.
es: `ecm_target_qml_sources()` añade archivos QML al módulo.
nl: `ecm_target_qml_sources()` voegt QML-bestanden toe aan de module.
sl: `ecm_target_qml_sources()` doda datoteke QML v modul.
sv: `ecm_target_qml_sources()` lägger till QML-filer i modulen.
uk: `ecm_target_qml_sources()` додає до модуля файли QML.

source: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) links the C++ libraries used in our code to our executable. Kirigami is not included here because we are using only its QML module.
ca: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) enllaça les biblioteques C++ utilitzades en el nostre codi amb el nostre executable. El Kirigami no s'inclou aquí perquè només estem utilitzant el seu mòdul QML.
eo: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) ligas la C++-bibliotekojn uzatajn en nia kodo al nia rulebla. Kirigami ne estas inkluzivita ĉi tie ĉar ni uzas nur ĝian QML-modulon.
es: [target_link_libraries](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) enlaza las bibliotecas de C++ usadas en el código fuente con nuestro ejecutable. Kirigami no está incluido aquí porque estamos usando solo su módulo QML.
nl: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) koppelt de C++-bibliotheken, die gebruikt worden in onze code, aan ons uitvoerbare bestand. Kirigami is hier niet meegenomen omdat we alleen zijn QML-module gebruiken.
sl: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) povezuje knjižnice C++, uporabljene v naši kodi, z našo izvršljivo datoteko. Kirigami tukaj ni vključen, ker uporabljamo samo njegov modul QML.
sv: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) länkar C++ biblioteken som används i vår kod till vårt körbara program. Kirigami inkluderas inte här eftersom vi bara använder dess QML-modul.
uk: [target_link_libraries()](https://cmake.org/cmake/help/latest/command/target_link_libraries.html) пов'язує ціль із бібліотеками C++, які використовуються у нашому коді для створення виконуваного файла. Kirigami не включено сюди, оскільки ми використовуємо лише її модуль QML.

source: [install()](https://cmake.org/cmake/help/latest/command/install.html) installs the executable to the system.
ca: [install()](https://cmake.org/cmake/help/latest/command/install.html) instal·la l'executable en el sistema.
eo: [install()](https://cmake.org/cmake/help/latest/command/install.html) instalas la plenumeblan al la sistemo.
es: [install()](https://cmake.org/cmake/help/latest/command/install.html) instala el ejecutable en el sistema.
nl: [install()](https://cmake.org/cmake/help/latest/command/install.html) installeert het uitvoerbare bestand in het systeem.
sl: [install()](https://cmake.org/cmake/help/latest/command/install.html) namesti izvršljivo datoteko v sistem.
sv: [install()](https://cmake.org/cmake/help/latest/command/install.html) installerar det körbara programmet på systemet.
uk: [install()](https://cmake.org/cmake/help/latest/command/install.html) встановлює виконуваний файл у системі.

source: The documentation for the two ECM commands can be found in the [extra-cmake-modules API for ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
ca: La documentació de les dues ordres ECM es pot trobar a l'[API dels extra-cmake-modules per a l'ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
eo: La dokumentaro por la du ECM-komandoj troviĝas en la [extra-cmake-modules API for ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
es: La documentación de las dos órdenes ECM se puede encontrar en la [API de extra-cmake-modules para ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
nl: De documentatie voor de twee ECM commando's is te vinden in de [extra-cmake-modules API voor ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
sl: Dokumentacijo za oba ukaza ECM lahko najdete v [API-ju extra-cmake-modules za ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
sv: Dokumentationen för de två ECM-kommandona finns i [extra-cmake-modules programmeringsgränssnitt för ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
uk: Документацію з двох команд ECM можна знайти у [програмному інтерфейсі extra-cmake-modules для ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).

source: The call to `ecm_add_qml_module()` was used here to modify the traditional C++ source code executable target and turn it into something that can accept QML files and C++ source code that is accessible from QML in what is called [using the executable as backing target for a QML module](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). This means the QML files are run directly as part of the application, which is often the case for applications.
ca: La crida a `ecm_add_qml_module()` s'ha fet servir aquí per a modificar l'objectiu de l'executable del codi font C++ tradicional i convertir-lo en alguna cosa que pugui acceptar fitxer QML i codi font C++ source que sigui accessible des del QML en el que s'ha cridat [usant l'executable com a objectiu de reserva per a un mòdul QML](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Això vol dir que els fitxers QML s'executen directament com a part de l'aplicació, que sovint és el cas de les aplicacions.
eo: La alvoko al `ecm_add_qml_module()` estis uzata ĉi tie por modifi la tradician C++-fontkodon plenumeblan celon kaj igi ĝin io kiu povas akcepti QML-dosierojn kaj C++-fontkodon kiu estas alirebla de QML en kio estas nomita [uzante la ruleblan kiel subtenan celon. por QML-modulo](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Ĉi tio signifas, ke la QML-dosieroj estas rulitaj rekte kiel parto de la aplikaĵo, kio ofte okazas por aplikoj.
es: La llamada a `ecm_add_qml_module()` se ha usado aquí para modificar el destino ejecutable del código fuente C++ tradicional y convertirlo en algo que pueda aceptar archivos QML y código fuente C++ al que se pueda acceder desde QML en lo que se denomina [uso del ejecutable como destino de respaldo para un módulo QML](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Esto significa que los archivos QML se ejecutan directamente como parte de la aplicación, como suele ser el caso de las aplicaciones.
nl: De aanroep van `ecm_add_qml_module()` was hier gebruikt om het uitvoerbare doel van de traditionele C++ broncode te wijzigen en het om te zetten in iets dat QML-bestanden en C++ broncode kan accepteren die toegankelijk is vanuit QML in wat wordt genoemd [het uitvoerbare bestand als achtergronddoel gebruiken voor een QML-module](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Dit betekent dat de QML-bestanden direct worden uitgevoerd als onderdeel van de toepassing, wat vaak het geval is voor toepassingen.
sl: Klic `ecm_add_qml_module()` je bil tukaj uporabljen za spreminjanje tradicionalnega izvršljivega cilja izvorne kode C++ in ga spremeni v nekaj, kar lahko sprejme datoteke QML in izvorno kodo C++, ki je dostopna iz QML v tako imenovanem [uporaba izvršljive datoteke kot podpornega cilja za modul QML](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). To pomeni, da se datoteke QML izvajajo neposredno kot del aplikacije, kar pogosto velja za aplikacije.
sv: Anropet till `ecm_add_qml_module()` användes här för att modifiera det traditionella körbara målet för C++ källkoden och omvandla det till något som kan acceptera QML-filer och C++ källkod som är åtkomlig från QML i vad som kallas [med den körbara filen som stödmål för en QML-modul](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Det innebär att QML-filerna körs direkt som en del av programmet, vilket ofta är fallet för program.
uk: Виклик `ecm_add_qml_module()` тут було використано, щоб модифікувати традиційну ціль збирання початкового коду C++, виконуваний файл, і перетворити її на щось, що може приймати файли QML, і початковий код C++ буде доступним з QML у межах того, що називається [використання виконуваного файла як резервної цілі для модуля QML](https://doc.qt.io/qt-6/qt-add-qml-module.html#executable-as-a-qml-module). Це означає, що файли QML запускаються безпосередньо як частина програми, що часто буває для програм.

source: You may also create a separate QML module that does not use the executable as backing target using `ecm_add_qml_module()`. In this case, you'd create a library target using [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), link it to an existing executable target using `target_link_libraries()`, and in addition to installing the library with `install()` you will need to finalize the QML module with [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) so it can generate two files: `qmldir` and `qmltypes`. These files are used by QtQuick applications to find separate QML modules.
ca: També podeu crear un mòdul QML separat que no usi l'executable com a objectiu de reserva utilitzant `ecm.add.qml.module()`. En aquest cas, hauríeu de crear un objectiu de biblioteca utilitzant [add.library()](https://cmake.org/cmake/help/latest/command/add_library.html), enllaçar-lo a un objectiu executable existent utilitzant `target_link_libraries()`, i a més d'instal·lar la biblioteca amb `install()` haureu de finalitzar el mòdul QML amb [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) perquè pugui generar dos fitxers: `qmldir` i `qmltypes`. Aquests fitxers són utilitzats per les aplicacions QtQuick per a trobar mòduls QML separats.
eo: Vi ankaŭ povas krei apartan QML-modulon, kiu ne uzas la plenumeblan kiel subtenan celon uzante `ecm_add_qml_module()`. En ĉi tiu kazo, vi kreus bibliotekan celon uzante [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), ligus ĝin al ekzistanta plenumebla celo uzante `target_link_libraries( )`, kaj krom instali la bibliotekon per `install()` vi devos fini la QML-modulon per [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) do ĝi povas generi du dosierojn: `qmldir` kaj `qmltypes`. Ĉi tiuj dosieroj estas uzataj de QtQuick-aplikoj por trovi apartajn QML-modulojn.
es: También puede crear un módulo QML independiente que no use el ejecutable como destino de respaldo mediante `ecm_add_qml_module()`. En este caso, crearía un destino de biblioteca mediante [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), lo enlazaría a un destino ejecutable existente mediante `target_link_libraries()` y, además de instalar la biblioteca con `install()`, deberá finalizar el módulo QML con [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) para que pueda generar dos archivos: `qmldir` y `qmltypes`. Las aplicaciones QtQuick usan estos archivos para buscar módulos QML independientes.
nl: U kunt ook een aparte QML-module aanmaken die niet het uitvoerbare bestand gebruikt als doel op de achtergrond met `ecm_add_qml_module()`. In zo'n geval zou u een bibliotheekdoel moeten aanmaken met [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html) en het koppelen aan een bestaand uitvoerbaardoel met `target_link_libraries()` en bovendien het installeren van de bibliotheek met `install()` dan moet u de QML-module afmaken met [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) het kan dus twee bestanden genereren: `qmldir` en `qmltypes`. Deze bestanden worden gebruikt door QtQuick toepassingen om aparte QML-modules te vinden.
sl: Ustvarite lahko tudi ločen modul QML, ki ne uporablja izvršljive datoteke kot podpornega cilja z uporabo `ecm_add_qml_module()`. V tem primeru bi ustvarili ciljno knjižnico z uporabo [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), jo povezali z obstoječim izvršljivim ciljem z uporabo `target_link_libraries( )` in poleg namestitve knjižnice z `install()` boste morali dokončati modul QML z [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html), tako da ustvari lahko dve datoteki: `qmldir` in `qmltypes`. Te datoteke uporabljajo aplikacije QtQuick za iskanje ločenih modulov QML.
sv: Man kan också skapa en separat QML-modul som inte använder den körbara filen som stödmål med hjälp av `ecm_add_qml_module()`. I det här fallet skulle man skapa ett biblioteksmål med [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), länka det till ett befintligt körbart mål med `target_link_libraries( )`, och förutom att installera biblioteket med `install()` också slutföra QML-modulen med [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html) så den kan generera två filer: `qmldir` och `qmltypes`. Filerna används av QtQuick-programmet för att hitta separata QML-moduler.
uk: Ви також можете створити окремий модуль QML, який не використовує виконуваний файл як резервну ціль, за допомогою `ecm_add_qml_module()`. У цьому випадку ви могли б створити ціль-бібліотеку з використанням [add_library()](https://cmake.org/cmake/help/latest/command/add_library.html), скомпонувати її із наявною ціллю — виконуваним файлом — за допомогою `target_link_libraries()`, і на додачу до встановлення бібліотеки за допомогою `install()` вам довелося б створити остаточну версію модуля QML за допомогою [ecm_finalize_qml_module()](https://api.kde.org/ecm/module/ECMQmlModule.html), так, щоб він міг створити два файли: `qmldir` і `qmltypes`. Ці файли програми QtQuick використовують для пошуку окремих модулів QML.

source: The method for creating a separate QML module is better exemplified in [Using separate files](/content/docs/getting-started/kirigami/introduction-separatefiles).
ca: El mètode per a crear un mòdul QML separat s'exemplifica millor a [Usar fitxers separats](/content/docs/getting-started/kirigami/introduction-separatefiles).
eo: La metodo por krei apartan QML-modulon estas pli bone ekzempligita en [Uzante apartajn dosierojn](/content/docs/getting-started/kirigami/introduction-separatefiles).
es: El método para crear un módulo QML separado se ejemplifica mejor en [Uso de archivos separados](/content/docs/getting-started/kirigami/introduction-separatefiles).
nl: De methode voor aanmaken van een aparte QML-module wordt beter geïllustreerd in [Aparte bestanden gebruiken](/content/docs/getting-started/kirigami/introduction-separatefiles).
sl: Metoda za ustvarjanje ločenega modula QML je bolje prikazana v [Uporaba ločenih datotek](/content/docs/getting-started/kirigami/introduction-separatefiles).
sv: Metoden för att skapa en separat QML-modul exemplifieras bättre i [Använda separata filer](/content/docs/getting-started/kirigami/introduction-separatefiles).
uk: Спосіб створення окремого модуля QML краще описано у розділі щодо [використання окремих файлів](/content/docs/getting-started/kirigami/introduction-separatefiles).

source: These are additions provided by extra-cmake-modules to make the use of [Qt declarative registration](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) (the [replacement to Qt resource files](https://doc.qt.io/qt-6/resources.html)) easier.
ca: Aquests són afegits proporcionats per extra-cmake-modules per a fer que l'ús del [registre declaratiu de les Qt](https://doc.qt.io/qt-6.7/cmake-build-qml-application.html) faciliti (la [substitució als fitxers de recursos de les Qt](https://doc.qt.io/qt-6/resources.html)).

source: These libraries should match the components that we included in our previous `CMakeLists.txt` file, otherwise these components will not be included and our application won't compile.
ca: Aquestes biblioteques han de coincidir amb els components que incloem en el nostre fitxer `CMakeLists.txt` anterior. En cas contrari, aquests components no s'inclouran i la nostra aplicació no compilarà.
eo: Ĉi tiuj bibliotekoj devus kongrui kun la komponantoj kiujn ni inkludis en nia antaŭa `CMakeLists.txt` dosiero, alie ĉi tiuj komponantoj ne estos inkluzivitaj kaj nia aplikaĵo ne kompiliĝos.
es: Estas bibliotecas deben coincidir con los componentes que incluimos en nuestro archivo `CMakeLists.txt` anterior; de lo contrario, estos componentes no se incluirán y nuestra aplicación no se compilará.
nl: Deze bibliotheken zouden overeen moeten komen met de componenten die we hebben ingevoegd in ons vorige bestand `CMakeLists.txt`, anders zullen deze componenten niet ingevoegd worden en zal onze toepassing niet compileren.
sl: Te knjižnice se morajo ujemati s komponentami, ki smo jih vključili v našo prejšnjo datoteko `CMakeLists.txt`, sicer te komponente ne bodo vključene in naša aplikacija se ne bo prevedla.
sv: Biblioteken ska motsvara komponenterna som vi inkluderade i vår tidigare `CMakeLists.txt`, annars inkluderas inte komponenterna och vårt program går inte att kompilera.
uk: Ці бібліотеки мають відповідати компонентам, які ми включили до нашого попереднього файла `CMakeLists.txt` — інакше ці компоненти не буде включено і нашу програму не можна буде зібрати.

source: The documentation for all three commands can be found in the [extra-cmake-modules API for ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
ca: La documentació de les tres ordres ECM es pot trobar a l'[API dels extra-cmake-modules per a l'ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
eo: La dokumentaro por ĉiuj tri komandoj troviĝas en la [extra-cmake-modules API for ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
es: La documentación de las tres órdenes se puede encontrar en la [API de extra-cmake-modules para ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
nl: De documentatie voor alle drie commando's is te vinden in de [extra-cmake-modules API voor ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
sl: Dokumentacijo za vse tri ukaze lahko najdete v [API-ju extra-cmake-modules za ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
sv: Dokumentationen för alla tre kommandon finns i [extra-cmake-modules programmeringsgränssnitt för ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
uk: Документацію до усіх трьох команд ECM можна знайти у [програмному інтерфейсі extra-cmake-modules для ECMQmlModule](https://api.kde.org/ecm/module/ECMQmlModule.html).
