Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The delegate on the other hand always need to have its dimensions set. Generally its dimensions are set to use only the full width of the view.
ca: D'altra banda, el delegat sempre ha de tenir les seves dimensions establertes. Generalment, les seves dimensions s'estableixen per a utilitzar només l'amplada completa de la vista.
eo: La delegito aliflanke ĉiam bezonas havi siajn dimensiojn fiksitaj. Ĝenerale ĝiaj dimensioj estas agordita por uzi nur la plenan larĝon de la vido.
es: Por otra parte, el delegado siempre debe tener definidas sus dimensiones. Generalmente, estas dimensiones se definen para que usen solo la anchura completa de la vista.
nl: Daarentegen moet bij een delegatie altijd de afmetingen opgegeven worden. Meestal worden de afmetingen daarvan zodanig ingesteld dat het alleen de volledige breedte van het venster gebruikt.
sl: Po drugi strani mora imeti delegat vedno nastavljene dimenzije. Na splošno so njegove mere nastavljene tako, da uporabljajo samo celotno širino pogleda.
sv: Delegaten måste å andra sidan alltid ha sina dimensioner definierade. Vanligtvis är dess dimensioner inställda att endast använda vyns fulla bredd.
uk: Для делегата, з іншого боку, завжди має бути встановлено розмірності. Загалом, його розмірності буде встановлено лише так, щоб використовувати усю ширину панелі перегляду.

source: Common mistakes
ca: Errors habituals
eo: Oftaj eraroj
es: Errores comunes
nl: Vaak gemaakte fouten
sl: Pogoste napake
sv: Vanliga misstag
uk: Типові помилки

source: The above means that delegates should not have bottom anchors, since the delegate doesn't need to have the same height as the view. In other words, you will probably never want to use `anchors.fill: parent`.
ca: L'anterior significa que els delegats no haurien de tenir àncores inferiors, ja que el delegat no necessita tenir la mateixa alçada que la vista. En altres paraules, probablement mai voldreu utilitzar `anchors.fill: parent`.
eo: Ĉi-supra signifas, ke delegitoj ne havu malsuprajn ankrojn, ĉar la delegito ne bezonas havi la saman altecon kiel la vido. Alivorte, vi verŝajne neniam volos uzi `ankroj.fill: parent`.
es: Lo anterior significa que los delegados no deben tener anclas inferiores, ya que el delegado no necesita tener la misma altura que la vista. En otras palabras, probablemente nunca querrá usar `anchors.fill: parent`.
nl: Bovengenoemde houdt in dat gedelegeerden geen ankers onderaan zouden moeten hebben, omdat de gedelegeerde niet dezelfde hoogte hoeft te hebben als het venster. Met andere woorden, u zal waarschijnlijk nooit `anchors.fill: parent` willen gebruiken.
sl: Zgoraj navedeno pomeni, da delegati ne bi smeli imeti spodnjih sider, saj ni treba, da ima delegat enako višino kot pogled. Z drugimi besedami, verjetno ne boste nikoli želeli uporabiti `anchors.fill: parent`.
sv: Ovanstående betyder att delegater inte ska ha förankringar längst ner, eftersom delegaten inte behöver ha samma höjd som vyn. Med andra ord, man vill förmodligen aldrig använda `anchors.fill: parent`.
uk: Вище сказане означає, що делегати не повинні мати нижніх прив'язок, оскільки делегат не повинен мати тієї самої висоти, що і панель перегляду. Іншими словами, у вас, ймовірно, ніколи не виникатиме потреби використовувати `anchors.fill: parent`.

source: Additionally, while it is possible to set its dimensions using the parent and anchors, which is usually the view's contentItem, like so:
ca: A més, encara que és possible establir les seves dimensions utilitzant el pare i les àncores, que normalment és el «contentItem» de la vista, així:
eo: Aldone, kvankam eblas agordi ĝiajn dimensiojn uzante la gepatron kaj ankrojn, kiu kutime estas la enhavo de la vido, tiel:
es: Además, aunque se pueden establecer sus dimensiones usando el padre y los anclajes, que generalmente es el contentItem de la vista, de la siguiente manera:
nl: Daarbij, ofschoon het mogelijk is om de afmetingen daarvan in te stellen door gebruik van de parent en ankers, wat is meestal de contentItem van de weergave, zoals op deze manier:
sl: Poleg tega je možno nastaviti njegove dimenzije s pomočjo nadrejenega elementa in sider, ki je običajno pogled contentItem, takole:
sv: Dessutom, även om det är möjligt att ställa in dimensionerna med hjälp av överliggande objekt och förankring, som vanligtvis är vyns contentItem, så här:
uk: Крім того, хоча можна встановити його розмірності за допомогою parent і прив'язок, яким, зазвичай, є contentItem панелі перегляду, ось так:

source: It is not guaranteed that the delegate's parent will be a view, and so it should be avoided. Instead, use the [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) attached property to point to the delegate's parent view:
ca: No està garantit que el pare del delegat sigui una vista, per tant, això ha d'evitar-se. En lloc d'això, utilitzeu la propietat adjunta [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) per a apuntar a la vista pare del delegat:
eo: Ne estas garantiite ke la gepatro de la delegito estos vido, kaj do ĝi devus esti evitita. Anstataŭe, uzu la [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) kunan proprecon por montri la gepatran vidon de la delegito:
es: No se garantiza que el padre del delegado sea una vista, por lo que debe evitarse. En lugar de ello, use la propiedad adjunta [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) para apuntar a la vista padre del delegado:
nl: Er is geen garantie dat de parent van de gedelegeerde een weergave heeft en moet daarom vermeden worden. Gebruik in plaats daarvan [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) verbonden eigenschap dat verwijst naar de weergave van de parent van de gedelegeerde:
sl: Ni zagotovljeno, da bo nadrejeni element delegata pogled, zato se mu je treba izogibati. Namesto tega uporabite priloženo lastnost [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop), da pokažete na nadrejeni pogled delegata:
sv: Det är inte garanterat att delegatens överliggande objekt är en vy, och det bör därför undvikas. Använd istället den bifogade egenskapen [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) för att peka på delegatens överliggande vy:
uk: Не гарантовано, що батьківським елементом делегата буде панель перегляду, і тому такого коду слід уникати. Замість цього, скористайтеся долученою властивістю [ListView.view](https://doc.qt.io/qt-6/qml-qtquick-listview.html#view-attached-prop) для вказування батьківської панелі перегляду делегата:

source: The most common use of a delegate is within a [Component](docs:qtqml;QtQml.Component), which does not instantiate the delegate immediately. When a view is constructed, the delegate is then used as a blueprint to make each item in the view.
ca: L'ús més comú d'un delegat es troba dins d'un [Component](docs:qtqml;QtQml.Component), que no instancia el delegat immediatament. Quan es construeix una vista, el delegat s'utilitza com a esquema per a fer cada element a la vista.
eo: La plej ofta uzo de delegito estas ene de [Component](docs:qtqml;QtQml.Component), kiu ne instantiigas la delegiton tuj. Kiam vido estas konstruita, la delegito tiam estas utiligita kiel skizo por fari ĉiun objekton en la vido.
nl: Een gedelegeerde word het meest gebruikt in een [Component](docs:qtqml;QtQml.Component), die de gedelegeerde niet onmiddellijk word gecreëerd. Als een weergave word geconstrueerd, dan word de gedelegeerden gebruikt als een blauwdruk voor elk item in de weergave.
sl: Najpogostejša uporaba delegata je znotraj [komponente](docs:qtqml;QtQml.Component), ki delegata ne instancira takoj. Ko je pogled izdelan, se delegat nato uporabi kot načrt za izdelavo vsakega elementa v pogledu.
sv: Den vanligaste användningen av en delegat är inom en [Component](docs:qtqml;QtQml.Component), som inte instansierar delegaten omedelbart. När en vy är konstruerad, används sedan delegaten som en ritning för att skapa varje objekt i vyn.
uk: Найпоширенішим використанням делегата є використання у межах [Component](docs:qtqml;QtQml.Component), що не створює екземпляра делегата негайно. При побудові панелі перегляду делегат буде використано як шаблон для створення усіх елементів на панелі перегляду.

source: While you can make your own custom components to be used as delegates without delegate-specific Qt APIs (for example, a Layout containing a few Items), QtQuick Controls does provide delegate APIs that are simpler to use:
ca: Tot i que podeu crear els vostres propis components personalitzats per a ser utilitzats com a delegats sense les API de les Qt específiques de delegats (per exemple, una disposició que conté alguns elements), els QtQuick Controls proporcionen les API de delegats que són més senzilles d'utilitzar:
eo: Dum vi povas fari viajn proprajn proprajn komponantojn por esti uzataj kiel delegitoj sen delegitaj specifaj Qt-API-oj (ekzemple, Aranĝo enhavanta kelkajn Erojn), QtQuick Controls disponigas delegitajn API-ojn pli simplajn uzeblajn:
nl: Ofschoon aangepaste componenten gemaakt kunnen worden die als gedelegeerden zonder gedelegeerde-specifieke Qt APIs (bijvoorbeeld een Layout met alleen een paar items) gebruikt kunnen worden, heeft QtQuick Controls gedelegeerde (delegate)-API's die eenvoudig te gebruiken zijn:
sl: Medtem ko lahko naredite svoje komponente po meri, ki jih boste uporabljali kot delegate brez API-jev Qt, specifičnih za delegate (na primer postavitev, ki vsebuje nekaj elementov), ​​QtQuick Controls ponuja API-je za delegate, ki so preprostejši za uporabo:
sv: Även om man kan skapa sina egna komponenter för att användas som delegater utan delegatspecifika Qt API:er (till exempel en layout som innehåller några objekt), tillhandahåller QtQuick Controls programmeringsgränssnitt för delegater som är enklare att använda:
uk: Хоча ви ви можете створювати власні нетипові компоненти, які буде використано як делегати без специфічних для делегата програмних інтерфейсів Qt (наприклад, компонування, що містить небагато записів Item), QtQuick Controls надає у ваше розпорядження програмні інтерфейси, якими простіше скористатися:

source: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegates with only text)
ca: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegats amb només text)
eo: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegitoj kun nur teksto)
es: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegados con texto solamente)
nl: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegeert met alleen tekst)
sl: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegati samo z besedilom)
sv: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (delegater med bara text)
uk: [ItemDelegate](docs:qtquickcontrols;QtQuick.Controls.ItemDelegate) (делегати, які містять лише текст)

source: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegates with a checkbox)
ca: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegats amb una casella de selecció)
eo: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegitoj kun markobutono)
es: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegados con una casilla de verificación)
nl: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) ((delegeert met een keuzevakje)
sl: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegati s potrditvenim poljem)
sv: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (delegater med en kryssruta)
uk: [CheckDelegate](docs:qtquickcontrols;QtQuick.Controls.CheckDelegate) (делегати з пунктом із позначкою)

source: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegates with a radio)
ca: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegats amb una opció)
eo: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegitoj kun radio)
es: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegados con una casilla de opción exclusiva)
nl: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegeert met een keuzerondje)
sl: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegati z radijem)
sv: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (delegater med en alternativknapp)
uk: [RadioDelegate](docs:qtquickcontrols;QtQuick.Controls.RadioDelegate) (делегати із варіантом вибору)

source: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegates with a switch)
ca: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegats amb un commutador)
eo: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegitoj kun ŝaltilo)
es: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegados con un interruptor)
nl: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegeert met een schakelaar)
sl: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegati s stikalom)
sv: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (delegater med en omkopplare)
uk: [SwitchDelegate](docs:qtquickcontrols;QtQuick.Controls.SwitchDelegate) (делегати з перемикачем)

source: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegates that can be swiped)
ca: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegats que es poden lliscar)
eo: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegitoj, kiujn oni povas svingi)
es: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegados que se pueden deslizar)
nl: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (gedelegeerde dat weggeveegd kan worden)
sl: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegati, ki jih je mogoče povleči)
sv: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (delegater som kan svepas)
uk: [SwipeDelegate](docs:qtquickcontrols;QtQuick.Controls.SwipeDelegate) (делегати, над якими можна проводити пальцем)

source: You should prefer using the upstream Qt delegates where possible.
ca: Hauríeu de preferir utilitzar els delegats originals de les Qt quan sigui possible.
eo: Vi devus preferi uzi la kontraŭfluajn Qt-delegitojn kie eblas.
es: Debería preferir el uso de los delegados propios de Qt siempre que sea posible.
nl: Het is raadzaam om waar mogelijk de upstream Qt gedelegeerden te gebruiken.
sl: Če je mogoče, raje uporabite delegate iz Qt toka navzgor.
sv: Man bör föredra att använda uppströms Qt-delegater där det är möjligt.
uk: Вам слід надавати перевагу використанню делегатів основної бібліотеки Qt там, де це можливо.

source: On top of these Qt delegates, Kirigami provides its own equivalents, with the added functionality of subtitles and icons:
ca: A sobre d'aquests delegats de les Qt, el Kirigami proporciona els seus propis equivalents, amb la funcionalitat afegida de subtítols i icones:
eo: Aldone al ĉi tiuj Qt-delegitoj, Kirigami disponigas siajn proprajn ekvivalentojn, kun la aldonita funkcieco de subtekstoj kaj piktogramoj:
es: Además de estos delegados de Qt, Kirigami proporciona sus propios equivalentes, con la funcionalidad añadida de subtítulos e iconos:
nl: Bovenop deze Qt gedelegeerden heeft Kirigami zijn eigen equivalenten, met de extra functionaliteit van subtitel en pictogrammen:
sl: Poleg teh delegatov Qt ponuja Kirigami svoje ekvivalente z dodano funkcijo podnapisov in ikon:
sv: Utöver dessa Qt-delegater tillhandahåller Kirigami sina egna motsvarigheter, med den extra funktionaliteten av undertexter och ikoner:
uk: Над цими делегатами Qt Kirigami надає у ваше розпорядження власні еквіваленти із доданими функціональними можливостями підзаголовків і піктограм:

source: The API ending with "Delegate" can be set as a direct delegate of the view, just like the previous examples that used Controls.ItemDelegate:
ca: L'API que acaba amb «Delegate» es pot definir com un delegat directe de la vista, igual que els exemples anteriors que utilitzaven Controls.ItemDelegate:
eo: La API finiĝanta per "Delegito" povas esti agordita kiel rekta delegito de la vido, same kiel la antaŭaj ekzemploj, kiuj uzis Controls.ItemDelegate:
nl: De API die eindigt met "Delegate" kan ingesteld worden als een direct gedelegeerde van de weergave, net zoals in de vorige voorbeelden die Controls.ItemDelegate gebruiken:
sl: API, ki se konča z "Delegate", lahko nastavite kot neposrednega delegata pogleda, tako kot v prejšnjih primerih, ki so uporabljali Controls.ItemDelegate:
sv: Programmeringsgränssnittet som slutar med "Delegate" kan anges som en direkt delegat i vyn, precis som de tidigare exemplen som använde Controls.ItemDelegate:
uk: Елементи програмного інтерфейсу, назви яких завершуються на «Delegate», можна встановлювати як безпосередні делегати панелі перегляду, як у попередніх прикладах, де використано Controls.ItemDelegate:

source: Both TitleSubtitle and IconTitleSubtitle are expected to be used to override a Qt delegate's contentItem, for example:
ca: Tant TitleSubtitle com IconTitleSubtitle s'espera que s'utilitzin per a substituir el «contentItem» d'un delegat de les Qt, per exemple:
eo: Kaj TitleSubtitle kaj IconTitleSubtitle estas atenditaj esti uzataj por superregi la enhavoItem de Qt-delegito, ekzemple:
nl: Er wordt verwacht dat zowel TitleSubtitle als IconTitleSubtitle worden gebruikt om een Qt delegate's contentItem te overschrijven, als voorbeeld:
sl: Tako TitleSubtitle kot IconTitleSubtitle naj bi se uporabljala za preglasitev contentItem delegata Qt, na primer:
sv: Både TitleSubtitle och IconTitleSubtitle förväntas användas för att överskrida en Qt-delegats contentItem, till exempel:
uk: Обидва, TitleSubtitle і IconTitleSubtitle, вважаються такими, які слід використовувати для перевизначення contentItem делегата Qt, приклад:

source: A practical example of using Kirigami delegates can be seen in the [ListItemTest file in the Kirigami Repository](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
ca: Es pot veure un exemple pràctic d'ús dels delegats del Kirigami al [fitxer ListItemTest al repositori del Kirigami](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
eo: Praktika ekzemplo pri uzado de Kirigami-delegitoj povas esti vidita en la [ListItemTest-dosiero en la Kirigami Deponejo](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
nl: Een praktisch voorbeeld van het gebruik van Kirigami gedelegeerden is te vinden in het [ListItemTest-bestand in de Kirigami Repository](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
sl: Praktični primer uporabe delegatov Kirigami si lahko ogledate v [datoteki ListItemTest v repozitoriju Kirigami](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
sv: Ett praktiskt exempel på att använda Kirigami-delegater kan ses i [filen ListItemTest i Kirigami-arkivet](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).
uk: Із практичним прикладом використання делегатів Kirigami можна ознайомитися у [файлі ListItemTest у сховищі Kirigami](https://invent.kde.org/frameworks/kirigami/-/blob/master/tests/ListItemTest.qml).

source: Page rows and page stacks
ca: Files de pàgines i piles de pàgines
eo: Paĝaj vicoj kaj paĝaj stakoj
es: Filas de páginas y pilas de páginas
fr: Rangées de pages et piles de pages
nl: Paginarijen en paginastapels
pl: Wiersze stron i stosy stron
pt: Linhas da página e pilhas de páginas
sl: Vrstice strani in skladi strani
sv: Sidrader och sidstaplar
uk: Ряди сторінок і стоси сторінок

source: Add flow to your application: Add, remove and replace pages in different ways
ca: Afegint flux a la vostra aplicació: afegir, eliminar i substituir pàgines de maneres diferents
eo: Aldonu fluon al via aplikaĵo: Aldonu, forigu kaj anstataŭigu paĝojn en malsamaj manieroj
es: Añadir flujo a la aplicación: añadir, eliminar y sustituir páginas de diferentes formas
fr: Ajoutez un flux à votre application : ajouter, supprimer et remplacer des pages de différentes manières.
nl: Iets vloeiendst aan uw toepassing toevoegen: pagina's op verschillende manieren toevoegen, verwijderen en vervangen
pl: Dodaj przepływ do swojej aplikacji: Dodawaj, usuwaj lub zastępuj strony na różne sposoby
pt: Adicionar fluxos: Adicionar, remover e substituir as páginas de diferentes formas
sl: Dodajanje toka v aplikacijo: dodajanje, odstranjevanje in zamenjava strani na različne načine
sv: Lägg till flöde i ditt program: Lägg till, ta bort och ersätt sidor på olika sätt
uk: Додавання у програму динаміки: різні способи додавання, вилучення і зміни сторінок

source: A row of pages
ca: Una fila de pàgines
eo: Vico da paĝoj
es: Una fila de páginas
nl: Een rij pagina's
pt: Uma fila de páginas
sl: Vrstica strani
sv: En rad med sidor
uk: Рядок сторінок

source: We have seen so far that one of the core components of a Kirigami window is a [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). A single page can envelop the whole screen of the application, or it can be shown together with other pages at the same time, if there is space.
ca: Fins ara hem vist que un dels components principals d'una finestra del Kirigami és un [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Una sola pàgina pot envoltar tota la pantalla de l'aplicació, o es pot mostrar juntament amb altres pàgines al mateix temps, si hi ha espai.
sl: Do sedaj smo videli, da je ena od osnovnih komponent okna Kirigami stran [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page). Ena stran lahko ovije celotni zaslon aplikacije, ali pa jo lahko prikazujemo skupaj z drugimi stranmi, če je še prostor.

source: Whenever a page gets added, or *pushed*, it appears to the right of the existing page(s), forming a row. This row of pages can be managed with the fittingly named [Kirigami.PageRow](docs:kirigami;org.kde.kirigami.PageRow).
ca: Quan s'afegeix una pàgina, o *s'empeny*, apareix a la dreta de les pàgines existents, formant una fila. Aquesta fila de pàgines es pot gestionar amb el que s'anomena correctament [Kirigami.PageRow](docs:kirigami;org.kde.kirigami.PageRow).
sl: Kadar koli je stran dodana ali *potisnjena*, se pojavi desno od obstoječih strani in tvori vrstico. To vrstico strani lahko upravljate z ustrezno naslovljeno vrsto strani [Kirigami.PageRow](docs:kirigami;org.kde.kirigami.PageRow).

source: A minimal page row with a single page could look like this:
ca: Una fila de pàgines mínima amb una pàgina única hauria de ser així:
eo: Minimuma paĝa vico kun ununura paĝo povus aspekti jene:
es: Una fila de páginas mínima con una sola página podría verse así:
nl: Een minimale paginarij met een enkele pagina zou er uit kunnen zien als:
pt: Uma linha da página mínima com uma única página deverá ser semelhante ao seguinte:
sl: Minimalna vrstica strani z eno stranjo bi lahko bila videti tako:
sv: En minimal sidrad med en enda sida skulle kunna se ut så här:
uk: Мінімальний рядок сторінок із однією сторінкою має виглядати ось так:
