Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![Global drawer as a menu on the desktop](/docs/use/kirigami/components-drawers/globaldrawer_menu.png)
fr: ![Un tiroir global comme menu sur le bureau](/docs/use/kirigami/components-drawers/globaldrawer_menu.png)

source: Banners
fr: Bannières
pl: Strony oddzielające
pt: Separadores

source: Banners allow you to display a title and an icon at the top of your global drawer (even above the header).
fr: Les bannières vous permettent d'afficher un titre et une icône en haut de votre tiroir global (même au-dessus de l'en-tête).
pl: Bannery umożliwiają wyświetlanie tytułu oraz ikony na górze globalnej półki (nawet powyżej nagłówka).
pt: Os separadores permitem-lhe mostrar um título e um ícone no topo da sua área global (mais acima do cabeçalho).

source: Titles, set with the `title` property, can be used to pretty up your global drawer and make it seem less sparse. More importantly, it can remind your users that this is a global and app-wide drawer rather than a local drawer.
fr: Les titres, définis avec la propriété « title », peuvent être utilisés pour embellir votre tiroir global et le rendre moins clairsemé. Plus important encore, il peut rappeler à vos utilisateurs qu'il s'agit d'un tiroir global et à l'échelle de l'application plutôt que d'un tiroir local.
pl: Tytuły, ustawione właściwością `title`, mogą być użyte do upiększenia twojej globalnej półki i sprawić, że będzie ona wyglądać mniej rozrzedzona. Najważniejsze jednak to to, że będzie przypominać twoim użytkownikom, że jest to globalna, a nie lokalna półka.

source: There is also a `titleIcon` property, which can be paired with your title to make the global drawer even more aesthetically pleasing. This icon will be placed to the left of the title.
fr: Il existe également une propriété « titleIcon » pouvant être associée à votre titre pour rendre le tiroir global encore plus esthétique. Cette icône sera placée à gauche du titre.
pl: Istnieje także właściwość `titleIcon`, którą można sparować z twoim tytułem, aby uczynić globalną półkę jeszcze bardziej estetyczną. Ikona ta zostanie umieszczona po lewej stronie tytułu.

source: ![Global drawer with title and icon in banner](/docs/use/kirigami/components-drawers/globaldrawer-banner.png)
fr: ! [Tiroir global avec titre et icône dans la bannière](/docs/use/kirigami/components-drawers/globaldrawer-banner.png)

source: The `titleIcon` property takes names for system-wide icons per the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application, or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
fr: La propriété « titleIcon » prend les noms des icônes du système selon la spécification de FreeDesktop. Ces icônes et leurs noms peuvent être affichés avec l'application CuttleFish de KDE, ou en visitant la page de [spécification des nommages d'icônes de FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pl: Właściwość `titleIcon` przyjmuje nazwy ikon systemowych zgodnych z wytycznymi FreeDesktop. Ikony te i ich nazwy można obejrzeć w aplikacji KDE o nazwie CuttleFish lub odwiedzając [wytyczne nazywania ikon we FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: However, by default, banners are only visible on mobile environments. You can change this by setting the global drawer component's `bannerVisible` property to `true`.
fr: Toutefois, par défaut, les bannières ne sont visibles que sur les environnements mobiles. Vous pouvez changer cela en définissant la propriété « bannerVisible » du composant global du tiroir à « True ».
pl: Jednakże, domyślnie, banery są widoczne tylko na urządzeniach przenośnych. Możesz to zmienić ustawiając właściwość składnika globalnej półki `bannerVisible` na `true`.

source: Modal drawers darken the rest of the application and, like overlay sheets, will be dismissed when clicking on a darkened area.
fr: Les tiroirs modaux assombrissent le reste de l'application et, comme les feuilles de recouvrement, sont rejetés lors d'un clic sur une zone assombrie.
pl: Modalne półki przyciemniają resztę aplikacji oraz, tak jak arkusze nakładkowe, zostaną odwołane po naciśnięciu na przyciemnionym obszarze.

source: Inline drawers allow the user to still interact with the rest of the application without being dismissed, and do not darken other areas.
fr: Les tiroirs intégrés permettent à l'utilisateur de continuer à interagir avec le reste de l'application sans être renvoyé et n'assombrissent pas les autres zones.
pl: Półki w wierszu nadal umożliwiają użytkownikowi oddziaływać na resztę aplikacji bez ich odwołania i nie przyciemniają innych obszarów.
pt: As áreas incorporadas permitem ao utilizador continuar a interagir com o resto da aplicação sem que as feche, não escurecendo as outras áreas.

source: These two drawers are so similar because they are, in fact, the same Kirigami component: `Kirigami.OverlayDrawer`. Important properties of this component to keep in mind:
fr: Ces deux tiroirs sont si semblables car ils sont, en fait, le même composant de Kirigami : « Kirigami.OverlayDrawer ». Les propriétés importantes de ce composant à conserver à l'esprit :
pl: Te dwie półki są takie podobne do siebie, bo są one tymi samymi składnikami Kirigami: `Kirigami.OverlayDrawer`. Ważnymi właściwościami tego składnika, o których warto pamiętać, to:

source: `modal` controls whether the drawer will be modal or inline depending on a boolean value
fr: « modal » contrôle si le tiroir sera modal ou intégré, selon sa valeur booléenne.
pl: `modal` określa, czy półka będzie modalna lub w wierszu, w zależności od wartości logicznej

source: `edge` controls which edge of the application window the drawer will appear on; options for this property are `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge`, and `Qt.LeftEdge`
fr: Le paramètre « edge » contrôle le bord de la fenêtre de l'application sur lequel le tiroir apparaîtra. Les options pour cette propriété sont « Qt.TopEdge », « Qt.RightEdge », « Qt.BottomEdge » et « Qt.LeftEdge ».
pl: `edge` określa na jakiej krawędzi okna aplikacji pojawi się półka; możliwe wartości dla tej właściwości to `Qt.TopEdge`, `Qt.RightEdge`, `Qt.BottomEdge` oraz `Qt.LeftEdge`

source: `contentItem` contains the component that will form the content of your drawer
fr: « contentItem » contient le composant qui formera le contenu de votre tiroir.
pl: `contentItem` zawiera składnik, który będzie stanowił treść naszej półki

source: Modal drawer on the bottom edge of the screen.
fr: Tiroir modal sur le bord inférieur de l'écran.
pl: Modalna półka na dolnej krawędzi ekranu.

source: Inline drawer on the bottom edge of the screen.
fr: Tiroir intégré sur le bord inférieur de l'écran.
pl: Półka w wierszu na dolnej krawędzi ekranu.

source: A usecase for overlay bottom drawers: NeoChat
fr: Un cas d'utilisation pour les tiroirs à fond superposé : NeoChat
pl: Przypadek użycia dolnych półek nakładkowych: NeoChat

source: NeoChat uses bottom overlay drawers to provide user with a number of actions they can perform on a message they have long-pressed. Here is a simplified example of what that looks like:
fr: NeoChat utilise des tiroirs superposés en bas de page pour proposer aux utilisateurs un certain nombre d'actions pouvant effectuer sur un message sur lequel ils ont réalisés un appui long. Voici un exemple simplifié de ce à quoi cela ressemble :
pl: NeoChat używa półek nakładkowych na dole, aby dać użytkownikom kilka działań, które mogą oni wykonać na wiadomości, którą długo przycisnęli. Oto uproszczony przykład tego, co to robi:

source: Message information
fr: Informations sur le message
pl: Wiadomość powiadamiająca
pt: Informação da mensagem

source: Message actions
fr: Actions de messages
pl: Działania wiadomości
pt: Acções da mensagem

source: Form Layouts
fr: Dispositions de formes
pl: Układy formularzy

source: `Kirigami.FormLayout` components make it easy for you to create forms that conform to the KDE Human Interface Guidelines. They are optimal for settings dialogs and for large groups of controls and input fields that are related to each other.
fr: Les composants « Kirigami.FormLayout » vous permettent de créer facilement des formulaires, conformes aux directives de l'interface utilisateur de KDE. Ils sont optimaux pour les paramètres des boîtes de dialogue et pour les grands groupes de contrôles et de champs de saisie liés les uns aux autres.
pl: Składniki `Kirigami.FormLayout` ułatwiają ci tworzenie formularzy, które są zgodne z Przewodnikiem po Interfejsach Ludzkich KDE. Są optymalne do okien ustawień i dużych grup rzeczy obsługujących i pól wprowadzania z nimi związanych.

source: When provided with enough space, form layouts will take up two columns. The column on the left will be occupied by the labels provided for the form's children components, while the right will be taken up by the children itself. In more space-constrained windows (or on mobile), forms will consist of a single vertical column with children components' labels being placed above their respective component.
fr: Lorsqu'ils disposent de suffisamment d'espace, les dispositions de formulaire s'organisent en deux colonnes. La colonne de gauche sera occupée par les étiquettes des composants fils du formulaire, tandis que la colonne de droite sera occupée par les fils eux-mêmes. Dans les fenêtres où l'espace est plus restreint (ou sur les mobiles), les formulaires seront constitués d'une seule colonne verticale, les étiquettes des composants fils étant placées au-dessus de leur composant correspondant.
pl: Układy formularzy zajmą dwie kolumny, gdy będą miały na to wystarczająco miejsca. Kolumna po lewej będzie zawierać etykiety dane elementom podrzędnym formularza, podczas gdy ta po prawej będzie zawierać same elementy. W bardziej ograniczonych powierzchniowo oknach (lub na urządzeniach przenośnych) formularze będą składać się z pojedynczej pionowej kolumny z etykietami elementów, znajdującymi się ponad nimi.

source: `Kirigami.FormLayout` components are similar in use to QtQuick Layout components such as `ColumnLayout` or `RowLayout`. The child components will be automatically arranged according to the size available to the form layout.
fr: Les composants « Kirigami.FormLayout » sont similaires dans leur utilisation aux composants QtQuick Layout tels que « ColumnLayout » ou « RowLayout ». Les composants fils seront automatiquement disposés en fonction de la taille disponible pour la disposition du formulaire.
pl: Składniki `Kirigami.FormLayout` są podobne do składników układu QtQuick takich jak `ColumnLayout` czy `RowLayout`. Składniki podrzędne zostaną samoczynnie ułożone na podstawie dostępnego rozmiaru w układzie formularza.

source: Children of a `Kirigami.FormLayout` have a property named `Kirigami.FormData.label`. This property lets you set the label that will be provided for the child component in question.
fr: Les fils d'un objet « Kirigami.FormLayout » ont une propriété nommée « Kirigami.FormData.label ». Cette propriété vous permet de définir l'étiquette à fournir au composant fils en question.
pl: Rzeczy należące do `Kirigami.FormLayout` mają właściwość o nazwie `Kirigami.FormData.label`. Ta właściwość umożliwia ci ustawienie etykiety, która zostanie przekazana rzeczom podrzędnym.

source: ![A simple formlayout](/docs/use/kirigami/components-formlayouts/formlayouts-simple.png)
fr: ![Une disposition simple de formulaire](/docs/use/kirigami/components-formlayouts/formlayouts-simple.png)

source: FormLayouts can also be divided into sections. Setting where a section starts is as easy as setting a child component's `Kirigami.FormData.isSection` to true. This will provide the component with some extra margin at the top to demarcate the start of the new section.
fr: Les objets « FormLayouts » peuvent également être divisés en sections. Définir où commence une section est aussi simple que de définir à la valeur « True » de l'objet « Kirigami.FormData.isSection » d'un composant fils. Cela fournira au composant une marge supplémentaire en haut pour délimiter le début de la nouvelle section.
pl: FormLayouts także mogą być podzielone na obszary. Określenie początku obszaru jest takie proste jak ustawienie właściwości w podrzędnym składniku `Kirigami.FormData.isSection` na true. Zapewni to składnikowi dodatkowy margines na górze, aby zaznaczyć początek nowego obszaru.

source: `Kirigami.Separator` components are best suited for starting new sections. A `Kirigami.Separator` will draw a thin horizontal line, demarcating the end of a section. If you would rather not have a line drawn between sections, you can use a standard QML `Item` property. Alternatively you could use the `Kirigami.FormData.isSection` property on any other component.
fr: Les composants « Kirigami.Separator » sont les mieux adaptés pour démarrer de nouvelles sections. Un objet « Kirigami.Separator » dessinera une fine ligne horizontale, délimitant la fin d'une section. Si vous ne souhaitez pas qu'une ligne soit tracée entre les sections, vous pouvez utiliser une propriété QML « Item » standard. Alternativement, vous pouvez également utiliser la propriété « Kirigami.FormData.isSection » sur tout autre composant.
pl: Do rozpoczynania nowych obszarów, najbardziej nadają się składniki `Kirigami.Separator`. `Kirigami.Separator` narysuje cienką linię w poziomie, znacząc koniec obszaru. Jeśli nie chcesz, aby taka linia była rysowana pomiędzy obszarami, to możesz użyć standardowej własności QML `Item`. Zamiennie możesz użyć własności `Kirigami.FormData.isSection` na innym składniku.

source: However, this is not recommended. On components where `Kirigami.FormData.isSection` is set to true, the label text provided for this component's `Kirigami.FormData.label` property will be displayed as the section's header text. **This does not apply to every component, hence the recommendation that you use `Kirigami.Separator` or `Item` components in places where you would like to use a header text.** This header text is larger than the normal label text, and provides users with a nice visual cue of what the form layout section is about.
fr: Toutefois, cela n'est pas recommandé. Sur les composants où « Kirigami.FormData.isSection » est positionné à la valeur « True », le texte de l'étiquette fourni pour la propriété « Kirigami.FormData.label » de ce composant s'affichera comme le texte d'en-tête de la section. **Ceci ne s'applique pas à tous les composants, d'où la recommandation d'utiliser les composants « Kirigami.Separator » ou « Item » aux endroits où vous souhaitez utiliser un texte d'en-tête**. Ce texte d'en-tête est plus grand que le texte normal de l'étiquette et donne aux utilisateurs un bon indice visuel de l'objet de la section de mise en page du formulaire.
pl: Jednakże, nie jest to zalecane. W składnikach, w których `Kirigami.FormData.isSection` jest ustawione na prawdę, tekst etykiety wpisanej we własności `Kirigami.FormData.label` zostanie wyświetlony jako tekst nagłówka obszaru. **Nie jest tak z każdym składnikiem, stąd zalecamy używanie składników `Kirigami.Separator` lub `Item` w miejscach, w których chciałbyś używać tekstu nagłówkowego.** Ten tekst nagłówkowy jest większy niż tekst zwyczajnej etykiety i powiadamia użytkownika o tym, o czym jest dany obszar.

source: ![A formlayout with sections](/docs/use/kirigami/components-formlayouts/formlayouts-sections.png)
fr: ![Une disposition de formulaire avec des sections](/docs/use/kirigami/components-formlayouts/formlayouts-sections.png)

source: A handy feature of `Kirigami.FormLayout` is that you can add checkboxes to its children. This can be useful in settings pages where you might want to let the user enable or disable a setting, and also want the user to provide some extra information in a component such as a textfield.
fr: Une fonctionnalité pratique de l'objet « Kirigami.FormLayout » est que vous pouvez ajouter des cases à cocher à ses fils. Cela peut être utile dans les pages de configuration où vous souhaitez laisser l'utilisateur activer ou désactiver un paramètre, tout en lui demandant de fournir des informations supplémentaires dans un composant tel qu'un champ de texte.
pl: Przydatną cechą `Kirigami.FormLayout` jest to, że możesz dodawać pola zaznaczane do jego rzeczy podrzędnych. Przydaje się to na stronach ustawień, gdzie chcesz dać użytkownikowi możliwość włączania lub wyłączania ustawień, a także gdy chcesz od użytkownika dodatkowych szczegółów w składnikach takich jak pola tekstowe.

source: ![A formlayout with checkable child](/docs/use/kirigami/components-formlayouts/formlayouts-checkable.png)
fr: ![Une disposition de formulaire avec un fil pouvant être coché](/docs/use/kirigami/components-formlayouts/formlayouts-checkable.png)

source: If you would rather have your form layout stay consistent regardless of your application's environment, you can use the `wideMode` property of the `Kirigami.FormLayout` component. `wideMode` is a boolean property:
fr: Si vous préférez que la mise en page du formulaire reste cohérente quel que soit l'environnement de votre application, vous pouvez utiliser la propriété « wideMode » du composant « Kirigami.FormLayout ». La propriété « wideMode » est booléenne :
pl: Jeśli chciałbyś, aby twój układ formularza pozostawał spójny, niezależnie od otoczenia aplikacji, to możesz użyć właściwości `wideMode` składnika `Kirigami.FormLayout`. `wideMode` jest własnością logiczną:

source: ![A formlayout with forced mobile layout](/docs/use/kirigami/components-formlayouts/formlayouts-widemode.png)
fr: ! [Une disposition de formulaire, forcée pour périphérique mobile](/docs/use/kirigami/components-formlayouts/formlayouts-widemode.png)

source: `Kirigami.InlineMessage` components have two important properties to be mindful of:
fr: Les composants « Kirigami.InlineMessage » possèdent deux propriétés importantes dont il faut tenir compte :
pl: Składniki `Kirigami.InlineMessage` zawierają dwie ważne właściwości, o których warto pamiętać:

source: `visible`: by default this is set to false, so that the message only appears when you explicitly want it to. This can be overridden if you wish by setting it to true. When a hidden inline message is set to be visible, you get a nice animation.
fr: « visible » : par défaut, ceci est défini à « False », de façon à ce que le message n'apparaisse que lorsque que vous le souhaitez explicitement. Ceci peut être écraser si vous souhaitez le définir à « True ». Quand une message masqué intégré est défini comme devant être visible, vous obtiendrez une agréable animation.
pl: `visible`: domyślnie jest to ustawione na false, tak aby wiadomość pojawiała się tylko wtedy, gdy wyraźnie tego chcesz. Można to zmienić jeśli chcesz, ustawiając ją na true. Gdy ukryta wiadomość w wierszu jest ustawiona na widoczną, to będziesz widzieć ładną animację.

source: `text`: here is where you set the text of your inline message.
fr: « text » : c'est ici que vous définissez le texte de votre message intégré.
pl: `text`: to miejsce, gdzie nadajesz tekst swojej wiadomości w treści.

source: ![A simple inline message and button](/docs/use/kirigami/components-inlinemessages/inlinemessages-simple.png)
fr: ! [Un message et un bouton simples et intégrés](/docs/use/kirigami/components-inlinemessages/inlinemessages-simple.png)

source: Standard inline messages are like the ones above: they have a blue background and a default icon. We can change that with the `type` property, which lets us set our inline message to a different type. There are four types we can choose from:
fr: Les messages intégrés standard sont comme ceux ci-dessus : ils ont un fond bleu et une icône par défaut. ut. Nous pouvons changer cela avec la propriété « type », qui nous permet de définir un autre type de message en ligne. Il existe quatre types parmi lesquels nous pouvons choisir parmi quatre types :
pl: Standardowe wiadomości w wierszu są takie jak te powyżej: mają niebieskie tła i domyślną ikonę. Możemy to zmienić poprzez właściwość `type`, która umożliwi nam ustawienie naszej wiadomości w treści na inny rodzaj. Istnieją cztery rodzaje do wyboru:

source: ![Different inline message types](/docs/use/kirigami/components-inlinemessages/inlinemessages-types.png)
fr: ![Des types de messages intégrés différents](/docs/use/kirigami/components-inlinemessages/inlinemessages-types.png)

source: ![An inline message with rich text](/docs/use/kirigami/components-inlinemessages/inlinemessages-richtext.png)
fr: ! [Un message intégré avec texte enrichi](/docs/use/kirigami/components-inlinemessages/inlinemessages-richtext.png)

source: You can also customise the icon that appears on the top-left of your message by providing a system icon name for the `icon.source` property. These icon names should correspond to icons installed on your system; you can use an application such as Cuttlefish to browse and search the icons available on your system, and what their names are.
fr: Vous pouvez également personnaliser l'icône apparaissant en haut à gauche de votre message, en fournissant un nom d'icône système avec la propriété « icon.source ». Ces noms d'icônes doivent correspondre à des icônes installées sur votre système. Vous pouvez utiliser une application telle que Cuttlefish pour parcourir et rechercher les icônes disponibles sur votre votre système, ainsi que leurs noms.
pl: Możesz także ustawić ikonę, która pojawia się w górnym lewym narożniku twojej wiadomości, określając nazwę ikony we właściwości `icon.source`. Nazwy tych ikon powinny odpowiadać nazwą ikon wgranych w twoim systemie; możesz użyć takiego narzędzia jak Cuttlefish do przeglądania i wyszukiwania ikon dostępnych na twoim systemie, a także do odczytania ich nazw.

source: ![An inline message with a specified icon](/docs/use/kirigami/components-inlinemessages/inlinemessages-icon.png)
fr: ! [Un message intégré avec une icône spécifiée](/docs/use/kirigami/components-inlinemessages/inlinemessages-icon.png)

source: If your messages need to be interactive, you can attach Kirigami actions to your inline messages. Like with pages, you can do this by setting the inline message's `actions` property to either a `Kirigami.Action` or an array containing `Kirigami.Action` components.
fr: Si vos messages doivent être interactifs, vous pouvez associer des actions de Kirigami à vos messages intégrés. Comme pour les pages, vous pouvez le faire en définissant la propriété « actions » du message intégré, soit grâce à un objet « Kirigami.Action », soit grâce un tableau contenant des composants « Kirigami.Action ».
pl: Jeśli twoje wiadomości muszą być interaktywne, to możesz doczepić działania Kirigami do swoich wiadomości w wierszu. Tak jak w przypadku stron, możesz to zrobić ustawiając właściwość wiadomości w wierszu `actions` na albo `Kirigami.Action` albo macierz zawierającą składniki `Kirigami.Action`.

source: ![An inline message with two actions](/docs/use/kirigami/components-inlinemessages/inlinemessages-actions.png)
fr: ! [Un message intégré avec actions](/docs/use/kirigami/components-inlinemessages/inlinemessages-actions.png)

source: By default, this close button is hidden, but this can be overridden by setting the `showCloseButton` property to `true`.
fr: Par défaut, le bouton de fermeture est masqué, mais il est possible de le remplacer en affectant la valeur « True » à la propriété « showCloseButton ».
pl: Domyślnie, ten przycisk zamykania jest ukryty, lecz można to zmienić, ustawiając właściwość `showCloseButton` na `true`.
