Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The [PageRow](docs:kirigami2;PageRow) is a container that lays out items horizontally in a row. If all child items don't fit in the [PageRow](docs:kirigami2;PageRow), it will behave like a [`Flickable`](https://doc.qt.io/qt-5/qml-qtquick-flickable.html) surface and will become a horizontal scrollable view of columns.
fr: L'objet [PageRow](docs:kirigami2;PageRow) est un conteneur disposant les éléments horizontalement dans une rangée. Si tous les éléments fils ne tiennent pas dans la [PageRow](docs:kirigami2;PageRow), celle-ci se comportera comme une surface [ « Flickable » ](https://doc.qt.io/qt-5/qml-qtquick-flickable.html) et deviendra une vue en colonnes pouvant défiler horizontalement.
pl: [PageRow](docs:kirigami2;PageRow) jest pojemnikiem, który rozmieszcza nasze rzeczy w poziomie w wierszu. Jeśli rzeczy podrzędne nie mieszczą się w [PageRow](docs:kirigami2;PageRow), to będzie zachowywać się jak powierzchnia [`Flickable`](https://doc.qt.io/qt-5/qml-qtquick-flickable.html) i stanie się widokiem kolumn przewijanych w poziomie.

source: A [PageRow](docs:kirigami2;PageRow) can show a single page or several of them as columns, depending on the window width. On a phone, a single column will be viewable, while on a tablet or a desktop more than one column should be visible at once.
fr: Un objet [PageRow](docs:kirigami2;PageRow) peut afficher une seule page ou plusieurs sous forme de colonnes, selon la largeur de la fenêtre. Sur un téléphone, une seule colonne sera visible, tandis que sur une tablette ou un ordinateur de bureau, plusieurs colonnes devraient être visibles à la fois.
pl: [PageRow](docs:kirigami2;PageRow) może pokazać pojedynczą stronę lub kilka stron w kolumnach, w zależności od szerokości okna. Na telefonie, będzie wyświetlana pojedyncza kolumna, podczas gdy na tablecie lub komputerze biurkowym powinna być wyświetlana więcej niż jedna kolumna na raz.

source: The columns can either all have the same fixed size, size themselves with `implicitWidth`, or automatically expand to take up all available width. By default, the last column will expand to take up all available space.
fr: Les colonnes peuvent soit avoir soit la même taille fixe, soit se dimensionner elles-mêmes grâce à la propriété « implicitWidth », soit se développer automatiquement pour occuper toute la largeur disponible. Par défaut, la dernière colonne se développera pour occuper tout l'espace disponible.
pl: Wszystkie kolumny mogą mieć ten sam rozmiar, mieć własny rozmiar nadany przez `implicitWidth` lub samoczynnie rozszerzać się, aby zająć całe dostępne miejsce. Domyślnie, ostatnia kolumna rozszerzy się, aby zająć całe dostępne miejsce.

source: Screenshot of a PageRow
fr: Copie d'écran de PageRow
pl: Zrzut ekranu PageRow

source: You can access the column view methods from the `pageStack` property of your [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) element or from anywhere else using `applicationWindow().pageStack`.
fr: Vous pouvez accéder aux méthodes d'affichage des colonnes à partir de la propriété « pageStack » de votre élément [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) ou de n'importe où ailleurs en utilisant « applicationWindow().pageStack ».
pl: Aby dotrzeć do metod metod widoku kolumny, możesz użyć właściwości `pageStack` swojego [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) lub z dowolnego miejsca, używając `applicationWindow().pageStack`.

source: The initial page is added with the `pageStack.initialPage` property. As an example: in a simple application that required the user to authenticate themselves, the initial page would be a login page.
fr: La page initiale est ajoutée avec la propriété « pageStack.initialPage ». Par exemple, dans une application simple demandant à l'utilisateur de s'authentifier, la page initiale sera une page de connexion.
pl: Początkowa strona została dodana przez właściwość `pageStack.initialPage`. Jako przykład: w prostej aplikacji, która wymaga od użytkownika jego uwierzytelnienia, początkową stroną byłaby strona logowania.

source: Once the user has logged into the application, you would need to replace the login page with the home page of the application. To do this, you would use `pageStack.replace`, removing the LoginPage and replacing it with a HomePage.
fr: Une fois que l'utilisateur s'est connecté à l'application, vous devez remplacer la page de connexion par la page d'accueil de l'application. Pour ce faire, vous devez utiliser « pageStack.replace » en supprimant la page de connexion et en la remplaçant par une page d'accueil.
pl: Gdy użytkownik zaloguje się już do aplikacji, to będziesz musiał zastąpić stronę logowania stroną domową aplikacji. Aby to zrobić, będziesz musiał użyć `pageStack.replace`, usuwając stronę LoginPage i zastępując ją stroną HomePage.

source: login formular
fr: formulaire de connexion
pl: Formularz logowania

source: give the registered user information to the homepage
fr: donner les informations concernant l'utilisateur enregistré à la page d'accueil
pl: daje zarejestrowanemu użytkownikowi informacje nt. strony domowej

source: display error message
fr: Afficher un message d'erreur
pl: wyświetl opis błędu

source: Now let's imagine you had a configuration page you wanted the user to access from the HomePage. You'd want the user to go back to the HomePage, so you can't use `replace`. Instead, you would use `push` to push a new page in the stack.
fr: Imaginons maintenant que vous ayez une page de configuration avec laquelle vous voulez que l'utilisateur accède à partir de sa page d'accueil. Vous voudriez que l'utilisateur retourne à la page d'accueil. Ainsi, vous ne pouvez pas utiliser « replace ». A la place, vous utiliserez « push » pour déposer une nouvelle page dans la pile.
pl: Teraz wyobraźmy sobie, że masz stronę ustawień, do której chciałbyś aby użytkownik miał dostęp ze strony domowej. Chciałbyś, aby użytkownik mógł wrócić do strony domowej, więc nie możesz użyć `replace`. Zamiast tego, użyłbyś `push`, aby wypchnąć nową stronę na stos.

source: You can also:
fr: Vous pouvez aussi :
pl: Możesz także:

source: [pop](docs:kirigami2;PageRow::pop) a page (which removes the last page in the stack) or
fr: [dépiler](docs:kirigami2;PageRow::pop) une page (ce qui supprime la dernière page de la pile) ou
pl: [pop](docs:kirigami2;PageRow::pop) stronę (co usuwa ostatnią stronę ze stosu) lub

source: use [insertPage](docs:kirigami2;PageRow::insertPage) to insert a page at a specific position in the stack,
fr: Utilisez [insertPage](docs:kirigami2;PageRow::insertPage) pour insérer une page à une position spécifique dans la pile.
pl: użyj [insertPage](docs:kirigami2;PageRow::insertPage) do wstawienia strony w danym miejscu stosu,

source: use [movePage](docs:kirigami2;PageRow::movePage) to move specific pages within the stack, or
fr: utiliser [movePage](docs:kirigami2;PageRow::movePage) pour déplacer des pages spécifiques au sein de la pile, ou bien
pl: użyj [movePage](docs:kirigami2;PageRow::movePage), aby przenieść dane strony wewnątrz stosu lub

source: [clear](docs:kirigami2;PageRow::clear) all pages from the stack.
fr: [effacer](docs:kirigami2;PageRow::clear) toutes les pages à partir de la pile.
pl: [wyczyść](docs:kirigami2;PageRow::clear) wszystkie strony ze stosu.

source: You can also modify `currentIndex` to change the currently active page programmatically, or use [flickBack](docs;Kirigami2;PageRow::flickBack) to simulate moving a page backwards in the stack.
fr: Vous pouvez également modifier l'objet « currentIndex » pour changer la page actuellement active, de manière programmée ou utiliser [flickBack](docs;Kirigami2;PageRow::flickBack) pour simuler le déplacement d'une page en arrière dans la pile.
pl: Możesz także zmienić `currentIndex`, aby programowo zmienić obecnie wyświetlaną stronę lub użyć [flickBack](docs;Kirigami2;PageRow::flickBack), aby zasymulować przesuwanie strony na dół stosu.

source: Layers
fr: Couches
pl: Warstwy

source: For the moment, we only saw horizontal navigation working in a 2 dimensional stack. You can also use layers in your application to push full-screen page into your application.
fr: Pour l'instant, nous n'avons vu que la navigation horizontale fonctionnant dans une pile en deux dimensions. Vous pouvez également utiliser des calques dans votre application pour pousser la page plein écran dans votre application.
pl: Na tę chwilę, widzieliśmy działanie poruszania się tylko w poziomie na 2 wymiarowym stosie. Możesz także użyć warstw w swojej aplikacji, aby wyświetlić stronę na pełnym ekranie.

source: In this case, only one page is visible at the same time on mobile and on the **desktop**.
fr: Dans ce cas, une seule page est visible en même temps sur le mobile et sur le **bureau**.
pl: W tym przypadku, tylko jedna strona na raz jest widoczna na urządzeniach przenośnych oraz na **biurkowych**.

source: The layers are accessible from `pageStack.layers` and use the same API as `pageStack`.
fr: Les couches sont accessibles depuis « pageStack.layers » et utilisent la même API que « pageStack ».
pl: Warstwy są dostępne z `pageStack.layers` i używają tego samego API co `pageStack`.

source: Progress Bars and Indicators
fr: Barres et indicateurs de progression
pl: Paski postępu i wskaźniki

source: `Controls.ProgressBar` is a component that lets you easily include progress bars in your application. There are four main properties you will need to use:
fr: Le composant « Controls.ProgressBar » vous permet d'inclure facilement des barres de progression dans votre application. Il y a quatre propriétés principales que vous devrez utiliser :
pl: `Controls.ProgressBar` jest składnikiem, który w łatwy sposób umożliwia dodanie pasków postępu do aplikacji. Istnieją czerty główne właściwości, których będziesz musiał używać:

source: `from`: the minimum value represented by the start of the progress bar
fr: « from » : la valeur minimale représentée par le début de la barre de progression
pl: `from`: najmniejsza wartość przedstawione wartością początkową paska postępu

source: `to`: the maximum value represented by the end of the progress bar
fr: « to » : la valeur maximale représentée par la fin de la barre de progression
pl: `to`: największa wartość przedstawione wartością końcową paska postępu

source: `value`: the current value of the action that is in progress (e.g. 50% loaded)
fr: « value » : la valeur actuelle de l'action qui est en cours (par exemple, 50% de chargement)
pl: `value`: bieżąca wartość działania, które jest w trakcie (np. 50% wczytane)

source: `indeterminate`: if the action that is in process currently has no clear progress value, you can set this property to true to show the user something is happening but its progress is not yet clear (but will be soon).
fr: « indeterminate »: si l'action en cours ne possède pas de valeur de progression claire, vous pouvez mettre cette propriété à « True » pour indiquer à l'utilisateur que quelque chose se passe mais que sa progression n'est pas encore claire (mais le sera bientôt).
pl: `indeterminate`: jeśli działanie, które jest w trakcie, obecnie nie ma wartości, świadczącej o jego postępie, to możesz ustawić tę własność na true, aby pokazać użytkownikowi, że coś się dzieje, lecz postęp nie jest jasny (lecz wkrótce będzie).

source: Above: progress bar at 50%; Below: indeterminate progress bar
fr: En haut : barre de progression à 50% ; en bas : barre de progression indéterminée
pl: Powyżej: pasek postępu na 50%; Poniżej: nieograniczony pasek postępu

source: In cases where loading times are shorter or measuring progress is not feasible, you can instead use `Controls.BusyIndicator`. This component provides a simple spinning wheel that shows users that something is happening.
fr: Si les temps de chargement sont plus courts ou s'il n'est pas possible de mesurer la progression, vous pouvez utiliser la propriété « Controls.BusyIndicator ». Ce composant fournit une roue tournante simple montrant aux utilisateurs que quelque chose est en cours d'exécution.
pl: W przypadkach, gdy czasy wczytywania są krótsze lub mierzenie postępu jest niemożliwe, to można użyć `Controls.BusyIndicator`. Ten składnik dostarcza prostego kręcącego się koła, które powiadamia użytkowników o tym, że coś się dzieje.

source: ![A busy indicator](/docs/use/kirigami/components-progressbars/busyindicator.png)
fr: ![Un indicateur d'activité](/docs/use/kirigami/components-progressbars/busyindicator.png)

source: If you want the indicator to stop running, you can do so by setting the `running` property to false.
fr: Si vous voulez que l'indicateur s'arrête de fonctionner, vous pouvez le faire en positionnant la propriété « running » à « False ».
pl: Jeśli chcesz, aby wskaźnik przestał działać, to możesz tak zrobić ustawiając jego właściwość `running` na false.

source: Scrollable Pages and List Views
fr: Pages et vues en listes déroulantes
pl: Strony przewijalne oraz widoki list

source: A [`Kirigami.ScrollablePage`](docs:kirigami2;ScrollablePage) is a page that holds scrollable content, such as `ListView`s. Scrolling and scrolling indicators are automatically managed.
fr: Une page [ « Kirigami.ScrollablePage »](docs:kirigami2;ScrollablePage) est une page contenant du contenu avec un défilement, tel que des « ListView ». Le défilement et les indicateurs de défilement sont gérés automatiquement.
pl: [`Kirigami.ScrollablePage`](docs:kirigami2;ScrollablePage) jest stroną, która przechowuje przewijalną treść, taką jak widoki `ListView`. Przewijanie oraz wskaźniki przewijania są samoczynnie zarządzane.

source: Do not put a `ScrollView` inside of a `Kirigami.ScrollablePage`; children of a `Kirigami.ScrollablePage` are already inside a `ScrollView`.
fr: Ne placez pas un objet « ScrollView » à l'intérieur d'un objet « Kirigami.ScrollablePage ». Les fils d'un objet « Kirigami.ScrollablePage » sont déjà présents dans un objet « ScrollView ».
pl: Nie umieszczaj `ScrollView` wewnątrz `Kirigami.ScrollablePage`; rzeczy podrzędne do `Kirigami.ScrollablePage` już są wewnątrz `ScrollView`.

source: When a `Kirigami.ScrollablePage`'s direct children extend vertically beyond the size of the page itself, a scrollbar appears at the right edge of the page and the page will be scrollable.
fr: Lorsque les fils directs d'une page « Kirigami.ScrollablePage » s'étendent verticalement au delà de la taille de la page elle-même, une barre de défilement apparaît sur le bord droit de la page et la page pourra se parcourir grâce à elle.
pl: Gdy bezpośrednia rzecz podrzędna `Kirigami.ScrollablePage` wykroczy w pionie poza rozmiar samej strony, to pojawi się pasek przewijania na prawej krawędzi strony, który umożliwi jej przewijanie.

source: NeoChat Scrollable Page Screenshot
fr: Copie d'écran d'une page avec barres de défilement de Neochat
pl: Zrzut ekranu strony przewijalnej NeoChat

source: Two scrollable pages, both containing a ListView with custom contents (Screenshot of NeoChat)
fr: Deux pages avec défilement, contenant toutes les deux un affichage en liste, avec un contenu personnalisé (Capture d'écran de NeoChat).
pl: Dwie przewijalne strony, obie zawierają widok ListView z własną treścią (Zrzut ekranu NeoChat)

source: Often you have more than one child in your `Kirigami.ScrollablePage`, and positioning items can be tricky - especially in combination with a `ListView`.
fr: Vous avez souvent plus d'un fils dans votre « Kirigami.ScrollablePage » et le positionnement des éléments peut être délicat - surtout en combinaison avec une « ListView ».
pl: Często masz więcej niż jedną rzecz podrzędną w `Kirigami.ScrollablePage`, a umieszczenie rzeczy może być złożone - szczególnie w połączeniu z `ListView`.

source: For non-visual components, having them inside the `ListView` element won't change the visuals of the page. So we can move them inside the `ListView`. Same for elements anchored to the center of the page, such as placeholder messages for empty `ListView`s.
fr: Pour les composants non visuels, le fait de les avoir dans l'élément « Listview » ne changera pas le rendu visuel de la page. Ainsi, nous pouvons les déplacer dans ce dernier. Cela s'applique aussi aux éléments ancrés au centre de la page, tel que les messages de remplacement pour les objets « Listview » vides.
pl: Dla niegraficznych składników, posiadanie ich w widoku `ListView` nie zmieni wyglądu strony. Tak więc możemy przemieszczać je wewnątrz `ListView`. To samo tyczy się rzeczy zakotwiczonych do środka strony, takich jak wiadomości zastępcze dla pustych widoków `ListView`.

source: For other items, it might make sense to move them to the header or footer of the `Kirigami.ScrollablePage`. This is often the case for search bars.
fr: Pour d'autres éléments, il peut être judicieux de les déplacer vers l'en-tête ou le pied de page de « Kirigami.ScrollablePage ». C'est souvent le cas pour les barres de recherche.
pl: Dla innych rzeczy, sens może mieć przeniesienie ich do nagłówka lub stopki `Kirigami.ScrollablePage`. Umieszczane są tam zazwyczaj paski wyszukiwania.

source: It is possible to add a [`Kirigami.PlaceholderMessage`](docs:kirigami2;PlaceholderMessage) with some instructions in case the list view is empty.
fr: Il est possible d'ajouter un message [ « Kirigami.PlaceholderMessage » ](docs:kirigami2;PlaceholderMessage) avec quelques instructions au cas où l'affichage en liste est vide.
pl: Możliwym jest dodania [`Kirigami.PlaceholderMessage`](docs:kirigami2;PlaceholderMessage) z pewnymi podpowiedziami w przypadku, gdy widok listy jest pusty.

source: A search field is often added to a `Kirigami.ScrollablePage` to filter the `ListView`. This can be done by changing the default `titleDelegate` to use a [`Kirigami.SearchField`](docs:kirigami2;SearchField) instead.
fr: Un champ de recherche est souvent ajouté à un objet « Kirigami.ScrollablePage » pour filtrer l'objet « ListView ». Ceci peut être réaliser en modifiant l'objet « titleDelegate » par défaut pour utiliser un objet [ « Kirigami.SearchField »](docs:kirigami2;SearchField) à la place.
pl: Pole wyszukiwania często jest dodawane do `Kirigami.ScrollablePage` do filtrowania `ListView`. Można to zrobić zmieniając domyślne `titleDelegate` na używanie [`Kirigami.SearchField`](docs:kirigami2;SearchField).

source: You can use [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) from [KItemModel](https://api.kde.org/frameworks/kitemmodels/html/) to easily add filtering capability directly in QML without any need for C++ code.
fr: Vous pouvez utiliser l'objet [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) à partir de KItemModel](https://api.kde.org/frameworks/kitemmodels/html/) pour ajouter facilement des fonctionnalités de filtrage directement dans QML sans avoir besoin de code C++.
pl: Możesz użyć [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) z [KItemModel](https://api.kde.org/frameworks/kitemmodels/html/), aby łatwo dodać możliwość filtrowania bezpośrednio w QML bez potrzeby dołączania kodu C++.

source: Another function provided by this component is a "pull to refresh" action. To use this, activate it as follows:
fr: Une autre fonction fournie par ce composant est une action « tirer pour rafraîchir ». Pour l'utiliser, il faut l'activer comme ceci :
pl: Kolejną funkcją, którą zawiera ten składnik, to działanie "pociągnij, aby odświeżyć". Aby jej użyć, wyzwól ją w następujący sposób:

source: NOTE: MyModel doesn't come from the components, it's purely an example on how it can be used together some application logic that can update the list model and signals when it's done.
fr: Remarque : « MyModel » ne provient pas des composants. C'est purement un exemple concernant la façon dont il peut être utilisé avec une logique d'application pouvant mettre à jour le modèle de liste et l'indique une fois réalisé.
pl: UWAGA: MyModel nie pochodzi ze składników, jest to czysty przykład na temat tego jak można go użyć wraz z logiką pewnej aplikacji i który może uaktualnić model listy oraz sygnały, gdy skończy.

source: So far, we have managed to build a simple app that can display cards. However, we don't yet have a way of adding new cards to our card view.
fr: Jusqu'à présent, nous avons réussi à construire une application simple pouvant afficher des cartes. Cependant, nous n'avons pas encore trouvé le moyen d'ajouter de nouvelles cartes à notre affichage en cartes.
pl: Do tej chwili, daliśmy radę zbudować prostą aplikację, która może wyświetlać karty. Jednakże nie mamy sposobu na dodawanie nowych kart do naszego widoku kart.
pt: Até agora, conseguimos criar uma aplicação simples que mostra cartões. Contudo, não temos nenhuma forma de adicionar cartões novos à nossa de área de cartões.

source: Page actions on the desktop.
fr: Actions de page pour le bureau.
pl: Działania stron na urządzeniach biurkowych.

source: If you have used Kirigami apps before, you have certainly interacted with Kirigami Actions. In this image, we can see actions to the right of the page title with various icons. Kirigami Actions can be displayed in several ways and can do a wide variety of things.
fr: Si vous avez déjà utilisé des applications sous Kirigami, vous avez certainement déjà interagi avec des objets « actions » de Kirigami. Dans cette image, nous pouvons voir des actions à droite de la page de titre avec diverses icônes. Les actions de Kirigami peuvent être affichées de plusieurs façons et peuvent réaliser une large variété de choses.
pl: Jeśli używałeś wcześniej aplikacji Kirigami, to na pewno obsługiwałeś je poprzez Działania Kirigami. Na tym obrazie, widzimy działania po prawej stronie tytułu okna z różnymi ikonami. Działania Kirigami można wyświetlić na kilka sposobów i są one w stanie robić różne rzeczy.
pt: Se tiver usado antes as aplicações do Kirigami, provavelmente já interagiu com as acções do Kirigami. Nesta imagem, poderemos ver as acções à direita do título da página com vários ícones. As acções do Kirigami poderão ser apresentadas de várias formas e poderão efectuar uma grande variedade de acções.
