Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) components make it easy for you to create forms that conform to the [KDE Human Interface Guidelines](https://develop.kde.org/hig/). They are optimal for settings dialogs and for large groups of controls and input fields that are related to each other.
ca: Els components de [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) faciliten la creació de formularis que s'ajustin a les [Directrius d'interfície humana de KDE](https://develop.kde.org/hig/). Són òptims per als diàlegs de configuració i per a grans grups de controls i camps d'entrada que estan relacionats entre si.
sl: Komponente [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) vam olajšajo ustvarjanje obrazcev, ki so skladni s smernicami uporabniškega vmesnika KDE [KDE Human Interface Guidelines](https://develop.kde.org/hig/). Optimalne so za pogovorna okna nastavitev in za velike skupine kontrolnikov in vnosnih polj, ki so povezana med seboj.

source: When provided with enough space, form layouts will take up two columns. The column on the left will be occupied by the labels provided for the form's children components, while the right will be taken up by the children components themselves. In more space-constrained windows (or on mobile), forms will consist of a single vertical column with the labels of children components being placed above their respective component.
ca: Quan se'ls proporciona prou espai, les disposicions de formulari ocuparan dues columnes. La columna de l'esquerra estarà ocupada per les etiquetes proporcionades pels components fills del formulari, mentre que la dreta estarà ocupada pels components fills mateixos. En les finestres amb un espai més limitat (o en dispositius mòbils), els formularis consistiran en una sola columna vertical amb les etiquetes dels components fills col·locades a sobre dels seus respectius components.
eo: Se provizitaj per sufiĉe da spaco, formularaj aranĝoj okupos du kolumnojn. La kolumno maldekstre estos okupita de la etikedoj provizitaj por la infanaj komponantoj de la formo, dum la dekstre estos okupita de la infanaj komponantoj mem. En pli spac-limigitaj fenestroj (aŭ sur poŝtelefono), formoj konsistos el ununura vertikala kolumno kun la etikedoj de infankomponentoj metitaj super sia respektiva komponento.
es: Cuando se les proporciona suficiente espacio, los diseños de formularios ocuparán dos columnas. La columna de la izquierda estará ocupada con las etiquetas proporcionadas para los componentes secundarios del formulario, mientras que la derecha contendrá los propios elementos secundarios. En ventanas con espacio más limitado (o en dispositivos móviles), los formularios constarán de una sola columna vertical con las etiquetas de los componentes secundarios colocadas sobre sus respectivos componentes.
nl: Als er voldoende ruimte is, krijgen formulierindelingen twee kolommen. De linker kolom bevat de labels geleverd door de kindcomponenten van het formulier, terwijl het rechter de kinderen van het formulier zelf bevatten. Bij meer beperkte ruimte in het venster (of op een mobiel), zullen formulieren bestaan uit een enkele verticale kolom met de labels van kindcomponenten, die geplaatst worden boven hun respectievelijke component.
pt: Quando tiverem espaço suficiente, as disposições dos formulários irão ocupar duas colunas. A coluna da esquerda será ocupada pelos textos fornecidos pelos componentes-filhos do formulário, enquanto o lado direito será ocupado pelos filhos propriamente ditos. Em janelas com mais restrições de espaço (ou em dispositivos móveis), os formulários irão consistir numa única coluna vertical com os textos dos componentes-filhos colocados logo acima do seu componente respectivo.
sl: Če je na voljo dovolj prostora, bodo postavitve obrazcev privzele dva stolpca. Stolpec na levi bo zaseden z oznakami, ki so predvidene za sestavne dele obrazca za odvisne komponente, desnega pa bodo prevzeli sami odvisni deli. V oknih z več prostorske omejitve (ali na mobilnih napravah) bodo obrazci sestavljeni iz enega navpičnega stolpca z oznakami za odvisne komponente, ki so nameščene nad njihovo ustrezno komponento.
sv: När tillräckligt utrymme tillhandahålls, upptar formulärlayouter två kolumner. Kolumnen till vänster upptas av beteckningarna tillhandahållna för formulärets underliggande komponenter, medan den högra upptas av själva de underliggande komponenterna själva. I mer utrymmesbegränsade fönster (eller på en mobil), består formulär av en enda vertikal kolumn med de underliggande komponenternas beteckningar placerade ovanför deras respektive komponent.
uk: Якщо місця достатньо, компонування форм виконуватиметься у два стовпчики. Лівий стовпчик буде заповнено мітками, які надано для дочірніх компонентів форми, а правий — самими дочірніми компонентами. У вікнах із обмеженим простором (або на мобільних пристроях) форми складатимуться з одного вертикального стовпчика із мітками дочірніх компонентів, які розташовано над відповідними компонентами.

source: Simple form
ca: Formulari senzill
eo: Simpla formo
es: Formulario sencillo
fr: Forme simple
nl: Eenvoudig formulier
pl: Prosty formularz
pt: Formulário simples
sl: Enostavna oblika
sv: Enkelt formulär
uk: Проста форма

source: [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) components are similar in use to [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) components such as [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) or [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). The child components will be automatically arranged according to the size available to the form layout.
ca: Els components de [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) són similars en ús als components [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html) com [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) o [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). Els components fills s'organitzaran automàticament d'acord amb la mida disponible per a la disposició del formulari.
sl: Komponente [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) so v uporabi podobne komponentam [QtQuick Layout](https://doc.qt.io/qt-6/qtquicklayouts-index.html), kot so ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html) ali [RowLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-rowlayout.html). Odvisne komponente bodo samodejno razporejene glede na velikost, ki je na voljo za postavitev obrazca.

source: Children of a [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) have a property named [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop). This property lets you set the label that will be provided for the child component in question.
ca: Els fills d'una [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) tenen una propietat anomenada [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop). Aquesta propietat permet establir l'etiqueta que es proporcionarà per al component fill en qüestió.

source: A simple form layout in desktop mode
ca: Una disposició de formulari senzilla en mode escriptori
eo: Simpla forma aranĝo en labortabla reĝimo
es: Un diseño de formulario simple en modo escritorio
nl: Een eenvoudige indeling van een formulier in modus bureaublad
pt: Um formulário disposto de forma simples no modo para o computador
sl: Enostaven obrazec postavljen v načinu namizja
sv: En enkel formulärlayout på skrivbordsdator
uk: Просте компонування форми у стільничному режимі

source: Sections and separators
ca: Seccions i separadors
eo: Sekcioj kaj apartigiloj
es: Secciones y separadores
fr: Sections et séparateurs
nl: Secties en scheidingstekens
pl: Wydzielone obszary i ich odgraniczniki
pt: Secções e separadores
sl: Odseki in ločila
sv: Sektioner och avskiljare
uk: Розділи і роздільники

source: FormLayouts can also be divided into sections. Setting where a section starts is as easy as setting a child component's [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) to true. This will provide the component with some extra margin at the top to demarcate the start of the new section.
ca: Les FormLayout també es poden dividir en seccions. Establir on comença una secció és tan fàcil com establir la [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) d'un component fill a «true». Això proporcionarà al component un marge addicional a la part superior per a demarcar el començament de la secció nova.

source: [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) components are best suited for starting new sections. Separators are used to draw a thin horizontal line, demarcating the end of a section. If you would rather not have a line drawn between sections, you can use a standard QML [Item](docs:qtquick;QtQuick.Item) property. Alternatively you could use the [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) property on any other component.
ca: Els components de [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) són els més adequats per a començar seccions noves. Els separadors s'usen per a dibuixar una prima línia horitzontal, delimitant el final d'una secció. Si preferiu no traçar dita línia entre les seccions, podeu utilitzar una propietat [Item](docs:qtquick;QtQuick.Item) de QML estàndard. De manera alternativa, podeu utilitzar la propietat [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) en qualsevol altre component.

source: However, this is not recommended. On components where [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) is set to `true`, the label text provided for this component's [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) property will be displayed as the section's header text.
ca: Tanmateix, això no està recomanat. Als components on [Kirigami.FormData.isSection](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#isSection-attached-prop) està establert a `true`, el text de l'etiqueta proporcionat per la propietat [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) d'aquest component es mostrarà com a text de capçalera de la secció.

source: Warning
ca: Avís
eo: Averto
es: Advertencia
fr: Avertissement
nl: Waarschuwing
pl: Ostrzeżenie
pt: Aviso
sl: Opozorilo
sv: Varning
uk: Попередження

source: This does not apply to every component, hence the recommendation that you use [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) or [Item](docs:qtquick;QtQuick.Item) components in places where you would like to use a header text.
ca: Això no s'aplica a cada component, d'aquí la recomanació que utilitzeu els components [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) o [Item](docs:qtquick;QtQuick.Item) en llocs on voleu utilitzar un text de capçalera.
sl: To ne velja za vsako komponento, zato priporočilo, da uporabljate komponenti [Kirigami.Separator](docs:kirigami;org.kde.kirigami.primitives.Separator) ali [Item](docs:qtquick;QtQuick.Item) na mestih, kjer bi želeli uporabiti glavo kot besedilo.

source: This header text is larger than the normal label text, and provides users with a nice visual cue of what the form layout section is about.
ca: Aquest text de capçalera és més gran que el text d'etiqueta normal, i proporciona als usuaris una pista visual agradable de què tracta la secció de disseny de formulari.
eo: Ĉi tiu kaplinia teksto estas pli granda ol la normala etikeda teksto, kaj provizas uzantojn kun bela vida indiko pri kio temas la form-aranĝo.
es: Este texto de encabezado es más grande que el texto de etiqueta normal y proporciona al usuario una buena pista visual sobre de qué trata la sección de diseño del formulario.
nl: Deze koptekst is groter dan de normale labeltekst en geeft aan de gebruikers een nette visuele aanwijzing waar de sectie formulierindeling over gaat.
pt: Este texto de cabeçalho é maior que o texto das legendas normais, dando aos utilizadores uma dica visual interessante sobre o que diz respeito o formulário.
sl: To besedilo glave je večje od običajnega besedila oznak in uporabnikom omogoča lepo vizualno iztočnico o razdelku in postavitvi obrazca.
sv: Sidhuvudtexten är större än normal beteckningstext och tillhandahåller användare med en snygg visuell ledtråd om vad formulärets layoutsektion handlar om.
uk: Цей текст заголовка є більшим за розміром за звичайний текст мітки і надає користувачеві чудову візуальну підказку щодо того, для чого призначено розділ компонування форми.

source: A form layout with sections
ca: Una disposició de formulari amb seccions
eo: Form-aranĝo kun sekcioj
es: Un diseño de formulario con secciones
nl: Een formulierindeling met secties
pt: Uma disposição em formulário com secções
sl: Postavitev obrazca s sekcijami
sv: En formulärlayout med sektioner
uk: Компонування форми з розділами

source: Forcing a desktop or mobile layout
ca: Forçar una disposició d'escriptori o mòbil
eo: Devigante labortablon aŭ moveblan aranĝon
es: Forzar un diseño de escritorio o móvil
fr: Application forcée d'une mise en page pour bureau ou mobile
nl: Een bureaublad- of mobielindeling afdwingen
pl: Wymuszanie układu z urządzenia biurkowego lub przenośnego
pt: Forçar um formato para computador ou dispositivo móvel
sl: Vsiljena namizna ali mobilna postavitev
sv: Tvinga skrivbords- eller mobillayout
uk: Примусове визначення компонування — комп'ютер чи мобільний пристрій

source: If you would rather have your form layout stay consistent regardless of your application's environment, you can use the [wideMode](https://api.kde.org/qml-org-kde-kirigami-layouts-formlayout.html#wideMode-prop) property of the [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout) component:
ca: Si preferiu que la disposició del formulari sigui coherent independentment de l'entorn on es trobi la vostra aplicació, podeu emprar la propietat [wideMode](https://api.kde.org/qml-org-kde-kirigami-layouts-formlayout.html#wideMode-prop) del component [Kirigami.FormLayout](docs:kirigami;org.kde.kirigami.layouts.FormLayout):

source: When set to `true`, the form layout will be structured in a desktop-optimized widescreen (double-column) layout
ca: Quan s'estableix a `true`, la disposició del formulari s'estructurarà en una disposició de pantalla ampla optimitzada per a l'escriptori (doble columna).
eo: Kiam agordita al "vera", la formo-aranĝo estos strukturita en labortabla optimumigita larĝekrana (du-kolumna) aranĝo
es: Cuando vale `true`, el formulario se estructurará en formato de pantalla ancha optimizado para el escritorio (a doble columna)
fr: Lorsque la valeur « True » est attribuée, la mise en page du formulaire sera structurée de manière optimisée pour les ordinateurs de bureau à écran large (en double colonne).
nl: Indien gezet op `true`, zal de formulierindeling gestructureerd zijn in een voor het bureaublad geoptimaliseerd indeling breed scherm (dubbele kolommen)
pl: Gdy ustawione na `true`, to układ formularza zostanie ułożony do szerokiego ekranu przystosowanego do komputerów biurkowych (podwójna kolumna)
pt: Quando for configurada como verdadeira, a disposição do formulário ficará estruturada como se estivesse num formato amplo e optimização para computadores (em duas colunas)
sl: Ko je nastavljena na 'true', bo postavitev obrazca strukturirana v postavitvi širokega zaslona (dvojnega stolpca) z optimizacijo namizja
sv: När den är inställd till `true`, struktureras formulärlayouten för en skrivbordsoptimerad bred (med dubbla kolumner) skärmlayout.
uk: Якщо встановлено значення `true`, компонування форми буде структуровано для широкоекранного представлення на комп'ютері (у два стовпчики)

source: When set to `false`, the form layout will be structured in a mobile layout (single column)
ca: Quan s'estableix a `false`, la disposició del formulari s'estructurarà en una disposició per a un dispositiu mòbil (una sola columna).
eo: Kiam agordita al "falsa", la formularenpaĝigo estos strukturita en movebla aranĝo (unu kolumno)
es: Cuando vale `false`, el formulario se organizará en un formato para móviles (a una sola columna)
fr: Lorsqu'elle est définie à « Faux », la mise en page du formulaire sera structurée selon une mise en page pour mobile (une seule colonne).
nl: Indien gezet op `false`, zal de formulierindeling gestructureerd zijn in een indeling voor een mobiel (enkele kolom)
pl: Po ustawieniu na `false`, układ formularza zostanie ułożony w układ jak na urządzenia przenośne (pojedyncza kolumna)
pt: Se for falso, a disposição do formulário ficará estruturada num formato para dispositivos móveis (única coluna)
sl: Ko je nastavljena na 'false', bo postavitev obrazca strukturirana v mobilni postavitvi (en stolpec)
sv: När den är inställd till `false`, struktureras formulärlayouten som en mobillayout (enstaka kolumn)
uk: Якщо встановлено значення `false`, компонування форми буде структуровано для мобільного пристрою (в один стовпчик)

source: A form layout with forced mobile layout
ca: Una disposició de formulari amb la disposició de mòbil forçada
eo: Form-aranĝo kun devigita movebla aranĝo
es: Un diseño de formulario con diseño móvil forzado
nl: Een formulierindeling met afdwongen indeling voor mobiel
pt: Forçar um formato para computador ou dispositivo móvel
sl: Postavitev obrazca z vsiljeno mobilno postavitvijo
sv: En formulärlayout med tvingande mobillayout
uk: Компонування форми з примусовим мобільним компонуванням

source: Aligning your labels
ca: Alineació de les etiquetes
eo: Vicigante viajn etikedojn
es: Alineación de etiquetas
nl: Uw labels uitlijnen
pt: Alinhar as suas legendas
sl: Poravnava oznak
sv: Justera beteckningar
uk: Вирівнювання ваших міток

source: There are instances when you want a label to be assigned to components that have more than one line or to a list of components. This can be achieved by putting the [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) in the [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), as you might have noticed in [Sections and Separators](#sections-and-separators). By default the label is positioned in the vertical center of the layout, which is not always desirable. We can change this with help of [Kirigami.FormData.labelAlignment](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#labelAlignment-attached-prop).
ca: Hi ha instàncies en què voleu assignar una etiqueta als components que tenen més d'una línia o a una llista de components. Això es pot aconseguir posant el [Kirigami.FormData.label](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#label-attached-prop) a la [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), tal com es pot veure a [Seccions i separadors](#sections-and-separators). Per defecte, l'etiqueta es col·loca al centre vertical de la disposició, la qual cosa no sempre és desitjable. Podem canviar això amb l'ajuda del [Kirigami.FormData.labelAlignment](https://api.kde.org/qml-org-kde-kirigami-layouts-formdata.html#labelAlignment-attached-prop).

source: A form layout with top-aligned label
ca: Una disposició de formulari amb una etiqueta alineada a dalt
eo: Form-aranĝo kun supra vicigita etikedo
es: Un diseño de formulario con una etiqueta alineada a la parte superior
nl: Een formulierindeling met een label bovenaan uitgelijnd
pt: Uma disposição em formulário com a legenda alinhada ao topo
sl: Postavitev obrazca z zgoraj poravnano oznako
sv: En formulärlayout med beteckning justerad längst upp
uk: Компонування форми з вирівняною вгору міткою

source: Setting the label alignment is particularly convenient to manage components or lists of components whose size you do not know beforehand. [Elisa](https://apps.kde.org/elisa) is a very good example of this:
ca: Establir l'alineació de l'etiqueta és especialment pràctic per a gestionar els components o llistes de components la mida dels quals no coneixeu prèviament. L'[Elisa](https://apps.kde.org/elisa) és un bon exemple d'això:
eo: Agordi la etikedan vicigon estas precipe oportuna por administri komponantojn aŭ listojn de komponantoj, kies grandecon vi ne scias antaŭe. [Elisa](https://apps.kde.org/elisa) estas tre bona ekzemplo de tio:
nl: De uitlijning van het label is speciaal handig om componenten te behandelen of lijsten componenten waarvan u de grootte van tevoren niet weet. [Elisa](https://apps.kde.org/elisa) is hier een erg goed voorbeeld van:
pt: A definição do alinhamento das legendas é particularmente conveniente para gerir os componentes ou listas de componentes cujo tamanho não conhece de antemão. O [Elisa](https://apps.kde.org/elisa) é um óptimo exemplo disto:
sl: Nastavitev poravnave nalepke je še posebej priročna za upravljanje komponent ali seznamov komponent, katerih velikost vnaprej ne poznate. [Elisa](https://apps.kde.org/elisa) je zelo dober primer tega:
sv: Att ställa in beteckningens justering är särskilt bekvämt för att hantera komponenter eller listor över komponenter vars storlek du inte känner till i förväg. [Elisa](https://apps.kde.org/elisa) är ett mycket bra exempel på det:
uk: Встановлення вирівнювання мітки зручне для керування компонентами або списками компонентів, чи розмір наперед невідомий. [Elisa](https://apps.kde.org/elisa) є чудовим прикладом цього:

source: The Comment label is only top aligned when its corresponding component has more than one line
ca: L'etiqueta Comment només està alineada a dalt quan el seu component corresponent té més d'una línia
eo: La Komento-etikedo estas nur supre vicigita kiam ĝia responda komponanto havas pli ol unu linion
es: La etiqueta Comment solo está alineada a la parte superior cuando su correspondiente componente tiene más de una línea.
nl: Het commentaarlabel is alleen bovenaan uitgelijnd wanneer zijn bijbehorende component meer dan één regel heeft
pt: A legenda Comentário só está alinhada ao topo quando o seu componente correspondente tem mais que uma linha
sl: Oznaka komentarja je zgoraj poravnana le, če ima ustrezna komponenta več kot eno vrstico
sv: Kommentarbeteckningen är bara justerad längst upp när motsvarande komponent har mer än en rad
uk: Мітку Comment буде вирівняно вгору, коли її відповідний компонент складається з декількох рядків

source: We can do something similar to this with a JavaScript ternary operator:
ca: Podem fer quelcom similar a això amb un operador JavaScript ternari:
eo: Ni povas fari ion similan al ĉi tio per JavaScript ternara operatoro:
es: Podemos hacer algo similar a esto con un operador ternario de JavaScript:
nl: We kunnen hierbij iets soortgelijks doen met een JavaScript ternary-operator:
pt: Podemos fazer algo semelhante a isto com um operador ternário em JavaScript:
sl: Lahko naredimo nekaj podobnega s ternarnim operatorjem v JavaScriptu:
sv: Vi kan göra någonting liknande med en Javascript ternär operator:
uk: Ми можемо зробити щось подібне до цього за допомогою тернарного оператора JavaScript:
