Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Kirigami components are designed in such a way that the place where you put Kirigami Actions is relevant. As seen above, if you add actions to a [Kirigami.Page](docs:kirigami2;Page), [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) or any other derivative Page component, they will show up on the right side of the header in desktop mode, and on the bottom in mobile mode.
eo: Kirigami-komponentoj estas desegnitaj tiel, ke la loko, kie vi metas Kirigami-Agojn, estas grava. Kiel vidite supre, se vi aldonas agojn al [Kirigami.Paĝo](docs:kirigami2;Paĝo), [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) aŭ ajna alia derivita Paĝa komponanto, ili aperos dekstre. de la kaplinio en labortabla reĝimo, kaj sur la malsupro en movebla reĝimo.
nl: Kirigami componenten zijn zodanig ontworpen dat de plaats waar de Kirigami acties geplaatst worden relevant is. Zoals hierboven te zien is, dat als acties aan een [Kirigami.Page](docs:kirigami2;Page), [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) of elke andere afgeleide pagina-component wordt toegevoegd, dan verschijnen ze aan de rechterzijde van de titel in de desktop mode, en aan de onderkant in de mobile mode.
sv: Kirigami-komponenter är konstruerade på ett sådant sätt att platsen där man placerar Kirigami Actions är relevant. Som framgår ovan, om man lägger till åtgärder på en [Kirigami.Page](docs:kirigami2;Page), [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) eller någon annan härledd sidkomponent, dyker de upp på höger sida om rubriken i skrivbordsläge och längst ner i mobilläge.
uk: Компоненти Kirigami розроблено так, щоб місце, де ви розташуєте кнопки дій Kirigami, було відповідним. Як можна бачити вище, якщо ви додаєте кнопки дій до [Kirigami.Page](docs:kirigami2;Page), [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) або будь-якому іншому похідному від Page компоненті, їх буде показано у правій частині заголовка у режимі робочої станції і у нижній частині сторінки у режимі мобільного пристрою.

source: Similarly, if Kirigami Actions are added to a [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer), they will show up in the resulting drawer or menu.
eo: Simile, se Kirigami-Agoj estas aldonitaj al [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer), ili aperos en la rezulta tirkesto aŭ menuo.
nl: Daarentegen als if Kirigami acties worden toegevoegd aan een [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer), dan verschijnen ze in de resulterende lade of menu.
sv: På liknande sätt, om Kirigami Actions läggs till i en [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer), dyker de upp i den resulterande lådan eller menyn.
uk: Так само, якщо дії Kirigami буде додано до [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer), їх буде показано на висувній панелі або у меню.

source: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) - [ContextDrawer tutorial here](/docs/getting-started/kirigami/components-drawers#context-drawers)
eo: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) - [ContextDrawer lernilo ĉi tie](/docs/getting-started/kirigami/components-drawers#context-drawers)
es: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) - [Tutorial de ContextDrawer](/docs/getting-started/kirigami/components-drawers#context-drawers)
sv: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer): [handledning om ContextDrawer finns här](/docs/getting-started/kirigami/components-drawers#context-drawers)
uk: [Kirigami.ContextDrawer](docs:kirigami2;ContextDrawer) — [підручник з ContextDrawer тут](/docs/getting-started/kirigami/components-drawers#context-drawers)

source: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) and derivatives - [Card tutorial here](/docs/getting-started/kirigami/components-card)
eo: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) kaj derivaĵoj - [Karto lernilo ĉi tie](/docs/getting-started/kirigami/components-card)
es: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) and derivatives - [Tutorial de Card](/docs/getting-started/kirigami/components-card)
nl: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) and derivatives - [Instructie over Card hier](/docs/getting-started/kirigami/components-card)
sv: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) och derivat: [handledning om Card finns här](/docs/getting-started/kirigami/components-card)
uk: [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) і похідні — [підручник з карток тут](/docs/getting-started/kirigami/components-card)

source: [Kirigami.Dialog](docs:kirigami2;Dialog) and derivatives - [Dialog tutorial here](/docs/getting-started/kirigami/components-dialogs)
eo: [Kirigami.Dialog](docs:kirigami2;Dialog) kaj derivaĵoj - [Dialogo-lernilo ĉi tie](/docs/getting-started/kirigami/components-dialogs)
es: [Kirigami.Dialog](docs:kirigami2;Dialog) and derivatives - [Tutorial de Dialog](/docs/getting-started/kirigami/components-dialogs)
nl: [Kirigami.Dialog](docs:kirigami2;Dialog) en afgeleiden - [Instructie over het dialoogvenster hier](/docs/getting-started/kirigami/components-dialogs)
sv: [Kirigami.Dialog](docs:kirigami2;Dialog) och derivat: [handledning om Dialog finns här](/docs/getting-started/kirigami/components-dialogs)
uk: [Kirigami.Dialog](docs:kirigami2;Dialog) і похідні — [підручник з Dialog тут](/docs/getting-started/kirigami/components-dialogs)

source: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [ActionToolBar tutorial here](/docs/getting-started/kirigami/components-actions#actiontoolbar)
eo: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [ActionToolBar lernilo ĉi tie](/docs/getting-started/kirigami/components-actions#actiontoolbar)
es: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [Tutorial de ActionToolBar](/docs/getting-started/kirigami/components-actions#actiontoolbar)
nl: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [ActionToolBar handleiding hier](/docs/getting-started/kirigami/components-actions#actiontoolbar)
sv: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [Handledning om ActionToolBar finns här](/docs/getting-started/kirigami/components-actions#actiontoolbar)
uk: [Kirigami.ActionToolBar](docs:kirigami2;ActionToolBar) - [підручник з ActionToolBar](/docs/getting-started/kirigami/components-actions#actiontoolbar)

source: <details> <summary><b>Main.qml:</b></summary>
eo: <detaloj> <summary><b>Main.qml:</b></summary>

source: First we edit the action from the previous tutorial: just a [Kirigami.Action](docs:kirigami2;Action) that triggers the dialog's [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) function.
eo: Unue ni redaktas la agon el la antaŭa instruilo: nur [Kirigami.Action](docs:kirigami2;Action) kiu ekigas la funkcion [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) de la dialogo.
nl: Als eerste bewerken we de actie uit de vorige inleiding: gewoon een [Kirigami.Action](docs:kirigami2;Action) die de functie van de dialoog [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) start.
sv: Först redigerar vi åtgärden från föregående handledning: bara en [Kirigami.Action](docs:kirigami2;Action) som aktiverar dialogens funktion [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open).
uk: Спочатку внесемо зміни до дії з попереднього розділу підручника — просто додамо [Kirigami.Action](docs:kirigami2;Action), яка вмикає функцію [open()](docs:qtquickcontrols;QtQuick.Controls.Popup::open) діалогового вікна.

source: The new component we add is a [Kirigami.Dialog](docs:kirigami2;Dialog). Dialogs appear at the center of the window and can be used to provide extra information relevant to the current content. They can't be moved, but they adapt their own size to the window.
eo: La nova komponanto, kiun ni aldonas, estas [Kirigami.Dialogo](docs:kirigami2;Dialogo). Dialogoj aperas en la centro de la fenestro kaj povas esti uzataj por provizi kromajn informojn rilatajn al la aktuala enhavo. Ili ne povas esti movitaj, sed ili adaptas sian propran grandecon al la fenestro.
nl: De nieuwe component die we toevoegen is [Kirigami.Dialog](docs:kirigami2;Dialog). Dialogen verschijnen in het centrum van het venster en kunnen gebruikt worden om extra informatie te leveren relevant voor de huidige inhoud. Ze kunnen niet verplaatst worden, maar ze passen hun eigen grootte aan aan het venster.
sv: Den nya komponenten vi lägger till är [Kirigami.Dialog](docs:kirigami2;Dialog). Dialogrutor dyker upp mitt på fönstret och kan användas för att tillhandahålla extra information relevant för det aktuella sammanhanget. De kan inte flyttas, men de anpassar sin egen storlek till fönstret.
uk: Новим компонентом, який ми додаємо є [Kirigami.Dialog](docs:kirigami2;Dialog). Діалогові вікна з'являються у центрі вікна. Ними можна скористатися для надання додаткових відомостей, які пов'язано із поточним вмістом вікна. Їх не можна пересувати, але їхній розмір адаптується до розміру головного вікна.

source: The header by default includes a [title](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) and a close button that can be disabled with [showCloseButton](docs:kirigami2;Dialog::showCloseButton). The footer by default includes a close button, and it can be overridden with [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).
eo: La kaplinio defaŭlte inkluzivas [titolon](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) kaj fermbutonon kiu povas esti malŝaltita per [showCloseButton] (docs:kirigami2;Dialog::showCloseButton). La piedlinio defaŭlte inkluzivas fermbutonon, kaj ĝi povas esti anstataŭita per [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).
nl: Standaard heeft de kop een [titel](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) en een sluitknop die uitgeschakeld kan worden met [showCloseButton](docs:kirigami2;Dialog::showCloseButton). Standaard heeft de voet een sluitknop, dit is aanpasbaar met [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).
sv: Header innehåller normalt en [title](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) och en stängningsknapp som kan inaktiveras med [showCloseButton] (docs:kirigami2;Dialog::showCloseButton). Footer innehåller normalt en stängningsknapp, och den kan ignoreras med [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).
uk: До заголовка, типово, включають [назву](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#title-prop) і кнопку закриття, яку можна вимкнути за допомогою [showCloseButton](docs:kirigami2;Dialog::showCloseButton). До підвалу, типово, включено кнопку закриття, і цю поведінку можна перевизначити за допомогою [standardButtons](https://doc.qt.io/qt-6/qml-qtquick-controls-dialog.html#standardButtons-prop).

source: We first set it to show an "Ok" button and a "Cancel" button, add some padding, and add a reasonable [preferredWidth](docs:kirigami2;Dialog::preferredWidth). The preferred width is the default expected size of the dialog, which can increase if needed. We can use standard [Kirigami.Units](docs:kirigami2;Kirigami::Platform::Units) that we will revisit later on.
eo: Ni unue starigis ĝin por montri butonon "Ok" kaj butonon "Nuligi", aldonu iom da kompletigo kaj aldonu racian [preferredWidth](docs:kirigami2;Dialog::preferredWidth). La preferata larĝo estas la defaŭlta atendata grandeco de la dialogo, kiu povas pliiĝi se necese. Ni povas uzi norman [Kirigami.Unuoj](docs:kirigami2;Kirigami::Platform::Unuoj) kiujn ni revizitos poste.
nl: We stellen het eerst zodanig in dat het een "Ok"-knop en een knop "Annuleren" toont, vervolgens voegen we nog wat opvulruimte toe, en voegen een redelijke [preferredWidth](docs:kirigami2;Dialog::preferredWidth) toe. De voorkeur breedte is de verwachte standaard afmeting van het dialoogvenster, die indien nodig nog groter kan worden. We kunnen de standaard [Kirigami.Units](docs:kirigami2;Kirigami::Platform::Units) gebruiken die we later opnieuw zullen bezoeken.
sv: Vi ställde först in den för att visa knapparna "Ok" och "Avbryt", lade till lite utfyllnad och en rimlig [preferredWidth](docs:kirigami2;Dialog::preferredWidth). Den föredragna bredden är den förväntade standardstorleken på dialogrutan, som kan öka vid behov. Vi kan använda standard [Kirigami.Units](docs:kirigami2;Kirigami::Platform::Units) som vi tittar vidare på igen senare.
uk: Спочатку, ми налаштуємо його на показ кнопки «Гаразд» і «Скасувати», додамо фаски, та додамо прийнятну [preferredWidth](docs:kirigami2;Dialog::preferredWidth). Пріоритетною шириною є типовий очікуваний розмір діалогового вікна. Її може бути збільшено, якщо це потрібно. Ми можемо скористатися стандартним [Kirigami.Units](docs:kirigami2;Kirigami::Platform::Units), до якого ми ще звернемося пізніше.

source: Then we come to a [Kirigami.FormLayout](docs:kirigami2;FormLayout). Unlike a [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), the layout of its child components is automatic and centered, with optional labels. As the name implies, it is used to create input forms.
eo: Poste ni venas al [Kirigami.FormLayout](docs:kirigami2;FormLayout). Male al [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), la aranĝo de ĝiaj infanaj komponantoj estas aŭtomata kaj centrita, kun laŭvolaj etikedoj. Kiel la nomo implicas, ĝi estas uzata por krei enigformularojn.
es: Luego llegamos a un [Kirigami.FormLayout](docs:kirigami2;FormLayout). Al contrario que un [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), la organización de los componentes hijos es automática y centrada, con etiquetas opcionales. Como su nombre indica, se usa para crear formularios de entrada de datos.
nl: En dan komen we bij een [Kirigami.FormLayout](docs:kirigami2;FormLayout). In tegenstelling tot een [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), is de indeling van zijn kinderen automatisch en gecentreerd, met optioneel labels. Zoals de naam al aangeeft, wordt het gebruikt om invul-formulieren te creëren.
sv: Sedan kommer vi till en [Kirigami.FormLayout](docs:kirigami2;FormLayout). I motsats till en [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), är layouten av ingående komponenter automatisk och centrerad, med valfria beteckningar. Som namnet antyder, används den för att skapa inmatningsformulär.
uk: Далі, ми переходимо до [Kirigami.FormLayout](docs:kirigami2;FormLayout). На відміну від [ColumnLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-columnlayout.html), компонування його дочірніх компонентів є автоматичним і центрованим з необов'язковими мітками. Як можна зрозуміти з назви, його використовують для створення форм введення даних.

source: Within each of these [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) elements, we are setting a [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) property that lets us define labels for them. The form will present the correct labels to the left of each of these text input fields.
eo: Ene de ĉiu el ĉi tiuj [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) elementoj, ni fiksas [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) proprecon kiu ebligas al ni difini etikedojn por ilin. La formularo prezentos la ĝustajn etikedojn maldekstre de ĉiu el ĉi tiuj tekstaj enigokampoj.
nl: In elk van deze [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField)-elementen, voegen we een [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label)-eigenschap toe waarmee we labels voor elk daarvan kunnen definiëren. Het formulier zal dan voor elk de correcte label links van de tekstvelden tonen.
sv: Inom vart och ett av elementen i [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) anger vi in egenskapen ​​[Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label) som låter oss definiera beteckningar för dem. Formuläret visar rätt beteckning till vänster om vart och ett av textinmatningsfälten.
uk: У кожному з цих елементів [Controls.Textfield](docs:qtquickcontrols;QtQuick.Controls.TextField) ми встановлюємо властивість [Kirigami.FormData.label](docs:kirigami2;FormLayoutAttached::label), що надає нам змогу визначити для них мітки. Форма покаже належні мітки ліворуч від кожного з цих полів для введення тексту.

source: Setting up and getting started
eo: Agordi kaj komenci
fr: Paramétrage et démarrage
nl: Opzetten en aan de slag gaan
pl: Ustawienia środowiska i pierwsze kroki
pt: Configuração e introdução
sv: Ställa in och komma igång
uk: Налаштовування і перші кроки

source: Getting ready to create our first Kirigami application
eo: Pretiĝas por krei nian unuan Kirigami-aplikaĵon
fr: Se préparer à la création de notre première application sous Kirigami.
nl: Gereed zijn om onze eerste Kirigami toepassing te maken
pl: Przygotowywanie się do stworzenia naszej pierwszej aplikacji Kirigami
pt: Preparar a criação da nossa primeira aplicação do Kirigami
sv: Bli redo att skapa vårt första program med Kirigami
uk: Готуємося до створення нашої першої програми Kirigami

source: Further information for other distributions can be found [here](/docs/getting-started/building/help-dependencies).
eo: Pliaj informoj pri aliaj distribuoj troveblas [ĉi tie](/docs/getting-started/building/help-dependencies).
es: Puede encontrar más información para otras distribuciones [aquí](/docs/getting-started/building/help-dependencies).
nl: Verdere informatie voor andere distributies is [hier](/docs/getting-started/building/help-dependencies) te vinden.
sl: Dodatne informacije za druge distribucije najdete [tukaj](/docs/getting-started/building/help-dependencies).
sv: Ytterligare information för andra distributioner finns [här](/docs/getting-started/building/help-dependencies).
uk: Подальші відомості для інших дистрибутивів наведено [тут](/docs/getting-started/building/help-dependencies).

source: KDE has a custom tool to easily install most of its libraries and programs: **Craft**. It can be used to install Kirigami on [Linux](https://community.kde.org/Craft/Linux), [FreeBSD](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/FreeBSD), [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) and [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
eo: KDE havas propran ilon por facile instali la plej multajn el siaj bibliotekoj kaj programoj: **Craft**. Ĝi povas esti uzata por instali Kirigami en [Linukso](https://community.kde.org/Craft/Linux), [FreeBSD](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/FreeBSD), [Vindozo](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows),[Android](https://community.kde.org/Craft/Android) kaj [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
nl: KDE heeft een eigen hulpmiddel om gemakkelijk de meeste van zijn bibliotheken en programma's te installeren: **Craft**. Het kan gebruikt worden om Kirigami te installeren op [Linux](https://community.kde.org/Craft/Linux), [FreeBSD](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/FreeBSD), [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) en [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
sv: KDE har ett eget verktyg för att enkelt installera de flesta av dess bibliotek och program: **Craft**. Det kan användas för att installera Kirigami på [Linux](https://community.kde.org/Craft/Linux), [FreeBSD](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/FreeBSD), [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) och [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
uk: У KDE передбачено нетиповий інструмент для полегшення встановлення більшості бібліотек і програм: **Craft**. Ним можна скористатися для встановлення Kirigami у [Linux](https://community.kde.org/Craft/Linux), [FreeBSD](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/FreeBSD), [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) та [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).

source: You will need to follow the [setup instructions for Craft](https://community.kde.org/Craft). By the end of the setup, you should have run an environment setup file (`craftenv.ps1` or `craftenv.sh`), which will give you a terminal shell where you will be compiling your Kirigami application.
eo: Vi devos sekvi la [agordan instrukciojn por Craft](https://community.kde.org/Craft). Antaŭ la fino de la aranĝo, vi devus esti rulinta medio-agordan dosieron (`craftenv.ps1` aŭ `craftenv.sh`), kiu donos al vi terminalŝelon kie vi kompilos vian Kirigami-aplikaĵon.
nl: U moet de [opzetinstructies voor Craft](https://community.kde.org/Craft) volgen. Aan het einde van de opzet zou u een opzetbestand voor de omgeving (`craftenv.ps1` of `craftenv.sh`) moeten uitvoeren, die u een terminal-shell geeft waar u uw Kirigami toepassing kunt compileren.
sl: Slediti boste morali [navodilom za namestitev za Craft](https://community.kde.org/Craft). Do konca namestitve bi morali zagnati datoteko za nastavitev okolja (`craftenv.ps1` ali `craftenv.sh`), ki vam bo dala terminalsko lupino, kjer boste prevajali svojo aplikacijo Kirigami.
sv: Du måste följa [installationsinstruktionerna för Craft](https://community.kde.org/Craft). I slutet av installationen ska du ha kört en miljöinstallationsfil (`craftenv.ps1` eller `craftenv.sh`), som ger dig ett skal i en terminal där du kan kompilera ditt Kirigami-program.
uk: Вам слід виконати [настанови зі встановлення для Craft](https://community.kde.org/Craft). Наприкінці налаштовування вам слід запустити файл налаштовування середовища (`craftenv.ps1` або `craftenv.sh`), який надасть у ваше розпорядження оболонку термінала, у якій ви збиратимете вашу програму Kirigami.

source: After that, you may simply run the following on a terminal:
eo: Post tio, vi povas simple ruli la jenon sur terminalo:
es: Tras esto, solo tiene que ejecutar lo siguiente en una terminal:
nl: Daarna kunt u eenvoudig het volgende in een terminal uitvoeren:
sl: Po tem lahko preprosto zaženete naslednje na terminalu:
sv: Därefter kan du helt enkelt köra följande på en terminal:
uk: Після цього ви можете просто віддати таку команду у терміналі:

source: If you close your terminal, you can simply run the environment setup file again to compile your app.
eo: Se vi fermas vian terminalon, vi povas simple ruli la medio-agordan dosieron denove por kompili vian apon.
nl: Als u uw terminal sluit kunt u eenvoudig het opzetbestand voor de omgeving opnieuw binnenhalen om uw toepassing te compileren.
sv: Om du stänger din terminal kan du helt enkelt köra miljöinstallationsfilen igen för att kompilera ditt program.
uk: Якщо ви закриєте термінал, ви можете просто ще раз запустити файл налаштовування середовища, щоб зібрати вашу програму.

source: Main.qml
eo: Ĉefa.qml
