Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: `add_executable` takes care of naming our executable and grabbing the files needed to create it
fr: « add_executable » se charge de nommer notre exécutable et de collecter les fichiers nécessaires à sa création.
pl: `add_executable` zajmie się nazwaniem pliku wykonywalnego i pobraniem wszystkich plików potrzebnych do jego stworzenia

source: `target_link_libraries` dynamically links the libraries used in our code to our executable.
fr: « target_link_libraries » effectue une liaison dynamique entre les bibliothèques utilisées dans notre code et notre exécutable.
pl: `target_link_libraries` dynamicznie dowiązuje biblioteki użyte w naszym kodzie do naszego pliku wykonywalnego.

source: A Kirigami Action encapsulates a user interface action. We can use these to provide our applications with easy-to-reach actions that are essential to their functionality.
fr: Une action de Kirigami encapsule une action pour l'interface utilisateur. Nous pouvons les utiliser pour fournir à nos applications des actions faciles d'accès, essentielles à leur fonctionnalité.
pl: Działanie Kirigami stanowi działanie z interfejsu użytkownika. Można je wykorzystać, aby dać naszej aplikacji łatwodostępne działania, które są istotne dla jej funkcjonalności.

source: Like QtQuick Controls Actions, they can be assigned to menu items and toolbar buttons, but also to multiple other Kirigami components.
fr: Comme les actions de contrôles de QtQuick, elles peuvent être affectées aux éléments de menu et aux boutons de la barre d'outils, mais aussi à plusieurs autres composants de Kirigami.
pl: Tak jak działania QtQuick Controls, można je przypisać do wpisów menu oraz przycisków paska narzędzi, ale także do różnych innych składników Kirigami.

source: The `icon.name` property takes names for system-wide icons per the FreeDesktop specification. These icons and icon names can be viewed with KDE's CuttleFish application, or by visiting [FreeDesktop's icon naming specification](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
fr: La propriété « icon.name » prend les noms des icônes du système selon la spécification de FreeDesktop. Ces icônes et leurs noms peuvent être affichés avec l'application CuttleFish de KDE, ou en visitant le site [de spécification des noms d'icônes pour FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pl: Właściwość `icon.name` przyjmuje nazwy ikon systemowych zgodnych z wytycznymi FreeDesktop. Ikony te i ich nazwy można obejrzeć w aplikacji KDE o nazwie CuttleFish lub odwiedzając [wytyczne nazywania ikon we FreeDesktop](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: Another feature of Kirigami Actions is to provide various hints to items using actions about how they should display the action. These are primarily handled by the `displayHint` and `displayComponent` properties.
fr: Une autre fonctionnalité des actions de Kirigami est de pouvoir fournir diverses indications aux éléments utilisant des actions concernant la façon de faire leur affichage. Ces indications sont principalement gérées par les propriétés « displayHint » et « displayComponent ».
pl: Inną możliwością Działań Kirigami jest dostarczenie rozmaitych wskazówek do rzeczy, używających działań, na temat tego jak powinny wyświetlać działania. Są one głównie obsługiwane przez właściwości `displayHint` oraz `displayComponent`.

source: These properties will be respected by the item if possible. For example, the following action will be displayed as a TextField with the item trying its best to keep the item visible as long as possible.
fr: Ces propriétés seront respectées par l'élément si possible. Par exemple, l'action suivante sera affichée en tant que champ de texte avec l'élément faisant de son mieux pour que l'élément reste visible le plus longtemps possible.
pl: Te właściwości będą uznawane przez rzecz, jeśli będzie to możliwe. Na przykład, następujące działanie zostanie wyświetlone jako TextField, gdzie rzecz będzie się starała utrzymać tekst widocznym tak długo jak to możliwe.

source: One of the features of pages is that Actions can be added to them.
fr: L'une des caractéristiques des pages est que des actions peuvent y être ajoutées.
pl: Jedną z cech stron jest to, że można do nich dodać działania.

source: You can add a main action, a left and right action and additional context actions that are displayed on the toolbar if there is enough place or in a hamburger menu on smaller screens.
fr: Vous pouvez ajouter une action principale, une action pour la gauche et la droite et des actions contextuelles supplémentaires, s'affichant dans la barre d'outils, à condition d'avoir suffisamment de place ou dans un menu en hamburger sur les écrans plus petits.
pl: Możesz dodać główne działanie, lewe i prawe działanie oraz dodatkowe działania podręczne, które są wyświetlane na pasku narzędzi, gdy będzie wystarczająco miejsca lub w menu hamburger na mniejszych ekranach.

source: Global Drawer
fr: Tiroir global
pl: Globalna belka
pt: Área Global

source: The global drawer provides an action based navigation to your application. This is the place, where nested actions are useful because it allows you to create nested navigation:
fr: Le tiroir global fournit à votre application à une navigation reposant sur des actions. C'est à cet endroit que les actions imbriquées sont utiles car elles vous permettent de créer une navigation imbriquée :
pl: Globalna półka dodaje rzecz do poruszania się po twojej aplikacji na podstawie działań. Jest to miejsce, w którym użyteczne są zagnieżdżone działania, bo umożliwia ci tworzenie zagnieżdżonych rzeczy do poruszania się.

source: Global Drawers actions on the desktop
fr: Actions globales sur tiroirs pour un ordinateur
pl: Działania globalnych półek na urządzeniach biurkowych

source: Global Drawers actions on a mobile device
fr: Actions globales sur tiroirs pour un périphérique mobile
pl: Działania globalnych półek na urządzeniach przenośnych

source: You can read more about Global Drawers in the [documentation page for drawers](../components-drawers/).
fr: Vous pouvez en apprendre plus sur les tiroirs globaux dans la [page de documentation sur les tiroirs](../components-drawers/).
pl: Więcej o globalnych półkach możesz poczytać na [stronie dokumentacji poświęconej półkom](../components-drawers/).

source: A [Kirigami ActionTextField](docs:kirigami2;ActionTextField) is used to add some contextual actions to a text field, for example to clear the text, or to search for the text.
fr: Un paramètre [Kirigami ActionTextField](docs:kirigami2;ActionTextField) est utilisé pour ajouter certaines actions contextuelles à un champ de texte, par exemple pour effacer le texte ou pour rechercher un texte.
pl: [Kirigami ActionTextField](docs:kirigami2;ActionTextField) jest używany do dodanie pewnych działań podręcznych do pola tekstowego, na przykład aby wyczyścić tekst lub wyszukać jakiegoś tekstu.

source: In this example, we are creating a clear button for a search field only visible when text is entered.
fr: Dans cet exemple, nous créons un bouton d'effacement pour un champ de recherche uniquement visible lorsque du texte est saisi.
pl: W tym przykładzie, tworzymy przycisk czyszczenia pola wyszukiwania tylko wtedy, gdy jakiś tekst został wpisany.

source: ![Search field with text: "I want ](searchfield.png)
fr: ! [Champ de recherche avec le texte : « Je veux » ](searchfield.png)
pl: ![Pole wyszukiwania z tekstem: "I want ](searchfield.png)
pt: ![Campo de pesquisa com texto: "Eu quero ](searchfield.png)

source: A [SwipeListItem](docs:kirigami2;SwipeListItem) is a delegate intended to support extra actions. When using a mouse, they will be shown on hover. On a touch device, they can be shown by dragging the item with the handle.
fr: Un objet [SwipeListItem](docs:kirigami2;SwipeListItem) est un délégué destiné à prendre en charge des actions supplémentaires. Lorsque vous utilisez une souris, ils s'affichent au survol. Sur un périphérique tactile, ils peuvent être affichés en faisant glisser l'élément avec la poignée.
pl: [SwipeListItem](docs:kirigami2;SwipeListItem) jest delegatem stworzonym do obsługi dodatkowych działań. Zostaną one pokazane, przy najechaniu na nie myszy.Na urządzeniach dotykowych, będą pokazywane po przeciągnięciu rzeczy za jej uchwyt.

source: An [ActionToolBar](docs:kirigami2;ActionToolBar) is a toolbar built out of a list of actions. By default, each action that will fit on the toolbar will be represented by a ToolButton, with those that do not fit being moved into a menu at the end of the toolbar.
fr: Un objet [ActionToolBar](docs:kirigami2;ActionToolBar) est une barre d'outils construite à partir d'une liste d'actions. Par défaut, chaque action correspondant à la barre d'outils sera représenté par un bouton « ToolButton », alors que celles ne correspondant pas seront déplacés dans un menu, à la fin de la barre d'outils.
pl: [ActionToolBar](docs:kirigami2;ActionToolBar) jest paskiem narzędzi zbudowanym z listy działań. Domyślnie, każde działanie, które zmieści się na pasku narzędzi będzie przedstawione przyciskiem ToolButton, podczas gdy te, które się nie zmieszczą będą przeniesione do menu na końcu paska narzędzi.

source: Like ActionTextField, you may not need to use ActionToolBar directly as it is used by page headers and cards to provide their action display.
fr: Comme pour le champ « ActionTextField », vous n'aurez peut-être pas besoin d'utiliser directement « ActionToolBar » car elle est utilisée par les en-têtes de page et les cartes pour afficher leurs actions.
pl: Tak jak ActionTextField, możesz potrzebować użyć ActionToolBar bezpośrednio tak jak jest używany przez nagłówki stron oraz karty, aby wyświetlić ich działania.

source: You can read more about ActionToolBar components in their [dedicated documentation page](../components-actiontoolbar/).
fr: Vous pouvez en apprendre plus sur les composants « ActionToolBar » grâce à la [page de documentation dédiée](../composants-actiontoolbar/).
pl: Więcej o składnikach ActionToolBar możesz przeczytać na [stronach dokumentacji im poświęconych](../components-actiontoolbar/).

source: The cards components can also take an action. For more information consult the [component page for Cards](../components-card/).
fr: Les composants de cartes peuvent également effectuer une action. Pour plus d'informations, veuillez consulter la [page des composants pour les cartes](../composants-card/).
pl: Składniki kart także mogą przyjąć działanie. Po więcej szczegółów zajrzyj na [stronę składnika dla kart](../components-card/).

source: Action Tool Bars
fr: Barres d'actions des outils
pl: Paski narzędzi działań

source: Kirigami provides the component `Kirigami.ActionToolBar`. It will display a list of `Kirigami.Action` objects and will display as many of them as possible, providing an overflow menu for the ones that don't fit. The ActionToolBar is dynamic and will move actions in and out of the overflow menu depending on the size available to it.
fr: Kirigami fournit le composant « Kirigami.ActionToolBar ». Il affichera une liste d'objets « Kirigami.Action » et en affichera le plus grand nombre possible, en fournissant un menu de débordement pour ceux qui le peuvent pas. La barre d'outils d'action est dynamique et déplacera les actions dans le menu de débordement, selon la taille disponible.
pl: Kirigami dostarcza składnik `Kirigami.ActionToolBar`. Wyświetli on listę obiektów `Kirigami.Action` i wyświetli ich tyle ile to możliwe, zapewniając menu przelewowe dla tych, które się nie zmieszczą. ActionToolBar jest dynamiczne i będzie przenosić swoje działania do i na zewnątrz menu przelewowego w zależności od dostępnego rozmiaru.

source: The layout and location of your `Kirigami.ActionToolBar` are really up to you, though for the sake of user-friendliness it is usually a good idea to stick to UI conventions and put your toolbar near the top or bottom of your page and to have it spread width-wise.
fr: La disposition et l'emplacement de votre objet « Kirigami.ActionToolBar » dépendent vraiment de vous. Pour des raisons de convivialité, il est généralement conseillé de respecter les conventions de l'interface utilisateur et de placer votre barre d'outils en haut ou en bas de votre page et de l'étendre dans le sens de la largeur.
pl: Układ i położenie naszego `Kirigami.ActionToolBar` są do twojego wyboru, lecz aby były przyjazne użytkownikowi, to lepiej trzymać się zasad tworzenia interfejsów użytkownika i umieścić pasek narzędzi blisko góry lub dołu twojej strony i rozciągnąć go na szerokość.

source: Like most other action-holding components, `Kirigami.ActionToolBar` has an `actions` property. We can assign an array of `Kirigami.Action` components to this property.
fr: Comme la plupart des autres composants d'actions, « Kirigami.ActionToolBar » possède une propriété « actions ». Nous pouvons affecter un tableau de composants « Kirigami.Action » à cette propriété.
pl: Tak ja większość innych składników przechowujących działanie, `Kirigami.ActionToolBar` ma właściwość `actions`. Do właściwości tej, możemy przypisać macierz składników `Kirigami.Action`.

source: By default, actions in the ActionToolBar will be left aligned. This might not be desirable in all situations. Thankfully we can change this with the `alignment` property. We can set this property to a range of values, but the three most relevant ones for an ActionToolBar are `Qt.AlignLeft`, `Qt.AlignCenter`, and `Qt.AlignRight` (which deal with horizontal alignment).
fr: Par défaut, les actions de la barre d'outils d'actions sont alignées à gauche. Cela n'est pas forcément souhaitable dans toutes les situations. Heureusement, nous pouvons changer cela avec la propriété « alignment ». Nous pouvons définir cette propriété dans une gamme de valeurs, mais les trois plus pertinentes pour un objet « ActionToolBar » sont « Qt.AlignLeft », « Qt.AlignCenter » et « Qt.AlignRight » (traitant l'alignement horizontal).
pl: Domyślnie, działania w ActionToolBar będą wyrównane do lewej. Może to być niepożądane we wszystkich przypadkach. Na szczęście możemy to zmienić przy użyciu właściwości `alignment`. Możemy ustawić tę właściwość na kila wartości, lecz najbardziej odpowiednie dla ActionToolBar to `Qt.AlignLeft`, `Qt.AlignCenter` oraz `Qt.AlignRight` (które dotyczą wyrównania w poziomie).

source: ![ActionToolBar with children center-aligned](/docs/use/kirigami/components-actiontoolbar/actiontoolbar-alignment.png)
fr: ! [Barre d'outils d'action avec des fils alignés de façon centrée](/docs/use/kirigami/components-actiontoolbar/actiontoolbar-alignment.png)

source: A card serves as overview and an entry point for more detailed information and can offer direct access to the most important actions on an item.
fr: Une carte sert de vue d'ensemble et de point d'entrée pour des informations plus détaillées . Elle peut offrir un accès direct aux actions les plus importantes sur un élément.
pl: Karta służy jako przegląd i punkt wejściowy do bardziej szczegółowych danych i może dać bezpośredni dostęp do najważniejszych działań danej rzeczy.

source: The Kirigami types [`Kirigami.AbstractCard`](docs:kirigami2;org::kde::kirigami::AbstractCard) and [`Kirigami.Card`](docs:kirigami2;org::kde::kirigami::Card) are used to implement the popular card component used on many mobile and web platforms. Cards can be used to display a collection of information or actions in an attractive and distinctive way.
fr: Les types de Kirigami [ « Kirigami.AbstractCard » ](docs:kirigami2;org::kde::kirigami::AbstractCard) et [ « Kirigami.Card » ](docs:kirigami2;org::kde::kirigami::Card) sont utilisés pour implémenter le composant populaire de carte, utilisé sur de nombreuses plate-formes mobiles et Internet. Les cartes peuvent être utilisées pour afficher un ensemble d'informations ou d'actions d'une manière attrayante et distinctive.
pl: Rodzaje Kirigami [`Kirigami.AbstractCard`](docs:kirigami2;org::kde::kirigami::AbstractCard) oraz [`Kirigami.Card`](docs:kirigami2;org::kde::kirigami::Card) są używane, aby zaimplementować powszechne składniki kart używane na wielu platformach sieciowych i przenośnych. Kart można używać do wyświetlania zbiorów informacji lub działań w ładny i wyraźny sposób.

source: Kirigami also offers 3 kinds of views and positioners to aid you in presenting your cards with beautiful and responsive layouts.
fr: Kirigami propose également 3 types de vues et de positionneurs pour vous aider à présenter vos cartes selon des mises en page belles et réactives.
pl: Kirigami daje także 3 rodzaje widoków i rzeczy umieszczających, aby pomóc w przedstawianiu kart przy użyciu pięknych i łatwo obsługiwalnych układów.

source: A [`Kirigami.AbstractCard`](docs:kirigami2;Card) is the simplest type of card. It's just a rectangle with a shadow, which can contain any `Item` in it. It can also have items assigned to its `header` or `footer` properties. In this case a [`Kirigami.Heading`](docs:kirigami2;Heading) is its header and a [`Controls.Label`](docs:qtquickcontrols;QtQuick.Controls.Label) with `wrapMode` set to `Text.WordWrap` is the card's `contentItem`.
fr: Une carte [ « Kirigami.AbstractCard » ](docs:kirigami2;Card) est le type de carte le plus simple. C'est juste un rectangle avec une ombre, pouvant contenir n'importe quel « Item ». Elle peut aussi avoir des éléments associés à ses propriétés « header » ou « footer ». Dans ce cas, un objet [ « Kirigami.Heading »](docs:kirigami2;Heading) représente son en-tête et un objet [ « Controls.Label » ](docs:qtquickcontrols;QtQuick.Controls.Label) en mode « wrapMode » positionné à « Text.WordWrap » représente le « contenu » de la carte.
pl: [`Kirigami.AbstractCard`](docs:kirigami2;Card) jest najprostszym rodzajem karty. Jest to tylko prostokąt z cieniem, który może w sobie zawierać dowolną `Item`. Może także mieć przypisane rzeczy do swoich właściwości `header` lub `footer`. W tym przypadku [`Kirigami.Heading`](docs:kirigami2;Heading) jest jego nagłówkiem a [`Controls.Label`](docs:qtquickcontrols;QtQuick.Controls.Label) z `wrapMode` ustawionym na `Text.WordWrap` jest `contentItem` karty.

source: ![Screenshot of an Abstract Card](/docs/use/kirigami/components-card/abstract-card.png)
fr: ![Copie d'écran d'une carte abstraite](/docs/use/kirigami/components-card/abstract-card.png)

source: A [`Kirigami.Card`](docs:kirigami2;Card) inherits from [`Kirigami.AbstractCard`](docs:kirigami2;AbstractCard) and provides more features out of the box. A card has a header composed of a `banner` and a footer composed of [`Kirigami.Action`](docs:kirigami2;Action) objects alongside its main content.
fr: Un objet [ « Kirigami.Card » ](docs:kirigami2;Card) hérite de l'objet [ « Kirigami.AbstractCard » ](docs:kirigami2;AbstractCard) et fournit plus de fonctionnalités de façon intégrée. Une carte possède une en-tête composée d'un objet « banner » et d'un pied de page composé d'objets [ « Kirigami.Action » ](docs:kirigami2;Action) à côté de son contenu principal.
pl: [`Kirigami.Card`](docs:kirigami2;Card) dziedziczy z [`Kirigami.AbstractCard`](docs:kirigami2;AbstractCard) i domyślnie daje więcej możliwości. Karta ma nagłówek składający się z `banner` oraz nagłówka składającego się z obiektu [`Kirigami.Action`](docs:kirigami2;Action) obok swojego głównego składnika.

source: CardsLayout
fr: Dispositions des cartes

source: A [`Kirigami.CardsLayout`](docs:kirigami2;CardsLayout) is most useful when the cards being presented are not instantiated by a model or by a model which always has very few items. They are presented as a grid of two columns which will remain centered if the application is really wide, or become a single column if there is not enough space for two columns, such as a mobile phone screen.
fr: Un objet [ « Kirigami.CardsLayout » ](docs:kirigami2;CardsLayout) est plus utile lorsque les cartes présentées ne sont pas instanciées par un modèle ou par un modèle qui possède toujours très peu d'éléments. Les cartes sont présentées sous la forme d'une grille de deux colonnes qui restera centrée si l'application est vraiment large ou passera sous une seule colonne s'il n'y a pas assez de place pour deux colonnes, comme sur l'écran d'un téléphone portable.
pl: [`Kirigami.CardsLayout`](docs:kirigami2;CardsLayout) jest najbardziej użyteczny, gdy przedstawiane karty nie są tworzone przez model lub przez model, który zawsze zawiera niewiele rzeczy. Są przedstawiane jako siatka dwóch kolumn, które pozostaną wyśrodkowane, jeśli aplikacja jest na prawdę szeroka, lub staną się pojedynczą kolumną, jeśli nie ma miejsca na dwie kolumny, tak jak w przypadku ekranów telefonów.

source: **A CardsLayout should always be contained within a ColumnLayout.**
fr: **Un « CardsLayout » doit toujours être contenu dans un « ColumnLayout ».**
pl: **CardsLayout powinien zawsze znajdować się w ColumnLayout.**

source: A card can optionally be oriented horizontally. In this case it will be wider than tall, and is better suited to being placed in a ColumnLayout. If you must put it in a CardsLayout, it will have a columnSpan of 2 by default.
fr: Une carte peut éventuellement être orientée horizontalement. Dans ce cas, elle sera plus large que haute et elle sera mieux adaptée pour être placée dans une disposition « ColumnLayout ». Si vous devez la placer dans un « CardsLayout », elle aura une propriété « columnSpan » de valeur 2 par défaut.
pl: Jeśli chcesz, to kartę możesz także ustawić w poziomie. W tym przypadku będzie ona szersza niż wyższa i lepiej będzie ją umieścić w ColumnLayout. Jeśli musisz ją umieścić w CardsLayout, to domyślnie będzie miała ustawione columnSpan na 2.

source: ![Screenshot of a CardsLayout](/docs/use/kirigami/components-card/cardslayout.png)
fr: ![Copie d'écran d'une disposition de cartes](/docs/use/kirigami/components-card/cardslayout.png)

source: A [`Kirigami.CardsListView`](docs:kirigami2;CardsListView) is a list view that can be used with [`Kirigami.AbstractCard`](docs:kirigami2;AbstractCard) components.
fr: Une [ « Kirigami.CardsListView » ](docs:kirigami2;CardsListView) est un affichage en liste pouvant être utilisé avec des composants [ « Kirigami.AbstractCard » ](docs:kirigami2;AbstractCard).
pl: [`Kirigami.CardsListView`](docs:kirigami2;CardsListView) jest widokiem listy, który może być użyty ze składnikami [`Kirigami.AbstractCard`](docs:kirigami2;AbstractCard).

source: A `Kirigami.CardsListView` will stretch child cards to its own width. This component should therefore only be used with cards which will look good at any horizontal size. Using a `Kirigami.CardsListView` the `Kirigami.Card` component is discouraged, unless it has `Qt.Horizontal` as its `headerOrientation` property.
fr: Un objet « Kirigami.CardsListView » va étirer les cartes fils selon sa propre largeur. Ce composant ne doit donc être utilisé qu'avec des cartes ayant une apparence correcte quel que soit leur taille horizontale. Il est déconseillé d'utiliser un objet « Kirigami.CardsListView » avec le composant « Kirigami.Card », sauf s'il a une valeur « Qt.Horizontal » comme propriété « headerOrientation ».
pl: `Kirigami.CardsListView` rozciągnie karty podrzędne do swojej własnej szerokości. Składnika tego powinno się zatem używać tylko z kartami, które będą wyglądać dobrze przy każdym rozmiarze szerokości. Nie zalecamy używania `Kirigami.CardsListView` składnika `Kirigami.Card`, chyba, że zawiera `Qt.Horizontal` w swojej właściwości `headerOrientation`.
