Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [Connect logic to your QML user interface](/docs/getting-started/kirigami/advanced-connect_backend)
ca: [Connectar la lògica amb la vostra interfície d'usuari en QML](/docs/getting-started/kirigami/advanced-connect_backend)
eo: [Konekti logikon al via uzantinterfaco de QML](/docs/getting-started/kirigami/advanced-connect_backend)
es: [Conectar la lógica de su interfaz de usuario en QML](/docs/getting-started/kirigami/advanced-connect_backend)
nl: [Verbindingslogica naar uw QML gebruikersinterface](/docs/getting-started/kirigami/advanced-connect_backend)
pt: [Ligar a lógica à sua interface de utilizador em QML](/docs/getting-started/kirigami/advanced-connect_backend)
sl: [Povežite logiko z uporabniškim vmesnikom QML](/docs/kirigami/advanced-connect_backend)
sv: [Anslut logik till ditt QML användargränssnitt](/docs/getting-started/kirigami/advanced-connect_backend)
uk: [З'єднання логіки з вашим інтерфейсом користувача QML](/docs/getting-started/kirigami/advanced-connect_backend)

source: Add advanced functionality to your Kirigami application and connect it to your UI.
ca: Afegir una funcionalitat avançada a la vostra aplicació en Kirigami i connecteu-la amb la IU.
eo: Aldonu altnivelan funkcion al via Kirigami-aplikaĵo kaj konektu ĝin al via UI.
es: Añadir funcionalidad avanzada a su aplicación Kirigami y conectarla a la interfaz gráfica.
fr: Ajoutez des fonctionnalités avancées à votre application sous Kirigami et connectez-la à votre interface utilisateur.
nl: Geavanceerde functionaliteit toevoegen aan uw Kirigami toepassing en het verbinden met uw UI.
pl: Dodaj rozbudowane możliwości do swojej aplikacji Kirigami i podłącz ją do interfejsu użytkownika.
pt: Adicione funcionalidades avançadas à sua aplicação em Kirigami e ligue-a à sua interface.
sl: Dodajte napredno funkcionalnost v aplikacijo Kirigami in jo povežite z uporabniškim vmesnikom.
sv: Lägg till avancerade funktioner i ditt Kirigami-program och anslut det till användargränssnittet.
uk: Додаємо функціональні можливості до програми Kirigami і з'єднуємо їх із інтерфейсом користувача.

source: [About Page](/docs/getting-started/kirigami/advanced-add_about_page)
ca: [Pàgina «Quant al»](/docs/getting-started/kirigami/advanced-add_about_page)
eo: [Pri Paĝo](/docs/getting-started/kirigami/advanced-add_about_page)
es: [Página «Acerca de»](/docs/getting-started/kirigami/advanced-add_about_page)
nl: [Pagina Info over](/docs/getting-started/kirigami/advanced-add_about_page)
pt: [Página 'Acerca'](/docs/getting-started/kirigami/advanced-add_about_page)
sl: [O strani](/docs/kirigami/advanced-add_about_page)
sv: [Om-sida](/docs/getting-started/kirigami/advanced-add_about_page)
uk: [Сторінка «Про програму»](/docs/getting-started/kirigami/advanced-add_about_page)

source: Add an "About Page" to your UI.
ca: Afegeix una «Pàgina quant al» a la interfície d'usuari.
eo: Aldonu "Pri Paĝo" al via UI.
es: Añadir una «Página "Acerca de"» a la interfaz gráfica.
nl: Een pagina "Info over" aan uw UI toevoegen.
pt: Adicione uma página "Acerca" na sua interface do utilizador.
sl: Dodajte "About Page" k vašemu uporabniškemu vmesniku.
sv: Lägg till en "Om-sida" i användargränssnittet.
uk: Додаємо сторінку «Про програму» до вашого інтерфейсу користувача.

source: Beginner C++ resources
ca: Recursos de C++ per a novells
eo: Komencaj C++-resursoj
es: Recursos de C++ para principiantes
fr: Ressources C++ pour débutant(e)s
nl: C++ hulpbronnen voor de beginner
pl: Zasoby C++ dla początkujących
pt: Recursos de C++ para principiantes
sl: Viri C++ za začetnike
sv: C++ nybörjarresurser
uk: Ресурси щодо C++ для початківців

source: If you are completely new to C++, there are numerous resources available throughout the web. Here are some that may be useful.
ca: Si sou completament nou en C++, al web existeixen nombrosos recursos disponibles. A continuació, es mostren alguns que poden resultar d'utilitat.
eo: Se vi estas tute nova en C++, ekzistas multaj rimedoj disponeblaj tra la reto. Jen kelkaj, kiuj povas esti utilaj.
es: Si es completamente nuevo en C++, existen numerosos recursos disponibles en la web. Estos son algunos que pueden resultarle útiles.
nl: Als u geheel nieuw bent in C++, er zijn talrijke hulpbronnen beschikbaar op het web. Hier zijn er enige die nuttig kunnen zijn.
pt: Se for completamente novo no C++, existem numerosos recursos disponíveis na Web. Aqui estão alguns que poderão ser úteis.
sl: Če ste popolnoma novi v C++ so na voljo številni viri v celotnem spletu. Tukaj jih je nekaj, ki bi lahko bili koristni.
sv: Om du är helt ny till C++, finns en mängd resurser tillgängliga överallt på webben. Här är några som kan vara användbara.
uk: Якщо ви нічого не знаєте про мову C++, в інтернеті можна знайти численні ресурси із інформацією. Тут ми наведемо лише деякі з них, які можуть бути корисними.

source: Resource
ca: Recurs
eo: Rimedo
es: Recurso
fr: Ressource
nl: Hulpbron
pl: Zasób
pt: Recurso
sl: Vir
sv: Resurs
uk: Ресурс

source: Tutorials to get to grips with C++
ca: Guies d'aprenentatge per a familiaritzar-se amb C++
eo: Lerniiloj por ekkompreni C++
es: Tutoriales para familiarizarse con C++
fr: Tutoriels pour se familiariser avec le C++
nl: Inleidingen om grip te krijgen op C++
pl: Samouczki do zrozumienia C++
pt: Tutoriais práticos de C++
sl: Vaje za spoprijemanje s C++
sv: Handledningar för att greppa C++
uk: Покрокові підручники для ознайомлення із C++

source: A reference site for C++
ca: Un lloc de referència per a C++
eo: Referenca retejo por C++
es: Un sitio de referencia para C++
fr: Un site de référence pour le langage C++
nl: Een referentiesite voor C++
pl: Podręcznik dla C++
pt: Uma página de referência para o C++
sl: Referenčno spletišče za C++
sv: En referensplats för C++
uk: Довідковий сайт з C++

source: [Wikibooks C++](https://en.wikibooks.org/wiki/C%2B%2B_Programming)
ca: [C++ a Wikibooks](https://en.wikibooks.org/wiki/C%2B%2B_Programming)
eo: [Vikilibroj C++](https://en.wikibooks.org/wiki/C%2B%2B_Programming)
fr: [Tutoriels « Wikibooks » pour le langage C++](https://en.wikibooks.org/wiki/C%2B%2B_Programming)
pt: [Wikibooks de C++](https://en.wikibooks.org/wiki/C%2B%2B_Programming)
uk: [Вікіпідручники з C++](https://en.wikibooks.org/wiki/C%2B%2B_Programming)

source: A comprehensive wikibook with C++ lessons and exercises
ca: Un llibre wiki complet amb lliçons i exercicis de C++
eo: Ampleksa vikilibro kun C++ lecionoj kaj ekzercoj
es: Un exhaustivo wikilibro con lecciones y ejercicios de C++
fr: Un tutoriel « wikibook » complet avec des leçons et des exercices sur le langage C++.
nl: Een beknopt wikibook met C++ lessen en oefeningen
pl: Szczegółowa książka wiki z lekcjami oraz ćwiczeniami w C++
pt: Um livro em Wiki abrangente com lições e exercícios de C++
sl: Celovita wiki-knjiga s C++ lekcijami in vajami
sv: En heltäckande wikibok med C++ lektioner och övningar
uk: Повний вікіпідручник з уроками і вправами з C++

source: [W3Schools C++](https://www.w3schools.com/cpp/cpp_intro.asp)
ca: [C++ a W3Schools](https://www.w3schools.com/cpp/cpp_intro.asp)

source: A set of C++ tutorials and other resources aimed at beginners
ca: Un conjunt de guies d'aprenentatge de C++ i altres recursos adreçats a principiants
eo: Aro da C++ lerniloj kaj aliaj rimedoj celitaj al komencantoj
es: Un conjunto de tutoriales en C++ y otros recursos destinados a principiantes
fr: Un ensemble de tutoriels C++ et d'autres ressources destinées aux débutants
nl: Een set C++ inleidingen en andere hulpbronnen gericht op beginners
pl: Zbiór samouczków C++ i inne zasoby skierowane do początkujących
pt: Um conjunto de tutoriais de C++ e outros recursos destinados a principiantes
sl: Sklop učbenikov C++ in drugih virov namenjenih začetnikom
sv: En uppsättning C++ handledningar och andra resurser avsedda för nybörjare
uk: Набір покрокових підручників з C++ та інші ресурси для початківців

source: We also provide a list of continuously updated resources to learn C++ in [Learning more](/docs/getting-started/building/help-learn/).
ca: També proporcionem una llista recursos actualitzats contínuament per a aprendre C++ en [Aprendre'n més](/docs/getting-started/building/help-learn/).

source: Creating classic KDE applications using QtWidgets
ca: Crear aplicacions KDE clàssiques mitjançant QtWidgets
eo: Krei klasikajn KDE-aplikaĵojn uzante QtWidgets
es: Creación de aplicaciones clásicas de KDE que usan QtWidgets
fr: Création d'applications classiques pour KDE à l'aide de QtWidgets
nl: Klassieke KDE toepassingen aanmaken met QtWidgets
pl: Tworzenie klasycznych aplikacji KDE przy użyciu QtWidgets
pt: Criar aplicações clássicas do KDE com o QtWidgets
sl: Ustvarjanje klasičnih aplikacij KDE z uporabo QtWidget-ov
sv: Skapa klassiska KDE-program genom att använda QtWidgets
uk: Створення класичних програм KDE за допомогою QtWidgets

source: If you'd like to work on KDE applications such as Dolphin, Kontact, or Kate, you will need to learn how to use QtWidgets, which uses a completely different way of developing user interfaces with Qt. More complex KDE applications or applications that follow a traditional design tend to be built with QtWidgets.
ca: Si us agradaria treballar en les aplicacions KDE com el Dolphin, el Kontact o el Kate, us caldrà aprendre més sobre com utilitzar QtWidgets, els quals usen una forma completament diferent de desenvolupar les interfícies d'usuari amb les Qt. Les aplicacions KDE més complexes o antigues que segueixen un disseny tradicional tendeixen a construir-se amb QtWidgets.
eo: Se vi ŝatus labori pri KDE-aplikoj kiel Dolphin, Kontact aŭ Kate, vi devos lerni kiel uzi QtWidgets, kiu uzas tute alian manieron evoluigi uzantinterfacojn kun Qt. Pli kompleksaj KDE-aplikoj aŭ aplikoj kiuj sekvas tradician dezajnon tendencas esti konstruitaj per QtWidgets.
nl: Als u wilt werken aan KDE toepassingen zoals Dolphin, Kontact of Kate dan moet u weten hoe QtWidgets te gebruiken, die een compleet andere manier van ontwikkelen van gebruikersinterfaces met Qt gebruiken. Complexere KDE toepassingen of toepassingen die een traditioneel ontwerp volgen tenderen naar het bouwen met QtWidgets.
sl: Če bi radi delali na aplikacijah KDE, kot so Dolphin, Kontact ali Kate, se boste morali naučiti uporabljati QtWidgets, ki uporablja povsem drugačen način razvijanja uporabniških vmesnikov s Qt. Bolj zapletene aplikacije KDE ali aplikacije, ki sledijo tradicionalni zasnovi, so ponavadi zgrajene s QtWidgets.
sv: Om du skulle vilja arbeta på mer komplexa KDE-program såsom Dolphin, Kontact eller Kate, behöver du lära dig mer om hur QtWidgets används, som utgör ett helt annat sätt att utveckla användargränssnitt med Qt. Mer komplex KDE-program eller program som följer en traditionell design tenderar att vara byggda med QtWidgets.
uk: Якщо ви хочете попрацювати над програмами KDE, зокрема Dolphin, Kontact або Kate, вам знадобляться знання щодо того, як користуватися QtWidgets, тобто зовсім іншого способу розробки інтерфейсів користувача за допомогою Qt. Складніші програми KDE або програми, у яких використано традиційний дизайн, має бути побудовано з використанням QtWidgets.

source: QtWidgets is somewhat more daunting to work with than QML (and *much* more C++ intensive!). Luckily, we have [a set of tutorials](/docs/getting-started/kxmlgui) in the KDE Docs that will help you become more familiar with them.
ca: És una mica més complicat treballar amb QtWidgets que amb el QML (i *molt* més intensiu en C++!). Afortunadament, tenim [un conjunt de guies d'aprenentatge](/docs/getting-started/kxmlgui) en el KDE Docs que us ajudaran a familiaritzar-vos amb ells.
eo: QtWidgets estas iom pli timiga labori kun ol QML (kaj *multe* pli C++-intensa!). Feliĉe, ni havas [aro da lerniloj](/docs/getting-started/kxmlgui) en la KDE-Dokumentoj, kiuj helpos vin pli familiariĝi kun ili.
nl: QtWidgets boezemen ietwat meer angst in om mee te werken dan QML (en *veel* meer gebruik van C++ !). Gelukkig hebben we [een set handleidingen](/docs/getting-started/kxmlgui) in de KDE Docs die u zullen helpen om meer bekend met hen te raken.
sl: QtWidgets je nekoliko bolj zastrašujoče za delo kot QML (in *veliko* bolj intenzivno C++!). Na srečo imamo [nabor učbenikov](/docs/getting-started/kxmlgui) v dokumentih KDE, ki vam bodo pomagali, da se z njimi bolje seznanite.
sv: QtWidgets är något mer skrämmande att arbeta med än QML (och *mycket* mer C++ intensiva). Tursamt nog har vi [en mängd handledningar](/docs/getting-started/kxmlgui) i KDE:s dokumentation som hjälper dig bli bekantare med dem.
uk: QtWidgets дещо складніші у роботі, якщо порівнювати з QML (і потребують *набагато* ширших знань C++!). На щастя, у нас є [набір підручників](/docs/getting-started/kxmlgui) у документації KDE, який допоможе вам ознайомитися із потрібними темами.

source: More QML and QtQuick
ca: Més QML i QtQuick
eo: Pli QML kaj QtQuick
es: Más QML y QtQuick
fr: Plus sur QML et QtQuick
nl: Meer QML en QtQuick
pl: Więcej QML oraz QtQuick
pt: Mais sobre o QML e o QtQuick
sl: Več QML in QtQuick
sv: Mer QML och QtQuick
uk: Більше QML і QtQuick

source: The Qt project is extensive, and so are QML and QtQuick. There is a lot of functionality we haven't covered, but there is a lot of documentation we can pull from to find out more.
ca: El projecte Qt és extens, com també QML i QtQuick. Hi ha moltes funcionalitats que no hem cobert, però hi ha molta documentació de la qual podem extreure per a obtenir més informació.
eo: La projekto Qt estas ampleksa, kaj ankaŭ QML kaj QtQuick. Estas multe da funkcioj, kiujn ni ne kovris, sed estas multe da dokumentaro, el kiu ni povas eltiri por ekscii pli.
es: El proyecto Qt es extenso, al igual que QML y QtQuick. Hay muchas funciones que no hemos cubierto, pero existe mucha documentación que podemos usar para obtener más información.
fr: Le projet Qt est vaste, tout comme ceux de QML et QtQuick. Il y a beaucoup de fonctionnalités que nous n'avons pas traitées. Mais, il y a beaucoup de documentation dans laquelle nous pouvons puiser pour en savoir plus.
nl: Het Qt project is uitgebreid en dus ook QML en QtQuick. Er is heel wat functionaliteit die we niet hebben behandeld, maar er is heel wat documentatie waar we uit kunnen putten om meer te weten te komen.
pl: Projekt Qt daje się rozbudowywać tak samo jak QML oraz QtQuick. Istnieje wiele możliwości, o których nie mówiliśmy, lecz istnieje dużo dokumentacji, którą możemy przejrzeć, aby dowiedzieć się więcej.
pt: O projecto Qt é extenso e, como tal, também o QML e o QtQuick. Existe um grande conjunto de funcionalidades que ainda não cobrimos, mas existe bastante documentação que podemos consultar para descobrir mais coisas.
sl: Projekt Qt je obsežen in prav tako QML in QtQuick. Obstaja veliko funkcionalnosti, ki je nismo obdelali, vendar je veliko dokumentacije, ki jo lahko izvlečemo, da izvemo več.
sv: Qt-projektet är omfattande, och det är QML och QtQuick också. Det finns mycket funktionalitet vi inte har täckt, men det finns mycket dokumentation som vi kan utnyttja för att ta reda på mer.
uk: Проєкт Qt є досить великим, і так само великими його частинами є QML і QtQuick. Ми ні слова не сказали про велику частину функціональних можливостей, але існує широкий діапазон документації, з якою ми можемо ознайомитися, щоб розширити наші знання.

source: If you want to look up what specific components do, look no further than [Qt's official QML documentation.](https://doc.qt.io/qt-6/qtquick-index.html)
ca: Si voleu cercar què fa algun component específic, no cerqueu més enllà de la [documentació QML oficial de les Qt.](https://doc.qt.io/qt-6/qtquick-index.html)
eo: Se vi volas serĉi, kion faras specifaj komponantoj, ne rigardu pli ol [la oficiala QML-dokumentado de Qt.](https://doc.qt.io/qt-6/qtquick-index.html)
es: Si desea buscar lo que hacen los distintos componentes, no busque más que la [documentación oficial de QML de Qt](https://doc.qt.io/qt-6/qtquick-index.html).
nl: Als u wilt opzoeken wat specifieke componenten doen, kijk niet verder dan [Qt's officiële QML documentatie.](https://doc.qt.io/qt-6/qtquick-index.html)
sl: Če želite poiskati, kaj naredijo določene komponente, ne glejte dlje od [Qt-jeve uradne dokumentacije QML.](https://doc.qt.io/qt-6/qtquick-index.html)
sv: Om du vill slå upp vad specifika komponenter gör, behöver du inte gå längre än till [Qt:s officiella QML-dokumentation.](https://doc.qt.io/qt-6/qtquick-index.html)
uk: Якщо ви хочете дізнатися, для чого призначено певні компоненти, зверніться одразу до [офіційної документації з QML Qt.](https://doc.qt.io/qt-6/qtquick-index.html)

source: If you are looking for a more guided approach to learning, [the QMLBook](https://www.qt.io/product/qt6/qml-book) is a great place to start.
ca: Si esteu cercant un enfocament d'aprenentatge més guiat, [el QMLBook](https://www.qt.io/product/qt6/qml-book) és un espai ideal per a començar.

source: More Kirigami
ca: Més Kirigami
eo: Pli da Kirigami
es: Más Kirigami
fr: Plus sur Kirigami
nl: Meer Kirigami
pl: Więcej Kirigami
pt: Mais sobre o Kirigami
sl: Več Kirigamija
sv: Mer Kirigami
uk: Більше Kirigami

source: This documentation includes a lot more about Kirigami. You can poke through some of the Components pages to find out more about some of the QML components that Kirigami provides for you to use.
ca: Aquesta documentació inclou molt més sobre el Kirigami. Podeu fullejar algunes de les pàgines de Components per a obtenir més informació sobre alguns dels components QML que proporciona el Kirigami perquè els utilitzeu.
eo: Ĉi tiu dokumentaro inkluzivas multe pli pri Kirigami. Vi povas trarigardi kelkajn el la Komponantoj-paĝoj por ekscii pli pri iuj el la QML-komponentoj, kiujn Kirigami provizas por vi uzi.
es: Esta documentación incluye mucho más sobre Kirigami. Puede hojear algunas de las páginas de Componentes para obtener más información sobre algunos de los componentes de QML que proporciona Kirigami.
fr: Cette documentation présente beaucoup plus d'informations sur Kirigami. Vous pouvez parcourir certaines des pages sur les composants pour en savoir plus sur certains composants QML que Kirigami met à votre disposition.
nl: Deze documentatie bevat heel wat meer over Kirigami. U kunt rondstruinen in enige van de pagina's Componenten om meer te weten te komen over sommige van de QML componenten die Kirigami voor uw gebruik levert.
pl: Ta dokumentacja zawiera o wiele więcej szczegółów o Kirigami. Możesz przejrzeć strony niektórych składników, aby dowiedzieć się więcej o tych, które dostarcza Kirigami.
pt: Esta documentação inclui muito mais sobre o Kirigami. Poderá percorrer algumas das páginas de Componentes para descobrir mais sobre alguns dos componentes de QML que o Kirigami lhe disponibiliza para usar.
sl: Ta dokumentacija vključuje veliko več o Kirigamiju. Če želite izvedeti več o nekaterih straneh o komponentah QML, lahko pokukate v nekatere komponente, ki jih Kirigami vam zagotavlja za uporabo.
sv: Dokumentationen inkluderar mycket mer om Kirigami. Du kan gå igenom en del av komponentsidorna för att ta reda på mer om en del av QML-komponenterna som Kirigami tillhandahåller för dig att använda.
uk: Цю документацію в основному призначено для вивчення Kirigami. Ви можете звернутися до сторінок компонентів, щоб дізнатися більше про деякі з компонентів QML, як надає у ваше користування Kirigami.

source: We recommend you also take a look at [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/), an application designed by KDE developers to demonstrate Kirigami's tools and capabilities. It provides both interactive examples of Kirigami components as well as links to the source code of these examples so you can see how they were built.
ca: Us recomanem que també vegeu la [Galeria del Kirigami](https://apps.kde.org/kirigami2.gallery/), una aplicació dissenyada per desenvolupadors del KDE per a mostrar les eines i capacitats del Kirigami. Proporciona tant exemples interactius dels components del Kirigami, així com enllaços amb el codi font d'aquests exemples perquè pugueu veure com s'han creat.
eo: Ni rekomendas, ke vi ankaŭ rigardu [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/), aplikaĵon dezajnitan de KDE-programistoj por montri la ilojn kaj kapablojn de Kirigami. Ĝi provizas ambaŭ interagajn ekzemplojn de Kirigami-komponentoj same kiel ligilojn al la fontkodo de ĉi tiuj ekzemploj por ke vi povu vidi kiel ili estis konstruitaj.
nl: We bevelen u ook aan om een kijkje te nemen in de Kirigami galerij [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/), een toepassing ontworpen door KDE ontwikkelaars om de hulpmiddelen en mogelijkheden van Kirigami te demonstreren. Het biedt zowel interactieve voorbeelden van Kirigami componenten alsook koppelingen naar de broncode van deze voorbeelden zodat u kunt zien hoe ze zijn gebouwd.
sl: Priporočamo, da si ogledate tudi [Kirigami Gallery](https://apps.kde.org/kirigami2.gallery/), aplikacijo, ki so jo oblikovali razvijalci KDE za predstavitev orodij in zmožnosti Kirigami. Ponuja tako interaktivne primere komponent Kirigami kot tudi povezave do izvorne kode teh primerov, tako da lahko vidite, kako so bili zgrajeni.
sv: Vi rekommenderar att du också tar en titt på [Kirigami galleri](https://apps.kde.org/kirigami2.gallery/), ett program konstruerat av KDE-utvecklare för att demonstrera Kirigamis verktyg och möjligheter. Det tillhandahåller både interaktiva exempel på Kirigami komponenter samt länkar till källkoden för exemplen, så att du kan se hur de byggts.
uk: Рекомендуємо вам поглянути на [Галерею Kirigami](https://apps.kde.org/kirigami2.gallery/), програму, яку було створено розробниками KDE для демонстрації інструментів і можливостей Kirigami. Там ви знайдете інтерактивні приклади компонентів Kirigami і прості у користуванні посилання на початковий код прикладі, щоб ви могли ознайомитися із тим, як побудовано ці компоненти.

source: The sky is the limit!
ca: El cel és el límit!
eo: La ĉielo estas la limo!
es: ¡El cielo es el limite!
fr: Le ciel comme seule limite !
pl: Tylko niebo cię ogranicza!
pt: O céu é o limite!
sl: Nebo je meja!
sv: Endast fantasin sätter gränser!
uk: Немає меж досконалості!
