Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: We also set the window `title` property to "Hello World". You'll notice that we have wrapped our "Hello World" string in a function called `i18nc()`, where we detail the context of the string as well as the string itself.
eo: Ni ankaŭ fiksas la fenestron `titolo` proprecon al "Saluton Mondo". Vi rimarkos, ke ni envolvis nian "Saluton Mondo" en funkcio nomata `i18nc()`, kie ni detaligas la kuntekston de la ĉeno same kiel la ĉenon mem.
es: También definimos la propiedad `title` de la ventana con el valor «Hello World». Notará que hemos encerrado la cadena «Hello World» en una función llamada `i18nc()`, donde detallamos el contexto de la cadena así como la propia cadena de texto.
nl: We stellen ook de eigenschap `title` van het venster in op "Hello World". U zult hebben opgemerkt dat we onze tekenreeks "Hello World" hebben ingepakt in een functie genaamd `i18nc`, waar we de context van de tekenreeks, evenals de tekenreeks zelf, detailleren.
pt: Também configuramos a propriedade `title` da janela como "Hello World" (Olá Mundo). Irá reparar que envolvemos o nosso texto com uma função chamada `i18nc()`, onde iremos detalhar o contexto do texto, assim como o texto propriamente dito.
sl: Naslov okna kot lastnost 'title' smo nastavili na "Hello World". Opazili boste, da smo zavili naš niz "Hello World" v funkcijo imenovano 'i18nc()', kjer podrobno opišemo kontekst niza kot tudi sami niz.
sv: Vi ställer också in fönstrets egenskap `title` till "Hello World". Du märker att vi har omgivit vår "Hello World" sträng med en funktion som heter `i18nc()`, där vi beskriver strängens sammanhang förutom själva strängen.
uk: Ми також встановимо для властивості вікна `title` значення «Hello World». Ми зауважимо, що рядок «Hello World» огорнуто у функцію із назвою `i18nc()`. У цій функції ми деталізуємо контекст рядка, а також вказуємо сам рядок.

source: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) builds on the `i18n()` function by allowing developers to provide some context to translators working on the app. Here we clarify that the UI component is the title of the application window, so we have included the string "@title:window" before "Hello World". See the [Ki18n Programmer's guide](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) for more details.
eo: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) baziĝas sur la funkcio `i18n()` permesante al programistoj disponigi iom da kunteksto al tradukistoj laborantaj pri la programo . Ĉi tie ni klarigas, ke la UI-komponento estas la titolo de la aplika fenestro, do ni inkluzivis la ĉenon "@title:window" antaŭ "Saluton Mondo". Vidu la [Ki18n Programmer's guide](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) por pliaj detaloj.
nl: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) bouwt verder op de functie `i18n()` door ontwikkelaars, die aan de toepassing werken. Hiermee leggen we uit dat de UI-component de titel is van het toepassingsvenster, we hebben dus de tekenreeks "@title:window" voor "Hello World" ingevoegd. Zie de [Ki18n Programmer's guide](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) voor meer details.
pt: O [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc.28.29) baseia-se na função `i18n()`, permitindo aos programadores fornecer algum contexto aos tradutores que estão a tratar da aplicação; é por isso que incluímos o texto "@title.window" antes de "Hello World". Veja o [Manual do Programador do Ki18n](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) para obter mais detalhes.
sl: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) gradi na funkciji `i18n()` tako da dovoljuje razvijalcem nudenje prevajalcem kontekst za delo na aplikaciji. Tukaj razčiščujemo, da je komponenta uporabniškega vmesnika naslov okna aplikacije, zato smo v niz vključili "@title:window" pred "Hello World". Oglejte si [Ki18n Programmer's guide](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) za več podrobnosti.
sv: [i18nc()](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc()) bygger på funktionen `i18n()` genom att tillåta utvecklare att ge visst sammanhang till översättarna som arbetar med programmet. Det är därför vi har inkluderat strängen "@title" innan "Hello World". Se [Ki18n Programmer's guide](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt) för mer information.
uk: [`i18nc()`](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc.28.29) побудовано на основі функції `i18n()`. Ця функція уможливлює для розробників надання перекладачам, які працюватимуть над перекладом програми, певного контексту. Тут ми прояснюємо, що компонент інтерфейсу користувача є заголовком вікна програми, тому ми включили рядок «@title:window» перед «Hello World». Див. [підручник програміста щодо ki18n](https://api.kde.org/frameworks/ki18n/html/prg_guide.html#good_ctxt), щоб дізнатися більше.

source: Finally, we include in our page a [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) that lets us place text on our page. We use `anchors.centerIn: parent` to center our label horizontally and vertically within our parent element. In this case, the parent component of our label is [Kirigami.Page](docs:kirigami2;Page). The last thing we need to do is set its text: `text: i18n("Hello World!")`.
eo: Fine, ni inkluzivas en nia paĝo [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) kiu ebligas al ni meti tekston sur nia paĝo. Ni uzas `anchors.centerIn: parent` por centri nian etikedon horizontale kaj vertikale ene de nia gepatra elemento. En ĉi tiu kazo, la gepatra komponanto de nia etikedo estas [Kirigami.Paĝo](docs:kirigami2;Paĝo). La lasta afero, kiun ni devas fari, estas agordi ĝian tekston: `text: i18n("Saluton Mondo!")`.
nl: Tenslotte voegen we in onze pagina een [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) in die ons tekst laat plaatsen op onze pagina. We gebruiken `anchors.centerIn: parent` om ons label horizontaal en verticaal te centreren in ons ouderelement. In dit geval is de oudercomponent van [Kirigami.Page](docs:kirigami2;Page). Het laatste ding dat we moeten doen is het zetten van zijn tekst: `text: i18n("Hello World!")`.
pt: Finalmente, incluímos na nossa página um [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) que nos permite colocar texto na nossa página. Usamos o `anchors.centerIn: parent` para centrar o nosso texto na horizontal e na vertical dentro do nosso elemento-pai. Neste caso, o componente-pai do `Controls.Label` é o [Kirigami.Page](docs:kirigami2;Page). A última coisa que é necessária é definir o texto: `text: i18n("Hello World!")`.
sv: Slutligen inkluderar vi en [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label) på vår sida, som låter oss placera text på den. Vi använder `anchors.centerIn: parent` för att centrera vår beteckning horisontellt och vertikalt inom vårt överliggande element. I det här fallet är det överliggande elementet för `Controls.Label` vår [Kirigami.Page](docs:kirigami2;Page). Det sista vi behöver göra är att ange texten: `text: i18n("Hello World!")`.
uk: Нарешті, ми включаємо до нашої сторінки [Controls.Label](docs:qtquickcontrols;QtQuick.Controls.Label), яка надасть нам змогу розмістити на нашій сторінці текст. Ми використовуємо `anchors.centerIn: parent` для центрування нашої мітки горизонтально і вертикально у нашому батьківському елементі. У цьому випадку батьківським для компонента нашої мітки буде компонент [Kirigami.Page](docs:kirigami2;Page). Нарешті, ми маємо встановити для мітки текст: `text: i18n("Hello World!")`.

source: The primary purpose of [Desktop Entry files](https://specifications.freedesktop.org/desktop-entry-spec/latest/) is to show your app on the application launcher on Linux. Another reason to have them is to have window icons on Wayland, as they are required to tell the compositor "this window goes with this icon".
eo: La ĉefa celo de [Desktop Entry-dosieroj](https://specifications.freedesktop.org/desktop-entry-spec/latest/) estas montri vian apon sur la aplikaĵlanĉilo en Linukso. Alia kialo por havi ilin estas havi fenestrajn piktogramojn sur Wayland, ĉar ili estas postulataj por diri al la kompostisto "ĉi tiu fenestro konvenas kun ĉi tiu piktogramo".
nl: Het hoofddoel van [Desktop Entry bestanden](https://specifications.freedesktop.org/desktop-entry-spec/latest/) is te zorgen dat uw programma in de toepassingenstarter van Linux verschijnt. Een andere reden om ze te hebben is om bij Wayland venster-pictogrammen te hebben, omdat ze nodig zijn om de compositor te vertellen "dit venster hoort bij dit icon".
sl: Glavni namen [datotek za vnos namizja](https://specifications.freedesktop.org/desktop-entry-spec/latest/) je prikazati vašo aplikacijo v zaganjalniku aplikacij v sistemu Linux. Drug razlog, da jih imate, so ikone oken na Waylandu, saj morajo sestavljavcu sporočiti "to okno gre s to ikono".
sv: Det primära syftet med [Desktop Entry-filer](https://specifications.freedesktop.org/desktop-entry-spec/latest/) är att visa programmet i programstart på Linux. En annan anledning att ha dem är att ha fönsterikoner på Wayland, eftersom de måste tala om för sammansättningen att "det här fönstret hör ihop med den här ikonen".
uk: Основним призначенням [файлів стільничних записів](https://specifications.freedesktop.org/desktop-entry-spec/latest/) є показ вашої програми у засобі запуску програм у Linux. Іншою причиною їхнього існування є визначення піктограм вікна у Wayland, оскільки вони потрібні для надсилання повідомлення засобу композиції «піктограмою цього вікна є така».

source: Windows
eo: Vindozo

source: We add this component inside our [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) from the last tutorial.
eo: Ni aldonas ĉi tiun komponanton ene de nia [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) de la lasta lernilo.
nl: We voegen deze component toe in onze [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) uit de laatste inleiding.
pt: Iremos adicionar este componente dentro da nossa [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) do último tutorial.
sv: Vi lägger till komponenten inne i vår [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) från den tidigare handledningen.
uk: Ми додаємо цей компонент до нашого [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) з останньої частини підручника.

source: We're using [Kirigami.CardsListView](docs:kirigami2;CardsListView), which is a [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) that allows us to easily display cards in a list. However, ListViews are made to show data taken from a model - to automatically populate itself from a set of data that we point it to. That's where the `model` property comes in: in this example, it's pointing to `kountdownModel`.
eo: Ni uzas [Kirigami.CardsListView](docs:kirigami2;CardsListView), kiu estas [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) kiu ebligas al ni facile montri kartojn en listo. Tamen, ListViews estas faritaj por montri datumojn prenitajn de modelo - por aŭtomate plenigi sin de aro de datumoj al kiuj ni montras ĝin. Jen kie la propreco `modelo` eniras: en ĉi tiu ekzemplo, ĝi montras al `kountdownModel`.
nl: We gaan [Kirigami.CardsListView](docs:kirigami2;CardsListView) gebruiken, die een [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) is en ons gemakkelijk kaarten biedt om in een lijst te tonen. Lijstweergaven zijn echter gemaakt om gegevens genomen uit een model te tonen - om automatisch zichzelf te bevolken uit een set gegevens waar we naar wijzen. Dat is waar de eigenschap `model` in beeld komt: in dit voorbeeld wijst het naar `kountdownModel`.
pt: A primeira coisa que irá reparar é que estamos a usar o [Kirigami.CardsListView](docs:kirigami2;CardsListView). Esta é uma [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) que nos permite apresentar facilmente cartões numa lista. Contudo, as ListView's são feitas para mostrar dados de um dado modelo - para se preencher a si própria com base num conjunto de dados para onde estamos a apontar. Aí é onde surge a propriedade `model`: neste exemplo, está a apontar para `kountdownModel`.
sv: Vi använder [Kirigami.CardsListView](docs:kirigami2;CardsListView) som är en [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html) som enkelt låter oss visa kort i en lista. Dock är listvyer gjorda för att visa data tagen från en modell, för att automatiskt befolkas från en uppsättning data som vi pekar den på. Det är där egenskapen `model` kommer in: i det här exemplet pekar den på `kountdownModel`.
uk: Ми скористалися [Kirigami.CardsListView](docs:kirigami2;CardsListView). Це [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html), який надає нам змогу просто показувати картки у форматі списку. Втім, ListView створено для показу даних, які взято з моделі — для автоматичного заповнення списку набором даних, які ми вказали. Ось тут нам стане у пригоді властивість `model` — у нашому прикладі, вона вказує на `kountdownModel`.

source: Model
eo: Modelo
es: Modelo
fr: Modèle
pt: Modelo
sv: Modell
uk: Модель

source: We add our `kountdownModel` inside the [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) from the last tutorial.
eo: Ni aldonas nian `kountdownModel` ene de la [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) de la lasta lernilo.
nl: We voegen ons `kountdownModel` toe in de [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) uit de laatste handleiding.
sv: Vi lägger till vår `kountdownModel` inne i [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) från den tidigare handledningen.
uk: Ми додаємо нашу `kountdownModel` до [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow) з останньої частини підручника.

source: While our `kountdownModel` contains the data that will be displayed, our `kountdownDelegate` will handle how the data will be displayed in the [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). For that we use a [Kirigami.CardsListView](docs:kirigami2;CardsListView) designed to display card-type delegates, and those delegates will be visually represented by means of a [Kirigami.AbstractCard](docs:kirigami2;AbstractCard).
eo: Dum nia `kountdownModel` enhavas la datumojn kiuj estos montritaj, nia `kountdownDelegate` pritraktos kiel la datumoj estos montritaj en la [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview .html). Por tio ni uzas [Kirigami.CardsListView](docs:kirigami2;CardsListView) desegnitan por montri kartspecajn delegitojn, kaj tiuj delegitoj estos vide reprezentitaj per [Kirigami.AbstractCard](docs:kirigami2;AbstractCard).
nl: Terwijl ons `kountdownModel` de gegevens bevat die getoond zullen worden, zal onze `kountdownDelegate` behandelen hoe de gegevens getoond zullen worden in de [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Daarvoor gebruiken we een [Kirigami.CardsListView](docs:kirigami2;CardsListView) ontworpen om card-type gedelegeerden te tonen en die gedelegeerden zullen zichtbaar gerepresenteerd worden door middel van een [Kirigami.AbstractCard](docs:kirigami2;AbstractCard).
sv: Medan vår `kountdownModel` innehåller data som ska visas, hanterar vår `kountdownDelegate` hur data visas i [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). För att göra det använder vi en [Kirigami.CardsListView](docs:kirigami2;CardsListView) konstruerad för att visa delegater av korttyp, och delegaterna representeras visuellt med hjälp av ett [Kirigami.AbstractCard](docs:kirigami2;AbstractCard).
uk: Хоча наша `kountdownModel` містить дані, які буде показано, наш `kountdownDelegate` оброблятиме спосіб показу даних у [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Для цього ми використовуємо [Kirigami.CardsListView](docs:kirigami2;CardsListView), який було розроблено для показу делегатів типу карток, і ці делегати буде візуально відтворено за допомогою [Kirigami.AbstractCard](docs:kirigami2;AbstractCard).

source: Delegates automatically receive the properties of the [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) that we have specified in our model. We can therefore just refer to their `name`, `description`, and `date` properties as if they were conventional variables within our delegate.
eo: Delegitoj aŭtomate ricevas la ecojn de la [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) kiujn ni specifis en nia modelo. Ni povas do nur rilati al iliaj `nomo', `priskribo', kaj `dato' proprecoj kvazaŭ ili estus konvenciaj variabloj ene de nia delegito.
nl: Gedelegeerden ontvangen automatisch de eigenschappen van het [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) dat we gespecificeerd hebben in ons model. We kunnen daarom gewoon refereren naar de eigenschappen `name`, `description` en `date` alsof ze conventionele variabelen zijn binnen onze gedelegeerde.
sl: Delegati samodejno prejmejo lastnosti [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html), ki smo jih določili v našem modelu. Zato se lahko samo sklicujemo na njihove lastnosti `name`, `description` in `date`, kot da bi bile običajne spremenljivke znotraj našega delegata.
sv: Delegater får automatiskt egenskaperna i [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) som vi har angivit i vår modell. Vi kan därför bara referera till egenskaperna `name`, `description` och `date` som om de är konventionella variabler inne i vår delegat.
uk: Делегати автоматично отримують властивості [ListElements](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html), які вказано у нашій моделі. Тому ми можемо просто посилатися на їхні властивості `name`, `description` і `date` так, наче це була б звичайні змінні у нашому делегаті.

source: The [Component](docs:qtqml;QtQml.Component) that will represent our delegate can be added inside our [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). We will then check what each part of our delegate component does.
eo: La [Component](docs:qtqml;QtQml.Component) kiu reprezentos nian delegiton povas esti aldonita ene de nia [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Ni tiam kontrolos kion faras ĉiu parto de nia delegita komponanto.
nl: De [Component](docs:qtqml;QtQml.Component) die onze gedelegeerde representeert kan toegevoegd worden in ons [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). We zullen daarna controleren wat elk deel van onze gedelegeerde component doet.
sv: Den [Component](docs:qtqml;QtQml.Component) som representerar vår delegat kan läggas till inne i vårt [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Vi tittar sedan på vad varje del av vår delegatkomponent gör.
uk: [Компонент](docs:qtqml;QtQml.Component), який представляє нашого делегата, можна додати всередині нашого [Kirigami.ApplicationWindow](docs:kirigami2;ApplicationWindow). Далі, ми перевіримо, яке завдання виконує кожна частина нашого компонента-делегата.

source: Looking at our [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), the first properties we set are [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) and [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). We have set these to the `delegateLayout.implicitWidth` and `delegateLayout.implicitHeight`, i.e. the `implicitWidth` and `implicitHeight` of the `GridLayout` element.
eo: Rigardante nian [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), la unuaj ecoj kiujn ni starigas estas [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth- prop) kaj [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). Ni agordis ĉi tiujn al la `delegateLayout.implicitWidth` kaj `delegateLayout.implicitHeight`, t.e. la `implicitWidth` kaj `implicitHeight` de la `GridLayout` elemento.
nl: Kijkend naar onze [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), zijn de eerste eigenschappen die we instellen [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) en [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). We hebben deze ingesteld op de `delegateLayout.implicitWidth` en `delegateLayout.implicitHeight`, d.w.z. de `implicitWidth` en `implicitHeight` van het element `GridLayout`.
sv: Om vi betraktar vår [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), är den första egenskaperna vi ställer in [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) och [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). Vi har ställer in dem till `delegateLayout.implicitWidth` och `delegateLayout.implicitHeight`, dvs. `implicitWidth` och `implicitHeight` i elementet `GridLayout`.
uk: Розглядаючи наш [Kirigami.AbstractCard](docs:kirigami2;AbstractCard), першими встановленими нами властивостями є [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) і [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). Ми надаємо їм значення `delegateLayout.implicitWidth` і `delegateLayout.implicitHeight`, тобто `implicitWidth` і `implicitHeight` елемента `GridLayout`.

source: Here we have set the `implicitWidth` and `implicitHeight` of our [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) to that of the [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) below to ensure it does not spill out of the card. This way, the card takes as much space is necessary for its contents.
eo: Ĉi tie ni starigis la `implicitWidth` kaj `implicitHeight` de nia [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) al tiu de la [GridLayout](https://doc.qt.io/qt-6/qml- qtquick-layouts-gridlayout.html) sube por certigi, ke ĝi ne elverŝiĝas el la karto. Tiel, la karto prenas tiom da spaco estas necesa por sia enhavo.
nl: Hier hebben we de `implicitWidth` en `implicitHeight` van ons [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) hetzelfde ingesteld als dat van de [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) eronder zodat het niet uit de kaart loopt. Op deze manier neemt de kaart zoveel ruimte als nodig is voor zijn inhoud.
sv: Här har vi ställt in `implicitWidth` och `implicitHeight` i vår [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) till det i vår [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) nedan, för att säkerställa att den inte flyter ut utanför kortet. På så sätt upptar kortet så mycket utrymme som är nödvändigt för dess innehåll.
uk: Тут ми встановили значення `implicitWidth` і `implicitHeight` нашого [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) у значення [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) нижче для того, щоб вони не вилізли за картку. Таким чином, картка займе стільки місця, скільки потрібно для її вмісту.
