Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: We are placing our Kirigami Action within our main page from our previous tutorials. If we wanted to, we could add more actions to our page (and even nest actions within actions!). `Kirigami.Action` components are used as contextual actions within Kirigami pages. We are setting it specifically to the `actions.main` property of the page: the `actions` object has properties that let us set different actions in different positions, but since our 'Add kountdown' action is central to our UI we are setting it as the main action of this page.
fr: Nous plaçons notre action de Kirigami dans notre page principale de nos précédents tutoriels précédents. Si nous le voulions, nous pourrions ajouter d'autres actions à notre page (et même imbriquer des actions dans des actions !). Les composants « Kirigami.Action » sont utilisés comme actions contextuelles dans les pages de Kirigami. Nous les définissons spécifiquement dans la propriété « actions.main » de la page. L'objet « Actions » possède des propriétés nous permettant de placer différentes actions à différents endroits. Mais, puisque notre action « Ajouter un compte à rebours » est au centre de notre interface utilisateur, nous la définissons comme l'action principale de cette page.
pl: Umieszczamy nasze działanie Kirigami wewnątrz naszej głównej strony z naszych poprzednich samouczków. Gdybyśmy chcieli, to moglibyśmy dodać więcej działań do naszej strony (a nawet zagnieżdżać działania wewnątrz działań!). Składniki `Kirigami.Action` są używane jako kontekstowe działania wewnątrz stron Kirigami. Ustawiamy jednoznacznie właściwość `actions.main` strony: obiekt `actions` ma właściwości, które umożliwiają nam ustawienie różnych działań w różnych miejscach, lecz ponieważ nasze działanie 'Dodaj odliczanie' jest w środku naszego interfejsu, to ustawiamy je jako główne działanie tej strony.

source: The `id` and `text` properties should be familiar from previous tutorials. However, the new `icon` property should be interesting: it is an object with several properties letting you display certain icons for your actions. Fortunately, to use KDE icons all we need to do is provide the name property for the icon property, `icon.name`.
fr: Les propriétés « id » et « text » devraient vous être familières grâce aux tutoriels précédents. Cependant, la nouvelle propriété « icon » devrait être intéressante. C'est un objet avec plusieurs propriétés vous permettant d'afficher certaines icônes pour vos actions. Heureusement, pour utiliser les icônes de KDE, tout ce que nous devons faire est de fournir la propriété de nom pour la propriété d'icône, « icon.name ».
pl: Właściwości `id` oraz `text` powinny być znane z poprzednich samouczków. Jednakże nowa właściwość `icon` wzbudza ciekawość: jest to obiekt o kilku właściwościach, umożliwiający ci wyświetlenie niektórych ikon dla twoich działań. Na szczęście, aby używać ikon KDE, wszystko co musimy zrobić, to tylko podanie nazwy ikony we właściwości ikony `icon.name`.

source: Cuttlefish is a KDE application that lets you view all the icons that you can use for your application. It offers a number of useful features such as previews of their appearance across different installed themes, previews at different sizes, and more. You might find it a useful tool when deciding on which icons to use in your application.
fr: Cuttlefish est une application de KDE vous permettant d'afficher toutes les icônes que vous pouvez utiliser pour votre application. Elle offre un certain nombre de fonctionnalités utiles telles que des aperçus de leur apparence à travers les différents thèmes installés, des aperçus selon différentes tailles et plus encore. Cet outil peut s'avérer très utile pour choisir les icônes à utiliser dans votre application.
pl: Cuttlefish jest aplikacją KDE, która umożliwia ci oglądanie wszystkich ikon, których możesz używać w swojej aplikacji. Daje kilka użytecznych możliwości, takich jak podgląd wyglądu przy różnych ustawieniach wyglądu systemu, podgląd przy różnych rozmiarach i więcej. Przydaje się przy określaniu, których ikon użyć w swojej aplikacji.
pt: O Cuttlefish é uma aplicação do KDE que lhe permite ver todos os ícones que poderá usar para a sua aplicação. A mesma oferece um conjunto de funcionalidades úteis, como as antevisões da sua aparência com os vários itens instalados, antevisões com vários tamanhos, etc. Poderá concluir que é uma ferramenta útil para decidir quais os itens a usar na sua aplicação.

source: Many of KDE's icons follow the FreeDesktop Icon Naming specification. Therefore, you might also find it useful to consult The FreeDesktop project's website, [which lists all of the cross-desktop compatible icon names on their website](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
fr: De nombreuses icônes de KDE suivent la spécification de dénomination des icônes de FreeDesktop. Cependant, vous pouvez également trouver utile de consulter le site Internet du projet FreeDesktop, [répertoriant tous les noms d'icônes compatibles avec tous les bureaux sur leur site Internet](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pl: Wiele z ikon KDE przestrzega nazewnictwa ikon FreeDesktop. Stąd możesz także zajrzeć na stronę projektu FreeDesktop, [która wymienia na swojej stronie wszystkie nazwy ikon, które są zamienne między pulpitami](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: The `onTriggered` property is the most important. This is what our action will do when it is used. You'll notice that in our example we're using the method `kountdownModel.append` of the `kountdownModel` we created in our previous tutorial. This method lets us append a new element to our list model. We are providing it with an object that has the relevant properties for our countdowns (name, description, and a placeholder date).
fr: La propriété « onTriggered » est la plus importante. C'est ce que fera notre action lorsqu'elle sera utilisée. Vous remarquerez que dans notre exemple, nous utilisons la méthode « kountdownModel.append » du modèle « kountdownModel » que nous avons créé dans notre précédent tutoriel. Cette méthode nous permet d'ajouter un nouvel élément à notre modèle de liste. Nous lui fournissons un objet possédant les propriétés pertinentes pour nos comptes à rebours (nom, description et une date de remplacement).
pl: Właściwość `onTriggered` jest najważniejsza. Oznacza ona, co nasze działanie wykona, gdy zostanie wywołane. Zauważysz, że w naszym przykładzie używamy metody `kountdownModel.append` z `kountdownModel`, który utworzyliśmy w naszym poprzednim samouczku. Ta metoda umożliwia nam dodanie nowej rzeczy do naszego modelu listy. Dostarczamy mu obiektu, który ma odpowiednie właściwości dla naszych odliczań (nazwa, opis oraz pole zastępcze daty).

source: Each time we click our now 'Add kountdown' button on the top right, our custom countdown is added.
fr: Chaque fois que nous cliquons sur le bouton « Ajouter un compte à rebours » en haut à gauche, notre compte à rebours personnalisé est ajouté.
pl: Za każdym razem gdy naciśniemy na nasz przycisk 'Add kountdown' po prawej na górze, zostanie dodane nasze własne odliczanie.

source: Did you notice those three lines next to the page title on the previous screenshot? That's a global drawer. Global drawers are useful for global navigation and actions: in other words, those things you might need to use throughout your application. We are going to create a simple global drawer that includes a quit button.
fr: Avez-vous remarqué ces trois lignes à côté du titre de la page sur la capture d'écran précédente ? Il s'agit d'un tiroir global. Les tiroirs globaux sont utiles pour la navigation et les actions globales : en d'autres termes, les éléments dont vous pourriez avoir besoin d'utiliser dans toute votre application. Nous allons créer un tiroir global simple comprenant un bouton de fermeture.
pl: Zwróciłeś uwagę na te trzy linie obok tytułu strony, na poprzednim zrzucie ekranu? To globalna półka. Globalne półki są użyteczne do globalnego poruszania się i działań: innymi słowy, są to rzeczy, które będziesz chciał wykorzystywać w swojej aplikacji. Utworzymy prostą globalną półkę, która zawiera przycisk zakończenia.

source: Here, we put our global drawer inside our application window. The main property we need to pay attention to is `actions`, which takes the form of an array of `Kirigami.Action` components. This action has an appropriate icon and triggers the `Qt.quit()` function, closing the application.
fr: Nous plaçons ici notre tiroir global à l'intérieur de la fenêtre de notre application. La principale propriété à laquelle nous devons faire attention est « actions », prenant la forme d'un tableau de composants « Kirigami.Action ». Cette action possède une icône appropriée et déclenche la fonction « Qt.quit() », fermant l'application.
pl: Tutaj, umieścimy naszą globalną półkę wewnątrz okna naszej aplikacji. Główną właściwością, na którą musimy zwrócić uwagę to `actions`, która przybiera kształt składników `Kirigami.Action`. To działanie ma odpowiednią ikonę i wyzwala funkcję `Qt.quit()`, zamykającą aplikację.

source: Since we are keeping our global drawer simple for now, we are setting the `isMenu` property to true. This displays our global drawer as a normal application menu, taking up less space than the default global drawer pane.
fr: Puisque nous gardons notre tiroir global simple pour le moment, nous définissions la propriété « isMenu » à « True ». Ceci affiche notre tiroir global comme un menu normal d'application, prenant moins de place que le volet par défaut du tiroir global.
pl: Ponieważ chcemy, aby nasza globalna półka na razie była prosta, ustawiamy własność `isMenu` na true. Wyświetla to naszą globalną półkę jako normalne menu aplikacji, zabierając mniej miejsca niż panel globalnej półki.

source: The ['Actions'](/docs/kirigami/components-actions/) page in the 'Components' section of these docs provides further detail on Kirigami actions and how they can be used.
fr: La page [ « Actions » ](https://develop.kde.org/docs/kirigami/actions/) de la section « Composants » pour ces documents fournit des informations détaillées sur les actions de Kirigami et la manière dont elles peuvent être utilisées.

source: Installing required packages
fr: Installation des paquets nécessaires
pl: Wgrywanie potrzebnych pakietów

source: Before getting started, we must install a few things. We need a C++ compiler, Qt development packages, and Kirigami.
fr: Avant de commencer, nous devons installer quelques éléments. Nous avons besoin d'un compilateur C++, des paquets de développement Qt et de Kirigami.
pl: Zanim zaczniemy, musimy wgrać kilka rzeczy. Potrzebujemy kompilatora C++, pakietów programistycznych Qt oraz Kirigami.

source: On Ubuntu, Debian and Neon we can install these with APT:
fr: Avec Ubuntu, Debian et Neon, nous pouvons les installer avec la commande « apt » :
pl: Na Ubuntu, Debianie oraz Neonie możemy je wgrać, używając APT:

source: On Arch-based distributions (like Manjaro) we can use Pacman:
fr: Sur les distributions reposant sur Arch (comme Manjaro), nous pouvons utiliser la commande « pacman » :
pl: Na dystrybucjach opartych na Archu (takich jak Manjaro) możemy skorzystać z Pacmana:

source: For Fedora, we use DNF:
fr: Pour Fedora, DNF est utilisé :
pl: Na Fedorze, użyjemy DNF:

source: Further information for other distributions can be found [here](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Install_the_dependencies).
fr: Des informations complémentaires pour les autres distributions sont disponibles [ici](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Install_the_dependencies).
pl: Dalsze szczegóły dla innych dystrybucji można znaleźć [tutaj](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Install_the_dependencies).

source: First we create our project folder. We are going to call ours 'helloworld'.
fr: Tout d'abord, nous créons le dossier de notre projet. Nous allons l'appeler « helloworld ».
pl: Najpierw tworzymy katalog naszego projektu. Nazwiemy go 'helloworld'.

source: Within this folder we are going to create a `src` folder and `CMakeLists.txt`. It is generally considered good practice to place all our main code files in a `src` folder. Our `src` folder in turn will contain a folder named `contents`, which itself contains a folder called `ui`. Here is where we will create our QML files.
fr: Dans ce dossier, nous allons créer un dossier « src » et un fichier « CMakeLists.txt ». Il est généralement considéré comme une bonne pratique de placer tous nos principaux fichiers de code dans un dossier « src ». Ce dernier contiendra à son tour un dossier nommé « contents x, qui lui-même contiendra un dossier appelé « ui x. C'est ici que nous allons créer nos fichiers QML.
pl: W tym katalogu stworzymy katalog `src` oraz `CMakeLists.txt`. Ogólnym zwyczajem jest umieszczanie wszystkich plików naszego głównego kodu w katalogu `src`. Nasz katalog `src` będzie zawierał katalog o nazwie `contents`, który będzie zawierał katalog o nazwie `ui`. To tutaj, gdzie utworzymy nasze pliki QML.

source: This is KDE convention, but not all KDE projects use this structure. You are free to set things up differently, but you will have to take this into account when creating your `CMakeLists.txt` and `resources.qrc` files.
fr: Ceci est la convention KDE, mais tous les projets avec KDE n'utilisent pas cette structure. Vous êtes libre de configurer les choses différemment. Cependant, vous devrez en tenir compte lors de la création de vos fichiers « CMakeLists.txt » et « resources.qrc ».
pl: Jest to zwyczaj KDE, lecz nie wszystkie projekty KDE przestrzegają tej struktury. Masz dowolność w ustawieniu rzeczy inaczej, lecz będziesz musiał to uwzględnić podczas tworzenia swoich plików `CMakeLists.txt` oraz `resources.qrc`.

source: If you know some Javascript, then much of QML will seem familiar to you (though it does have its own peculiarities). [Qt's documentation](https://doc.qt.io/qt-5/qtqml-index.html) has an extensive amount of material on this language if you feel like trying something on your own. Over the course of these tutorials we will be focusing much of our attention on our QML code, where we can use Kirigami to get the most out of it.
fr: Si vous connaissez un peu le langage Javascript, alors une grande partie de QML vous semblera familière (bien qu'il ait ses propres particularités). La [documentation de Qt](https://doc.qt.io/qt-5/qtqml-index.html) propose une quantité importante de documents sur ce langage si vous avez envie d'essayer quelque chose par vous-même. Au cours de ces tutoriels, nous porterons une grande partie de notre attention sur notre code QML, où nous pourrons utiliser Kirigami pour en tirer le meilleur parti.
pl: Jeśli znacz trochę Javascriptu, to większość QML będzie dla ciebie znajoma (mimo tego ma on swoje osobliwości). [Dokumentacja Qt](https://doc.qt.io/qt-5/qtqml-index.html) zawiera wiele treści na temat tego języka, jeśli chciałbyś spróbować czego samemu. Na przestrzeni tych samouczków, będziemy skupiać nasza uwagę na kodzie QML, dzięki któremu możemy wydobyć najwięcej z Kirigami.
pt: Se souber alguma coisa de Javascript, então muito do QML parecer-lhe-á familiar (ainda que tenha as suas particularidades). A [documentação do Qt](https://doc.qt.io/qt-5/qtqml-index.html) tem uma quantidade extensa de material sobre esta linguagem se se sentir à vontade para experimentar algo você mesmo. Ao longo destes tutoriais, focar-nos-emos a nível de atenção no nosso código em QML, onde poderemos usar o Kirigami para tirar o máximo partido.

source: For now, let's focus on `main.qml`. First we import a number of important modules:
fr: Pour l'instant, concentrons-nous sur « main.qml ». Tout d'abord, nous importons un certain nombre de modules importants :
pl: Na teraz, skupmy się na `main.qml`. Najpierw importujemy kilka ważnych modułów:

source: QtQuick, the standard library used in QML applications.
fr: QtQuick, la bibliothèque standard utilisée dans les applications QML.
pl: QtQuick, standardowa biblioteka używana w aplikacjach QML.

source: QtQuick Controls, which provides a number of standard controls we can use to make our applications interactive.
fr: QtQuick Controls fournissant un certain nombre de contrôles standards que nous pouvons utiliser pour rendre nos applications interactives.
pl: QtQuick Controls, który daje kilka standardowych rzeczy sterujących, których możemy użyć, aby umożliwić oddziaływanie z naszą aplikacją.

source: QtQuick Layouts, which provides tools for placing components within the applications window.
fr: QtQuick Layouts, fournissant des outils pour le placement des composants dans la fenêtre des applications.
pl: Układy QtQuick, które zapewniają narzędzia do umieszczania składników wewnątrz okna aplikacji.

source: Kirigami, which provides a number of components suited for creating applications that work across devices of different shapes and sizes.
fr: Kirigami, qui fournit un certain nombre de composants adaptés à la création d'applications fonctionnant sur des appareils de formes et de tailles différentes.
pl: Kirigami, który dostarcza kilka składników nadających się do tworzenia aplikacji, które działają na urządzeniach o różnych kształtach i rozmiarach.

source: We then come to our base element, [`Kirigami.ApplicationWindow`](docs:kirigami2;ApplicationWindow) which provides some basic features needed for all Kirigami applications. This is the window that will contain each of our pages, the main sections of our UI.
fr: Nous revenons alors vers notre élément de base [ « Kirigami.ApplicationWindow » ](docs:kirigami2;ApplicationWindow), fournissant certaines fonctionnalités de base pour toutes les applications sous Kirigami. Ceci est la fenêtre qui contiendra chacune de nos pages, les sections principales de notre interface utilisateur.
pl: Dochodzimy wtedy do naszej rzeczy głównej, [`Kirigami.ApplicationWindow`](docs:kirigami2;ApplicationWindow) która daje podstawowe możliwości, potrzebne każdej aplikacji Kirigami. To jest okno, które będzie zawierało każdą z naszych stron oraz główne obszary naszego interfejsu.

source: We then set the `id` property of `Kirigami.ApplicationWindow` to 'root'. IDs are useful because they let us uniquely reference a component, even if we have several of the same type.
fr: Nous définissons ensuite la propriété « id » de l'objet « Kirigami.ApplicationWindow » à la valeur « root ». Les identifiants sont utiles car ils nous permettent de référencer de manière unique un composant, même si nous en avons plusieurs du même type.
pl: Następnie ustawiamy właściwość `id` rzeczy `Kirigami.ApplicationWindow` na 'root'. Identyfikatory są użyteczne, bo umożliwiają odnoszenie się do składnika w niepowtarzalny sposób, nawet gdy mamy kilka tego samego rodzaju.

source: We also set the window `title` property to 'Hello World'. You'll notice that we have wrapped our "Hello World" string in a function called `i18nc`, where we detail the context of the string as well as the string itself.
fr: Nous avons également défini la propriété « title » de la fenêtre pour « Hello World ». Vous remarquerez que nous avons encapsulé notre chaîne « Hello World » dans une fonction appelée « i18nc », où nous détaillons le contexte de la chaîne ainsi que la chaîne elle-même.
pl: Ustawiamy także własność okna `title` na 'Hello World'. Możesz zauważyć, że otoczyliśmy nasz ciąg znaków "Hello World" funkcją o nazwie `i18nc`, w której opisujemy zarówno kontekst ciągu znaków jak i sam ciąg znaków.

source: [`i18n()`](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n.28.29) functions make your app more easily translatable, as they return a version of the provided string in the user's language (as long as your app has been localised for that language). While an English user might see our window title as 'Hello World', a Spanish user would see 'Hola Mundo'.
fr: Les fonctions [ « i18n() » ](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n.28.29) rendent votre application plus facilement traduisible, car elles renvoient une version de la chaîne fournie dans la langue de l'utilisateur (pour autant que votre application ait été localisée pour cette langue). Alors qu'un utilisateur anglais pourrait voir le titre de notre fenêtre comme « Hello World », un utilisateur français verrait « Bonjour le monde ».
pl: Funkcje [`i18n()`](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Translatable_Code_Using_i18n.28.29) czynią twoją aplikację łatwiejszą w tłumaczeniu, bo zwracają danego ciągu znaków w języku użytkownika (jeśli aplikacja została przetłumaczona na dany język). Użytkownik angielskojęzyczny będzie widział nazwę naszego okna jako 'Hello World', podczas gdy hiszpańskojęzyczny jako 'Hola Mundo'.

source: [`i18nc()`](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc.28.29) builds on the `i18n()` function by allowing developers to provide some context to translators working on the app; that's why we have included the string "@title" before "Hello World".
fr: [ « 18nc() »](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc.28.29) s'appuie sur la fonction « i18n() » en permettant aux développeurs de fournir un certain contexte aux traducteurs travaillant sur l'application. C'est pourquoi nous avons inclus la chaîne « @title » avant « Bonjour tout le monde ».
pl: [`i18nc()`](https://techbase.kde.org/Development/Tutorials/Localization/i18n#Adding_Context_with_i18nc.28.29) jest zbudowane na funkcji `i18n()` i umożliwia programistom dodanie znaczenia dla tłumaczy, pracujących nad aplikacją; stąd dołączyliśmy ciąg znaków "@title" przed "Hello World".

source: We then set the first page of our page stack. Most Kirigami applications are organised as a stack of pages, each page containing related components suited to a specific task. For now, we are keeping it simple, and sticking to a single page. With `pageStack.initialPage: Kirigami.Page{...}` we set the first page presented upon loading the application to a `Kirigami.Page`, which will contain all our content.
fr: Nous définissons ensuite la première page de notre pile de pages. La plupart des applications avec Kirigami sont organisées comme une pile de pages, chaque page contenant des composants associés, adaptés à une tâche spécifique. Pour l'instant, nous allons rester simples et nous en tenir à une seule page. Avec le paramètre « pageStack.initialPage : Kirigami.Page{...} », nous définissons la première page présentée au chargement de l'application comme étant une page « Kirigami.Page », contenant la totalité du contenu.
pl: Następnie ustawiamy pierwszą stronę naszego stosu stron. Większość aplikacji Kirigami jest zorganizowanych jako stosy stron, gdzie każda strona zawiera składniki odpowiednie danemu zadaniu. Na tę chwilę, chcemy prostoty, więc trzymamy się pojedynczej strony. Poprzez `pageStack.initialPage: Kirigami.Page{...}` ustawiamy pierwszą stronę przedstawianą podczas wczytywania aplikacji do `Kirigami.Page`, która będzie zawierać całą naszą zawartość.
