Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The About page of our application should look like this:
ca: La pàgina «Quant al» de la nostra aplicació s'hauria de veure així:
eo: La paĝo Pri de nia aplikaĵo devus aspekti jene:
es: La página «Acerca de» de nuestra aplicación debería parecerse a esto:
nl: De pagina Info over van uw toepassing zou er als volgt uit moeten zien:
sl: Stran About page bi morala izgledati takole:
sv: Om sidan i vårt program ska se ut så här:
uk: Сторінка «Про програму» нашої програми має виглядати так:

source: Using JSON instead of KAboutData
ca: Ús del JSON en lloc del KAboutData
eo: Uzante JSON anstataŭ KAboutData
es: Uso de JSON en lugar de KAboutData
nl: JSON gebruiken in plaats van KAboutData
sl: Uporaba JSON namesto KAboutData
sv: Använda JSON istället för KAboutData
uk: Використання JSON замість KAboutData

source: Instead of letting your about page get information from [KAboutData](docs:kcoreaddons;KAboutData), it is possible to pass a JSON object directly. You will still need to use [QApplication::setWindowIcon()](docs:qtgui;QGuiApplication::setWindowIcon) in your `main.cpp` in order for your application icon to show up.
ca: En lloc de permetre que la pàgina «Quant al» rebi informació de [KAboutData](docs:kcoreaddons;KAboutData), és possible passar directament un objecte JSON. Encara haureu d'utilitzar [QApplication::setWindowIcon()](docs:qtgui;QGuiApplication::setWindowIcon) en el vostre `main.cpp` perquè es mostri la icona de l'aplicació.

source: Create a `MyAboutPage.qml` like this:
ca: Creeu una `MyAboutPage.qml` com aquesta:
eo: Kreu `MyAboutPage.qml` tiamaniere:
es: Cree un `MyAboutPage.qml` como este:
nl: Maak en `MyAboutPage.qml` zoals deze:
sl: Ustvarite `MyAboutPage.qml` takole:
uk: Створіть `MyAboutPage.qml` з таким вмістом:

source: And then adjust your `Main.qml` to include your new about page:
ca: I després ajusteu el `Main.qml` per a incloure la pàgina nova «quant al»:
eo: Kaj tiam alĝustigu vian `Main.qml` por inkluzivi vian novan 'pri'-paĝon:
es: Y luego ajuste `Main.qml` para que incluya la nueva página «acerca de»:
nl: En pas uw `Main.qml` aan om onze nieuwe pagina About-pagina in te voegen:
sl: In nato prilagodite svoj `Main.qml`, da bo vključeval vašo novo stran o programu:
uk: І внесіть зміни до `Main.qml` так, щоб включити до нього нашу нову інформаційну сторінку:

source: The main JSON object here contains the keys `displayName`, `productName`, `homepage` and so on. The keys `authors`, `credits`, `translators` and `licenses` can each be passed an array of objects. The objects passed to `authors`, `credits` and `translators` share the same keys so that they can be displayed each in their own section, while `licenses` includes the keys `name`, `text` and `spdx` for each license added, as it is not uncommon for the same project to include multiple licenses.
ca: L'objecte JSON principal conté les claus `displayName`, `productName`, `homepage` i així successivament. Les claus `authors`, `credits`, `translators` i `licenses` s'hi poden passar una matriu d'objectes. Els objectes passats a `authors`, `credits` i `translators` comparteixen les mateixes claus perquè es puguin mostrar cadascuna en la seva pròpia secció, mentre que `licenses` inclou les claus `name`, `text` i `spdx` per a cada llicència afegida, ja que no és estrany que el mateix projecte inclogui diverses llicències.
eo: La ĉefa JSON-objekto ĉi tie enhavas la ŝlosilojn `displayName`, `productName`, `hejmpaĝo` ktp. La ŝlosiloj `aŭtoroj`, `kreditoj`, `tradukistoj` kaj `licencoj` povas ĉiu esti pasita tabelo da objektoj. La objektoj transdonitaj al "aŭtoroj", "kreditoj" kaj "tradukistoj" dividas la samajn ŝlosilojn por ke ili povu esti montritaj ĉiu en sia propra sekcio, dum "licencoj" inkluzivas la ŝlosilojn "nomo", "teksto" kaj "spdx" por ĉiu permesilo aldonita, ĉar ne malofte la sama projekto inkluzivas plurajn permesilojn.
es: El objeto JSON principal contiene aquí las claves `displayName`, `productName`, `homepage` y demás. Las claves `authors`, `translators` y `licenses` se pueden pasar como array de objetos. Los objetos que se pasan a `authors`, `credits` y `translators` comparten las mismas claves, por lo que cada uno se puede mostrar en su propia sección, mientras que `licenses` incluye las claves `name`, `text` y `spdx` para cada licencia que se añada, ya que es común que un proyecto incluya múltiples licencias.
nl: Het hoofd JSON-object hier bevat de sleutels `displayName`, `productName`, `homepage` enzovoort. De sleutels `authors`, `credits`, `translators` en `licenses` kunnen elk doorgeven worden als een array van objecten. De doorgeven objecten aan `authors`, `credits` en `translators` delen dezelfde sleutels zodat ze getoond kunnen worden elk in hun eigen sectie, terwijl `licenses` de sleutels `name`, `text` en `spdx` voor elke toegevoegde licentie bevat, omdat het niet ongewoon is voor hetzelfde project om meerdere licenties te bevatten.
sl: Glavni objekt JSON tukaj vsebuje ključe `displayName`, `productName`, `homepage` in tako naprej. Prek ključev `authors`, `credits`, `translators` in `licences` je mogoče posredovati niz predmetov. Predmeti, ki so prešli na `authors`, `credits` in `translators` si delijo iste ključe, tako da so lahko prikazani vsak v svojem razdelku, medtem ko `licences` vključuje ključe`name`, `text` in `spdx` za vsako dodano licenco, saj ni neobičajno, da je isti projekt za vključenih več licenc.
sv: JSON-huvudobjektet här innehåller nycklarna `displayName`, `productName`, `homepage` och så vidare. Nycklarna `authors`, `credits`, `translators` och `licenses` kan var och en skickas ett objektfält. Objekten som skickas till `authors`, `credits` and `translators` delar samma nycklar så att de kan visas var och en i sin egen sektion, medan `licenses` inkluderar nycklarna `name`, `text` och `spdx` för varje licens som läggs till, eftersom det inte är ovanligt att samma projekt inkluderar flera licenser.
uk: Головний об'єкт JSON містить ключі `displayName`, `productName`, `homepage` тощо. Кожному з ключів `authors`, `credits`, `translators` і `licenses` можна передати масив об'єктів. Об'єкти, передані до `authors`, `credits` і `translators`, мають однакові ключі, тому їх можна показувати у окремих розділах для кожного, тоді як `licenses` включає ключі `name`, `text` і `spdx` для кожної доданої ліцензії, оскільки часто той самий проєкт ліцензовано з використанням різних ліцензій.

source: These keys are optional, but a reasonable minimum amount of keys is expected to make your application have no empty fields: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` and `authors`. You are encouraged to fill as many key as possible, however.
ca: Aquestes claus són opcionals, però s'espera que una quantitat mínima raonable de claus faci que la vostra aplicació no tingui camps buits: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` i `authors`. No obstant això, se us anima a omplir tantes claus com sigui possible.
eo: Ĉi tiuj ŝlosiloj estas laŭvolaj, sed akceptebla minimuma kvanto da ŝlosiloj estas atendita por ke via aplikaĵo ne havu malplenajn kampojn: `displayName`, `version`, `priskribo`, `hejmpaĝo`, `kopyrightStatement` kaj `aŭtoroj`. Vi estas kuraĝigita plenigi kiel eble plej multajn ŝlosilojn.
es: Estas claves son opcionales, aunque se espera una cantidad mínima de claves razonable para que la aplicación no tenga en blanco los campos `displayName`, `version`, `description`, `homepage`, `copyrightStatement` y `authors`. No obstante, se recomienda que se rellenen tantos como sea posible.
nl: Deze sleutels zijn optioneel, maar een redelijke minimale hoeveelheid sleutels wordt verwacht om te zorgen dat uw toepassing geen lege velden heeft: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` en `authors`. U wordt echter aangemoedigd om zoveel sleutels als mogelijk in te vullen.
sl: Ti ključi so neobvezni, vendar se pričakuje razumno minimalno število ključev, da vaša aplikacija nima praznih polj: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` in `authors`. Seveda se spodbuja, da izpolnite čim več ključev.
sv: Nycklarna är valfria, men en rimlig minsta antal nycklar förväntas göra att programmet inte har några tomma fält: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` och `authors`. Du uppmanas dock att fylla i så många nycklar som möjligt.
uk: Ці ключі є необов'язковими, але очікуваною є розумна мінімальна кількість ключів, щоб ваша програма не мала порожніх полів: `displayName`, `version`, `description`, `homepage`, `copyrightStatement` і `authors`. Проте вам рекомендується заповнити якомога більше ключів.

source: Form delegates in your settings pages
ca: Delegats de formularis a les pàgines de configuració
eo: Formu delegitojn en viaj agordaj paĝoj
es: Delegados de Form en sus páginas de preferencias
nl: Formulier gedelegeerden in uw instellingen pagina's
sl: Oblikujte delegate na vaših straneh z nastavitvami
sv: Formulärdelegater på inställningssidorna
uk: Делегати форми на наших сторінках параметрів

source: Create elegant custom settings pages.
ca: Creació de pàgines elegants de configuració personalitzada.
eo: Kreu elegantajn proprajn agordojn paĝojn.
es: Cree elegantes páginas de preferencias personalizadas.
nl: Elegante aangepaste instellingenpagina's aanmaken.
sl: Ustvarite elegantne strani z nastavitvami po meri.
sv: Skapa eleganta anpassade inställningssidor.
uk: Створіть елегантні нетипові сторінки параметрів.

source: You have learned how to add [About and AboutKDE pages](/docs/getting-started/kirigami/addons-about) to your application. Now you will be able to use their same inner components to create your settings pages.
ca: Heu après a afegir [pàgines «Quant al» i «Quant al KDE»](/docs/getting-started/kirigami/addons-about) a l'aplicació. Ara podreu utilitzar els seus mateixos components interns per a crear les pàgines de configuració.

source: The project structure should look like this:
ca: L'estructura del projecte s'hauria de veure així:
eo: La projekta strukturo devus aspekti jene:
es: La estructura del proyecto debería parecerse a esto:
nl: De projectstructuur zou er als volgt uit moeten zien:
sl: Struktura projekta bi morala izgledati takole:
sv: Projektstrukturen ska se ut så här:
uk: Структура проєкту має виглядати так:

source: Needed Changes
ca: Canvis necessaris
eo: Bezonataj Ŝanĝoj
es: Cambios necesarios
nl: Benodigde wijzigingen
sl: Potrebne spremembe
sv: Nödvändiga ändringar
uk: Потрібні зміни

source: Change `Main.qml` to include our new Settings page:
ca: Canvieu el `Main.qml` per a incloure la pàgina nova Settings:
eo: Ŝanĝu `Main.qml` por inkluzivi nian novan paĝon de Agordo:
es: Cambie `Main.qml` para que incluya nuestra nueva página de preferencias:
nl: Wijzig `Main.qml` om onze nieuwe pagina Instellingen in te voegen:
sl: Spremenite `main.qml`, da bo vključevala našo novo stran z nastavitvami:
uk: Внесемо зміни до `Main.qml` так, щоб включити до нього нашу нову сторінку Settings:

source: We can now start checking out the components used to create our Settings page: the Form Card and its Delegates.
ca: Ara podem començar a consultar els components que s'utilitzen per a crear la pàgina de Configuració: la Targeta de Formulari i els seus Delegats.
eo: Ni nun povas komenci pritrakti la komponantojn uzatajn por krei nian Agordan paĝon: la Formularo-Karto kaj ĝiaj Delegitoj.
es: Ahora podemos comenzar a revisar los componentes usados para crear nuestra página de «Preferencias»: la tarjeta de formulario y sus delegados.
nl: We kunnen nu beginnen met de checkout van de componenten gebruikt om onze pagina Instellingenpage aan te maken: het formulier Card en zijn Gedelegeerden.
sl: Zdaj lahko začnemo preverjati komponente, uporabljene za ustvarjanje naše strani nastavitev: kartica obrazca in njeni delegati.
sv: Vi kan nu börja titta på komponenterna som används för att skapa vår inställningssida: formulärkortet och dess delegater.
uk: Тепер ми можемо розпочати перевірку компонентів, які використовуються для створення сторінки налаштувань: картки форми та її делегатів.

source: Form Delegates
ca: Delegats de Formularis
eo: Formu Delegitojn
es: Delegados de Form
nl: Formulier over gedelegeerden
sl: Obrazec Delegati
sv: Formulärdelegater
uk: Делегати форми

source: FormCard and FormCardPage
ca: FormCard i FormCardPage
eo: FormCard kaj FormCardPage
es: FormCard y FormCardPage
nl: FormCard en FormCardPage
sl: FormCard in FormCardPage
sv: FormCard och FormCardPage
uk: FormCard і FormCardPage

source: [FormCard.FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html) is the main component we will be using to group all its child components, the Delegates.
ca: [FormCard.FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html és el component principal que utilitzarem per a agrupar tots els seus components fills, els Delegats.

source: We used a form card in the [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) before. Its main purpose is to serve as a container for other components while following a color different from the background, in a similar manner to a [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card).
ca: Hem utilitzat una targeta de formulari en la [introducció dels complements del Kirigami](/docs/getting-started/kirigami/addons-introduction) abans. El seu propòsit principal és servir com a contenidor per a altres components alhora que segueix un color diferent del fons, de manera similar a un [Kirigami.Card](docs:kirigami;org.kde.kirigami.Card).

source: Create a new `SettingsPage.qml` file:
ca: Crea un fitxer `SettingsPage.qml` nou:
eo: Kreu novan dosieron `SettingsPage.qml`:
es: Cree un nuevo archivo `SettingsPage.qml`:
nl: Maak een nieuw bestand `SettingsPage.qml`:
sl: Ustvarite novo datoteko `SettingsPage.qml`:
uk: Створіть файл `SettingsPage.qml`:

source: This is where all our delegates go!
ca: Aquí és on van tots els nostres delegats!
eo: Ĉi tie iras ĉiuj niaj delegitoj!
es: Aquí es donde van nuestros delegados.
nl: Dit is waar alle gedelegeerden naartoe gaan!
sl: Sem gredo vsi naši delegati!
sv: Det är här alla våra delegater ska finnas.
uk: Ось куди ми впишемо усі делегати!

source: Since we are making a separate QML file for our Settings page, and since we need to prepare for potential scrolling in our page, we use a [FormCard.FormCardPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcardpage.html), which inherits [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage).
ca: Com que estem creant un fitxer QML separat per a la nostra pàgina de Configuració, i com que necessitem preparar el desplaçament potencial a la nostra pàgina, utilitzem un [FormCard.FormCardPage](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcardpage.html), que hereta [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage).

source: The nice thing about the form card page is that it comes with an internal layout, so no additional ColumnLayout is needed and our delegates can be added directly to it.
ca: El més agradable de la pàgina de la targeta de formulari és que ve amb una disposició interna, de manera que no es necessita cap ColumnLayout addicional i els nostres delegats poden afegir-se directament a ella.
eo: La agrabla afero pri la formularkartpaĝo estas, ke ĝi venas kun interna aranĝo, do ne necesas plia ColumnLayout kaj niaj delegitoj povas esti aldonitaj rekte al ĝi.
es: Lo bueno de la página de la tarjeta de formulario es que viene con un diseño interno, por lo que no necesita ningún «ColumnLayout» adicional, y nuestros delegados se pueden añadir directamente al mismo.
nl: Het mooie van de pagina form-card is dat het komt met een interne indeling, dus is geen extra ColumnLayout nodig en onze gedelegeerden kunnen direct eraan worden toegevoegd.
sl: Dobra stvar pri strani s kartico obrazca je, da je opremljena z notranjo postavitvijo, tako da ni potreben dodaten ColumnLayout in naši delegati so lahko dodani neposredno vanjo.
sv: Det fina med formulärkortsidan är att en intern layout ingår, så ingen ytterligare ColumnLayout behövs och våra delegater kan läggas till direkt.
uk: Приємна особливість сторінки картки форми полягає у тому, що вона має внутрішній макет, тому додатковий ColumnLayout не потрібен, і наших делегатів можна додавати безпосередньо до нього.

source: {{< alert color="info" title="Note" >}} It is possible to use FormCard delegates directly with a Kirigami.ScrollablePage, but in that case you will need to add your own layouts. {{< /alert >}}
ca: {{< alert color="info" title="Note" >}} És possible utilitzar delegats de FormCard directament amb un Kirigami.ScrollablePage, però en aquest cas haureu d'afegir les vostres pròpies disposicions. {{< /alert >}}
eo: {{< alert color="info" title="Noto" >}} Eblas uzi FormCard-delegitojn rekte kun Kirigami.ScrollablePage, sed tiukaze vi devos aldoni viajn proprajn aranĝojn. {{< /alert >}}
es: {{< alert color="info" title="Nota" >}} Se pueden usar delegados de FormCard directamente con una Kirigami.ScrollablePage, aunque en este caso tendrá que añadir sus propios diseños. {{< /alert >}}
nl: {{< alert color="info" title="Note" >}} Het is mogelijk FormCard gedelegeerden direct te gebruiken met een Kirigami.ScrollablePage, maar in dat geval moet u uw eigen indelingen toevoegen. {{< /alert >}}
sl: {{< alert color="info" title="Note" >}} mogoče je uporabiti delegate FormCard neposredno s Kirigami.ScrollablePage, vendar boste v tem primeru morate dodati svoje lastne postavitve. {{< /alert >}}
sv: {{< alert color="info" title="Note" >}} Det är möjligt att använda FormCard delegater direkt med en Kirigami.ScrollablePage, men i detta fall måste en egen layout läggas till. {{< /alert >}}
uk: {{< alert color="info" title="Зауваження" >}} Можна використовувати делегати FormCard безпосередньо за допомогою Kirigami.ScrollablePage, але у цьому випадку вам доведеться додати ваші власні компонування. {{< /alert >}}

source: For every [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html) you want to create, you can create a [FormHeader](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formheader.html) just before it. The header uses bold text and shows up right above the form card.
ca: Per a cada [FormCard](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formcard.html) que vulgueu crear, podeu crear un [FormHeader](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formheader.html) just abans. La capçalera utilitza text en negreta i es mostra just a sobre de la targeta de formulari.

source: Our delegates go here...
ca: Els nostres delegats van aquí...
eo: Niaj delegitoj iras ĉi tien...
es: Nuestros delegados van aquí...
nl: Onze gedelegeerden gaan hier...
sl: Naši delegati gredo sem...
sv: Våra delegater ska finnas här...
uk: Тут будуть наші делегати…

source: FormTextDelegate and FormSectionText
ca: FormTextDelegate i FormSectionText
eo: FormTextDelegate kaj FormSectionText
es: FormTextDelegate y FormSectionText
nl: FormTextDelegate en FormSectionText
sl: FormTextDelegate in FormSectionText
sv: FormTextDelegate och FormSectionText
uk: FormTextDelegate і FormSectionText

source: Let's start simple, with plain text.
ca: Comencem de manera senzilla, amb text net.
eo: Ni komencu simple, kun simpla teksto.
es: Empecemos de forma sencilla, con texto sin formato.
nl: Laten we eenvoudig beginnen met platte tekst.
sl: Začnimo preprosto, z navadnim besedilom.
sv: Låt oss börja enkelt, med vanlig text.
uk: Розпочнімо із простого — звичайного тексту.

source: [FormSectionText](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formsectiontext.html) simply adds a thin delegate containing a label. [FormTextDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html) has text and a grayed out description.
ca: [FormSectionText](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formsectiontext.html) senzillament afegeix un delegat fi que conté una etiqueta. [FormTextDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html) té text i una descripció en gris.

source: We add some dummy text for the hypothetical theme detection. If we wanted to have actual color scheme detection, in the future it could be done similarly to [Neochat](https://apps.kde.org/neochat) ([code here](https://invent.kde.org/network/neochat/-/blob/master/src/settings/colorschemer.cpp)), making use of a C++ model with [KColorSchemeManager](https://api.kde.org/kcolorschememanager.html).
ca: Afegim algun text fictici per a la hipotètica detecció del tema. Si volíem tenir una detecció real de l'esquema de color, en el futur es podria fer de manera similar al [Neochat](https://apps.kde.org/neochat) ([codi aquí](https://invent.kde.org/network/neochat/-/blob/master/src/settings/colorschemer.cpp)), fent ús d'un model de C++ amb el [KColorSchemeManager](https://api.kde.org/kcolorschememanager.html).

source: In the Online Accounts section, we see an additional property, [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#leading-prop). We can add an [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) to it so that it appears before the text. Its opposite property, [trailing](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#trailing-prop), would be able to show an Item after the text, but we won't use it in our program.
ca: A l'apartat Comptes Online, veiem un immoble addicional, [leading](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#leading-prop). Es pot afegir un [Item](https://doc.qt.io/qt-6/qml-qtquick-item.html) perquè aparegui abans del text. La seva propietat oposada, [trailing](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formtextdelegate.html#trailing-prop), podria mostrar un element després del text, però no l'utilitzarem en el programa.

source: We use a [Kirigami.Icon](docs:kirigami;org.kde.kirigami.primitives.Icon) here for simplicity, but this could also be implemented using a Kirigami Addons [Avatar](https://api.kde.org/qml-org-kde-kirigamiaddons-components-avatar.html) that grabs the information from a model, [as is done in Neochat](https://invent.kde.org/network/neochat/-/blob/master/src/settings/AccountsPage.qml).
ca: Fem servir un [Kirigami.Icon](docs:kirigami;org.kde.kirigami.primitives.Icon) aquí per a la simplicitat, però això també es podria implementar utilitzant un [Avatar](https://api.kde.org/qml-org-kde-kirigamiaddons-components-avatar.html) dels complements del Kirigami que captura la informació d'un model, [com es fa al Neochat](https://invent.kde.org/network/neochat/-/blob/master/src/settings/AccountsPage.qml).

source: It should end up looking like this:
ca: Hauria d'acabar veient-se així:
eo: Ĝi devus fini aspekti jene:
es: Debería terminar pareciéndose a esto:
nl: Het zou er uiteindelijk als volgt uit moeten zien:
sl: Na koncu bi moralo videti takole:
sv: Slutligen ska det se ut så här:
uk: Врешті, маємо отримати таке:

source: The [FormButtonDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html) is visually similar to a FormTextDelegate, but it is clickable and shows an arrow pointing to the right. We used it in the [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) before.
ca: El [FormButtonDelegate](https://api.kde.org/qml-org-kde-kirigamiaddons-formcard-formbuttondelegate.html) és visualment similar a un FormTextDelegate, però s'hi pot fer clic i mostra una fletxa que apunta cap a la dreta. L'hem utilitzat abans a la [introducció dels complements del Kirigami](/docs/getting-started/kirigami/addons-introduction).
