Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Since QML is built on top of JavaScript, many of this language's features are available for use in QML files. However, QML variables have to be prefixed with `property`, unless it is inside a JS code block. You can read more about it in [this page](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
ca: Com que el QML està construït sobre el JavaScript, moltes de les característiques d'aquest llenguatge estan disponibles per al seu ús en fitxers QML. No obstant això, les variables QML s'han de prefixar amb `property`, a menys que estigui dins d'un bloc de codi JS. Podeu llegir-ne més en [aquesta pàgina](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
eo: Ĉar QML estas konstruita sur Ĝavoskripto, multaj el la funkcioj de ĉi tiu lingvo estas disponeblaj por uzo en QML-dosieroj. Tamen, QML-variabloj devas esti prefiksitaj per `proprieto`, krom se ĝi estas ene de JS-kodbloko. Vi povas legi pli pri ĝi en [ĉi tiu paĝo](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
nl: Omdat QML is bovenop JavaScript is gebouwd, zijn vele van deze taalfuncties beschikbaar voor gebruik in QML-bestanden. QML-variabelen moeten echter een prefix met `property` hebben, tenzij het binnen een JS codeblok is. U kunt hier meer over lezen op [deze pagina](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
pt: Dado que o QML é desenvolvido sobre o JavaScript, muitas das funcionalidades desta linguagem estão disponíveis para usar nos ficheiros QML. Contudo, as variáveis em QML têm de ser antecedidas de `property`, a menos que esteja dentro de um bloco de código em JS. Poderá ler mais sobre isso [nesta página](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
sl: Ker je QML zgrajen na vrhu JavaScripta, so številne funkcije tega jezika na voljo za uporabo v datotekah QML. Vendar pa je treba spremenljivke QML predpona s "lastnostjo", razen če je znotraj kodnega bloka JS. Več o tem si lahko preberete v [tej strani](https://doc.qt.io/qt-6/qtqml-javascript-topic.htm).
sv: Eftersom QML är byggt på Javascript är många av språkets funktioner tillgängliga för användning i QML-filer. QML-variabler måste dock ha prefixet `property`, såvida de inte finns i ett JS-kodblock. Du kan läsa mer om det på [den här sidan](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).
uk: Оскільки QML побудовано на основі JavaScript, багатьма можливостями цієї мови можна скористатися у файлах QML. Втім, до змінних QML слід додавати префікс «property», якщо код не перебуває у блоці JS. Докладніше про це можна дізнатися з [відповідної сторінки](https://doc.qt.io/qt-6/qtqml-javascript-topic.html).

source: Models are also useful in how they can be modified through the use of several methods. Some important ones are:
ca: Els models també són útils perquè es poden modificar mitjançant l'ús de diversos mètodes. Alguns importants són:
eo: Modeloj ankaŭ estas utilaj en kiel ili povas esti modifitaj per la uzo de pluraj metodoj. Iuj gravaj estas:
es: Los modelos también son útiles porque se pueden modificar mediante el uso de varios métodos. Algunos importantes son:
fr: Les modèles sont également utiles dans la mesure où ils peuvent être modifiés grâce à l'utilisation de plusieurs méthodes. En voici les plus importants :
nl: Modellen zijn ook nuttig in hoe ze gewijzigd kunnen worden met gebruik van verschillende methoden. Enige belangrijken zijn:
pl: Modele są także użyteczne w sposób w jaki można je zmieniać poprzez użycie kilku metod. Jedne z ważniejszych to:
pt: Os modelos são também úteis na forma como poderão ser modificados através do uso de vários métodos. Alguns dos importantes são:
sl: Modeli so uporabni tudi v tem, kako jih je mogoče spremeniti z uporabo več metod. Nekatere pomembne so:
sv: Modeller är också användbara på det sätt de kan ändras genom användning av flera metoder. Några viktiga är:
uk: Крім того, моделі є корисними через те, як їх можна змінювати, використовуючи декілька методів. Серед важливих методів такі:

source: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) adds a JavaScript object (JSObject) `yourobject` to the ListModel and places it after the last item in the model. For this to happen correctly, you must provide a JSObject with the correct properties and corresponding datatypes.
ca: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) afegeix un objecte de JavaScript (JSObject) `yourobject` al ListModel, i el col·loca després de l'últim element del model. Perquè això succeeixi correctament, cal proporcionar un objecte JSObject amb les propietats correctes i els tipus de dades corresponents.
eo: [ListModel.append(youobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) aldonas JavaScript-objekton (JSObject) `youobject` al la ListModel kaj metas ĝin post la lasta elemento en la modelo. Por ke ĉi tio okazu ĝuste, vi devas provizi JSObject kun la ĝustaj proprecoj kaj respondaj datumtipoj.
nl: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) voegt een JavaScript-object toe (JSObject)`yourobject` aan het ListModel en plaatst het na het laatste item in het model. Om dit juist te laten gebeuren moet u een JSObject leveren met de juiste eigenschappen en overeenkomstige gegevenstypen.
sl: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) doda objekt JavaScript (JSObject) `yourobject` v ListModel in ga postavi za zadnji element v modelu. Da bi se to zgodilo pravilno, morate zagotoviti JSObject s pravilnimi lastnostmi in ustreznimi tipi podatkov.
sv: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) lägger till ett Javascript-objekt (JSObject) `yourobject` i listmodellen, och placerar det efter det sista objektet i modellen. För att det ska göras korrekt, måste du tillhandahålla ett JSObject med rätt egenskaper och motsvarande datatyper.
uk: [ListModel.append(yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#append-method) додає вказаний вами об'єкт JavaScript (JSObject) до ListModel і розташовує його після останнього запису у моделі. Щоб це відбувалося належним чином, вам слід надати JSObject із належними властивостями і відповідними типами даних.

source: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) returns the JSObject at the index location you provide.
ca: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) retorna el JSObject en la ubicació de l'índex que heu proporcionat.
eo: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) resendas la JSObject ĉe la indeksa loko, kiun vi provizas.
nl: ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) geeft het JSObject terug op de indexlocatie die u levert.
pt: O [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) devolve o JSObject na posição 'indice' que indicar.
sl: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) vrne JSObject na mestu indeksa, ki ga navedete.
sv: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) returnerar JSObject på indexplatsen du tillhandahåller.
uk: [ListModel.get(index: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#get-method) повертає JSObject із наданим індексом розташування.

source: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) removes the JSObject at the provided `index` location, and as many after that index location as you put in `count` (1 includes only the JSObject at the provided index)
ca: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) elimina el JSObject en la ubicació proporcionada `index`, i tantes com vulgueu després d'aquesta ubicació de l'índex com indiqueu a `count` (1 només inclou el JSObject a l'índex proporcionat).
eo: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) forigas la JSObject ĉe la provizita ` indeksa loko, kaj tiom da post tiu indeksa loko kiom vi metas en "kalkulo" (1 inkluzivas nur la JSObject ĉe la provizita indekso)
nl: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) verwijdert het JSObject op de geleverde locatie van `index` en zoveel na die indexlocatie als u stopt in `count` (1 stopt alleen het JSObject in de geleverde index)
pt: O [ListModel.remove(indice: int, quantidade: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) remove o JSObject na posição `indice` indicada, removendo tantos itens quantos desejar através do parâmetro `quantidade` (o valor 1 inclui apenas o JSObject na posição indicada)
sl: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) odstrani JSObject na predvidenem mestu indeksa `index` in tolikokrat po tem mestu indeksa, kot želite v števcu `count` (1 vključuje samo JSObject na danem indeksu)
sv: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) tar bort JSObject på den tillhandahållna platsen `index`, och så många efter den platsen som du anger i `count` (1 inkluderar bara JSObject på tillhandahållet index)
uk: [ListModel.remove(index: int, count: int)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#remove-method) вилучає JSObject із наданим індексом розташування і вказану кількість `count` об'єктів після нього (1 включає лише JSObject із наданим індексом)

source: [ListModel.set(index: int, yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) changes the item at the provided `index` location with the values provided in `yourobject`. Same rules as with `append()`.
ca: [ListModel.set(index: int, yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) canvia l'element en la ubicació proporcionada de `index` amb els valors proporcionats a `yourobject`. Les mateixes regles que amb `.append()`.
eo: [ListModel.set (indekso: int, viaobjekto: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) ŝanĝas la eron ĉe la provizita ` index` loko kun la valoroj provizitaj en `youobject`. Samaj reguloj kiel ĉe `append()`.
nl: [ListModel.set(index: int, yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) wijzigt het item op de geleverde locatie `index`met de waarden geleverd in `yourobject`. Zelfde regels als met `append()`.
pt: O [ListModel.set(indice: int, objecto: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) altera o item na posição 'indice' indicada com os valores fornecidos em 'objecto'. Aplicam-se as mesmas regras no `append()`.
sl: [ListModel.set(index: int, yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) spremeni postavko na zagotovljenem mestu indeksa `index` z vrednostmi, navedenimi v vašemu predmetu `yourobject`. Enaka pravila so kot pri `append()`.
sv: [ListModel.set(index: int, yourobject: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) ändrar objektet på tillhandahållen plats `index` med värdet som tillhandahålls i `yourobject`. Samma regel som med `.append`.
uk: [ListModel.set(index: int, ваш_об'єкт: jsobject)](https://doc.qt.io/qt-6/qml-qtqml-models-listmodel.html#set-method) замінює значення запису із наданим індексом розташування значеннями наданого вами об'єкта `yourobjectваш_об'єкт`. Ті самі правила, що і для `append()`.

source: Delegates
ca: Delegats
eo: Delegitoj
es: Delegados
nl: Gedelegeerden
sl: Delegati
sv: Delegater
uk: Делегати

source: While our `kountdownModel` contains the data that will be displayed, our `kountdownDelegate` will handle how the data will be displayed in the [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). For that we use a [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) designed to display card-type delegates, and those delegates will be visually represented by means of a [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard).
ca: Mentre que `kountdownModel` conté les dades que es mostraran, el nostre `kountdownDelegate` gestionarà com es mostraran les dades a la [ListView](https://doc.qt.io/qt-6/qml-qtquick-listview.html). Per això farem servir una [Kirigami.CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) dissenyada per a mostrar delegats del tipus targetes i aquests delegats es representaran visualment per mitjà d'una [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard).

source: Delegates automatically receive the properties of the [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) instances that we have specified in our model. We can therefore just refer to their `name`, `description`, and `date` properties as if they were conventional variables within our delegate.
ca: Els delegats reben automàticament les propietats de les instàncies [ListElement](https://doc.qt.io/qt-6/qml-qtqml-models-listelement.html) que hem especificat en el nostre model. Per tant, només podem fer referència a les seves propietats `name`, `description` i `date` com si fossin variables convencionals dins del nostre delegat.

source: Building the delegate card
ca: Construir la targeta de delegat
eo: Konstruante la delegitan karton
es: Construyendo la tarjeta de delegado
nl: De delegatiekaart bouwen
sl: Izdelava kartice delegata
sv: Bygga delegatkortet
uk: Побудова делегованої картки

source: The [Component](docs:qtqml;QtQml.Component) that will represent our delegate can be added inside our [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow). We will then check what each part of our delegate component does.
ca: El [Component](docs:qtqml;QtQml.Component) que representarà el nostre delegat es pot afegir dins del nostre [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow). Després comprovarem que fa cada part del nostre component delegat.

source: implicitWidth/Height define the natural width/height of an item if no width or height is specified. The setting below defines a component's preferred size based on its content
ca: implicitWidth/Height defineix l'amplada/alçada natural d'un element si no se n'especifica cap. La configuració següent defineix la mida preferida d'un component en funció del seu contingut.
eo: implicitWidth/Height difinas la naturan larĝon/alton de ero se neniu larĝo aŭ alteco estas specifita. La suba agordo difinas la preferatan grandecon de komponento laŭ ĝia enhavo
es: implicitWidth/Height definen la anchura/altura natural de un elemento si no se indica otra anchura o altura. La siguiente preferencia define el tamaño preferido de un componente en función de su contenido
fr: implicitWidth/Height définissent la largeur/hauteur naturelle d'un élément si aucune largeur ou hauteur n'est spécifiée. Le paramètre ci-dessous définit la taille préférée d'un composant préférée d'un composant en fonction de son contenu.
nl: implicitWidth/Height definiëren de natuurlijke breedte/hoogte van een item als er geen breedte of hoogte is gespecificeerd. De onderstaande instelling definieert een grootte met voorkeur gebaseerd op zijn inhoud
pl: implicitWidth/Height określają naturalną szerokość/wysokość rzeczy, jeśli nie podano szerokości lub wysokości. Ustawienie poniżej określa optymalny rozmiar składnika na podstawie jego treści
pt: O 'implicitWidth/Height' define a largura/altura natural de um item, caso não tenham sido definidas a largura ou a altura. A opção abaixo define o tamanho preferido de um componente com base no seu conteúdo
sl: implicitWidth/Height določi naravno širino/višino elementa, če ni določena širina ali višina. Spodnja nastavitev določa želeno velikost komponente na podlagi njene vsebine
sv: implicitWidth/Height definierar den naturliga bredd/höjd för ett objekt om ingen bredd eller höjd anges. Inställningen nedan definierar en komponents föredragna storlek baserat på dess innehåll
uk: implicitWidth/Height визначають природну ширину і висоту пункту, якщо ширину або висоту не вказано явним чином. Наведений нижче код визначає бажані розміри компонента на основі його вмісту.

source: onClicked: to be done... soon!
ca: onClicked: s'ha de fer... aviat!
eo: onKlakita: farota... baldaŭ!
es: onClicked: pendiente de hacer... ¡pronto!
fr: onClicked : à faire... bientôt !
nl: onClicked: nog te doen... spoedig!
pl: onClicked: do zrobienia... w krótce!
pt: onClicked: a fazer... em breve!
sl: onClicked: za opraviti... kmalu!
sv: onClicked: snart klart!
uk: onClicked: буде зроблено… невдовзі!

source: implicitWidth and implicitHeight
ca: implicitWidth i implicitHeight
eo: implicitWidth kaj implicitHeight
es: implicitWidth e implicitHeight
fr: implicitWidth et implicitHeight
nl: implicitWidth en implicitHeight
pl: implicitWidth oraz implicitHeight
pt: 'implicitWidth' e 'implicitHeight'
sl: implicitWidth in implicitHeight
sv: implicitWidth och implicitHeight
uk: implicitWidth та implicitHeight

source: The first part we will take a look at is how to manage the width and height of our component:
ca: A la primera part donarem un cop d'ull a com gestionar l'amplada i l'alçada del nostre component:
eo: La unua parto, kiun ni rigardos, estas kiel administri la larĝon kaj altecon de nia komponanto:
nl: Het eerste deel waar we naar zullen kijken is hoe de breedte en hoogte van onze component te beheren:
pt: A primeira parte que iremos observar é como gerir a largura e a altura do nosso componente:
sl: V prvem delu si bomo ogledali, kako upravljati širino in višino naše komponente:
sv: Den första delen vi tar en titt på är hur komponentens bredd och höjd hanteras:
uk: Перша частина, яку ми розглянемо, полягає у тому, як керувати шириною та висотою нашого компонента:

source: Looking at our [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard), the first properties we set are [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) and [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). We have set these to the `delegateLayout.implicitWidth` and `delegateLayout.implicitHeight`, i.e. the [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) and [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop) of the [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) element.
ca: Mirant la nostra [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard), les primeres propietats que establim són [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) i [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop). Les hem establert a la `delegateLayout.implicitWidth` i `delegateLayout.implicitHeight`, és a dir, les [implicitWidth](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitWidth-prop) i [implicitHeight](https://doc.qt.io/qt-6/qml-qtquick-item.html#implicitHeight-prop) de l'element [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html).

source: Implicit widths and heights are properties available in any [Item](docs:qtquick;QtQuick.Item) that function as hints and are set as a default, or as a fallback, if there is no explicit width or height set for these components. These values default to 0x0, so it is very important that you define those in raw Item components as done above.
ca: Les amplades i alçades implícites són propietats disponibles en qualsevol [Item](docs:qtquick;QtQuick.Item) que funcionen com a consells i s'estableixen com a valor predeterminat, o com a reserva, si no hi ha una amplada o alçada explícita establerta per a aquests components. Aquests valors són predeterminats a 0x0, per tant, és molt important que els definiu en components Item en brut tal com s'ha fet anteriorment.
eo: Implicaj larĝoj kaj altecoj estas proprecoj haveblaj en iu ajn [Ero](docs:qtquick;QtQuick.Item) kiuj funkcias kiel sugestoj kaj estas agordita kiel defaŭlta, aŭ kiel rezervi, se ne ekzistas eksplicita larĝo aŭ alteco agordita por ĉi tiuj komponantoj. Ĉi tiuj valoroj defaŭlte estas 0x0, do estas tre grave, ke vi difinas tiujn en krudaj Item-komponentoj kiel farite supre.
nl: Impliciete breedtes en hoogtes zijn eigenschappen die beschikbaar zijn bij elk[Item](docs:qtquick;QtQuick.Item) die functioneren als hints en ingesteld als een set standaarden of als terugvalwaarden, als er geen expliciete breedte of hoogte in ingesteld voor deze waarden. Deze waarden zijn standaard 0x0, dus is het belangrijk dat u ze definieert in ruwe Item-componenten zoals bovenstaand.
sl: Implicitne širine in višine so lastnosti, ki so na voljo v katerem koli predmetu [Item](docs:qtquick;QtQuick.Item), ki delujejo kot namigi in so nastavljene kot privzete ali nadomestne, če za te komponente ni eksplicitne širine ali višine. Te vrednosti so privzeto nastavljene na 0x0, zato je zelo pomembno, da jih definirate v neobdelanih komponentah predmeta, kot je storjeno zgoraj.
sv: Implicita bredder och höjder är egenskaper tillgängliga i alla [Item](docs:qtquick;QtQuick.Item) som fungerar som tips och ställs in som förvalda värden, eller som reserv om det inte finns någon bredd och höjd inställt för komponenterna. Värdena har förval 0x0, så det är mycket viktigt att de definieras i de obehandlade komponenterna som gjordes ovan.
uk: Неявними ширинами і висотами є властивості, які доступні у будь-якому [Item](docs:qtquick;QtQuick.Item), і які працюють як підказки. Вони є або типовими або резервними варіантами, якщо для цих компонентів не встановлено явно ширини або висоти. Типовими значеннями цих величин є 0x0, тому дуже важливо визначати ці значення у простих компонентах Item, як це зроблено вище.

source: Here we have set the `implicitWidth` and `implicitHeight` of our [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) to that of the [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) below to ensure it does not spill out of the card. This way, the card takes as much space is necessary for its contents.
ca: Aquí haurem establert la `implicitWidth` i `implicitHeight` de la nostra [Kirigami.AbstractCard](docs:kirigami;org.kde.kirigami.AbstractCard) a la de la [GridLayout](https://doc.qt.io/qt-6/qml-qtquick-layouts-gridlayout.html) següent per a assegurar-nos que no desbordi la targeta. D'aquesta manera, la targeta pren tant espai com sigui necessari per al seu contingut.

source: Layouts
ca: Disposicions
eo: Aranĝoj
es: Diseños
fr: Dispositions
nl: Indelingen
pl: Układy
pt: Disposições
sl: Postavitve
sv: Layouter
uk: Компонування
