Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Right, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): a button that will do something... soon!
ca: A la dreta, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): un botó que farà alguna cosa... aviat!
eo: Ĝuste, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): butono kiu faros ion... baldaŭ!
nl: Rechts, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): een knop die iets zal doen... spoedig!
pt: À direita, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): um botão que irá fazer algo... em breve!
sl: Desno, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): gumb, ki bo nekaj naredil... kmalu!
sv: Höger, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): en knapp som kommer att göra någonting... snart!
uk: Праворуч, [Controls.Button](docs:qtquickcontrols;QtQuick.Controls.Button): кнопка, яка щось робитиме… невдовзі!

source: ![Screenshot of the app appearance after completing this lesson](Screenshot.webp)
ca: ![Captura de pantalla de l'aparença de l'aplicació després de completar aquesta lliçó](Screenshot.webp)
eo: ![Ekrankopio de la aplikaĵo post kompletigado de ĉi tiu leciono](Ekrankopio.webp)
nl: ![Schermafdruk van het uiterlijk van de toepassing na afmaken van deze les](Screenshot.webp)
pt: ![Imagem da aparência da aplicação depois de terminar esta lição](Screenshot.webp)
sl: ![Posnetek zaslona videza aplikacije po končanju te lekcije](Screenshot.webp)
sv: ![Skärmbild av programmets utseende efter att ha gjort färdigt den här lektionen](Screenshot.webp)
uk: ![Знімок вигляду вікна програми після завершення цього уроку](Screenshot.webp)

source: So there is our basic card!
ca: Així que aquí està la nostra targeta bàsica!
eo: Do estas nia baza karto!
es: ¡Así que ahí está nuestra tarjeta básica!
fr: Ainsi, ceci est notre carte basique !
nl: Dus hier is onze basis kaart!
pl: Tak więc jest to nasza podstawowa karta!
pt: Aqui temos então o nosso cartão básico!
sl: Tu je naša osnovna kartica!
sv: Så där är vårt grundläggande kort.
uk: Отже, маємо нашу базову картку!

source: With these steps, we have now laid the basic groundwork for adding all the functionality to our app.
ca: Amb aquests passos, hem establert les bases bàsiques per a afegir tota la funcionalitat a la nostra aplicació.
eo: Kun ĉi tiuj paŝoj, ni nun metis la bazan bazon por aldoni ĉiujn funkciojn al nia programo.
es: Con estos pasos hemos sentado las bases para añadir toda la funcionalidad a nuestra aplicación.
fr: Avec ces étapes, nous avons maintenant posé les bases pour ajouter toutes les fonctionnalités à notre application.
nl: Met deze stappen hebben we de basis gelegd voor het toevoegen van alle functionaliteit aan uw toepassing.
pl: Tymi krokami, stworzyliśmy fundament do dodawania całej funkcjonalności do naszej aplikacji.
pt: Com estes passos, já dispomos o trabalho de base para adicionar todas as funcionalidades à nossa aplicação.
sl: S temi koraki smo zdaj v postavili temeljne podlage za dodajanje vseh funkcionalnosti v našo aplikacijo.
sv: Med de här stegen har vi nu lagt grundstenen för att lägga till alla funktioner i vårt program.
uk: Виконанням цих кроків ми заклали підвалини для додавання функціональних можливостей до нашої програми.

source: Next steps
ca: Passos següents
eo: Sekvaj paŝoj
es: Siguientes pasos
fr: Étapes suivantes
nl: Volgende stappen
pl: Następne kroki
pt: Próximos passos
sl: Naslednji koraki
sv: Följande steg
uk: Наступні кроки

source: What to do after finishing your first simple Kirigami application
ca: Què fer una vegada finalitzada la primera aplicació senzilla escrita amb el Kirigami
eo: Kion fari post fino de via unua simpla aplikaĵo de Kirigami
es: Qué hacer después de terminar la primera aplicación sencilla de Kirigami
fr: Que faire après avoir terminé votre première application simple avec Kirigami ?
nl: Wat doen na het beëindigen van uw eerste eenvoudige Kirigami toepassing
pl: Co zrobić po ukończeniu twojej pierwszej prostej aplikacji Kirigami
pt: O que fazer depois de terminar a sua primeira aplicação simples em Kirigami
sl: Kaj storiti po prvi dokončani preprosti aplikaciji Kirigami?
sv: Vad du kan göra efter att ha gjort färdigt ditt första enkla Kirigami-program
uk: Що робити після завершення роботи над вашою першою простою програмою Kirigami

source: What we have built
ca: El que hem construït
eo: Kion ni konstruis
es: Lo que hemos construido
fr: Ce que nous avons compilé
nl: Wat hebben we gebouwd
pl: Co zbudowaliśmy
pt: O que criámos
sl: Kaj smo zgradili
sv: Vad vi har byggt
uk: Що ми побудували?

source: Over the past few tutorials you have built a basic but functional Kirigami application that lets you add, edit, and delete date countdowns. In doing so we have learned about Kirigami and QtQuick components, some of how QML works, basic application layouts, and more. Not bad at all!
ca: En les últimes guies d'aprenentatge, heu creat una aplicació bàsica però funcional amb el Kirigami, que permet afegir, editar i eliminar comptes enrere de dates. En fer-ho, hem après sobre els components de Kirigami i QtQuick, quelcom del funcionament del QML, disposicions bàsiques d'aplicació i més. No està malament!
eo: Dum la pasintaj kelkaj lerniloj vi konstruis bazan sed funkcian Kirigami-aplikaĵon, kiu ebligas al vi aldoni, redakti kaj forigi datajn retronombradojn. Farante tion ni lernis pri Kirigami kaj QtQuick-komponentoj, iujn el kiel QML funkcias, bazajn aplikaĵaranĝojn, kaj pli. Tute ne malbone!
nl: Gedurende de paar inleidingen hebt u een basis, maar functionele Kirigami toepassing gebouwd, die aflopen van datums laat toevoegen, bewerken en verwijderen. Door dat te doen hebben we iets geleerd over Kirigami en QtQuick componenten, iets over hoe QML werkt, basis indelingen van toepassingen en meer. Al met al, niet slecht!
pt: Ao longo dos últimos tutoriais, fomos construindo uma aplicação básica mas funcional do Kirigami que lhe permite adicionar, editar e apagar contagens decrescentes de datas. Ao fazê-lo, aprendemos muito sobre o Kirigami e os componentes do QtQuick, alguns dos sistemas do QML, disposições de aplicações básicas, e muito mais. Nada mau!
sl: V preteklih nekaj vajah ste zgradili osnovno, vendar funkcionalno aplikacijo Kirigami, ki vam omogoča, da dodate, uredite in izbrišete odštevanje datuma. Pri tem smo spoznali komponenti Kirigami in QtQuick, nekatere sisteme QML-a, osnovne postavitve aplikacij in še več. Ni slabo!
sv: Under de senaste handledningarna har du byggt ett enkelt med funktionellt Kirigami-program som låter dig lägga till, redigera och ta bort datumnedräknare. När vi gjorde det har vi lärt oss om komponenter i Kirigami och QtQuick, något om hur QML fungerar, enkla programlayouter, med mera. Inte illa alls!
uk: У декількох останніх розділах підручника ми побудували базову, але функціональну програму Kirigami, за допомогою якої ви можете додавати, редагувати та вилучати відліки за датами. Роблячи це, ми навчилися користуватися компонентами Kirigami і QtQuick, познайомилися із тим, як працює QML, базовими компонуваннями інтерфейсу програми тощо. І це добре!

source: You now have a grasp of the basics that make up many of KDE's most popular applications. You might be asking yourself: what now?
ca: Ara compreneu els conceptes bàsics que formen moltes de les aplicacions més populars del KDE. Potser us esteu preguntant: I ara, què?
eo: Vi nun ekkomprenas la bazaĵojn kiuj konsistigas multajn el la plej popularaj aplikaĵoj de KDE. Vi eble demandas vin: kio nun?
es: Ahora comprende los conceptos básicos que componen muchas de las aplicaciones más populares de KDE. Quizá se esté preguntando: ¿y ahora qué?
fr: Vous avez maintenant une bonne maîtrise des bases constituant de nombreuses applications les plus populaires de KDE. Vous vous demandez peut-être : quoi de plus maintenant ?
nl: U hebt nu een glimp opgevangen van de basis waar velen van de meest populaire toepassingen van genaakt zijn. U zou uzelf kunnen afvragen: wat nu?
pl: Teraz masz pojęcie o podstawach, które czynią wiele z aplikacji KDE najbardziej popularnymi. Możesz zadawać sobie pytanie: co teraz?
pt: Agora tem uma boa visão sobre as bases que compõem muitas das aplicações mais conhecidas do KDE. Poder-se-á questionar a si próprio: e agora?
sl: Zdaj ste spoznali tisto, kar je osnova mnogih od najbolj priljubljenih aplikacij KDE. Morda se sprašujete: kaj pa zdaj?
sv: Nu har du en hum om grunderna som skapar många av KDE:s mest populära program. Du kanske frågar dig: vad göra nu?
uk: Тепер ви маєте базові знання щодо того, з чого складається багато найпопулярніших програм KDE. Можливо, у вас виникло питання: «І що ж тепер?»

source: Well, don't worry: we have taken the time to provide some pointers as to where you can go from here.
ca: Bé, no us preocupeu: ens hem pres el temps per a donar-vos algunes indicacions sobre on podeu anar a partir d'aquí.
eo: Nu, ne maltrankviliĝu: ni prenis la tempon por provizi kelkajn indikojn pri kie vi povas iri de ĉi tie.
es: Bueno, no se preocupe: nos hemos tomado el tiempo para darle algunos consejos sobre adónde puede ir desde aquí.
fr: Ne vous inquiétez pas : nous avons pris le temps de vous donner quelques indications sur la marche à suivre à partir d'ici.
nl: Wel, geen zorgen: we hebben de tijd genomen om enige aanwijzingen te geven over waar u vanaf hier naar toe kunt gaan.
pl: Cóż, nie przejmuj się: poświęciliśmy trochę czasu na wskazówki gdzie możesz pójść z tego miejsca.
pt: Bem, não se preocupe: algum do tempo que aplicámos serviu para lhe dar algumas indicações do que poderá fazer a partir daqui.
sl: No, ne skrbite: vzeli smo si čas, da zagotovimo nekaj usmeritev, v katero smer lahko nadaljujete.
sv: Var inte orolig: vi har tagit oss tid att ge några pekare till vart du kan gå härifrån.
uk: Добре, не хвилюйтеся: ми вже подумали про подальші шляхи розвитку ваших знань.

source: Contributing to KDE projects
ca: Col·laborar amb els projectes del KDE
eo: Kontribuante al KDE-projektoj
es: Colaboración con proyectos de KDE
fr: Contribution aux projets de KDE
nl: Bijdragen aan projecten van KDE
pl: Współtworzenie projektów KDE
pt: Contribuir para os projectos do KDE
sl: Prispevanje k projektom KDE
sv: Bidra till KDE-projekt
uk: Участь у проєктах KDE

source: One of the best ways to improve your development skills is by putting them into practice. KDE's community is welcoming and always looking for more passionate developers!
ca: Una de les millors formes de millorar les vostres habilitats de desenvolupament és posant-les en pràctica. La comunitat KDE és acollidora i sempre busca més desenvolupadors apassionats!
eo: Unu el la plej bonaj manieroj plibonigi viajn evoluajn kapablojn estas praktiki ilin. La komunumo de KDE bonvenigas kaj ĉiam serĉas pli pasiajn programistojn!
es: Uno de los mejores modos de mejorar sus habilidades de desarrollo es ponerlas en práctica. La comunidad de KDE es acogedora y siempre busca más desarrolladores apasionados.
fr: L'une des meilleures façons d'améliorer vos compétences en développement est de les mettre en pratique. La communauté KDE est accueillante et cherche toujours plus de personnes passionnées par le développement.
nl: Een van de beste manieren om uw ontwikkelvaardigheden te verbeteren is door ze in praktijk te brengen. De gemeenschap van KDE verwelkomt en zoekt altijd naar meer gepassioneerde ontwikkelaars!
pl: Jednym z najlepszych sposobów na poprawienie swoich umiejętności programistycznych jest wykorzystywanie ich w praktyce. Społeczność KDE wita z otwartymi rękoma i zawsze chętnie szuka programistów z pasją!
pt: Uma das melhores formas de melhoras as suas competências de desenvolvimento é pô-las em prática. A comunidade do KDE é amigável e está sempre à procura de mais programadores apaixonados!
sl: Eden najboljših načinov za izboljšanje vaših razvojnih veščin je, da jih daste v prakso. KDE-jeva skupnost je dobrodošla in vedno išče več strastnih razvijalcev!
sv: Ett av de bästa sätten att förbättra sin utvecklingskompetens är att använda den i praktiken. KDE:s gemenskap är välkomnande och säker alltid efter fler nitiska utvecklare!
uk: Одним з найкращих способів удосконалення навичок з розробки є їхнє практичне використання. Спільнота KDE буде завжди рада появі нових відданих розробників!

source: We have several pieces of documentation that can help guide you towards becoming a contributor. We recommend you take a look at our other [development pages](/docs/getting-started/building) which can help you learn more about the KDE Community's development workflow. We also recommend you take a look at our documentation for KDE's GitLab instance, called [Invent](https://community.kde.org/Infrastructure/GitLab), as you will likely need to interact with it during the development process. The KDE Community interacts mainly through Matrix, and we also have [a page on the community wiki](https://community.kde.org/Matrix) that will guide you through setting up with your very own account.
ca: Tenim diversos documents que poden ajudar-vos a fer que us convertiu en col·laborador. Us recomanem que vegeu les altres [pàgines de desenvolupament](/docs/getting-started/building), la qual pot ajudar-vos a obtenir més informació sobre el flux de treball de desenvolupament de la comunitat KDE. També recomanem que doneu un cop d'ull a la nostra documentació sobre la instància de GitLab de KDE, anomenada [Invent](https://community.kde.org/Infrastructure/GitLab), ja que probablement necessitareu interactuar amb ella durant el procés de desenvolupament. La comunitat KDE interactua principalment a través de Matrix, i també tenim [una pàgina al wiki de la comunitat](https://community.kde.org/Matrix) que us guiarà per a configurar el vostre propi compte.

source: While interacting with others in the KDE Community, please make sure you abide by the [Code of Conduct](https://kde.org/code-of-conduct/).
ca: Mentre interactueu amb els altres a la Comunitat KDE, assegureu-vos de complir amb el [Codi de conducta](https://kde.org/code-of-conduct/).
eo: Dum interagado kun aliaj en la KDE-Komunumo, bonvolu certigi, ke vi observas la [Kodon de Konduto](https://kde.org/code-of-conduct/).
nl: Tijdens het omgaan met anderen in de KDE-gemeenschap, houd u aan de [Code voor gedrag](https://kde.org/code-of-conduct/).
pt: Enquanto interage com outros na Comunidade do KDE, certifique-se por favor que cumpre o seu [Código de Conduta](https://kde.org/code-of-conduct/).
sl: Pri komuniciranju z drugimi v skupnosti KDE se prepričajte, da spoštujete [kodeks obnašanja](https://kde.org/code-of-conduct/).
sv: När du samspelar med andra i KDE-gemenskapen, se till att du följer [förhållningsreglerna](https://kde.org/code-of-conduct/).
uk: Взаємодіючи з іншими учасниками спільноти KDE, будь ласка, дотримуйтеся [Кодексу поведінки учасника](https://kde.org/code-of-conduct/).

source: With your newfound skills you are in a good position to begin contributing to Kirigami projects. Thankfully, many of KDE's most popular applications and components are built with this framework. Here are a list of projects you are welcome to help with.
ca: Amb les vostres noves habilitats, esteu en una bona posició per a començar a contribuir amb els projectes escrits amb el Kirigami. Afortunadament, moltes de les aplicacions i components més populars del KDE es creen amb aquest marc de treball. Aquí hi ha una llista dels projectes en els quals podreu ajudar.
eo: Kun viaj novaj kapabloj vi estas en bona pozicio por komenci kontribui al Kirigami-projektoj. Feliĉe, multaj el la plej popularaj aplikoj kaj komponantoj de KDE estas konstruitaj kun ĉi tiu kadro. Jen listo de projektoj, pri kiuj vi bonvenas helpi.
es: Con sus nuevas habilidades, está en una buena posición para comenzar a colaborar con los proyectos de Kirigami. Afortunadamente, muchas de las aplicaciones y componentes más populares de KDE se crean con esta infraestructura. Esta es una lista de proyectos en los que puede ayudar.
fr: Avec vos nouvelles compétences, vous êtes en bonne position pour commencer à contribuer aux projets de Kirigami. Heureusement, la plupart des applications et composants les plus populaires de KDE sont construits avec cet environnement de développement. Voici une liste de projets auxquels vous pouvez participer.
nl: Met uw nieuw gevonden vaardigheden bent u in een goede positie om te beginnen met bij te dragen aan Kirigami projecten. Gelukkig zijn vele van de meest populaire toepassingen en componenten van KDE gebouwd met dit framework. Hier is een lijst met projecten waar u welkom bent om mee te helpen.
pl: Ze swoimi nowymi umiejętnościami jesteś gotowy do współtworzenia projektów Kirigami. Na szczęście, wiele najpowszechniejszych aplikacji oraz składników KDE jest zbudowanych wokół tego szkieletu. Oto spis projektów, w których twoja pomoc będzie mile widziana.
pt: Com as suas competências recém-adquiridas, está numa boa posição para começar a contribuir para projectos do Kirigami. Felizmente, muitas das aplicações e componentes conhecidos do KDE são criados com base nessa plataforma. Aqui está uma lista dos projectos com os quais é bem-vindo para ajudar.
sl: Z novo pridobljenimi znanji ste v dobrem položaju, da začnete prispevati k projektom Kirigami. K sreči so s tem okvirom zgrajene številne najbolj priljubljene aplikacije in komponente KDE. Tukaj je seznam projektov, kjer je vaša pomoč dobrodošla.
sv: Med dina nyfunna färdigheter, är du rätt placerad för att börja bidra till Kirigami-projekt. Som tur är byggs många av KDE:s populäraste program och komponenter med ramverket. Här är en lista över projekt som du är välkommen att hjälpa till med.
uk: Із набутими вами знаннями вам буде просто почати робити внесок до проєктів Kirigami. На щастя, багато з найпопулярніших програм і компонентів KDE побудовано за допомогою саме цієї бібліотеки. Нижче наведено список проєктів, які будуть раді вашій допомозі.

source: Beginner-friendly Kirigami projects
ca: Projectes escrits amb el Kirigami per a novells
eo: Projektoj de Kirigami por komencantoj
es: Proyectos de Kirigami para principiantes
fr: Projets Kirigami accessibles aux débutant(e)s
nl: Beginner-vriendelijke Kirigami projecten
pl: Projekty Kirigami przyjazne początkującym
pt: Projectos do Kirigami amigáveis para principiantes
sl: Začetnikom prijazni projekti Kirigami
sv: Nybörjarvänliga projekt med Kirigami
uk: Зручні для початківців проєкти Kirigami

source: Project
ca: Projecte
eo: Projekto
es: Proyecto
fr: Projet
pl: Projekt
pt: Projecto
sl: Projekt
sv: Projekt
uk: Проєкт

source: What it is
ca: Què és això
eo: Kio ĝi estas
es: Lo que es
fr: Qu'est ce que c'est
nl: Wat het is
pl: Co to jest
pt: O que é
sl: Kaj je to
sv: Vad den gör
uk: Призначення

source: Links
ca: Enllaços
eo: Ligiloj
es: Enlaces
fr: Liens
nl: Koppelingen
pl: Odnośniki
pt: Hiperligações
sl: Povezave
sv: Länkar
uk: Посилання

source: A touch friendly calendar application designed for mobile devices.
ca: Una aplicació de calendari tàctil dissenyada per a dispositius mòbils.
eo: Tuŝ-amika kalendara aplikaĵo dizajnita por porteblaj aparatoj.
es: Una aplicación de calendario táctil diseñada para dispositivos móviles.
nl: Een aanraakvriendelijke agendatoepassing ontworpen voor gebruik op mobiele apparaten.
pt: Uma aplicação de calendário táctil amigável e desenhada para dispositivos móveis.
sl: Aplikacija koledarja, prijazna za dotik, zasnovana za mobilne naprave.
sv: Ett pekvänlig kalenderprogram konstruerat för mobilenheter.
uk: Зручна на сенсорних екранах програма-календар для мобільних пристроїв.

source: [KDE Apps page](https://apps.kde.org/calindori)<br />[KDE Invent page](https://invent.kde.org/plasma-mobile/calindori)
ca: [Pàgina de KDE Apps](https://apps.kde.org/calindori)<br />[Pàgina de KDE Invent](https://invent.kde.org/plasma-mobile/calindori)

source: An image viewer designed for desktop and touch devices.
ca: Un visualitzador d'imatges dissenyat per a l'escriptori i dispositius tàctils.
eo: Bildrigardilo dizajnita por labortablaj kaj tuŝaj aparatoj.
es: Un visor de imágenes diseñado para el escritorio y para dispositivos táctiles.
fr: Un afficheur d'images conçue pour les ordinateurs de bureau et les appareils tactiles.
nl: Een afbeeldingenviewer ontworpen voor bureaublad en aanraakapparaten.
pl: Przeglądarka obrazów stworzona dla urządzeń biurkowych i dotykowych.
pt: Um visualizador de imagens desenhado para computadores e dispositivos tácteis.
sl: Pregledovalnik slik namenjen namiznim napravam in napravam na dotik.
sv: En bildvisare konstruerad för skrivbordsdatorer och pekskärmar.
uk: Програма для перегляду зображень на комп'ютерах та сенсорних пристроях.

source: [KDE Apps page](https://apps.kde.org/koko/)<br />[KDE Invent page](https://invent.kde.org/graphics/koko)
ca: [Pàgina de KDE Apps](https://apps.kde.org/koko/)<br />[Pàgina de KDE Invent](https://invent.kde.org/graphics/koko)

source: A color contrast checker that tells you if your color combinations are accessible for people with color vision deficiencies.
ca: És un comprovador del contrast del color i indica si les vostres combinacions de color són accessibles per a persones amb deficiències de visió del color.
eo: Kontrolilo de kolorkontrasto, kiu diras al vi, ĉu viaj koloraj kombinaĵoj estas alireblaj por homoj kun kolorvidaj mankoj.
es: Un verificador de contraste de colores que le indica si sus combinaciones de colores son accesibles para personas con deficiencias en la visión de los colores.
fr: Un vérificateur de contraste des couleurs qui vous indique si vos combinaisons de couleurs sont accessibles aux personnes souffrant de déficience visuelle.
nl: Een controleprogramma op kleurcontrast die u vertelt of uw kleurcombinaties toegankelijk zijn voor mensen met kleurenblindheid.
pl: Program do sprawdzania kontrastu, który mówi czy połączenia barw są przystępne dla ludzi z trudnościami w widzeniu.
pt: Uma aplicação de verificação do contraste de cores que lhe indica se as suas combinações de cores são acessíveis para pessoas com deficiências na visão das cores.
sl: Preverjalnik barvnega kontrasta, ki vam pove, ali so vaše barvne kombinacije dostopne za osebe s pomanjkanjem barvnega vida.
sv: Ett kontrollverktyg för färgkontrast som talar om för dig om dina färgkombinationer är tillgängliga för personer med färgblindhet.
uk: Засіб для перевірки контрастності кольорів. Програма повідомить вам, чи є поєднання кольорів достатньо контрастним для людей із вадами розрізнення кольорів.

source: [KDE Apps page](https://apps.kde.org/kontrast)<br />[KDE Invent page](https://invent.kde.org/accessibility/kontrast)
ca: [Pàgina de KDE Apps](https://apps.kde.org/kontrast)<br />[Pàgina de KDE Invent](https://invent.kde.org/accessibility/kontrast)

source: An app to help you choose the license to go with your project.
ca: Una aplicació per a ajudar-vos a triar la llicència que s'adigui al vostre projecte.
eo: Apo por helpi vin elekti la permesilon por iri kun via projekto.
es: Una aplicación que le ayuda a escoger una licencia para su proyecto.
nl: Een toepassing om u te helpen bij het kiezen van de licentie die behoort bij uw project.
pt: Uma aplicação para o ajudar a escolher a licença com que o seu projecto será disponibilizado.
sl: Aplikacija, ki vam bo pomagala izbrati licenco za svoj projekt.
sv: Ett program för att hjälpa dig välja licens att använda med ditt projekt.
uk: Програма, яка допомагає вибрати умови ліцензування проєкту.
