Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) is visually similar to a FormTextDelegate, but it is clickable and shows an arrow pointing to the right. We used it in the [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) before.
eo: La [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) estas vide simila al FormTextDelegate, sed ĝi estas klakebla kaj montras sagon indikantan dekstren. Ni uzis ĝin en la [Kirigami Addons-enkonduko](/docs/getting-started/kirigami/addons-introduction) antaŭe.
es: El [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) es visualmente similar a un FormTextDelegate, aunque se puede hacer clic sobre él y muestra una flecha que apunta hacia la derecha. Ya lo hemos usado en la [introducción a los complementos de Kirigami](/docs/getting-started/kirigami/addons-introduction).
nl: De [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) is visueel gelijk aan een FormTextDelegate, maar er is op te klikken en toont een pijl wijzend naar rechts. We gebruikten het eerder in de [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction).
sl: [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) je vizualno podoben FormTextDelegate, a ga je mogoče klikniti in prikazuje puščico, ki kaže v desno. Uporabili smo ga v [Kirigami Addons introduction](/docs/getting-started/kirigami/addons-introduction) že prej.
sv: [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) liknar FormTextDelegate visuellt, men är klickbar och visar en pil som pekar åt höger. Vi använde den tidigare i [Kirigami Addons introduktion](/docs/getting-started/kirigami/addons-introduction).
uk: [FormButtonDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormButtonDelegate.html) візуально схожий на FormTextDelegate, але його можна натиснути, і на ньому показано стрілку, що вказує праворуч. Раніше ми використовували його у [вступі до додатків Kirigami](/docs/getting-started/kirigami/addons-introduction).

source: While the FormTextDelegate had the `leading` and `trailing` properties to show an item before and after the main content, the FormButtonDelegate only has the `leading` property, because the right side is occupied by the arrow.
eo: Dum la FormTextDelegate havis la "ĉefajn" kaj "malantaŭajn" ecojn por montri eron antaŭ kaj post la ĉefa enhavo, la FormButtonDelegate nur havas la "ĉefan" proprecon, ĉar la dekstra flanko estas okupata de la sago.
es: Mientras que FormTextDelegate tiene las propiedades `leading` y `trailing` para mostrar un elemento antes y después del contenido principal, FormButtonDelegate solo tiene la propiedad `leading`, ya que la parte derecha está ocupada por la flecha.
nl: Terwijl de FormTextDelegate de eigenschappen `leading` en `trailing` hadden om een item voor en na de hoofdinhoud te tonen, zo heeft de FormButtonDelegate slechts de eigenschap `leading`, omdat de rechterkant bezet is door de pijl.
sl: Medtem ko je imel FormTextDelegate lastnosti `leading` in `trailing` da pokaže element pred in za glavno vsebino, samo FormButtonDelegate ima lastnost `leading`, ker je desna stran zasedena s puščico.
sv: Medan FormTextDelegate har egenskaperna `leading` och `trailing` för att visa ett objekt före eller efter huvudinnehållet, har FormButtonDelegate bara egenskapen `leading`, eftersom den högra sidan är upptagen av pilen.
uk: У той час як FormTextDelegate мав властивості `leading` і `trailing` для показу елемента до та після основного вмісту, FormButtonDelegate має лише властивість `leading`, оскільки права сторона зайнята стрілкою.

source: We use its `icon.name` property to set a plus (+) icon to appear after the space where the `leading` would appear, and before the main content. This is a common pattern to indicate your button will add something to a list.
eo: Ni uzas ĝian proprecon `icon.name` por agordi pli (+) piktogramon por aperi post la spaco kie la `ĉefa` aperus, kaj antaŭ la ĉefa enhavo. Ĉi tio estas ofta ŝablono por indiki ke via butono aldonos ion al listo.
es: Hemos usado la propiedad `icon.name` para hacer que aparezca un icono con el signo más (+) después del espacio donde aparecería `leading` y delante del contenido principal. Esto es un patrón común para indicar que el botón añadirá algo a una lista.
nl: We gebruiken zijn eigenschap `icon.name` om een pluspictogram (+) te laten verschijnen na de ruimte waar de `leading` zou verschijnen en voor de hoofdinhoud. Dit is een algemeen patroon om aan te geven dat uw knop iets aan een lijst wil toevoegen.
sl: Uporabljamo njegovo lastnost `icon.name`, da nastavimo ikono plus (+), ki se prikaže za prostorom, kjer bi se pojavil `leading`, in pred glavno vsebino. To je običajen vzorec, ki označuje vaš gumb, ki bo nekaj dodal na seznam.
sv: Vi använder dess egenskap `icon.name` för att ange en plusikon (+) som ska visas efter utrymmet där `leading` skulle visas, och före huvudinnehållet. Det är ett vanligt mönster för att indikera att knappen lägger till något i en lista.
uk: Ми використовуємо його властивість `icon.name`, щоб установити піктограму плюса (+), яка з'являється після місця, де з'являтиметься `leading`, і перед основним вмістом. Це загальний шаблон, який вказує, що ваша кнопка додасть щось до списку.

source: The RadioButton, CheckBox and Switch are very commonly used components in any user interface. Kirigami Addons provides them as [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) and [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
eo: La RadioButton, CheckBox kaj Ŝaltilo estas tre ofte uzataj komponantoj en iu ajn uzantinterfaco. Kirigami Addons provizas ilin kiel [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami- addons/html/classFormCheckDelegate.html) kaj [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
es: Los botones de opción, las casillas de verificación y los interruptores son componentes que se usan con mucha frecuencia en cualquier interfaz de usuario. Los complementos de Kirigami los proporcionan como [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) y [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
nl: De RadioButton, CheckBox en Switch zijn erg gebruikelijke componenten in elke gebruikersinterface. Kirigami Addons levert ze als [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) en [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
sl: RadioButton, CheckBox in Switch so zelo pogosto uporabljene komponente vpoljubnem uporabniškem vmesniku. Kirigami Addons jih ponuja kot [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) in [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
sv: RadioButton, CheckBox och Switch är mycket vanliga komponenter i alla användargränssnitt. Kirigami Addons tillhandahåller dem som [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) och [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).
uk: RadioButton, CheckBox і Switch є дуже поширеними компонентами для будь-якого інтерфейсу користувача. Додатки Kirigami надають їх як [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html), [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) і [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html).

source: We want to create some autosave functionality in our application, and we want to only show its settings if the user has enabled this functionality. Create a new section using a [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) and a [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html), then add a [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) and a [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
eo: Ni volas krei iun aŭtomatan konservadon en nia aplikaĵo, kaj ni volas nur montri ĝiajn agordojn se la uzanto ebligis ĉi tiun funkcion. Kreu novan sekcion uzante [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) kaj [FormHeader](https://api.kde.org/frameworks/ kirigami-addons/html/classFormHeader.html), tiam aldonu [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) kaj [FormRadioDelegate](https:// api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
es: Queremos dotar de cierta funcionalidad para guardar automáticamente a nuestra aplicación, y solo queremos mostrar sus preferencias si el usuario ha activado dicha funcionalidad. Creamos una nueva sección usando una [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) y una [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html), a la que añadiremos un [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) y un [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
nl: We willen enige auto-opslag functionaliteit in uw toepassing aanmaken en we willen alleen zijn instellingen tonen als de gebruiker deze functionaliteit heeft ingeschakeld. Maak een nieuwe sectie aan met een [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) en een [FormHeader](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html), voeg daarna een [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) toe en een [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
sl: V naši aplikaciji želimo ustvariti nekaj funkcij samodejnega shranjevanja in želimo prikazati svoje nastavitve le, če je uporabnik omogočil to funkcijo. Ustvarite nov razdelek z [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) in [Glava obrazca](https://api.kde.org/frameworks/kirigami-addons/html/classFormHeader.html), nato dodajte[FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) in [FormRadioDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
sv: Vi vill skapa en del funktioner för att spara automatiskt i vårt program, och vi vill bara visa dess inställningar om användaren har aktiverat funktionaliteten. Skapa en ny sektion med ett [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) och en [FormHeader](https://api.kde.org/frameworks/ kirigami-addons/html/classFormHeader.html), lägg sedan till en [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) och en [FormRadioDelegate](https:// api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).
uk: Ми хочемо створити деякі функції автозбереження у нашій програмі, і ми хочемо показувати її налаштування, лише якщо користувач увімкнув цю функцію. Створіть новий розділ за допомогою [FormCard](https://api.kde.org/frameworks/kirigami-addons/html/classFormCard.html) і [FormHeader](https://api.kde.org/frameworks/ kirigami-addons/html/classFormHeader.html), потім додайте [FormSwitchDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormSwitchDelegate.html) і [FormRadioDelegate](https:// api.kde.org/frameworks/kirigami-addons/html/classFormRadioDelegate.html).

source: If you have some programming background in imperative languages such as C++, you might be tempted to set the `checked` property of the switch to turn the visibility of the radio buttons to `true` with a JavaScript assignment such as:
eo: Se vi havas iom da programado en nepraj lingvoj kiel ekzemple C++, vi povus esti tentata agordi la `markita' proprecon de la ŝaltilo por turni la videblecon de la radiobutonoj al `vera` kun JavaScript-tasko kiel ekzemple:
es: Si tiene experiencia en programación con lenguajes imperativos, como C++, es posible que tenga la tentación de definir la propiedad `checked` del interruptor para cambiar la visibilidad de los botones de opción a `true` con una asignación de JavaScript, como:
nl: Als u enige achtergrond hebt in programmeren in imperatieve talen zoals C++, dan zou u verleid kunnen worden om de eigenschap `geactiveerd` aan de schakelaar te hangen om de zichtbaarheid van het keuzerondje op `true` te zetten met een JavaScript toekenning zoals:
sl: Če imate nekaj programskega znanja v jezikih, kot je C++, vas bo morda zamikalo, da nastavite lastnost `checked` stikala, da obrnete vidnost izbirnih gumbov na `true` z dodelitvijo JavaScript, npr. kot:
sv: Om du har viss programmeringsbakgrund med imperativa språk som C++, kan du bli frestad att använda omkopplarens egenskap `checked` för att ändra synlighet för alternativknapparna till "true" med en tilldelning i JavaScript som:
uk: Якщо ви маєте досвід програмування в імперативних мовах, таких як C++, у вас може виникнути спокуса встановити властивість `checked` перемикача, щоб змінити видимість пунктів варіантів на `true` за допомогою призначення JavaScript, наприклад:

source: To test our checkbox, we can add a new [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) to our General section.
eo: Por testi nian markobutonon, ni povas aldoni novan [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) al nia Ĝenerala sekcio.
es: Para probar nuestra casilla de verificación, podemos añadir un nuevo [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) a nuestra sección «General».
nl: Om ons keuzevakje te testen kunnen we een nieuwe [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) toevoegen aan onze sectie Algemeen.
sl: Če želite preizkusiti naše potrditveno polje, lahko dodamo nov [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) v naš Splošni del.
sv: För att prova vår kryssruta, kan vi lägga till en ny [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) i sektionen General.
uk: Щоб перевірити наш пункт варіанта, ми можемо додати новий [FormCheckDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormCheckDelegate.html) до нашого розділу «Загальне».

source: Here we use the `onToggled` [signal handler](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) to show some dummy text to simulate a tray icon appearing in the system. If you really wanted to, you could easily implement a tray icon using [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
eo: Ĉi tie ni uzas la `onToggled' [signaltraktilo](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) por montri iun ŝajnan tekston por simuli pletan piktogramon aperantan en la sistemo. Se vi vere volis, vi povus facile efektivigi pletan piktogramon uzante [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
es: Aquí usamos el [manejador de señal](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) `onToggled` para mostrar un texto de relleno para simular un icono de la bandeja del sistema que aparece en el sistema. Si realmente lo necesita, podría implementar fácilmente un icono de la bandeja del sistema usando [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
nl: Hier gebruiken we de `niet-omgeschakeld` [signaalbehandelaar](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) om enige dummy tekst te tonen om een pictogram in het systeemvak te simuleren die in het systeem verschijnt. Als u dat echt wilt, zou u gemakkelijk een pictogram in het systeemvak kunnen implementeren met [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
sl: Tukaj uporabljamo `onToggled` [obravnavalnik signalov](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) za prikaz navideznega besedila za simulacijo ikone v pladnju, ki se pojavlja v sistemu. Če bi res želeli, bi to zlahka uresničili kot ikono pladnja z [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
sv: Här använder vi [signalhanteraren](https://doc.qt.io/qt-6/qtqml-syntax-signals.html) `onToggled` för att visa lite text som platsmarkering för att simulera att en brickikon visas i systemet. Om du verkligen vill, skulle du enkelt kunna implementera en brickikon med användning av [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).
uk: Тут ми використовуємо `onToggled` [обробник сигналів](https://doc.qt.io/qt-6/qtqml-syntax-signals.html), щоб показати деякий фіктивний текст для імітації піктограми у лотку, що з'являється у системі. Якщо ви справді захочете, ви можете легко додати піктограму у лотку за допомогою [SystemTrayIcon](https://doc.qt.io/qt-6/qml-qt-labs-platform-systemtrayicon.html).

source: The common ComboBox component can be created using a [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
eo: La komuna ComboBox-komponento povas esti kreita per [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
es: El componente común ComboBox se puede crear usando un [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
nl: De algemene component keuzelijst kan aangemaakt worden met een [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
sl: Skupno komponento ComboBox lahko ustvarite z [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
sv: Den vanliga komponenten ComboBox kan skapas med hjälp av en [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).
uk: Типовий компонент ComboBox можна створити за допомогою [FormComboBoxDelegate](https://api.kde.org/frameworks/kirigami-addons/html/classFormComboBoxDelegate.html).

source: This combobox has several useful properties we can make use of: `editable`, `displayText` and `displayMode`.
eo: Ĉi tiu kombokesto havas plurajn utilajn ecojn, kiujn ni povas uzi: `redaktebla`, `displayText` kaj `displayMode`.
es: Esta lista desplegable tiene varias propiedades útiles que podemos usar: `editable`, `displayText` y `displayMode`.
nl: Deze keuzelijst heeft verschillende nuttige eigenschappen waar we gebruik van kunnen maken: `editable`, `displayText` en `displayMode`.
sl: To kombinirano polje ima več uporabnih lastnosti, ki jih lahko uporabimo: `editable`, `displayText` in `displayMode`.
sv: Kombinationsrutan har flera användbara egenskaper som vi kan använda: `editable`, `displayText` och `displayMode`.
uk: Цей спадний список має декілька корисних властивостей, якими ми можемо скористатися: `editable`, `displayText` and `displayMode`.

source: And the most interesting one, which we will be using in our example, is `displayMode`. It can have three options:
eo: Kaj la plej interesa, kiun ni uzos en nia ekzemplo, estas `displayMode`. Ĝi povas havi tri eblojn:
es: Y la más interesante, que usaremos en nuestro ejemplo, es `displayMode`. Puede tener tres opciones:
nl: En de meest interessante, die we zullen gaan gebruiken in ons voorbeeld, is `displayMode`. Het kan drie opties hebben:
sl: In najbolj zanimiva, ki jo bomo uporabili v našem primeru, je`displayMode`. Ima lahko tri možnosti:
sv: Och det mest intressanta, som vi kommer att använda i vårt exempel, är `displayMode`. Det kan ha tre alternativ:
uk: І найцікавішим, який ми будемо використовувати в нашому прикладі, є `displayMode`. Він може мати три варіанти:

source: **FormComboBoxDelegate.Dialog**: a dialog showing a list of options in the middle of the window, like a [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
eo: **FormComboBoxDelegate.Dialog**: dialogo montranta liston de elektebloj en la mezo de la fenestro, kiel [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
es: **FormComboBoxDelegate.Dialog**: un diálogo que muestra una lista de opciones en el centro de la ventana, como una [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
nl: **FormComboBoxDelegate.Dialog**: een dialoog die een lijst met opties in het midden van het venster toont, zoals [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
sl: **FormComboBoxDelegate.Dialog**: pogovorno okno, ki prikazuje seznam možnosti v na sredini okna, kot [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
sv: **FormComboBoxDelegate.Dialog**: En dialogruta som visar en lista med alternativ i mitten av fönstret, som ett [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).
uk: **FormComboBoxDelegate.Dialog**: діалогове вікно, у якому буде показано список пунктів посередині вікна, подібне до [Kirigami.OverlaySheet](docs:kirigami2;OverlaySheet).

source: Our Settings page is taking shape, but each section is starting to get long. We can add a few FormDelegateSeparators to make our page tidier:
eo: Nia Agorda paĝo formiĝas, sed ĉiu sekcio komencas longiĝi. Ni povas aldoni kelkajn FormDelegateSeparators por igi nian paĝon pli ordigita:
es: Nuestra página de «Preferencias» va tomando forma, aunque cada sección está empezando a ser demasiado larga. Podemos añadir unos cuantos FormDelegateSeparators para que la página quede más clara:
nl: Onze pagina Instellingen krijgt vorm, maar elke sectie begint lang te worden. We kunnen een paar FormDelegateSeparators toevoegen om onze pagina netter te maken:
sl: Naša stran z nastavitvami dobiva obliko, vendar vsak razdelek postaja daljši. Dodamo lahko nekaj FormDelegateSeparators, da bo naša stran bolj urejena:
sv: Vår inställningssida tar form, men varje sektion börjar bli lång. Vi kan lägga till några FormDelegateSeparators för att göra vår sida snyggare:
uk: Наша сторінка налаштувань набуває форми, але її розділи стають надто довгими. Ми можемо додати кілька FormDelegateSeparators, щоб зробити нашу сторінку більш охайною:
