Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Here is an example showcasing how color sets are inherited and can be used to distinguish different components. A large border has been added to contrast colors.
ca: Aquest és un exemple que mostra com s'hereten els conjunts de colors i es poden utilitzar per a distingir components diferents. S'ha afegit una vora gran als colors de contrast.
eo: Jen ekzemplo montranta kiel koloraroj estas hereditaj kaj povas esti uzataj por distingi malsamajn komponentojn. Granda bordo estis aldonita por kontrasti kolorojn.
nl: Hier is een voorbeeld dat presenteert hoe kleurensets geërfd worden en gebruikt kunnen worden om verschillende componenten te onderscheiden. Een grote rand is toegevoegd om kleuren te laten contrasteren.
pt: Aqui está um exemplo que demonstra como são herdados os conjuntos de cores e como podem ser usados para distinguir entre os diferentes componentes. Foi adicionado um contorno grande às cores em contraste.
sl: Tu je primer, ki prikazuje, kako se podedujejo nabori barv in jih je mogoče uporabiti za razlikovanje različnih komponent. Dodana je velika obroba za kontrast barvam.
sv: Här är ett exempel som visar hur färguppsättningar ärvs och kan användas för att särskilja olika komponenter. En stor kant har lagts till för att kontrastera färger.
uk: Тут наведено приклад, у якому продемонстровано те, як успадковуються набори кольорів та як ними можна скористатися для виокремлення різних компонентів. Для додавання контрастності кольорам було використано широку рамку.

source: How color sets differ in Breeze
ca: Com els conjunts de colors difereixen en el Brisa
eo: Kiel koloraroj diferencas en Breeze
es: Cómo se diferencian los conjuntos de colores en «Brisa»
nl: Hoe kleurensets in Breeze verschillen
pt: Como diferem os conjuntos de cores no Brisa
sl: Kako se nabori barv razlikujejo v Sapici/Breeze
sv: Hur färguppsättningar skiljer sig i Breeze
uk: Як відрізняються набори кольорів у Breeze

source: How color sets differ in Breeze Dark
ca: Com els conjunts de colors difereixen en el Brisa fosc
eo: Kiel koloraroj diferencas en Breeze Dark
es: Cómo se diferencian los conjuntos de colores en «Brisa oscuro»
nl: Hoe kleurensets in Breeze Dark verschillen
pt: Como diferem os conjuntos de cores no Brisa Escuro
sl: Kako se nabori barv razlikujejo v Temni sapici/Breeze Dark
sv: Hur färguppsättningar skiljer sig i Breeze mörk
uk: Як відрізняються набори кольорів у темній Breeze

source: Using Custom Colors
ca: Utilitzar colors personalitzats
eo: Uzante Proprajn Kolorojn
es: Uso de colores personalizados
fr: Utilisation de couleurs personnalisées
nl: Aangepaste kleuren gebruiken
pl: Używanie własnych barw
pt: Usar Cores Personalizadas
sl: Uporaba barv po meri
sv: Använda egna färger
uk: Використання нетипових кольорів

source: Although it's discouraged to use hardcoded colors, Kirigami offers a more maintainable way to assign a custom hardcoded palette to an item and all its children, which allows to define such custom colors in one place and one only:
ca: Tot i que es desaconsella utilitzar colors codificats, el Kirigami ofereix una forma més fàcil de mantenir per a assignar una paleta codificada personalitzada a un element i a tots els seus fills, el qual permetrà definir aquests colors personalitzats en un lloc i només en un:
eo: Kvankam estas malkuraĝigite uzi malmolkoditajn kolorojn, Kirigami ofertas pli konserveblan manieron asigni propran malmolkoditan paletron al objekto kaj ĉiuj ĝiaj infanoj, kio permesas difini tiajn proprajn kolorojn en unu loko kaj unu nur:
es: Aunque no se recomienda usar colores codificados, Kirigami ofrece un modo más fácil de mantener para asignar una paleta personalizada codificada a un elemento y a todos sus hijos, que permite definir dichos colores personalizados en un único lugar:
nl: Hoewel het ontmoedigd wordt om hard gecodeerde kleuren te gebruiken, biedt Kirigami een meer te onderhouden manier om een aangepaste hard gecodeerd palet aan een item en al zijn kinderen toe te kennen, dat biedt het definiëren van zulke aangepaste kleuren op alleen één plaats:
pt: Ainda que seja desencorajado o uso de cores fixas, o Kirigami oferece uma forma mais fácil de manter uma paleta de cores personalizadas fixas para um item e todos os seus filhos, a qual permitirá definir essas cores personalizadas em apenas um sítio:
sl: Čeprav odsvetujemo uporabo trdo določenih barv, ponuja Kirigami način za lažje vzdrževanje za dodeljevanje v kodi določene palete po meri elementu in vsem njegovim podrejenim, kar omogoča, da opredelite takšne barve po meri na enem samem mestu:
sv: Även om användning av hårdkodade färger avråds från, erbjuder Kirigami ett mer underhållsbart sätt att tilldela en egen hårdkodad palett till ett objekt och alla dess underliggande objekt, som gör det möjligt att definiera sådana egna färger på ett ställe och bara en gång:
uk: Хоча не рекомендовано використовувати жорстко прописані кольори, у Kirigami передбачено зручніший у сенсі супроводу спосіб призначення нетипової жорстко прописаної палітри для запису і усіх його дочірніх записів. Цей спосіб надає змогу визначити такі нетипові кольори одноразово і у єдиному місці коду:

source: NOTE: regardless of the color set used, it is recommended to replace all available colors in Theme, to avoid badly contrasting colors
ca: NOTA: Independentment del conjunt de colors utilitzat, es recomana substituir tots els colors disponibles al tema, per a evitar un contrast dolent dels colors
eo: RIMARKO: sendepende de la koloraro uzita, estas rekomendite antatataŭigi ĉiujn disponeblajn kolorojn en Etoso por eviti malbone kontrastantajn kolorojn
nl: Opmerking: onafhankelijk van welke kleurenset wordt gebruikt, wordt aanbevolen om alle beschikbare kleuren van het thema te vervangen, om slechte combinaties van kleuren te vermijden
sl: OPOMBA: ne glede na uporabljeni barvni nabor je priporočljivo zamenjati vse razpoložljive barve v temi, da se izognete slabo kontrastnim barvam
sv: Observera: Oavsett vilken färguppsättning som används rekommenderas att ersätta alla tillgängliga färger i Theme, för att undvika färger med dåligt kontrast
uk: ЗАУВАЖЕННЯ: незалежно від використаного набору кольорів, рекомендуємо замінити усі доступні кольори у Theme, щоб уникнути помилок із контрастністю кольорів

source: Redefine all the other colors you want
ca: Redefiniu tots els altres colors que vulguis
eo: Redifini ĉiujn aliajn kolorojn kiejn vi volas
nl: Definieer alle andere door u gewenste kleuren
sl: Ponovno določite vse druge barve, ki jih želite
sv: Definiera om alla andra färger du vill
uk: Перевизначення усіх інших потрібних кольорів

source: This will be "#b9d795"
ca: Aquest serà «#b9d795»
eo: Tio ĉi estos "#b9d795"
es: Esto será "#b9d795"
nl: Dits zal "#b9d795" zijn
sl: To bo "#b9d795"
sv: Det är "#b9d795"
uk: Це буде "#b9d795"

source: This will be "#465c2b"
ca: Aquest serà «#465c2b»
eo: Tio ĉi estos "#465c2b"
es: Esto será "#465c2b"
nl: Dit zal "#465c2b" zijn
sl: To bo "#465c2b"
sv: Det är "#465c2b"
uk: Це буде "#465c2b"

source: Example with custom colors
ca: Exemple amb colors personalitzats
eo: Ekzemplo kun propraj koloroj
es: Ejemplo con colores personalizados
nl: Voorbeeld met eigen/aangepaste kleuren
pt: Exemplo com cores personalizadas
sl: Primer z barvami po meri
sv: Exempel med egna färger
uk: Приклад із нетиповими кольорами

source: Typography
ca: Tipografia
eo: Tipografio
es: Tipografía
fr: Typographies
nl: Typografie
pl: Typografia
pt: Tipografia
sl: Tipografija
sv: Typografi
uk: Типографія

source: For demonstrative purposes, this tutorial uses an AbstractCard to make the text examples clearer. A better way to achieve the same results would be to use a [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction).
ca: Per motius demostratius, aquesta guia d'aprenentatge utilitza una AbstractCard per a fer més clars els exemples de text. Una manera millor d'aconseguir els mateixos resultats seria utilitzar un [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction).
eo: Por pruvaj celoj, ĉi tiu lernilo uzas AbstractCard por pliklarigi la tekstajn ekzemplojn. Pli bona maniero atingi la samajn rezultojn estus uzi [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction).
nl: Als demonstratie, gebruiken we in deze instructie een AbstractCard om de tekst duidelijker te maken. Een betere manier om hetzelfde resultaat te krijgen is om een [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction) te gebruiken.
sl: V predstavitvene namene ta učbenik uporablja kartico AbstractCard, da so primeri besedila jasnejši. Boljši način za doseganje enakih rezultatov bi bila uporaba [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction).
sv: I demonstrationssyfte använder handledningen AbstractCard för att göra textexemplen tydligare. Ett bättre sätt att uppnå samma resultat skulle vara att använda [Kirigami Addons FormCard](/docs/getting-started/kirigami/addons-introduction).
uk: З метою демонстрації, у цьому підручнику використано AbstractCard для спрощення текстових прикладів. Кращим способом досягти тих самих результатів було б використання [FormCard з додатків Kirigami](/docs/getting-started/kirigami/addons-introduction).

source: Headings
ca: Capçaleres
eo: Titoloj
es: Encabezados
fr: En-têtes
nl: Hoofdstuktitels
pl: Nagłówki
pt: Cabeçalhos
sl: Naslovi
sv: Rubriker
uk: Заголовки

source: Kirigami provides a [Heading](docs:kirigami;org.kde.kirigami.Heading) that can be used for page or section titles.
ca: El Kirigami proporciona un [Heading](docs:kirigami;org.kde.kirigami.Heading) que es pot utilitzar per a títols de pàgines o de seccions.

source: Five headings with different levels for size comparison
ca: Cinc encapçalaments amb nivells diferents per a comparar la mida
eo: Kvin rubrikoj kun malsamaj niveloj por grandeco komparo
es: Cinco cabeceras con distintos niveles para comparar sus tamaños
nl: Vijf koppen met verschillende niveaus voor vergelijken van grootte
pt: Cinco cabeçalhos com diferentes níveis, para fins de comparação dos tamanhos
sl: Pet glav naslovov z različnimi nivoji za primerjavo velikosti
sv: Fem rubriker med olika nivåer för storleksjämförelse
uk: П'ять заголовків із різними рівнями для порівняння розмірів

source: Labels
ca: Etiquetes
eo: Etikedoj
es: Etiquetas
fr: Étiquettes
pl: Etykiety
pt: Legendas
sl: Oznake
sv: Beteckningar
uk: Мітки

source: Text elements should use the [Label](docs:qtquickcontrols;QtQuick.Controls.Label) component from QtQuick Controls 2.
ca: Els elements de text hauran d'emprar l'element [Label](docs:qtquickcontrols;QtQuick.Controls.Label) de QtQuick Controls 2.
eo: Tekstaj elementoj devus uzi la komponanton [Label](docs:qtquickcontrols;QtQuick.Controls.Label) de QtQuick Controls 2.
es: Los elementos de texto deben usar el componente [Label](docs:qtquickcontrols;QtQuick.Controls.Label) de los controles de QtQuick 2.
nl: Tekstelementen zouden de component [Label](docs:qtquickcontrols;QtQuick.Controls.Label) uit QtQuick Controls 2 moeten gebruiken.
pt: Os elementos de texto deverão usar o elemento [Label](docs:qtquickcontrols;QtQuick.Controls.Label) do QtQuick Controls 2.
sl: Besedilni elementi naj bi uporabili element oznake [Label](docs:qtquickcontrols;QtQuick.Controls.Label) iz QtQuick Controls 2.
sv: Textelement ska använda komponenten [Label](docs:qtquickcontrols;QtQuick.Controls.Label) från QtQuick Controls 2.
uk: Текстові елементи мають використовувати компонент [Label](docs:qtquickcontrols;QtQuick.Controls.Label) з QtQuick Controls 2.

source: Text Alignment
ca: Alineació del text
eo: Teksta vicigo
es: Alineación del texto
fr: Alignement de texte
nl: Uitlijning tekst
pl: Wyrównanie tekstu
pt: Alinhamento do Texto
sl: Poravnava besedila
sv: Textjustering
uk: Вирівнювання тексту

source: You can align your text elements using the [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) and [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop) properties.
ca: Podeu alinear els elements de text utilitzant les propietats [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) i [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
eo: Vi povas vicigi viajn tekstajn elementojn per la [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) kaj [verticalAlignment](https://doc.qt .io/qt-6/qml-qtquick-text.html#verticalAlignment-prop) propraĵoj.
es: Puede alinear elementos de texto usando las propiedades [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) y [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
nl: U kunt uw tekstelementen uitlijnen met de eigenschappen [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) en [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
pt: Poderá alinhar os seus elementos de texto com as propriedades [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) e [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
sl: Vaše besedilne elemente lahko poravnate z uporabo lastnosti [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) in [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
sv: Du kan justera textelement genom att använda egenskaperna [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) och [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).
uk: Ви можете вирівняти текстові елементи за допомогою властивостей [horizontalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#horizontalAlignment-prop) і [verticalAlignment](https://doc.qt.io/qt-6/qml-qtquick-text.html#verticalAlignment-prop).

source: Heading and lorem ipsum text aligned to the horizontal center
ca: Capçalera i text lorem ipsum alineat al centre horitzontal
eo: Titolo kaj lorem ipsum teksto vicigitaj al la horizontala centro
es: Cabecera y el texto «lorem ipsum» centrado horizontalmente
nl: Kop en tekst lorem ipsum uitgelijnd naar het horizontale centrum
pt: Cabeçalho e texto 'lorem ipsum' alinhado horizontalmente ao centro
sl: Glava naslova in besedilo lorem ipsum poravnani na vodoravno sredino
sv: Sidhuvud- och lorem ipsum-text justerad till horisontellt centrum
uk: Заголовок і текст lorem ipsum вирівняно горизонтально за центром

source: Heading and lorem ipsum text using right-aligned text
ca: Capçalera i text lorem ipsum usant text alineat a la dreta
eo: Titolo kaj lorem ipsum teksto uzante dekstre vicigitan tekston
es: Cabecera y el texto «lorem ipsum» alineado a la derecha
nl: Kop en tekst lorem ipsum met de tekst rechts uitgelijnd
pt: Cabeçalho e texto 'lorem ipsum' alinhado à direita
sl: Glava naslova in besedilo lorem ipsum desno poravnani
sv: Sidhuvud- och lorem ipsum-text som använder högerjusterad text
uk: Заголовок і текст lorem ipsum з використанням вирівняного праворуч тексту

source: Heading with bottom vertical alignment and lorem ipsum text with top vertical alignment
ca: Capçalera amb alineació vertical inferior i text lorem ipsum amb alineació vertical superior
eo: Titolo kun malsupra vertikala paraleligo kaj lorem ipsum teksto kun supra vertikala paraleligo
es: Cabecera con alineación vertical a la parte inferior y el texto «lorem ipsum» con alineación vertical a la parte superior
nl: Kop met verticale uitlijning onderaan en tekst lorem ipsum met verticale uitlijning bovenaan
pt: Cabeçalho com alinhamento vertical ao fundo e texto 'lorem ipsum' com alinhamento vertical ao topo
sl: Naslov z navpično poravnavo na dnu in besedilom lorem ipsum z navpično poravnavo na vrhu
sv: Sidhuvud med vertikal justering längst ner och lorem ipsum-text vertikal justering längst upp
uk: Заголовок із вертикальним вирівнюванням вниз і текстом lorem ipsum із вертикальним вирівнюванням вгору

source: Heading with top vertical alignment and lorem ipsum text with bottom vertical alignment
ca: Capçalera amb alineació vertical superior i text lorem ipsum amb alineació vertical inferior
eo: Titolo kun supra vertikala paraleligo kaj lorem ipsum teksto kun malsupra vertikala paraleligo
es: Cabecera con alineación vertical a la parte superior y el texto «lorem ipsum» con alineación vertical a la parte inferior
nl: Kop met verticale uitlijning bovenaan en tekst lorem ipsum met verticale uitlijning onderaan
pt: Cabeçalho com alinhamento vertical ao topo e texto 'lorem ipsum' com alinhamento vertical ao fundo
sl: Naslov z navpično poravnavo zgoraj in besedilom lorem ipsum z navpično poravnavo na dnu
sv: Sidhuvud med vertikal justering längst top och lorem ipsum-text vertikal justering längst ner
uk: Заголовок із вертикальним вирівнюванням вгору і текстом lorem ipsum із вертикальним вирівнюванням вниз

source: Rich Text
ca: Text enriquit
eo: Riĉa Teksto
es: Texto enriquecido
fr: Texte enrichi
nl: Opgemaakte tekst
pl: Formatowany tekst
pt: Texto Formatado
sl: Obogateno besedilo
uk: Форматований текст

source: QML allows you to display (and edit) rich text. The behavior can be controlled via the [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop) property.
ca: El QML permet mostrar (i editar) el text enriquit. El comportament es pot controlar mitjançant la propietat [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
eo: QML permesas al vi montri (kaj redakti) riĉan tekston. La konduto povas esti regita per la propreco [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
es: QML permite mostrar (y editar) texto enriquecido. El comportamiento se puede controlar usando la propiedad [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
nl: QML biedt u het tonen (en bewerken) van opgemaakte tekst. Het gedrag kan bestuurd worden via de eigenschap [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
pt: O QML permite-lhe apresentar (e editar) texto formatado. O comportamento poderá ser controlado através da propriedade [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
sl: QML omogoča prikaz (in urejanje) obogatenega besedila. Vedenje je mogoče nadzorovati prek lastnosti [textFormat](https://doc.qt.io/qt-5/qml-qtquick-text.html#textFormat-prop).
sv: QML låter dig visa (och redigera) rich text. Beteendet kan styras via egenskapen [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).
uk: У QML передбачено можливість показу (і редагування) форматованого тексту. Поведінкою засобу форматування можна керувати за допомогою властивості [textFormat](https://doc.qt.io/qt-6/qml-qtquick-text.html#textFormat-prop).

source: A Label containing a list of fruits using HTML tags like paragraph, unordered lists and bold fonts
ca: Una etiqueta que conté una llista de fruites que utilitzen etiquetes HTML com ara paràgraf, llistes desordenades i lletra en negreta
eo: Etikedo enhavanta liston de fruktoj uzante HTML-etikedojn kiel alineo, neordigitaj listoj kaj grasaj tiparoj
es: Una Label que contiene una lista de frutas que usan etiquetas HTML, como párrafo, lista desordenada y textos en negrita
nl: Een label met een lijst met fruit gebruikmakend van HTML tags zoals paragraaf, ongeordende lijsten en vette lettertypen
pt: Uma Label que contém uma lista de frutas, usando marcas de HTML como os parágrafos, listas não ordenadas e tipos de letra a negrito
sl: Oznaka, ki vsebuje seznam sadja z uporabo oznak HTML, kot so odstavek, neurejeni seznami in krepke pisave
sv: En beteckning som innehåller en lista över frukter som använder HTML-taggar som stycken, oordnade listor och teckensnitt med fetstil
uk: Мітка, що містить список фруктів із використанням теґів HTML, зокрема теґів абзаців, неупорядкованих списків та напівжирних шрифтів

source: The font size of the [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) is available as `Kirigami.Theme.defaultFont.pointSize` in your application.
ca: La mida de la lletra del [Kirigami.Theme](https://api.kde.org/qml-org-kde-kirigami-platform-theme.html) està disponible en la vostra aplicació com una `Kirigami.Theme.defaultFont.pointSize`.

source: Kirigami
eo: Kirigamio

source: Components
eo: Komponentoj
es: Componentes
fr: Composants
nl: Componenten
pl: Składniki
pt: Componentes
sl: Komponente
sv: Komponenter
uk: Компоненти

source: While you will use QML to create the visual part of your application, the business logic—the code that does the heavy lifting for your application's functionality—is usually created in C++ for performance reasons. We will also explore how to integrate our business logic with our UI in the tutorials below.
eo: Dum vi uzos QML por krei la vidan parton de via aplikaĵo, la komerca logiko—la kodo, kiu faras la pezan ŝarĝon por la funkcieco de via aplikaĵo— estas kutime kreita en C++ pro rendimentaj kialoj. Ni ankaŭ esploros kiel integri nian komercan logikon kun nia UI en la ĉi-subaj lerniloj.
nl: Terwijl u QML zal gebruiken om het visuele deel van uw toepassing te maken, wordt voor de zakelijke logica - de code die het zware werk doet voor de functionaliteit van uw toepassing - gewoonlijk aangemaakt in C++ voor redenen van prestaties. We zullen ook nagaan hoe uw zakelijke logica integreert met uw UI in de onderstaande inleidingen.
pt: Embora irá usar o QML para criar a componente visual da sua aplicação, a lógica de negócio, ou seja, o código que faz o trabalho pesado da funcionalidade da sua aplicação, normalmente é desenvolvido em C++ por questões de performance. Iremos também explorar como integrar a nossa lógica de negócio com a nossa interface nos tutoriais abaixo.
sv: Även om QML används för att skapa den visuella delen av programmet, skapas oftast uppgiftslogiken (koden som utför själva arbetet i programmets funktion) i C++ av prestandaskäl. Vi utforskar också hur vår uppgiftslogik integreras med vårt användargränssnitt i handledningen nedan.
uk: Одночасно із використанням QML для створення візуальної частини програми, робочу логіку — код, який надаватиме вашій програмі функціональних можливостей — зазвичай, пишуть на C++ з міркувань швидкодії. У наведених нижче розділах підручника ми також вивчимо питання інтеграції робочої логіки із інтерфейсом користувача.
