Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [Installing Kirigami from the repositories in your Linux distribution](#linux)
ca: [Instal·lar el Kirigami a partir dels repositoris de la vostra distribució Linux](#linux)
eo: [Instalante Kirigami el la deponejoj en via Linuksa distribuo](#linux)
es: [Instalación de Kirigami desde los repositorios de su distribución Linux](#linux)
nl: [Kirigami installeren uit de opslagruimte in uw Linux distributie](#linux)
sl: [Namestitev Kirigamija iz skladišč v vaši distribuciji Linuxa](#linux)
sv: [Installera Kirigami från arkiven i Linux-distribution](#linux)
uk: [Встановлення Kirigami зі сховищ пакунків у вашому дистрибутиві Linux](#linux)

source: [Using kde-builder](#kde-builder)
ca: [Utilitzar el «kde-builder»](#kde-builder)
eo: [Konstruante Kirigami per kde-builder](#kde-builder)
es: [Uso de kde-builder](#kde-builder)
sl: [Uporaba kde-builder](#kde-builder)
uk: [Користування kde-builder](#kde-builder)

source: [Installing Kirigami with Craft](#craft)
ca: [Instal·lar el Kirigami amb el Craft](#craft)
eo: [Instalante Kirigami kun Craft](#craft)
es: [Instalación de Kirigami con Craft](#craft)
nl: [Kirigami installeren met Craft](#craft)
sl: [Namestitev Kirigami s programom Craft](#craft)
sv: [Installera Kirigami med Craft](#craft)
uk: [Встановлення Kirigami за допомогою Craft](#craft)

source: If you are on a [sufficiently up-to-date distribution](docs/getting-started/building#choosing) such as Debian Testing, latest non-LTS Ubuntu, Fedora, openSUSE Tumbleweed, or Arch, you may [install Kirigami from your distribution](#linux).
ca: Si feu servir una [distribució prou actualitzada](docs/getting-started/building#choosing) com la Debian Testing, l'última Ubuntu no LTS Ubuntu, Fedora, openSUSE Tumbleweed o Arch, podreu [instal·lar el Kirigami a partir de la distribució](#linux).
sl: Če uporabljate [dovolj posodobljeno distribucijo](docs/getting-started/building#choosing), kot je Debian Testing, najnovejši Ubuntu, ki ni LTS, Fedora, openSUSE Tumbleweed ali Arch, lahko [namestite Kirigami iz vaše distribucije](#linux).

source: If you are on a [not up-to-date distribution](docs/getting-started/building#choosing) such as Debian Stable or LTS Ubuntu, you should use [kde-builder](#kde-builder) for this tutorial. It should use at most 2 GB of storage.
ca: Si feu servir una [distribució no tan al dia](docs/getting-started/building#choosing) com la Debian Stable o la Ubuntu LTS, hauríeu d'utilitzar el [kde-builder](#kde-builder) per a aquesta guia d'aprenentatge. Hauria d'utilitzar com a màxim 2 GB d'emmagatzematge.
sl: Če uporabljate [neposodobljeno distribucijo](docs/getting-started/building#choosing), kot je Debian Stable ali LTS Ubuntu, morate za to vadnico uporabiti [kde-builder](#kde-builder). Uporabi lahko največ 2 GB prostora za shranjevanje.

source: Installing Kirigami from the repositories in your Linux distribution
ca: Instal·lar el Kirigami a partir dels repositoris de la vostra distribució Linux
eo: Instalante Kirigami el la deponejoj en via Linuksa distribuo
es: Instalación de Kirigami desde los repositorios de su distribución Linux
nl: Kirigami installeren uit de opslagruimte in uw Linux distributie
sl: Namestitev Kirigamija iz skladišč v vaši distribuciji Linuxa
sv: Installera Kirigami från arkiven i Linux-distribution.
uk: Встановлення Kirigami зі сховищ пакунків у вашому дистрибутиві Linux

source: We need a C++ compiler, Qt development packages, and Kirigami. Open a terminal application and run one of the following, depending on which Linux distribution you are using:
ca: Necessitem un compilador de C++, els paquets de desenvolupament de les Qt i el Kirigami. Obriu una aplicació de terminal i executeu un dels següents, depenent de quina distribució Linux utilitzeu:
eo: Ni bezonas C++-kompililon, Qt-disvolvajn pakaĵojn kaj Kirigami. Malfermu terminalan aplikaĵon kaj rulu unu el la jenaj, depende de kiu Linuksa distribuo vi uzas:
es: Necesitamos un compilador de C++, los paquetes de desarrollo de Qt y Kirigami. Abra una aplicación de terminal y ejecute una de las siguientes líneas, dependiendo de la distribución Linux que esté usando:
nl: We hebben een C++ compiler, Qt ontwikkelpakketten en Kirigami nodig. Open een terminaltoepassing en voer een van de volgende, afhankelijk van welke Linux distributie u gebruikt:
sl: Potrebujemo prevajalnik C++, razvojne pakete Qt in Kirigami. Odprite terminalsko aplikacijo in zaženite nekaj od naslednjega, odvisno od tega, katero distribucijo Linuxa uporabljate:
sv: Vi behöver en C++-kompilator, Qt-utvecklingspaket och Kirigami. Öppna ett terminalprogram och kör något av följande, beroende på vilken Linux-distribution du använder:
uk: Нам знадобиться компілятор C++, пакунки для розробки Qt та Kirigami. Відкрийте програму-термінал і віддайте одну з вказаних нижче команд, залежно від дистрибутива Linux, яким ви користуєтеся:

source: Further information for other distributions can be found in [Installing build dependencies](/docs/getting-started/building/help-dependencies).
ca: Trobareu més informació sobre les altres distribucions a [Instal·lació de dependències de construcció](/docs/getting-started/building/help-dependencies).

source: Using kde-builder
ca: Utilitzar el «kde-builder»
eo: En Linukso, kun kde-builder
es: Uso de kde-builder
sl: Uporaba kde-builder
uk: Користування kde-builder

source: [Set up your development environment with kde-builder](/docs/getting-started/building/kde-builder-setup/). That will give you the necessary development tools and underlying libraries, and build the KDE Frameworks from scratch.
ca: [Configureu l'entorn de desenvolupament amb el «kde-builder»](/docs/getting-started/building/kde-builder-setup/). Això us proporcionarà les eines de desenvolupament necessàries i les biblioteques subjacents i construirà els Frameworks de KDE des de zero.
sl: [Nastavi svoje razvojno okolje s kde-builder](/docs/getting-started/building/kde-builder-setup/). To vam bo dalo potrebna razvojna orodja in temeljne knjižnice ter zgradilo ogrodja KDE iz nič.
uk: [Налаштуйте ваше середовище розробки за допомогою kde-builder](/docs/getting-started/building/kde-builder-setup/). Так ви отримаєте усі потрібні для розробки інструменти і базові бібліотеки, а також зібрані KDE Frameworks з нуля.

source: Create a folder `~/kde/src/kirigami-tutorial`. In that folder you will place the source code files from this tutorial.
ca: Creeu una carpeta `~/kde/src/kirigami-tutorial`. En aquesta carpeta situareu els fitxers de codi font d'aquesta guia d'aprenentatge.
sl: Ustvari mapo `~/kde/src/kirigami-tutorial`. V to mapo boste postavili datoteke izvorne kode iz te vadnice.
uk: Створіть теку `~/kde/src/kirigami-tutorial`. У цій теці зберігатимуться файли початкового коду з цього підручника.

source: Add the following at the end of your `~/.config/kde-builder.yaml`:
ca: Afegiu el següent al final del vostre `~/.config/kde-builder.yaml`:
sl: Dodaj naslednje na koncu vašega `~/.config/kde-builder.yaml`:
uk: Додайте таке наприкінці вашого файла `~/.config/kde-builder.yaml`:

source: ⏳ With kdesrc-build...
ca: ⏳ Amb el «kdesrc-build»...
eo: ⏳ Per kdesrc-build...
es: ⏳ Con kdesrc-build...
nl: ⏳ Met kdesrc-build...
sl: S kdesrc-build...
uk: ⏳ За допомогою kdesrc-build…

source: <details> <summary>Click here to know how this was done with kdesrc-build</summary></br>
ca: <details> <summary>Feu clic aquí per a conèixer com s'ha fet amb el «kdesrc-build»</summary>
eo: <details> <summary>Alklaku ĉi tie por ekscii kiel tio estas farita per kdesrc-build</summary>
es: <details> <summary>Pulse aquí para saber cómo se hace esto con kdesrc-build</summary></br>
nl: <details> <summary>Klik hier om meer te weten hoe dt is gedaan met kdesrc-build</summary>
sl: <details> <summary>Kliknite sem, da bi zdaj izvedeli, kako je bilo to narejeno s kdesrc-build</summary></br>
uk: <details> <summary>Натисніть, щоб дізнатися про те, як це можна зробити за допомогою kdesrc-build</summary></br>

source: This step used to be done by writing to `~/.config/kdesrc-buildrc` instead with a different syntax:
ca: Aquest pas es feia escrivint a `~/.config/kdesrc-buildrc` amb una sintaxi diferent:
nl: Deze stap werd gedaan door in plaats daarvan te schrijven naar `~/.config/kdesrc-buildrc` met een andere syntaxis:
sl: Ta korak se je včasih izvajal tako, da se je namesto v `~/.config/kdesrc-buildrc` pisalo z drugačno sintakso:
uk: Цей крок виконується записуванням до `~/.config/kdesrc-buildrc` із іншими синтаксисом:

source: Installing Kirigami with Craft
ca: Instal·lar el Kirigami amb el Craft
eo: Instalado de Kirigami kun Craft
es: Instalación de Kirigami con Craft
nl: Kirigami installeren met Craft
sl: Namestitev Kirigami s programom Craft
sv: Installera Kirigami med Craft
uk: Встановлення Kirigami за допомогою Craft

source: KDE has a custom tool to easily install most of its libraries and programs: **Craft**. It can be used to install Kirigami on [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) and [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
ca: KDE té una eina personalitzada per a instal·lar fàcilment la majoria de les seves biblioteques i programes: **Craft**. Es pot utilitzar per a instal·lar el Kirigami al [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), l'[Android](https://community.kde.org/Craft/Android) i el [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).
sl: KDE ima orodje po meri za preprosto namestitev večine svojih knjižnic in programov: **Craft**. Uporablja se lahko za namestitev Kirigamija v [Windows](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Windows), [Android](https://community.kde.org/Craft/Android) in [macOS](https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source/Mac).

source: While Craft is also available for Linux and FreeBSD, its intended use is only for AppImages and packaging.
ca: Tot i que Craft també està disponible per al Linux i FreeBSD, el seu ús previst és només per a les AppImages i empaquetament.
sl: Čeprav je Craft na voljo tudi za Linux in FreeBSD, je predvidena uporaba samo za AppImages in pakiranje.

source: You will need to follow the [setup instructions for Craft](https://community.kde.org/Craft). By the end of the setup, you should have run an environment setup file (`craftenv.ps1` on windows, or `craftenv.sh` on all other platforms), which will give you a terminal shell where you will be compiling your Kirigami application.
ca: Cal seguir les [instruccions de configuració per al Craft](https://community.kde.org/Craft). Cap al final de la configuració, hauríeu d'executar un fitxer de configuració d'entorn (`craftenv.ps1` al Windows o `craftenv.sh` a totes les altres plataformes), que us proporcionarà un intèrpret d'ordres de terminal a on compilareu la vostra aplicació Kirigami.

source: After that, you can run the following on a terminal:
ca: Després d'això, podeu executar el següent en un terminal:

source: This will take a while to finish on first run. If you close your terminal, you can run the environment setup file to prepare your terminal again.
ca: Això trigarà una estona a acabar en la primera execució. Si tanqueu el terminal, podeu tornar a executar el fitxer de configuració d'entorn per a tornar a preparar el terminal.

source: While there are tools that can easily set up our files, we are going to create them manually. This will let us better understand the pieces that are going to make up our new application.
ca: Si bé existeixen eines que poden configurar amb facilitat els nostres fitxers, els crearem manualment. Això ens permetrà comprendre millor les peces que compondran la nostra nova aplicació.
eo: Kvankam ekzistas iloj, kiuj povas facile agordi niajn dosierojn, ni kreos ilin permane. Ĉi tio permesos al ni pli bone kompreni la pecojn, kiuj konsistigos nian novan aplikaĵon.
es: Si bien existen herramientas que pueden configurar fácilmente nuestros archivos, los crearemos manualmente. Esto nos permitirá comprender mejor las piezas que compondrán nuestra nueva aplicación.
fr: Bien qu'il existe des outils qui permettent de configurer facilement nos fichiers, nous allons les créer manuellement. Cela nous permettra de mieux comprendre les éléments qui vont constituer notre nouvelle application.
nl: Terwijl er hulpmiddelen zijn die gemakkelijk onze bestanden in kunnen stellen, gaan we ze handmatig aanmaken. Hiermee begrijpen we de onderdelen beter waaruit onze nieuwe toepassing gaat bestaan.
pl: Mimo że istnieją narzędzia, które umożliwiają łatwe stworzenie tych plików, to my stworzymy je ręcznie. Ułatwi nam to zrozumienie części, które będą się składać na nasza nową aplikację.
pt: Embora existam ferramentas que nos ajudem a configurar facilmente os nossos ficheiros, vamos criá-los manualmente. Isto permitir-nos-á compreender melhor as componentes que irão compor a nossa nova aplicação.
sl: Medtem ko obstajajo orodja, s katerimi lahko enostavno nastavite naše datoteke, jih bomo ustvarili ročno. Tako bomo bolje razumeli dele, ki bodo iznašli našo novo aplikacijo.
sv: Även om det finns verktyg som enkelt kan skapa våra filer, kommer vi att skapa dem manuellt. Det låter oss förstå delarna som utgör vårt nya program bättre.
uk: Хоча існують інструменти, за допомогою яких можна просто налаштувати наші файли, ми створимо їх вручну. Це надасть нам змогу краще зрозуміти частини, з яких буде створено нашу нову програму.

source: First we create our project folder (you can use the commands below). We are going to call ours `kirigami-tutorial/`.
ca: Primer crearem la nostra carpeta de projecte (podeu utilitzar les ordres de sota). L'anomenarem `kirigami-tutorial/`.
eo: Unue ni kreas nian projektan dosierujon (vi povas uzi la komandojn sube). Ni nomos nian `kirigami-lernilo/`.
nl: Eerst maken we onze projectmap aan (u kunt de onderstaande commando's gebruiken). De onze gaan we `kirigami-tutorial/` noemen.
sl: Najprej ustvarimo našo projektno mapo (uporabite lahko spodnje ukaze). Našo vadnico bomo imenovali `kirigami-tutorial/`.
sv: Först skapar vi vår projektkatalog (du kan använda kommandona nedan). Vi kallar vår `kirigami-tutorial/`.
uk: Спочатку ми створимо теку нашого проєкту (ви можете скористатися наведеними нижче командами). Назвемо цю теку `kirigami-tutorial/`.

source: Within this folder we are going to create a `src/` folder and `CMakeLists.txt`. It is generally considered good practice to place all our main C++ code files in a `src/` folder. We also put the `Main.qml` file in it since it will be run together with the executable.
ca: Dins d'aquesta carpeta crearem una carpeta `src/` i un `CMakeLists.txt`. En general, es considera una bona pràctica posar tots els nostres principals fitxers de codi C++ en una carpeta `src/`. També hi posarem el fitxer `Main.qml` ja que s'executarà junt amb l'executable.
eo: Ene de ĉi tiu dosierujo ni kreos dosierujon `src/` kaj `CMakeLists.txt`. Ĝenerale estas konsiderata bona praktiko meti ĉiujn niajn ĉefajn C++-koddosierojn en dosierujon `src/`. Ni ankaŭ metas la dosieron `Main.qml` en ĝi ĉar ĝi estos rulita kune kun la rulebla.
nl: In deze map gaan we een map `src/` en `CMakeLists.txt` aanmaken. Het wordt in het algemeen als een goede praktijk beschouwd om al onze bestanden met hoofd C++-code in een map `src/` te plaatsen. We zetten ook het bestand `Main.qml` erin omdat het tegelijk met het uitvoerbare bestand zal draaien.
sl: V tej mapi bomo ustvarili mapo `src/` in `CMakeLists.txt`. Na splošno velja za dobro prakso, da vse naše glavne kodne datoteke C++ postavite v mapo `src/`. Vanjo smo vstavili tudi datoteko `Main.qml`, saj se bo izvajala skupaj z izvršljivo datoteko.
sv: Under katalogen skapar vi katalogen `src/` och `CMakeLists.txt`. Det anses i allmänhet vara god praxis att placera alla våra huvudsakliga C++ källkodsfiler i katalogen `src`. Vi placerar också filen `Main.qml` i den eftersom den används tillsammans med det körbara programmet.
uk: У цій теці ми створимо теку `src/` і файл `CMakeLists.txt`. Зазвичай, вважається за правило розташовувати усі файли основного коду C++ у теці `src/`. Ми також збережемо у ньому файл `Main.qml`, оскільки його буде запущено разом із виконуваним файлом.

source: In case you want to automatically build the project with kde-builder, custom module name should be the same as the project root folder (in our case it will be "kirigami-tutorial"), otherwise you would need to customize the `source-dir` or `dest-dir` for the module. We will assume the path to your `main.cpp` will be `~/kde/src/kirigami-tutorial/src/main.cpp`.
ca: En cas que vulgueu construir automàticament el projecte amb el kde-builder, el nom del mòdul personalitzat hauria de ser el mateix que la carpeta arrel del projecte (en el nostre cas serà «kirigami-tutorial»), en cas contrari hauríeu de personalitzar el `source-dir` o `dest-dir` per al mòdul. Assumirem que el camí cap al `main.cpp` serà `~/kde/src/kirigami-tutorial/src/main.cpp`.
sl: Če želite samodejno zgraditi projekt s kde-builderjem, mora biti ime modula po meri enako kot korenska mapa projekta (v našem primeru bo to "kirigami-tutorial"), sicer bi morali prilagoditi `source- dir` ali `dest-dir` za modul. Predvidevamo, da bo pot do vašega `main.cpp` `~/kde/src/kirigami-tutorial/src/main.cpp`.
uk: Якщо ви хочете автоматично збирати проєкт за допомогою kde-builder, нетипова назва модуля має бути такою, як назва кореневої теки проєкту (у нашому випадку, це буде «kirigami-tutorial»). Якщо це не так, вам слід змінити `source-dir` або `dest-dir` для модуля. Ми припускатимемо, що шляхом до вашого `main.cpp` буде `~/kde/src/kirigami-tutorial/src/main.cpp`.

source: Here's where we will be handling our application's frontend.
ca: Aquí és on manejarem el frontal de la nostra aplicació.
eo: Jen kie ni pritraktos la fasadon de nia aplikaĵo.
es: Aquí es donde manejaremos la interfaz de nuestra aplicación.
fr: C'est ici que nous allons gérer l'interface utilisateur de notre application.
nl: Hier gaan we onze frontend van de toepassing behandelen.
pl: To miejsce, w którym będziemy obsługiwać przód naszej aplikacji.
pt: Aqui está como será tratada a interface da nossa aplicação.
sl: Tukaj bomo delali na ospredju naše aplikacije.
sv: Här är stället där vi hanterar vårt förgrundsprogram.
uk: Тут ми працюватимемо із оболонкою нашої програми.

source: If you know some Javascript, then much of QML will seem familiar to you (though it does have its own peculiarities). [Qt's documentation](https://doc.qt.io/qt-6/qtqml-index.html) has an extensive amount of material on this language if you feel like trying something on your own. Over the course of these tutorials we will be focusing much of our attention on our QML code, where we can use Kirigami to get the most out of it.
ca: Si coneixeu alguna cosa de JavaScript, gran part de QML us resultarà familiar (encara que té les seves pròpies peculiaritats). Si teniu ganes de provar alguna cosa pel vostre compte, la [documentació de les Qt](https://doc.qt.io/qt-6/qtqml-index.html) té una gran quantitat de material sobre aquest llenguatge. Al llarg d'aquestes guies d'aprenentatge, centrarem gran part de la nostra atenció en el codi en QML, on podrem emprar el Kirigami per a aprofitar-lo al màxim.
eo: Se vi konas iom da Javascript, tiam multe de QML ŝajnos al vi konata (kvankam ĝi havas siajn proprajn proprecojn). [La dokumentaro de Qt](https://doc.qt.io/qt-6/qtqml-index.html) havas ampleksan kvanton da materialo pri ĉi tiu lingvo se vi emas provi ion memstare. Dum ĉi tiuj lerniloj ni koncentriĝos grandan parton de nia atento al nia QML-kodo, kie ni povas uzi Kirigami por akiri la plej grandan parton de ĝi.
es: Si sabe algo de JavaScript, gran parte de QML le será familiar (aunque tiene sus propias peculiaridades). La [documentación de Qt](https://doc.qt.io/qt-6/qtqml-index.html) dispone de gran cantidad de material sobre este lenguaje si tiene ganas de probar cosas por su cuenta. A lo largo del curso de estos tutoriales nos vamos a centrar en nuestro código QML, donde podemos usar Kirigami para sacar el máximo provecho del mismo.
nl: Als u enige Javascript kent, dan zal veel van QML u bekend voorkomen (hoewel het zijn eigen eigenaardigheden heeft). [Qt's documentation](https://doc.qt.io/qt-6/qtqml-index.html) heeft een uitgebreide hoeveelheid materiaal over deze taal als u zelf iets wilt proberen. Gedurende de loop van deze inleidingen zullen we veel van onze aandacht focussen op onze QML code, waar we Kirigami kunnen gebruiken om er het meeste uit te krijgen.
sl: Če poznate nekaj Javascripta, se vam bo večina QML zdela znana (čeprav ima svoje posebnosti). [Dokumentacija Qt](https://doc.qt.io/qt-6/qtqml-index.html) vsebuje obsežno količino gradiva o tem jeziku, če želite nekaj poskusiti sami. Med temi učbenki bomo veliko pozornosti namenili naši kodi QML, kjer lahko uporabimo Kirigami, da ga kar najbolje izkoristimo.
sv: Om du kan lite Javascript ser mycket av QML bekant ut (även om det har sina egenheter). [Qt:s dokumentation](https://doc.qt.io/qt-6/qtqml-index.html) har en omfattande mängd material om språket om du känner för att prova något på egen hand. Genom alla de här handledningarna kommer vi att fokusera mycket av vår uppmärksamhet på vår QML-kod, där vi kan använda Kirigami för att få ut så mycket som möjligt av den.
uk: Якщо ви трохи знаєте Javascript, більша частина QML видасться вам знайомою (хоча тут є свої особливості). У [документації до Qt](https://doc.qt.io/qt-6/qtqml-index.html) є багато матеріалу щодо цієї мови, якщо вам захочеться спробувати щось самостійно. Вивчаючи курс підручника, ми зосередимося на нашому коді QML, де ми використовуватимемо Kirigami, щоб отримати максимальні переваги від цього.

source: For now, let's focus on `Main.qml`. First we [import](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) a number of important modules:
ca: Per ara, centrem-nos en `Main.qml`. Primer [importarem](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) diversos mòduls importants:
eo: Nuntempe, ni koncentriĝu pri `Main.qml`. Unue ni [importas](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) kelkajn gravajn modulojn:
es: Por ahora, centrémonos en `Main.qml`. Primero [importamos](https:// doc.qt.io/qt-6/qtqml-syntax-imports.html) cierto número de importantes módulos:
nl: Laten we ons voor nu focussen op `Main.qml`. Eerst [importeren](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) we een aantal belangrijke modulen:
sl: Za zdaj se osredotočimo na `Main.qml`. Najprej [uvozimo](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) številne pomembne module:
sv: Låt oss för tillfället fokusera på `Main.qml`. Först [importerar](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) vi ett antal viktiga moduler:
uk: Тепер зосередимо увагу на `Main.qml`. Спочатку ми [імпортуємо](https://doc.qt.io/qt-6/qtqml-syntax-imports.html) декілька важливих модулів:
