Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Often you have more than one child in your [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), and positioning items can be tricky—especially in combination with a [ListView](docs:qtquick;QtQuick.ListView).
eo: Ofte vi havas pli ol unu infanon en via [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), kaj poziciigi elementojn povas esti malfacila—precipe en kombinaĵo kun [ListView](docs:qtquick;QtQuick.ListView).
nl: U hebt vaak meer dan één kind in uw [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) en items positioneren kan moeilijk zijn-speciaal in combinatie met een [ListView](docs:qtquick;QtQuick.ListView).
pt: Muitas vezes tem mais que um elemento-filho na sua [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), e o posicionamento dos itens poderá ser complicado - principalmente em conjunto com uma [ListView](docs:qtquick;QtQuick.ListView).
sv: Ofta har man mer än ett underliggande objekt i en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), och det kan vara knepigt att positionera objekten, särskilt i kombination med en [ListView](docs:qtquick;QtQuick.ListView).
uk: Часто на [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) міститься більше одного дочірнього елемента, а розташовування елементів може бути складною справою — особливо у поєднанні із [ListView](docs:qtquick;QtQuick.ListView).

source: For other items, it might make sense to move them to the header or footer of the [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). This is often the case for search bars.
eo: Por aliaj eroj, povus havi sencon movi ilin al la kaplinio aŭ piedlinio de la [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Ĉi tio ofte okazas por serĉbretoj.
es: Para otros elementos, podría tener sentido moverlos al encabezado o al pie de página de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Este suele ser el caso de las barras de búsqueda.
nl: Voor andere items kan het zinvol zijn om ze te verplaatsen naar de kop of voet van de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Dit is vaak het geval voor zoekbalken.
pt: Para os outros itens, poderá fazer algum sentido movê-las para o cabeçalho ou rodapé do [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Este é normalmente o caso das barras de pesquisa.
sv: För andra objekt kan det vara vettigt att flytta dem till ett sidhuvud eller en sidfot i [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Det gäller ofta sökrader.
uk: Інші ж елементи варто пересувати у шапку або підвал [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Так часто роблять із панелями пошуку.

source: PlaceholderMessage
eo: AnstataŭiloMesaĝo
pl: Wiadomość zastępcza

source: It is possible to add a [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) with some instructions in case the list view is empty.
eo: Eblas aldoni [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) kun kelkaj instrukcioj, se la listvido estas malplena.
es: Es posible añadir un [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) con algunas instrucciones en caso de que la vista de la lista esté vacía.
nl: Het is mogelijk om een [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) met enige instructies toe te voegen in geval de lijstweergave leeg is.
pt: É possível adicionar uma [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) com algumas instruções, no caso de a lista estar vazia.
sv: Det är möjligt att lägga till [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) med några instruktioner i fallet då listvyn är tom.
uk: Можна додати [Kirigami.PlaceholderMessage](docs:kirigami2;PlaceholderMessage) із певними настановами, якщо панель списку є порожньою.

source: A search field is often added to a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) to filter the [ListView](docs:qtquick;QtQuick.ListView). This can be done by changing the default [titleDelegate](docs:kirigami2;Page::titleDelegate) to use a [Kirigami.SearchField](docs:kirigami2;SearchField) instead.
eo: Serĉkampo ofte estas aldonita al [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) por filtri la [ListView](docs:qtquick;QtQuick.ListView). Ĉi tio povas esti farita ŝanĝante la defaŭltan [titleDelegate](docs:kirigami2;Page::titleDelegate) por uzi [Kirigami.SearchField](docs:kirigami2;SearchField) anstataŭe.
nl: Er wordt vaak een zoekveld toegevoegd aan een [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) om de [ListView](docs:qtquick;QtQuick.ListView) te filteren. Dit kan gedaan worden door de standaard [titleDelegate](docs:kirigami2;Page::titleDelegate) te wijzigen om een [Kirigami.SearchField](docs:kirigami2;SearchField) in plaats daarvan te gebruiken.
pt: Um campo de pesquisa normalmente é adicionado a uma [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) para filtrar a [ListView](docs:qtquick;QtQuick.ListView). Isto pode ser feito se modificar o `titleDelegate` predefinido para usar um [Kirigami.SearchField](docs:kirigami2;SearchField) em alternativa.
sv: Ett sökfält läggs ofta till i en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) för att filtrera en [ListView](docs:qtquick;QtQuick.ListView). Det kan göras genom att ändra fördefinierad [titleDelegate](docs:kirigami2;Page::titleDelegate) att använda [Kirigami.SearchField](docs:kirigami2;SearchField) istället.
uk: Поле пошуку часто додають до [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage) для фільтрування [ListView](docs:qtquick;QtQuick.ListView). Зробити це можна замінивши типовий [titleDelegate](docs:kirigami2;Page::titleDelegate) на [Kirigami.SearchField](docs:kirigami2;SearchField).

source: You can use [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) from [KItemModel](docs:kitemmodels) to easily add filtering capability directly in QML without any need for C++ code.
eo: Vi povas uzi [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) de [KItemModel](docs:kitemmodels) por facile aldoni filtran kapablon rekte en QML sen ia bezono de C++-kodo.
es: Puede usar el [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) de [KItemModel](docs:kitemmodels) para añadir filtrado con facilidad directamente en QML, sin ninguna necesidad de código C++.
nl: U kunt [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) gebruiken uit [KItemModel](docs:kitemmodels) om gemakkelijk filtermogelijkheden direct in QML toe te voegen zonder enige noodzaak voor C++ code.
pt: Poderá usar o [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) do [KItemModel](docs:kitemmodels) para adicionar facilmente a capacidade de filtragem directamente no QML, sem ser necessário qualquer código em C++.
sv: Du kan använda [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) från [KItemModel](docs:kitemmodels) för att enkelt lägga till filtreringsmöjlighet direkt i QML utan någon C++ kod.
uk: Ви можете скористатися [KSortFilterProxyModel](docs:kitemmodels;SortFilterModel) з [KItemModel](docs:kitemmodels) для спрощення додавання можливостей фільтрування безпосередньо до QML без потреби у коді C++.

source: A [Kirigami.Action](docs:kirigami2;Action) encapsulates a user interface action. We can use these to provide our applications with easy-to-reach actions that are essential to their functionality.
eo: [Kirigami.Action](docs:kirigami2;Action) enkapsuligas uzantinterfacon. Ni povas uzi ĉi tiujn por provizi niajn aplikojn per facile atingeblaj agoj, kiuj estas esencaj por ilia funkcieco.
es: Una [Kirigami.Action](docs:kirigami2;Action) encapsula una acción de la interfaz de usuario. Podemos usarlas para proporcionar a nuestras aplicaciones acciones de fácil acceso que son esenciales para su funcionalidad.
nl: Een [Kirigami.Action](docs:kirigami2;Action) omvat geheel een actie in de gebruikersinterface. We kunnen deze gebruiken om onze toepassingen te voorzien van gemakkelijk te bereiken acties die essentieel zijn voor hun functionaliteit.
pt: Uma [Kirigami.Action](docs:kirigami2;Action) encapsula uma acção da interface do utilizador. Podemos usá-las para oferecer às nossas aplicações acções fáceis de aceder e que são essenciais à sua funcionalidade.
sv: En [Kirigami.Action](docs:kirigami2;Action) inkapslar en åtgärd i ett användargränssnitt. Vi kan använda dem för att tillhandahålla åtgärder i våra program som är enkla att nå och är grundläggande för deras funktion.
uk: Дія [Kirigami.Action](docs:kirigami2;Action) є контейнером для дії з інтерфейсом користувача. Діями можна скористатися для надання нашій програмі легкодоступних дій, які є критичними для виконання нею функціональних можливостей.

source: We are placing our [Kirigami.Action](docs:kirigami2;Action) within our main page from the previous tutorials. If we wanted to, we could add more actions to our page (and even nest actions within actions!).
eo: Ni metas nian [Kirigami.Action](docs:kirigami2;Action) ene de nia ĉefa paĝo de la antaŭaj lerniloj. Se ni volus, ni povus aldoni pli da agoj al nia paĝo (kaj eĉ nesti agojn ene de agoj!).
nl: We plaatsen onze [Kirigami.Action](docs:kirigami2;Action) op onze hoofdpagina uit de eerdere instructie. Als we het willen, dan kunnen we meer acties aan onze pagina (en zelfs geneste acties in acties!) toevoegen.
sv: Vi placerar vår [Kirigami.Action](docs:kirigami2;Action) på vår huvudsida från de tidigare handledningarna. Om vi ​​ville kunde vi lägga till fler åtgärder på vår sida (och till och med kapsla in åtgärder i åtgärder).
uk: Ми розташовуємо нашу [Kirigami.Action](docs:kirigami2;Action) на нашій основній сторінці з попередніх підручників. Якщо нам потрібно, ми можемо додати інші кнопки дій на нашій сторінці (і навіть вкласти дії у інші дії!).

source: <details> <summary>Click here to see how to check the available icons on your system</summary> <br> Cuttlefish is a KDE application that lets you view all the icons that you can use for your application. It offers a number of useful features such as previews of their appearance across different installed themes, previews at different sizes, and more. You might find it a useful tool when deciding on which icons to use in your application.<br><br>
eo: <detaloj> <summary>Alklaku ĉi tie por vidi kiel kontroli la disponeblajn piktogramojn en via sistemo</summary> <br> Cuttlefish estas KDE-aplikaĵo, kiu ebligas al vi vidi ĉiujn piktogramojn, kiujn vi povas uzi por via aplikaĵo. Ĝi ofertas kelkajn utilajn funkciojn kiel antaŭrigardojn de ilia aspekto tra malsamaj instalitaj temoj, antaŭrigardojn je malsamaj grandecoj kaj pli. Vi eble trovos ĝin utila ilo kiam vi decidas pri kiuj piktogramoj uzi en via aplikaĵo.<br><br>
es: <details> <summary>Pulse aquí para ver cómo comprobar los iconos disponibles en su sistema</summary> <br> Cuttlefish es una aplicación de KDE que le permite ver todos los iconos que puede usar en su aplicación. Ofrece una serie de funciones útiles, como vistas previas de su apariencia con los diferentes temas instalados, vistas previas en distintos tamaños y más. Puede que le resulte una herramienta útil a la hora de decidir los iconos que va a utilizar en su aplicación.<br><br>
nl: <details> <summary>Click here to see how to check the available icons on your system</summary> <br> Cuttlefish is een KDE toepassing die u alle pictogrammen laat zien die u voor uw toepassing kunt gebruiken. Het biedt een aantal nuttige functies zoals voorbeelden van hun uiterlijk over verschillende geïnstalleerde thema's, voorbeelden bij verschillende groottes en meer. U zou het een nuttig hulpmiddel kunnen vinden bij beslissen over welke pictogrammen in uw toepassing te gebruiken.<br><br>
sv: <details> <summary>Klicka här för att se hur du kontrollerar tillgängliga ikoner på systemet</summary> <br> Cuttlefish är ett KDE-program som låter dig visa alla ikoner som du kan använda i ditt program. Det erbjuder ett antal användbara funktioner, såsom förhandsgranskningar av deras utseenden över olika installerade teman, förhandsgranskningar vid olika storlekar, med mera. Det kan vara ett användbart verktyg när du ska bestämma dig för vilka ikoner du vill använda i ditt program.<br><br>
uk: <details> <summary>Натисніть тут, щоб ознайомитися із тим, як переглянути доступні піктограми у вашій системі</summary> <br> Cuttlefish — програма KDE, за допомогою якої ви можете переглянути усі піктограми, якими можна скористатися у вашій програмі. У програмі передбачено декілька корисних можливостей, зокрема попередній перегляд вигляду піктограм у різних встановлених темах, попередній перегляд із різними розмірами тощо. Можливо, програма буде корисною для вас із метою визначення, які піктограми варто використати у вашій програмі.<br><br>

source: Many of KDE's icons follow the FreeDesktop Icon Naming specification. Therefore, you might also find it useful to consult The FreeDesktop project's website, [which lists all cross-desktop compatible icon names](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
eo: Multaj el la piktogramoj de KDE sekvas la specifon de FreeDesktop Icon Naming. Sekve, vi eble ankaŭ trovos utile konsulti la retejon de la projekto FreeDesktop, [kiu listigas ĉiujn inter-tablaj kongruaj piktogramnomoj](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest .html).
es: Muchos de los iconos de KDE siguen la especificación de denominación de iconos de FreeDesktop. Por lo tanto, también puede resultarle útil consultar el sitio web del proyecto FreeDesktop, que [enumera todos los nombres de iconos compatibles con todos los escritorios](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
nl: Veel van de pictogrammen van KDE volgen de specificatie FreeDesktop Icon Naming. U zou het daarom ook nuttig kunnen vinden om de website van The FreeDesktop project te consulteren, [die lijsten heeft van cross-desktop compatibele pictogramnamen](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
pt: Muitos dos ícones do KDE seguem a especificação do FreeDesktop para nomes de ícones. Como tal, poderá querer consultar a página Web do projecto FreeDesktop, o qual [contém todos os nomes de ícones compatíveis com os vários ambientes de trabalho](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
sl: Mnoge ikone KDE sledijo specifikaciji poimenovanja ikon FreeDesktop. Zato se utegne biti tudi koristno, da se posvetujete s spletnim mestom projekta FreeDesktop, [ki na svoji spletni strani našteva vsa imena združljivih ikon](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
sv: Många av KDE:s ikoner följer FreeDesktop specifikation för namngivning av ikoner. Därför kan det också vara nyttigt att konsultera FreeDesktop-projektets webbplats, [som listar alla kompatibla ikonnamn för olika skrivbord](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).
uk: У багатьох піктограмах KDE використано специфікацію назв піктограм FreeDesktop. Через це, вам також буде корисним звернутися до сайта проєкту FreeDesktop, [де наведено список усіх сумісних із різними стільничними середовищами назв піктограм](https://specifications.freedesktop.org/icon-naming-spec/icon-naming-spec-latest.html).

source: The next component is a [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). It shows up as a [hamburger menu](https://en.wikipedia.org/wiki/Hamburger_button). By default it opens a sidebar, which is especially useful on mobile, as the user can just swipe in a side of the screen to open it. Global drawers are useful for global navigation and actions. We are going to create a simple global drawer that includes a "quit" button.
eo: La sekva komponanto estas [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). Ĝi aperas kiel [hamburger-menuo](https://en.wikipedia.org/wiki/Hamburger_button). Defaŭlte ĝi malfermas flankbreton, kiu estas precipe utila ĉe poŝtelefono, ĉar la uzanto povas simple gliti en flankon de la ekrano por malfermi ĝin. Ĉieaj tirkestoj estas utilaj por ĉiea navigado kaj agoj. Ni kreos simplan ĉiean tirkeston, kiu inkluzivas butonon "ĉesi".
nl: Het volgende component is een [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). Het verschijnt als een [hamburger menu](https://en.wikipedia.org/wiki/Hamburger_button). Standaard opent het een zijbalk, wat met name zinvol is bij een mobieltje, omdat de gebruiker gewoon langs de zijkant van het scherm een veegbeweging kan maken om het te openen. Globale schuiflades zijn erg handig voor de algemene navigatie en de bijbehorende acties. We gaan een eenvoudige schuiflade creëren met daarop een knop "afsluiten".
sv: Nästa komponent är en [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). Den visas som en [hamburgermeny](https://en.wikipedia.org/wiki/Hamburger_button). Normalt öppnar den ett sidofält, vilket är särskilt användbart på en mobil, eftersom användaren bara kan svepa in på en sida av skärmen för att öppna den. Globala lådor är användbara för global navigering och handlingar. Vi skapar en enkel global låda som innehåller knappen "avsluta".
uk: Наступним компонентом є [Kirigami.GlobalDrawer](docs:kirigami2;GlobalDrawer). Він показує [меню-гамбургер](https://en.wikipedia.org/wiki/Hamburger_button). Типово, він відкриває бічну панель, яка є особливо корисною на мобільних пристроях, оскільки користувач може просто провести пальцем збоку екрана, щоб відкрити його. Загальні висувні панелі корисні для загальної навігації та кнопок дій. Ми збираємося створити просту загальну висувну панель, на якій буде показано кнопку «Вийти».

source: Here, we put our global drawer inside our application window. The main property we need to pay attention to is [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions), which takes the form of an array of [Kirigami.Action](docs:kirigami2;Action) components. This action has an appropriate icon and executes the [Qt.quit()](docs:qtqml;QtQml.Qt::quit) function when triggered, closing the application.
eo: Ĉi tie ni metas nian ĉiean tirkeston ene de nia aplika fenestro. La ĉefa eco, kiun ni devas atenti, estas [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions), kiu prenas la formon de tabelo de [Kirigami.Action](docs:kirigami2;Action) komponantoj. Ĉi tiu ago havas taŭgan piktogramon kaj efektivigas la funkcion [Qt.quit()](docs:qtqml;QtQml.Qt::quit) kiam ĝi estas ekigita, fermante la aplikaĵon.
nl: Hier stoppen we onze globale schuiflade in ons toepassingsvenster. De hoofdeigenschap die we nodig hebben om aandacht aan te geven is [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions), die de vorm van een array met [Kirigami.Action](docs:kirigami2;Action) componenten aanneemt. Deze actie heeft een toepasselijk pictogram en start de functie [Qt.quit()](docs:qtqml;QtQml.Qt::quit), om de toepassing af te sluiten.
pt: Agora iremos colocar a nossa área global dentro da janela da nossa aplicação. A propriedade principal que precisa de prestar atenção é a [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions), que tem a forma de uma lista de componentes [Kirigami.Action](docs:kirigami2;Action). Esta acção tem um ícone apropriado e invoca a função [Qt.quit()](docs:qtqml;QtQml.Qt::quit), fechando a aplicação.
sv: Här placerar vi vår globala låda inne i programfönstret. Huvudegenskapen som vi måste ta hänsyn till är [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions), som har formen av ett fält av [Kirigami.Action](docs:kirigami2;Action) komponenter. Åtgärden har en lämplig ikon och kör funktionen [Qt.quit()](docs:qtqml;QtQml.Qt::quit) när den används, som stänger programmet.
uk: Тут ми розмістили нашу загальну висувну панель у нашому вікні програми. Головною властивістю, якій ми маємо приділити увагу, є [GlobalDrawer.actions](docs:kirigami2;GlobalDrawer::actions). Ця властивість приймає значення масиву компонентів [Kirigami.Action](docs:kirigami2;Action). Ця дія має відповідну піктограму і запускає функцію [Qt.quit()](docs:qtqml;QtQml.Qt::quit), яка завершує роботу програми.

source: Since we are keeping our global drawer simple for now, we are setting the [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) property to `true`. This displays our global drawer as a normal application menu, taking up less space than the default global drawer pane.
eo: Ĉar ni nun simpligas nian ĉiean tirkeston, ni fiksas la proprecon [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) al `true`. Ĉi tio montras nian ĉiean tirkeston kiel normalan aplikaĵmenuon, okupante malpli da spaco ol la defaŭlta ĉiea kestofenestro.
es: Como vamos a mantener nuestro cajón global simple por ahora, definimos la propiedad [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) como `true`. Esto muestra nuestro cajón global como un menú de aplicación normal, que ocupa menos espacio que el panel del cajón global predeterminado.
nl: Omdat we onze globale schuiflade voor nu eenvoudig houden, stellen we de eigenschap [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) in op true. Dit toont onze globale schuiflade als een normaal toepassingsmenu, die minder ruimte inneemt dan het standaard globale schuifladepaneel.
pt: Dado que estamos a manter a nossa área global simples por agora, vamos configurar a propriedade [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) como verdadeira. Isto mostra a nossa área global como um menu da aplicação normal, ocupando menos espaço que a a área global predefinida.
sv: Eftersom vi håller vår globala låda enkel för tillfället, ställer vi in egenskapen [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) till `true`. Det visar vår globala låda som en normal programmeny, vilket upptar mindre utrymme än den normala rutan för globala lådor.
uk: Оскільки ми поки зберігаємо простоту нашої загальної висувної панелі, ми встановлюємо для [GlobalDrawer.isMenu](docs:kirigami2;GlobalDrawer::isMenu) значення true. У результаті нашу загальну висувну панель буде показано як звичайне меню програми, яке займатиме менше місця за типову загальну висувну панель.
