Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: Qt models with one role
ca: Models Qt amb un rol
eo: Qt-modeloj kun unu rolo
es: Modelos de Qt con un rol
nl: Qt modellen met een rol
sl: Modeli Qt z eno vlogo
sv: Qt-modeller med en roll
uk: Моделі Qt з однією роллю

source: In most cases, for prototyping
ca: En la majoria dels casos, per a fer prototips
eo: Plejofte, por prototipado
es: En la mayoría de los casos, para la creación de prototipos
nl: In de meeste gevallen, voor prototyping
sl: V večini primerov, za izdelavo prototipov
sv: I de flesta fall, för prototyper
uk: У більшості випадків для прототипізації

source: JavaScript array model
ca: Model de matriu JavaScript
eo: JavaScript tabelmodelo
es: Modelo de matriz de JavaScript
sv: Javascript-fältmodell
uk: Модель масиву JavaScript

source: For prototyping
ca: Per a fer prototips
eo: Por prototipado
es: Para la creación de prototipos
nl: Voor prototyping
sl: Za izdelavo prototipov
sv: För prototyper
uk: Для прототипізації

source: Integer model
ca: Model enter
eo: Entjera modelo
es: Modelo de enteros
sl: Celoštevilski model
sv: Heltalsmodell
uk: Цілочисельна модель

source: You can read about [other ways to use models in the Qt documentation](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
ca: Podeu llegir sobre [altres maneres d'usar els models a la documentació de les Qt](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
eo: Vi povas legi pri [aliaj manieroj uzi modelojn en la Qt-dokumentado](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
es: Puede leer más sobre [otras formas de usar modelos en la documentación de Qt](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
nl: U kunt lezen over [andere manieren om modellen te gebruiken in de Qt documentatie](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
sl: O [drugih načinih uporabe modelov lahko preberete v dokumentaciji Qt](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
sv: Du kan läsa om [andra sätt att använda modeller i Qt-dokumentationen](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).
uk: Ви можете ознайомитися із [іншими способами використання моделей у документації Qt](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html).

source: In the table above, "Qt models" refers to both C++-specific models like [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) and QML-specific models like ListModel. This tutorial page will only focus on QML-specific models. Farther ahead we provide a tutorial for [Connecting C++ models to QML using QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
ca: A la taula anterior, els «models Qt» es refereixen tant a models específics de C++ com [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) i a models específics de QML com ListModel. Aquesta pàgina de la guia d'aprenentatge només se centrarà en models específics de QML. Més endavant, proporcionem una guia d'aprenentatge per a [Connectar models C++ a QML utilitzant QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
eo: En la supra tabelo, "Qt-modeloj" rilatas al ambaŭ C++-specifaj modeloj kiel [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) kaj QML-specifaj modeloj kiel ListModel. Ĉi tiu lernilo-paĝo nur koncentriĝos pri QML-specifaj modeloj. Pli antaŭen ni provizas lernilon por [Konekti C++-modelojn al QML uzante QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
es: En la tabla anterior, «Modelos de Qt» se refiere a modelos específicos de C++, como [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html), y a modelos específicos de QML, como ListModel. Esta página del tutorial se centrará solo en los modelos específicos de QML. Más adelante ofrecemos un tutorial para [Conectar modelos de C++ a QML usando QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
nl: In de tabel hierboven,verwijst "Qt modellen" naar zowel C++-specifieke modellen zoals [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) als naar QML-specifieke modellen zoals ListModel. Deze pagina zal zich alleen focussen op QML-specifieke modellen. Verderop geven we een instructie voor het [verbinden van C++ modellen met QML met gebruik van QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
sl: V zgornji tabeli se "modeli Qt" nanašajo tako na modele, specifične za C++, kot je [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html), kot na modele, specifične za QML, kot je ListModel. Ta stran učbenika se bo osredotočila samo na modele, specifične za QML. Malo naprej nudimo učbenik za [Povezovanje modelov C++ z QML z uporabo QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
sv: I tabellen ovan hänvisar "Qt-modeller" till både C++ specifika modeller som [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html) och QML-specifika modeller som ListModel. Den här sidan i handledningen fokuserar enbart på QML-specifika modeller. Längre fram tillhandahåller vi en handledning för att [Ansluta C++ modeller till QML med QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).
uk: У наведеній вище таблиці «Моделі Qt» означають і C++-специфічні моделі, подібні до [QAbstractListModel](https://doc.qt.io/qt-6/qabstractlistmodel.html), і QML-специфічні моделі, зокрема ListModel. На цій сторінці підручника акцент зроблено на QML-специфічних моделях. Далі ми наведемо настанови щодо [з'єднання моделей C++ із QML за допомогою QAbstractListModel](/docs/getting-started/kirigami/advanced-connect_models).

source: The `model.index` property is made available to every model and contains the index (the position) of each delegate. It can be shortened to `index` for convenience.
ca: La propietat `model.index` es posa a disposició de cada model i conté l'índex (la posició) de cada delegat. Es pot escurçar a `index` per comoditat.
eo: La propreco `model.index` estas disponebla por ĉiu modelo kaj enhavas la indekson (la pozicion) de ĉiu delegito. Ĝi povas esti mallongigita al `indekso` por oportuno.
es: La propiedad `model.index` está disponible para todos los modelos y contiene el índice (la posición) de cada delegado. Se puede abreviar a `index` por conveniencia.
nl: De `model.index`-eigenschap is bij elk model beschikbaar en heeft de index index (de positie) van elk delegate. Voor de handigheid kan het worden afgekort naar `index`.
sl: Lastnost `model.index` je na voljo vsakemu modelu in vsebuje indeks (položaj) vsakega delegata. Zaradi udobja ga je mogoče skrajšati na `index`.
sv: Egenskapen `model.index` görs tillgänglig för varje modell och innehåller indexet (positionen) för varje delegat. Det kan för enkelhets skull förkortas till "index".
uk: Властивість `model.index` зроблено доступною для будь-якої моделі. Вона містить індекс (позиція) кожного делегата. Її можна скоротити до `index` для зручності.

source: The `model.somerole` property mentioned above is just a placeholder, it is not a specific property that comes from QML: `somerole` can be any role that is defined by the model. In the first code example of this page shown above the table, the `plasmaProductsModel` model has the `product` and `target` roles, which can be accessed with `model.product` and `model.target`, respectively.
ca: La propietat `model.somerole` esmentada anteriorment és només una variable de substitució, no és una propietat específica que prové del QML: `somerole` pot ser qualsevol rol que estigui definit pel model. En el primer exemple de codi d'aquesta pàgina que es mostra a sobre de la taula, el model `plasmaProductsModel` té els rols `product` i `target`, als quals es pot accedir amb `model.product` i `model.target`, respectivament.
eo: La eco `model.somerole` menciita supre estas nur lokokupilo, ĝi ne estas specifa eco kiu venas de QML: `somerole` povas esti ajna rolo kiu estas difinita de la modelo. En la unua kodekzemplo de ĉi tiu paĝo montrita super la tabelo, la modelo `plasmaProductsModel` havas la rolojn `produkto` kaj `celo`, kiuj estas alireblaj per `model.product` kaj `model.target`, respektive.
nl: De eigenschap `model.somerole` hierboven genoemd is alleen maar een plaatshouder, het is niet een specifieke eigenschap die uit QML komt : `somerole` kan elke rol zijn die door het model wordt gedefinieerd. In het eerste code voorbeeld op deze pagina toont de tabel hierboven, het model `plasmaProductsModel` heeft de `product` en `target` rollen, waar toe met respectievelijk `model.product` en `model.target` toegang gekregen kan worden.
sl: Zgoraj omenjena lastnost `model.somerole` je le označba mesta in ni specifična lastnost, ki izhaja iz QML: `somerole` je lahko katera koli vloga, ki jo definira model. V prvem primeru kode te strani, ki je prikazan nad tabelo, ima model `plasmaProductsModel` vlogi `product` in `target`, do katerih lahko dostopate z `model.product` oziroma `model.target`.
sv: Egenskapen `model.somerole` som nämns ovan är bara en platsmarkör, den är inte en specifik egenskap som kommer från QML: `somerole` kan vara vilken roll som helst som definieras av modellen. I det första kodexemplet på den här sidan som visas ovanför tabellen har "plasmaProductsModel" modellen "product" och rollerna "target", som kan nås med "model.product" respektive "model.target".
uk: Властивість `model.якась_роль`, про яку ми згадували вище, є лише замінником. Це не специфічна властивість, яка надходить від QML: записом `якась_роль` може бути будь-яка роль, яку визначено моделлю. У першому прикладі коду на цій сторінці, який показано над таблицею, модель`plasmaProductsModel` містить ролі `product` і `target`, доступ до яких можна здійснювати за допомогою `model.product` і `model.target`, відповідно.

source: Just as `model.index` can be shortened to `index`, each `model.somerole` property can be shorted to just `somerole` (like `product`) for convenience, but it is recommended that they be turned into required properties:
ca: De la mateixa manera que `model.index` es pot escurçar a `index`, cada propietat `model.somerole` es pot escurçar a només `somerole` (com `product`) per comoditat, però es recomana que es converteixin en propietats requerides:
eo: Same kiel `model.index` povas esti mallongigita al `index`, ĉiu `model.somerole` propreco povas esti mallongigita al nur `somerole` (kiel `produkto`) por oportuno, sed estas rekomendite ke ili estu igitaj postulataj trajtoj:
nl: Net zoals `model.index` afgekort kan worden tot `index`, kan voor de handigheid ook elk de `model.somerole`-eigenschap afgekort worden tot alleen maar `somerole` (zoals `product`), maar het wordt aanbevolen dat ze naar de betreffende eigenschappen worden omgezet:
sl: Tako kot je `model.index` mogoče skrajšati v `index`, lahko vsako lastnost `model.somerole` skrajšamo samo v `somerole` (kot `product`) zaradi udobja, vendar je priporočljivo, da jih spremenite v zahtevane lastnosti :
sv: Precis som "model.index" kan förkortas till "index", kan varje egenskap "model.somerole" kortas till bara "somerole" (som "product") för enkelhetens skull, men det rekommenderas att de omvandlas till nödvändiga egenskaper:
uk: Так само, як `model.index` можна скоротити до `index`, кожну властивість `model.якась_роль` можна скоротити до простого `якась_роль` (наприклад, `product`) для зручності, але рекомендуємо перетворювати їх до потрібних властивостей:

source: Additionally, if the model contains only one role or has no role at all, its data can also be accessed with the property `model.modelData`, which can also be shortened to `modelData` (and as such would also need to be a required property):
ca: A més, si el model conté només un rol o no té cap rol, també es pot accedir a les seves dades amb la propietat `model.modelData`, que també es pot escurçar a `modelData` (i com a tal també necessitaria ser una propietat requerida):
eo: Aldone, se la modelo enhavas nur unu rolon aŭ tute ne havas rolon, ĝiaj datumoj ankaŭ estas alireblaj per la propreco `model.modelData`, kiu ankaŭ povas esti mallongigita al `modelData` (kaj kiel tia ankaŭ bezonus esti postulata propreco):
nl: Daarnaast, als het model alleen maar een rol heeft of helemaal geen rol heeft, dan kan men er ook toegang toe krijgen met de eigenschap `model.modelData`, wat ook afgekort kan worden tot `modelData` (en als zodanig een vereiste eigenschap moet zijn):
sl: Poleg tega, če model vsebuje samo eno vlogo ali sploh nima nobene vloge, je mogoče do njegovih podatkov dostopati tudi z lastnostjo `model.modelData`, ki jo je mogoče tudi skrajšati v `modelData` (in kot taka bi morala biti tudi zahtevana lastnost):
sv: Dessutom, om modellen bara innehåller en roll eller inte har någon roll alls, kan dess data också nås med egenskapen "model.modelData", som också kan förkortas till "modelData" (och som sådan också skulle behöva vara en nödvändig egenskap):
uk: Крім того, якщо модель містить лише одну роль або взагалі не містить ролі, доступ до даних також можна здійснювати за допомогою властивості `model.modelData`, що можна скоротити до `modelData` (і як така також має бути обов'язковою властивістю):

source: This matches model.software
ca: Aquest coincideix amb model.software
eo: Ĉi tio kongruas kun modelo.softvaro
es: Esto coincide con model.software
nl: Dit komt overeen met model.software
sl: To se ujema z model.software
sv: Det motsvarar model.software
uk: Це відповідає model.software

source: For comparison, here is how the above code would look like with a [JavaScript array](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), with no role:
ca: Com a comparació, aquí és com es veuria el codi anterior amb una [matriu JavaScript](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), sense rol:
eo: Por komparo, jen kiel la supra kodo aspektus kun [JavaScript-tabelo](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), sen rolo:
es: A modo de comparación, así es como se vería el código anterior con una [matriz JavaScript](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), sin ningún rol:
nl: Voor vergelijking, is hier hoe de code van boven er uit zou zien met een [JavaScript array](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), zonder een rol:
sl: Za primerjavo, tukaj je videti zgornja koda s [poljem JavaScripta](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), brez vloge:
sv: För jämförelse, så här skulle ovanstående kod se ut med ett [Javascript-fält](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), utan roll:
uk: Для порівняння, ось як наведених вище код міг би виглядати з [масивом JavaScript](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array), без ролі:

source: Using an integer for the model can be useful for very specific cases, namely prototyping and tests:
ca: L'ús d'un enter per al model pot ser útil per a casos molt específics, com el prototipatge i les proves:
eo: Uzi entjeron por la modelo povas esti utila por tre specifaj kazoj, nome prototipado kaj testoj:
es: El uso de un número entero para el modelo puede ser útil para casos muy específicos, como prototipos y pruebas:
nl: Het gebruik van een integer voor de rol kan in zeer specifieke gevallen bruikbaar zijn, namelijk prototyping en tests:
sl: Uporaba celega števila za model je lahko uporabna za zelo specifične primere, namreč izdelavo prototipov in teste:
sv: Att använda ett heltal för modellen kan vara användbart för mycket specifika fall, nämligen prototyper och tester:
uk: Використання цілого числа для моделі може бути корисним для дуже специфічних випадків, а саме, прототипізації та тестування:

source: Understanding views and delegates
ca: Entendre les vistes i els delegats
eo: Komprenante vidojn kaj delegitojn
es: Entendiendo las vistas y los delegados
nl: Weergaven en delegaties begrijpen
sl: Razumevanje pogledov in delegatov
sv: Förstå vyer och delegater
uk: Розбираємося із переглядами і делегатами

source: Let's go back to the original example:
ca: Tornem a l'exemple original:
eo: Ni reiru al la originala ekzemplo:
es: Volvamos al ejemplo original:
nl: Laten we terug gaan naar het oorspronkelijke voorbeeld:
sl: Vrnimo se k izvirnemu primeru:
sv: Låt oss gå tillbaka till det ursprungliga exemplet:
uk: Повернімося до початкового прикладу:

source: Unlike the model (which merely contains data) and a delegate [Component](docs:qtqml;QtQml.Component) (which only appears when instantiated), the view is a visual component immediately instantiated and so it needs to either have its dimensions set or use anchors or Layouts.
ca: A diferència del model (que només conté dades) i d'un delegat [Component](docs:qtqml;QtQml.Component) (que només apareixen quan s'instancien), la vista és un component visual instanciat immediatament i, per tant, necessita tenir les seves dimensions establertes o utilitzar ancoratges o disposicions.
eo: Male al la modelo (kiu nur enhavas datenojn) kaj delegito [Komponento](docs:qtqml;QtQml.Component) (kiu nur aperas kiam instancigita), la vido estas vida komponanto tuj instancigita kaj do ĝi devas aŭ havi siajn dimensiojn agordita aŭ uzu ankrojn aŭ Aranĝojn.
es: A diferencia del modelo (que solo contiene datos) y un delegado [Component](docs:qtqml;QtQml.Component) (que solo aparece cuando se instancia), la vista es un componente visual que se instancia de forma inmediata y, por lo tanto, necesita tener unas dimensiones establecidas o usar anclas o Layouts.
nl: In tegenstelling tot het model (wat alleen maar data bevat) en een delegatie [Component](docs:qtqml;QtQml.Component) (wat alleen verschijnt als het gecreëerd wordt), is de weergave een visueel component dat onmiddellijk wordt gecreëerd en er moet daarom daarvan zijn afmetingen ingesteld zijn of er moeten anchors gebruikt worden of er moeten Layouts (vensterindelingen) gebruikt worden .
sl: Za razliko od modela (ki vsebuje samo podatke) in delegata [Component](docs:qtqml;QtQml.Component) (ki se prikaže le, ko je instanciran), je pogled vizualna komponenta, ki je takoj instancirana, zato mora imeti bodisi nastavljene dimenzije ali uporabite sidra ali postavitve.
sv: Till skillnad från modellen (som bara innehåller data) och en delegat [Component](docs:qtqml;QtQml.Component) (som bara visas när den instansieras), är vyn en visuell komponent som omedelbart instansieras och därför måste den antingen ha sina dimensioner inställda eller använd förankringar eller layouter.
uk: На відміну від моделі (яка, в основному, містить дані) і [компонента](docs:qtqml;QtQml.Component) делегата (який з'являється, лише якщо створено екземпляр), панель перегляду є візуальним компонентом, екземпляр якого створюється негайно, і тому потребує або встановлення його розмірностей, або використання прив'язок чи компонувань.

source: As views are commonly lists of content the user would want to scroll through, when they are added to a [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), views become the main content with little padding around them, and there is no need to make it fill the page. When the view is added to a simple [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page), it will require to set its dimensions properly before it will show up. In other words: in the scrollable page above, `anchors.fill: parent` is not required; if a simple page was used, it would be required.
ca: Com que les vistes són normalment llistes de contingut per les quals l'usuari es desplaçarà, quan s'afegeixen a un [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), les vistes es converteixen en el contingut principal amb poc farciment al voltant d'elles, i no hi ha cap necessitat de fer que ompli la pàgina. Quan la vista s'afegeix a una única [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page), necessitarà establir les seves dimensions correctament abans que aparegui. En altres paraules: a la pàgina desplaçable de dalt, no es requereix `anchors.fill: parent`; si s'utilitzés una única pàgina, seria necessària.
sl: Ker so pogledi običajno seznami vsebine, po kateri bi se uporabnik rad pomikal, ko so dodani na [Kirigami.ScrollablePage](docs:kirigami;org.kde.kirigami.ScrollablePage), pogledi postanejo glavna vsebina z malo oblazinjenja okoli njih in ni potrebe da zapolni stran. Ko je pogled dodan k preprosti strani [Kirigami.Page](docs:kirigami;org.kde.kirigami.Page), bo moral pravilno nastaviti svoje dimenzije, preden se prikaže. Z drugimi besedami: na zgornji strani, po kateri se lahko premikate, `anchors.fill: parent` ni zahtevan; če je bila uporabljena preprosta stran, pa bi bil zahtevan.

source: There are multiple views APIs can be used, some from Qt and some from Kirigami. Here are the most commonly used ones:
ca: Hi ha diverses API de vistes que es poden utilitzar, algunes de les Qt i altres de Kirigami. A continuació us detallem les més utilitzades:
eo: Estas pluraj vidoj API-oj uzeblaj, iuj de Qt kaj iuj de Kirigami. Jen la plej ofte uzataj:
nl: Er zijn meerdere weergave-API's die kunnen worden gebruikt, enkele van Qt en enkele van Kirigami. Hier zijn de meest voorkomende:
sl: Uporabiti je mogoče več pogledov API-jev, nekatere iz Qt in nekatere iz Kirigami. Tu so najpogosteje uporabljeni:
sv: Det finns flera programmeringsgränssnitt för vyer som kan användas, några från Qt och några från Kirigami. Här är de mest använda:
uk: Можна використовувати декілька програмних інтерфейсів панелей перегляду, деякі походять з Qt, а деякі — з Kirigami. Ось найпоширеніші:

source: Qt's [ListView](docs:qtquick;QtQuick.ListView)
ca: [ListView](docs:qtquick;QtQuick.ListView) de les Qt
eo: [ListView] de Qt (docs:qtquick;QtQuick.ListView)
es: [ListView](docs:qtquick;QtQuick.ListView) de Qt
uk: [ListView](docs:qtquick;QtQuick.ListView) Qt

source: Qt's [GridView](docs:qtquick;QtQuick.GridView)
ca: [GridView](docs:qtquick;QtQuick.GridView) de les Qt
eo: [GridView] de Qt (docs:qtquick;QtQuick.GridView)
es: [GridView](docs:qtquick;QtQuick.GridView) de Qt
uk: [GridView](docs:qtquick;QtQuick.GridView) Qt

source: Qt's [TableView](docs:qtquick;QtQuick.TableView)
ca: [TableView](docs:qtquick;QtQuick.TableView) de les Qt
eo: [TableView] de Qt (docs:qtquick;QtQuick.TableView)
es: [TableView](docs:qtquick;QtQuick.TableView) de Qt
uk: [TableView](docs:qtquick;QtQuick.TableView) Qt

source: Qt's [TreeView](docs:qtquick;QtQuick.TreeView)
ca: [TreeView](docs:qtquick;QtQuick.TreeView) de les Qt
eo: [TreeView] de Qt (docs:qtquick;QtQuick.TreeView)
es: [TreeView](docs:qtquick;QtQuick.TreeView) de Qt
uk: [TreeView](docs:qtquick;QtQuick.TreeView) Qt

source: Kirigami's [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView)
ca: [CardsListView](docs:kirigami;org.kde.kirigami.CardsListView) del Kirigami

source: Kirigami's [ColumnView](docs:kirigami;org.kde.kirigami.layouts.ColumnView)
ca: [ColumnView](docs:kirigami;org.kde.kirigami.layouts.ColumnView) del Kirigami
