Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: [KDE Apps page](https://apps.kde.org/en/neochat)<br />[KDE Invent page](https://invent.kde.org/network/neochat)
eo: [KDE Apps-paĝo](https://apps.kde.org/en/neochat)<br />[KDE Invent-paĝo](https://invent.kde.org/network/neochat)
es: [Página de KDE Apps](https://apps.kde.org/en/neochat)<br />[Página de KDE Invent](https://invent.kde.org/network/neochat)
fr: [Page de KDE Apps](https://apps.kde.org/en/neochat)<br />[Page de KDE Invent](https://invent.kde.org/network/neochat)
nl: [KDE Apps pagina](https://apps.kde.org/en/neochat)<br />[KDE Invent pagina](https://invent.kde.org/network/neochat)
pl: [Strona Aplikacji KDE](https://apps.kde.org/en/neochat)<br />[Strona KDE Invent](https://invent.kde.org/network/neochat)
pt: [Página das Aplicações do KDE](https://apps.kde.org/en/neochat)<br />[Página do KDE Invent](https://invent.kde.org/network/neochat)
sl: [Stran aplikacij KDE](https://apps.kde.org/sl/neochat)<br />[Stran KDE Invent](https://invent.kde.org/network/neochat)
sv: [KDE-programsida](https://apps.kde.org/en/neochat)<br />[KDE Invent-sida](https://invent.kde.org/network/neochat)
uk: [Сторінка на KDE Apps](https://apps.kde.org/en/neochat)<br />[Сторінка на KDE Invent](https://invent.kde.org/network/neochat)

source: We also provide a list of continuously updated resources to learn C++ in [this wiki page](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
eo: Ni ankaŭ provizas liston de kontinue ĝisdatigitaj rimedoj por lerni C++ en [ĉi tiu vikipaĝo](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
nl: We leveren ook een lijst met continue bijgewerkte hulpbronnen om C++ te leren in [deze wiki-pagina](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
pt: Também oferecemos uma lista de recursos em actualização contínua para aprender C++ [nesta página de wiki](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
sl: Ponujamo tudi seznam nenehno posodabljanih virov za učenje C ++ n [tej strani wiki](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
sv: Vi tillhandahåller också en lista över kontinuerligt uppdaterade resurser för att lära sig C++ på[den här wiki-sidan](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).
uk: Ми також надаємо список неперервно оновлюваних ресурсів для вивчення C++ на [цій сторінці вікі](https://community.kde.org/Get_Involved/development/Learn#C_and_C++).

source: If you are looking for a more guided approach to learning, [the QMLBook](https://qmlbook.github.io/) is a great place to start.
eo: Se vi serĉas pli gviditan aliron al lernado, [la QMLBook](https://qmlbook.github.io/) estas bonega loko por komenci.
es: Si está buscando un enfoque de aprendizaje más guiado [el QMLBook](https://qmlbook.github.io/) es un buen punto de partida.
fr: Si vous recherchez une approche plus encadrée de l'apprentissage, le [QMLBook](https://qmlbook.github.io/) est un excellent point de départ.
nl: Als u zoekt naar een meer geleide benadering van leren, is [the QMLBook](https://qmlbook.github.io/) een prachtige plaats om te beginnen.
pl: Jeśli szukasz bardziej prowadzonej nauki, to [QMLBook](https://qmlbook.github.io/) jest dobrym miejscem, aby zacząć.
pt: Se estiver à procura de uma abordagem mais guiada para a aprendizagem, o [QMLBook](https://qmlbook.github.io/) é um bom ponto de partida.
sl: Če iščete bolj voden pristop k učenju, je [QMLBook](https://qmlbook.github.io/) odličen kraj za začetek.
sv: Om du letar efter en mer guidad metod för lärande, är [QMLBook](https://qmlbook.github.io/) en utmärkt plats att börja.
uk: Якщо ви шукаєте більш цілеспрямований підхід до вивчення питань, чудовим початком буде читання [QMLBook](https://qmlbook.github.io/).

source: Kirigami apps are typically organized in pages by using [Kirigami.Page](docs:kirigami2;Page). Pages are the different "screens" of an app. You will want to have a page dedicated to specific aspects of your app's interaction, and to make things easier you can create different QML files for each page.
eo: Kirigami-aplikoj estas kutime organizitaj en paĝoj per uzado de [Kirigami.Paĝo](docs:kirigami2;Paĝo). Paĝoj estas la malsamaj "ekranoj" de aplikaĵo. Vi volas havi paĝon dediĉitan al specifaj aspektoj de la interago de via programo, kaj por faciligi la aferojn vi povas krei malsamajn QML-dosierojn por ĉiu paĝo.
nl: Kirigami toepassingen zijn standaard georganiseerd in pagina's door [Kirigami.Page](docs:kirigami2;Page) te gebruiken. Pagina's zijn de verschillende "schermen" van een toepassing. U zult een pagina willen hebben gericht op specifieke aspecten van de interactie met uw toepassing en om de zaken eenvoudiger te maken kunt u verschillende QML bestanden aanmaken, één voor elke pagina.
sv: Kirigami-program är typiskt organiserade i sidor genom att använda [Kirigami.Page](docs:kirigami2;Page). Sidor är de olika "skärmarna" i ett program. Du bör ha sidor tillägnade till specifika aspekter i programmets interaktion, och för att göra saker och ting lättare kan du skapa olika QML-filer för varje sida.
uk: Програми Kirigami типово поділено на сторінки за допомогою [Kirigami.Page](docs:kirigami2;Page). Сторінки є різними ‘екранами' програми. Вам знадобляться сторінки, кожну з яких присвячено певним аспектам взаємодії із вашою програмою, і, щоб полегшити справу, ви можете створити різні файли QML, кожен з яких міститиме код для окремої сторінки.

source: Pages are organized in a [page stack](docs:kirigami2;AbstractApplicationWindow::pageStack) where they can be pushed and popped. On a phone only the top-most page is shown, whereas on a larger screen (desktop or tablet), if desired, multiple pages can be shown next to each other.
eo: Paĝoj estas organizitaj en [paĝa stako](docs:kirigami2;AbstractApplicationWindow::pageStack) kie ili povas esti puŝitaj kaj ŝtopitaj. Sur telefono nur la plej supra paĝo estas montrata, dum sur pli granda ekrano (skribotablo aŭ tablojdo), se vi volas, pluraj paĝoj povas esti montritaj unu apud la alia.
nl: Pagina's zijn georganiseerd in een [paginastapel](docs:kirigami2;AbstractApplicationWindow::pageStack) waar ze ingestopt en uitgehaald kunnen worden. Op een telefoon wordt alleen de bovenste pagina getoond, terwijl op een groter scherm (bureaublad of tablet), indien gewenst, meerdere pagina's naast elkaar getoond kunnen worden.
sv: Sidor organiseras i en [sidstapel](docs:kirigami2;AbstractApplicationWindow::pageStack) där de kan läggas till eller tas bort. På en telefon visas bara den översta sidan, medan på en större skärm (skrivbordsdator eller surfplatta) kan flera sidor visas intill varandra om så önskas.
uk: Сторінки упорядковано у [стос сторінок](docs:kirigami2;AbstractApplicationWindow::pageStack), до якого можна заштовхувати сторінки і з якого можна ці сторінки виштовхувати. На телефоні буде показано лише верхню сторінку, а на пристроях із більшим екраном (комп'ютері або планшеті) може бути показано, якщо потрібно, декілька сторінок, поруч одна з одною.

source: A [Kirigami.Page](docs:kirigami2;Page) inherits from a [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), and as such you can use the latter's properties as well.
eo: [Kirigami.Paĝo](docs:kirigami2;Paĝo) heredas de [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), kaj kiel tia vi povas uzi ankaŭ la lastan propraĵojn.
nl: Een [Kirigami.Page](docs:kirigami2;Page) erft van een [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), en als zodanig kunt u ook de eigenschappen van de laatste gebruiken.
pt: Uma [Kirigami.Page](docs:kirigami2;Page) herda de uma [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page) e, como tal, poderá usar as propriedades da última da mesma forma.
sv: [Kirigami.Page](docs:kirigami2;Page) ärver från [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), och därmed kan du också använda den senares egenskaper.
uk: [Kirigami.Page](docs:kirigami2;Page) успадковує від [Controls.Page](docs:qtquickcontrols;QtQuick.Controls.Page), отже ви можете скористатися і властивостями останньої.

source: We make our application start to our [Kirigami.Page](docs:kirigami2;Page). All we have included in it is a label containing "Hello World", but we're going to spruce things up a little.
eo: Ni igas nian aplikaĵon komenciĝi al nia [Kirigami.Paĝo](docs:kirigami2;Paĝo). Ĉio, kion ni enmetis en ĝi, estas etikedo enhavanta "Saluton Mondo", sed ni iom plibonigos aferojn.
nl: We zorgen dat onze toepassing start op onze [Kirigami.Page](docs:kirigami2;Page). Alles wat we erin hebben ingevoegd is een label met "Hello World" erin, maar we gaan de zaken een beetje opfleuren.
pt: Faremos com que a nossa aplicação comece com a nossa [Kirigami.Page](docs:kirigami2;Page). Tudo o que temos incluído nela é um texto que diz 'Hello World', mas iremos apurar as coisas um pouco mais.
sv: Vi gör så att vårt program startar på vår [Kirigami.Page](docs:kirigami2;Page). Allt vi har inkluderat på den är en beteckning som innehåller "Hello World", men vi kommer att piffa upp den lite grand.
uk: Наша програма запускатиметься з [Kirigami.Page](docs:kirigami2;Page). Усе, що ми включили до цієї сторінки — це мітка «Hello World», але ми маємо намір дещо розширити ці можливості.

source: The idea behind our app is that we're going to be able to display a bunch of countdowns to the user. The problem with a normal [Kirigami.Page](docs:kirigami2;Page) is that it has a fixed vertical size, so instead we can use a [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), which already comes with its own built-in scrollbar.
eo: La ideo malantaŭ nia programo estas, ke ni povos montri amason da retronombradoj al la uzanto. La problemo kun normala [Kirigami.Paĝo](docs:kirigami2;Paĝo) estas, ke ĝi havas fiksan vertikalan grandecon, do anstataŭe ni povas uzi [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), kiu jam venas kun sia propra enkonstruita rulumbreto.
nl: Het idee achter onze toepassing is dat we in staat zullen zijn om een aantal aftellingen aan de gebruiker te tonen. Het probleem met een normale [Kirigami.Page](docs:kirigami2;Page) is dat het een vaste verticale grootte heeft, dus in plaats daarvan gebruiken we [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), die al komt met zijn eigen ingebouwde schuifbalk.
sv: Idén bakom vårt program är att vi ska kunna visa ett antal nedräknare för användaren. Problemet med en normal [Kirigami.Page](docs:kirigami2;Page) är att den har en fast vertikal storlek, så istället kan vi använda en [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), som redan levereras med sin egen inbyggda rullningslist.
uk: Ідея нашої програми полягає у можливості показу користувачеві декількох відліків. Проблема звичайного об'єкта [Kirigami.Page](docs:kirigami2;Page) полягає у тому, що він має фіксований вертикальний розмір, тому, замість цього, ми можемо скористатися [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage), частиною якого вже є власна вбудована смужка гортання.

source: Kirigami pages also feature neat titles placed within the toolbar, quickly indicating to the user which page they are on. All we need to do is to set a page title using the `title` property of [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). In this case, we used one of the `i18nc()` functions we explored in our previous tutorial to this end.
eo: Kirigami-paĝoj ankaŭ prezentas bonordajn titolojn metitaj ene de la ilobreto, rapide indikante al la uzanto sur kiu paĝo ili estas. Ĉio, kion ni devas fari, estas agordi paĝotitolon per la `titolo`-propreco de [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). En ĉi tiu kazo, ni uzis unu el la funkcioj `i18nc()`, kiujn ni esploris en nia antaŭa lernilo tiucele.
es: Las páginas de Kirigami también cuentan con títulos claros situados dentro de la barra de herramientas que le indican rápidamente al usuario en qué página se encuentra. Todo lo que tenemos que hacer es definir un título de página usando la propiedad `title` de [Kirigami.ScrollablePage(docs:kirigami2;ScrollablePage)]. En este caso, usamos una de las funciones `i18nc()` que exploramos en nuestro tutorial anterior para este fin.
nl: Kirigami pagina's hebben ook nette titels geplaatst in de werkbalk, snel aan de gebruiker laten zien in welke pagina zij zijn. Alles wat we moeten doen is een paginatitel instellen met de eigenschap `title` van [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). In dit geval, gebruikten we er een van de functies `i18nc()`, die we hiervoor bekeken hebben in onze vorige inleiding.
pt: As páginas do Kirigami também possuem títulos bonitos dentro da barra de ferramentas, que indicam rapidamente ao utilizador em que página ele se encontra. Tudo o que tem a fazer é definir um título para a página com a propriedade `title` do [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Neste caso, foi usada uma das funções `i18nc()` que explorámos no nosso tutorial anterior para este fim.
sv: Kirigami-sidor har också snygga titlar placerade inne i verktygsraden, som snabbt anger för användaren vilken sida de är på. Allt vi behöver göra är att ställa in en sidtitel genom att använda egenskapen `title` i [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). Här använder vi en av `i18nc()` funktionerna som vi utforskade i vår förra handledning i detta syfte.
uk: У сторінок Kirigami також є чудові заголовки, які розташовуються на панелі інструментів, надаючи користувачеві дані щодо того, з якою сторінкою він працює. Нам достатньо встановити заголовок сторінки за допомогою властивості `title` об'єкта [Kirigami.ScrollablePage](docs:kirigami2;ScrollablePage). У цьому випадку ми використали одну з функцій `i18nc()`, які обговорювали у одному з попередніх розділів підручника.

source: Using separate files
eo: Uzante apartajn dosierojn
nl: Aparte bestanden gebruiken
sv: Använda separata filer
uk: Користування окремими файлами

source: If we move the code to a separate files, then, there is no point in leaving it enveloped in a Component: we can split just the [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) in the separate file. Here is the resulting `KountdownDelegate.qml`:
eo: Se ni movas la kodon al apartaj dosieroj, do ne utilas lasi ĝin envolvita en Komponento: ni povas dividi nur la [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) en la aparta dosiero. Jen la rezulta `KountdownDelegate.qml`:
nl: Als we de code in separate bestanden verplaatsen, dan is er geen reden om ze ingepakt in een Component te laten: we kunnen gewoon de [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) in het separate bestand uitsplitsen. Hier is het resulterende `KountdownDelegate.qml`:
sv: Om vi ​​flyttar koden till en separat fil, är det ingen mening att lämna den inkapslad i en komponent: vi kan bara dela upp [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) i den separata filen. Här är den resulterande `KountdownDelegate.qml`:
uk: Якщо ми пересуваємо код до окремих файлів, немає сенсу в огортанні у Component: ми можемо просто вирізати [Kirigami.AbstractCard](docs:kirigami2;AbstractCard) до окремого файла. Ось результат у `KountdownDelegate.qml`:

source: Colors
eo: Koloroj
es: Colores
fr: Couleurs
nl: Kleuren
pl: Barwy
pt: Cores
sl: Barve
sv: Färger
uk: Кольори

source: Primitive components such as [Rectangle](docs:qtquick;QtQuick.Rectangle) should always be colored with the color palette provided by Kirigami via the [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) attached property.
eo: Primivaj komponantoj kiel [Rektangulo](docs:qtquick;QtQuick.Rectangle) ĉiam estu kolorigitaj per la kolorpaletro provizita de Kirigami per la kuna propreco [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme).
es: Los componentes primitivos, como [Rectangle](docs:qtquick;QtQuick.Rectangle), siempre se deben colorear con la paleta de colores proporcionada por Kirigami a través de la propiedad adjunta [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme).
nl: Primitieve componenten zoals [Rectangle](docs:qtquick;QtQuick.Rectangle) zouden altijd gekleurd moeten zijn met het kleurpalet geleverd door Kirigami via de aangehangen eigenschap [Kirigami.Thema](docs:kirigami2;Kirigami::Platform::PlatformTheme).
sv: Primitiva komponenter såsom [Rectangle](docs:qtquick;QtQuick.Rectangle) ska alltid färgläggas med färgpaletten som tillhandahålls av Kirigami via den bifogade egenskapen [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme).
uk: Примітивні компоненти, зокрема [Rectangle](docs:qtquick;QtQuick.Rectangle), завжди має бути розфарбовано з використанням палітри кольорів, яка надається Kirigami за допомогою долученої властивості [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme).

source: Hardcoded colors in QML, such as `#32b2fa` or `red`, should usually be avoided; if it is really necessary to have elements with custom colors, it should be an area where only custom colors are used (usually in the content area of the app, and never in chrome areas such as toolbars or dialogs). For instance, a hardcoded `black` foreground cannot be used over a [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::Platform::PlatformTheme::backgroundColor) background, because if the platform uses a dark color scheme the result will have poor contrast with black over almost black. This is an accessibility issue and should be avoided.
eo: Malmolkodigitaj koloroj en QML, kiel ekzemple `#32b2fa` aŭ `ruĝa`, devus kutime esti evititaj; se vere necesas havi elementojn kun kutimaj koloroj, ĝi devus esti areo kie nur kutimaj koloroj estas uzataj (kutime en la enhavareo de la apo, kaj neniam en kromaj areoj kiel ilobretoj aŭ dialogoj). Ekzemple, malmola kodita `nigra` malfono ne povas esti uzata super fono [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::Platform::PlatformTheme::backgroundColor), ĉar se la platformo uzas malhelan kolorskemon la rezulto havos malbonan kontraston kun nigra super preskaŭ nigra. Ĉi tio estas problemo de alirebleco kaj devus esti evitita.
nl: Hard gecodeerde kleuren in QML, zoals `#32b2fa` of `red` zouden gewoonlijk vermeden moeten worden; als het echt noodzakelijk is om elementen met aangepaste kleuren te hebben, zou het in een gebied moeten zijn waar alleen aangepaste kleuren zijn gebruikt (gewoonlijk in het inhoudsgebied van de toepassing en nooit in het chroomgebieden zoals werkbalken of dialogen). Bijvoorbeeld, een hard gecodeerd `black` als voorgrond kan niet gebruikt worden over een [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::Platform::PlatformTheme::backgroundColor) achtergrond, omdat als het platform een donker kleurenschema gebruikt het resultaat er slecht uitziet met contrast tussen zwart en bijna zwart.
sv: Hårdkodade färger i QML, såsom `#32b2fa` eller `red` ska oftast undvikas. Om det verkligen är nödvändigt att ha element med egna färger, ska det vara ett område där bara egna färger används (oftast i programmets innehållsområde och aldrig i omgivningen som verktygsrader eller dialogrutor). Exempelvis kan inte en hårdkodad `black` förgrund användas över en [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::Platform::PlatformTheme::backgroundColor) bakgrund, eftersom om plattformen använder ett mörkt färgschema har resultatet dålig kontrast med svart ovanpå nästan svart. Det är en tillgänglighetsfråga och bör undvikas.
uk: У коді QML, зазвичай, слід уникати жорстко прописаних кольорів, зокрема `#32b2fa` або `red`. Якщо у елементах із нетиповими кольорами справді є потреба, це має бути область, де використовуються лише нетипові кольори (зазвичай, область показу даних програми, — ніколи не обрамлення, зокрема панелі інструментів або діалогові вікна). Наприклад, не можна використовувати жорстко прописаний колір переднього плану `black` над кольором тла [Kirigami.Theme.backgroundColor](docs:kirigami2;Kirigami::Platform::PlatformTheme::backgroundColor), оскільки якщо у платформі використано темну схему кольорів, результат матиме погану контрастність із чорним кольором над майже чорним кольором. Слід уникати цієї проблеми із доступністю.

source: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) is an attached property, and therefore it is available to use for any QML item. Its properties include all the colors available in the palette, and what palette to use, such as the [colorSet](docs:kirigami2;Kirigami::Platform::PlatformTheme::colorSet) property.
eo: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) estas kuna propreco, kaj tial ĝi estas uzebla por iu ajn QML-aĵo. Ĝiaj proprecoj inkluzivas ĉiujn kolorojn disponeblajn en la paletro, kaj kian paletron uzi, kiel ekzemple la propreco [colorSet](docs:kirigami2;Kirigami::Platform::PlatformTheme::colorSet).
nl: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) is een aangehangen eigenschap en is daarom beschikbaar voor gebruik in elk QML item. Het bevat als eigenschap alle kleuren beschikbaar in het palet, zoals eigenschap [colorSet](docs:kirigami2;Kirigami::Platform::PlatformTheme::colorSet).
sv: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) är en bifogad egenskap, och är därför tillgänglig för användning i alla QML-objekt. Den innehåller alla tillgängliga färger som egenskaper i paletten, och vilken palett som ska användas, som egenskapen [colorSet](docs:kirigami2;Kirigami::Platform::PlatformTheme::colorSet).
uk: [Kirigami.Theme](docs:kirigami2;Kirigami::Platform::PlatformTheme) є долученою властивістю, тому нею можна користуватися у будь-якому записі QML. Вона містить як властивості усі доступні кольори палітри і дані щодо палітри, яку має бути використано зокрема у властивості [colorSet](docs:kirigami2;Kirigami::Platform::PlatformTheme::colorSet).
