Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The choice between using this view with `Kirigami.AbstractCard` components or a conventional `ListView` with [`AbstractListItem`](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) components is purely an aesthetic one.
fr: Le choix entre l'utilisation de cet affichage avec les composants « Kirigami.AbstractCard » ou de d'un objet conventionnel « ListView » avec des composants [ « AbstractListItem » ](docs:kirigami2;AbstractListItem) / [BasicListItem](docs:kirigami2;BasicListItem) est purement un choix d'esthétique.
pl: W wyborze pomiędzy używaniem tego widoku ze składnikiem `Kirigami.AbstractCard` lub zwykłym widokiem `ListView` ze składnikami [`AbstractListItem`](docs:kirigami2;AbstractListItem)/[BasicListItem](docs:kirigami2;BasicListItem) rozchodzi się tylko o wygląd.

source: ![Screenshot of a CardsListView](/docs/use/kirigami/components-card/cardslistview.png)
fr: ![Copie d'écran de l'affichage de cartes en grille](/docs/use/kirigami/components-card/cardsgridview.png)

source: Use a [`Kirigami.CardsGridView`](docs:kirigami2;org::kde::kirigami::CardsGridView) to display cards in a grid.
fr: Utilisez un objet [ « Kirigami.CardsGridView » ](docs:kirigami2;org::kde::kirigami::CardsGridView) pour afficher des cartes dans une grille.
pl: Użyj [`Kirigami.CardsGridView`](docs:kirigami2;org::kde::kirigami::CardsGridView), aby wyświetlić karty w siatce.

source: Its behavior is the same as a `Kirigami.CardsLayout`, and it allows cards to be put in one or two columns depending on the available width.
fr: Son comportement est le même que celui de la propriété « Kirigami.CardsLayout ». Il permet de placer des cartes sur une ou deux colonnes en fonction de la largeur disponible.
pl: Jego zachowanie jest takie same jak `Kirigami.CardsLayout` i umożliwia umieszczenie kart w jednej lub dwóch kolumnach w zależności od dostępnej szerokości.

source: CardsGridView has the limitation that every card must have the same exact height, so `cellHeight` must be manually set to a value for which the content must fit for every child card.
fr: L'objet « CardsGridView » présente une limitation puisque chaque carte doit avoir exactement la même hauteur, donc la propriété « cellHeight » doit être manuellement définie avec une valeur selon laquelle le contenu doit s'adapter pour chaque carte fils.
pl: CardsGridView ma to ograniczenie, że każda karta musi mieć dokładnie tę samą wysokość, więc `cellHeight` trzeba ustawić ręcznie na wartość, dla której treść musi zmieścić się dla każdej karty podrzędnej.

source: If possible use `Kirigami.CardsGridView` only when you need to instantiate many cards. If you are only going to instantiate a few cards, opt for a `Kirigami.CardsLayout` with a `Repeater` instead.
fr: Si possible, n'utilisez « Kirigami.CardsGridView » que lorsque vous avez besoin d'instancier de nombreuses cartes. Si vous n'avez l'intention d'instancier que quelques cartes, optez plutôt pour un module « Kirigami.CardsLayout » avec un objet « Repeater ».
pl: Jeśli to możliwe, to używaj tylko `Kirigami.CardsGridView`, gdy potrzebujesz stworzyć wiele kart. Jeśli potrzebujesz tylko kilku kart, to użyj `Kirigami.CardsLayout` ze składnikiem `Repeater`.

source: Model with the following roles: text, actions and image
fr: Modèle avec les rôles suivants : texte, actions et image
pl: Model o następujących rolach: text, actions oraz image
pt: Modelo com os seguintes papéis: texto, acções e imagem

source: ![Screenshot of a CardsGridView](/docs/use/kirigami/components-card/cardsgridview.png)
fr: ![Copie d'écran de l'affichage de cartes en grille](/docs/use/kirigami/components-card/cardsgridview.png)

source: Kirigami offers a wide selection of different interactive elements that you can use in your applications. Each different type has slightly different interaction styles, visual styles, and functionality. Using the right type of control in your application can help make your user interface more responsive and intuitive.
fr: Kirigami offre une large sélection de différents éléments interactifs que vous pouvez utiliser dans vos applications. Chaque type a des styles d'interaction, des styles visuels et des fonctionnalités légèrement différents. L'utilisation du bon type de contrôle dans votre application peut contribuer à rendre votre interface utilisateur plus réactive et intuitive.
pl: Kirigami daje szeroki wybór różnych rzeczy, które umożliwiają oddziaływanie z twoją aplikacją. Każda rzecz umożliwia trochę inne oddziaływanie, trochę inaczej wygląda i trochę inaczej działa. Użycie właściwej rzeczy w swojej aplikacji może ci pomóc stworzyć bardziej żywy i intuicyjny interfejs.
pt: O Kirigami oferece uma grande selecção de diferentes elementos interactivos que poderá usar nas suas aplicações. Cada tipo diferente tem estilos de interacção ligeiramente diferentes, estilos visuais e funcionalidades. O uso do tipo correcto de controlo na sua aplicação podê-lo-á ajudar a tornar a sua interface de utilizador mais adaptativa e intuitiva.

source: In Kirigami apps, we use buttons from QtQuick Controls. Using them is pretty straightforward: we set the text to the `text` property and any action we want it to perform is set to the `onClicked` property.
fr: Dans les applications avec Kirigami, nous utilisons les boutons de QtQuick Controls. Leur utilisation est assez simple. Nous définissons le texte avec la propriété « text » et toute action que nous voulons qu'il réalise est définie par la propriété « onClicked ».
pl: W aplikacjach Kirigami, używamy przycisków z QtQuick Controls. Używanie ich jest całkiem proste: ustawiamy tekst we właściwości `text` i dowolne działanie jakie chcemy, aby wykonał na właściwości `onClicked`.

source: ![A freshly-clicked button](/docs/use/kirigami/components-controls/controls-button.png)
fr: ![Un bouton fraîchement cliqué](/docs/use/kirigami/components-controls/controls-button.png)

source: Buttons' behaviour can be changed to make them toggleable: in this mode, they will stay pressed until clicked on once more. This mode can be activated by setting the `checkable` property to `true`; we can also set buttons to be toggled on by default by setting the `checked` property to `true`.
fr: Le comportement des boutons peut être modifié pour les rendre basculants. Dans ce mode, ils resteront enfoncés jusqu'à ce que vous cliquiez à nouveau dessus. Ce mode peut être activé en attribuant la valeur « True » à la propriété « checkable ». Nous pouvons aussi définir ces boutons comme basculant par défaut en donnant à la propriété « checked » la valeur « True ».
pl: Zachowanie przycisków można zmienić tak, aby stały się przestawialne: w tym trybie, pozostaną naciśnięte do ponownego naciśnięcia. Ten tryb można włączyć, ustawiając właściwość `checkable` na `true`; możemy także ustawić przyciski, aby przełączały się domyślnie, ustawiając właściwość `checked` na `true`.

source: We can get the most out of toggleable buttons by using the `onCheckedChanged` property. It works similarly to `onClicked`, except here the assigned action will be executed when the button's `checked` property changes. `checked` is a boolean property, which can come in handy for specific use-cases.
fr: Nous pouvons tirer le meilleur parti des boutons à basculement en utilisant la propriété « onCheckedChanged ». Son fonctionnement est similaire à celui de la propriété « onClicked », sauf qu'ici, l'action assignée sera exécutée lorsque la propriété « checked » du bouton changera. Cette propriété « checked » est booléenne, ce qui peut s'avérer utile dans certains cas.
pl: Z przestawianych przycisków uzyskamy najwięcej, używając właściwości `onCheckedChanged`. Działa ona podobnie do `onClicked`, z tym, że przypisane działanie zostanie wykonane, gdy zmianie ulegnie właściwość `checked`. `checked` jest właściwością logiczną, która może się przydać w szczególnych przypadkach.

source: In this example, we set the visibility of an in-line drawer according to the status of a toggleable button:
fr: Dans cet exemple, nous définissons la visibilité d'un tiroir intégré selon l'état d'un bouton à basculement :
pl: W tym przykładzie, ustawimy widoczność półki w wierszu w zależności od stanu przycisku przełączanego:

source: ![A toggleable button](/docs/use/kirigami/components-controls/controls-togglebutton.png)
fr: ![Un bouton à bascule](/docs/use/kirigami/components-controls/controls-togglebutton.png)

source: With the default Breeze theme in KDE Plasma it can be hard to tell whether a button is toggled, since buttons are coloured blue when they are clicked on. Make sure you take this into account when creating your application: a different control might be more user-friendly.
fr: Avec le thème Breeze par défaut de KDE Plasma, il peut être difficile de savoir si un bouton est activé ou non.En effet, les boutons sont colorés en bleu lorsqu'on clique dessus. Veuillez en tenir compte lors de la création de votre application : un contrôle différent pourrait être plus convivial.
pl: Przy domyślnym wyglądzie Bryzy w Plazmie KDE może być trudno rozróżnić, czy przycisk jest włączony, gdyż przyciski są barwione na niebiesko, gdy są naciskane. Upewnij się, że uwzględnisz to przy tworzeniu aplikacji: inna rzecz obsługująca może być bardziej przyjazna użytkownikowi.

source: There is a specific button type meant for use in toolbars, `Controls.ToolButton`. The most obvious difference between this and a conventional button is the styling, with toolbuttons being flat (though this is alterable with the boolean property `flat`).
fr: Il y a un type spécifique de bouton dédié pour leur utilisation dans les barres d'outils, « Controls.ToolButton ». La différence la plus évidente entre celui-ci et un bouton conventionnel est l'apparence, par rapport à des boutons d'outils qui sont plats (Même si cela peut être modifié avec la propriété de type booléen « flat »).
pl: istnieje szczególny rodzaj przycisku przeznaczony do użycia na paskach narzędzi, `Controls.ToolButton`. Najoczywistszą różnicą pomiędzy tym i zwykłym przyciskiem jest wygląd, gdzie przyciski toolbuttons są płaskie (jednakże można to zmienić poprzez właściwość logiczną `flat`).

source: ![A tool button](/docs/use/kirigami/components-controls/controls-toolbutton.png)
fr: ![Un bouton pour les outils](/docs/use/kirigami/components-controls/controls-toolbutton.png)

source: Checkboxes are meant for options where the choices are non-exclusive and where each option has a clear alternative.
fr: Les cases à cocher sont destinées à des options dont les choix sont non exclusifs et où chaque option a une alternative claire.
pl: Pola zaznaczane są przeznaczone dla ustawień, w których wybór jest niewykluczający się i w których każde ustawienie ma jasny zamiennik.

source: ![A set of checkboxes](/docs/use/kirigami/components-controls/controls-checkbox.png)
fr: ![Un ensemble de boîtes à cocher](/docs/use/kirigami/components-controls/controls-checkbox.png)

source: As you can see, they are simple to use. The property `checked` holds a boolean value determining whether or not they have been checked.
fr: Comme vous pouvez le constater, ils sont simples à utiliser. La propriété « checked » contient une valeur booléenne déterminant si ils ont été cochés ou non.
pl: Jak widzisz, są one łatwe w użyciu. Właściwość `checked` przechowuje zmienną logiczną, określającą czy zostały one zaznaczone, czy nie.

source: Radio buttons are designed for situations where the user must choose one option from a set of several options.
fr: Les boutons radio sont conçus pour les situations dans lesquelles l'utilisateur doit choisir une option parmi un ensemble de plusieurs.
pl: Przyciski radio są stworzone dla przypadków, w których użytkownik musi wybrać jedno ustawienie z zestawu kilku ustawień.

source: Like checkboxes, they can be set to be checked or unchecked by default with the `checked` property.
fr: Comme les cases à cocher, ils peuvent être activés ou désactivés par défaut avec la propriété « checked ».
pl: Tak jak pola zaznaczane, można je ustawić na domyślnie zaznaczone lub niezaznaczone poprzez właściwość `checked`.

source: ![A set of radio buttons](/docs/use/kirigami/components-controls/controls-radiobutton.png)
fr: ![Un ensemble de boutons radio](/docs/use/kirigami/components-controls/controls-radiobutton.png)

source: Switches are primarily designed for use on mobile devices.
fr: Les commutateurs sont principalement conçus pour être utilisés sur des périphériques mobiles.
pl: Przełączniki zostały stworzone główne z myślą o urządzeniach przenośnych.

source: On the desktop, changing settings usually involves changing the setting and then applying the setting by clicking on an 'Apply' or 'OK' button. On mobile, we can use switches instead.
fr: Sur un ordinateur de bureau, la modification des paramètres implique généralement de modifier la configuration, puis de l'appliquer en cliquant sur un bouton « Appliquer » ou « Ok ». Sur les téléphones mobiles, nous pouvons utiliser des commutateurs, de façon alternative.
pl: Na komputerach biurkowych, zmiana ustawień zazwyczaj wiąże się ze zmianą ustawienia, a następnie naciśnięciem przycisku 'Zastosuj' lub 'OK'. Na urządzeniach przenośnych możemy możemy do tego użyć przełączników.

source: Switches can be toggled between an on and off state. They can be clicked or tapped on to toggle them, or they can be dragged towards the 'on' or 'off' position. Once again, switches can be set to be on or off by default with the `checked` property.
fr: Les commutateurs peuvent être basculés entre des états activé ou désactivé. Ils peuvent être cliqués ou tapotés pour changer leurs états, ou ils peuvent être glissés vers une position activée ou désactivée. Une fois de plus, ces commutateurs peuvent être définis activés ou désactivés par défaut avec la propriété « checked ».
pl: Przełączniki można przełączać pomiędzy stanami włączenia i wyłączenia. Można je nacisnąć lub stuknąć, aby je przełączyć, można je także przeciągać do położeń 'włączony' lub 'wyłączony'. Przełączniki można ustawić, aby domyślnie były włączone lub wyłączone przy użyciu właściwości `checked`.

source: ![A set of switches](/docs/use/kirigami/components-controls/controls-switch.png)
fr: ![Un ensemble de commutateurs](/docs/use/kirigami/components-controls/controls-switch.png)

source: Sliders allow users to select certain values by sliding a handle along a track. Thanks to QtQuick Controls, there are several types that you can choose from depending on the values you'd like your users to choose from in your application.
fr: Les curseurs permettent aux utilisateurs de sélectionner certaines valeurs en les faisant glisser grâce à une poignée le long d'un axe. Grâce à QtQuick Controls, il existe plusieurs types de curseurs parmi lesquels vous pouvez choisir selon selon les valeurs que vous souhaitez que vos utilisateurs choisissent dans votre application.
pl: Suwaki umożliwiają użytkownikom zaznaczenie pewnych wartości poprzez przesuwanie uchwytu wzdłuż szyny. Dzięki QtQuick Controls, istnieje kilka rodzajów do wyboru w zależności od tego jakie wartości chcesz, aby użytkownik mógł wybrać w twojej aplikacji.

source: A standard slider provides the user with very fine control over the selection they wish to make.
fr: Un curseur standard offre à l'utilisateur un contrôle très fin de la sélection qu'il souhaite effectuer.
pl: Standardowy suwak daje użytkownikom bardzo dokładną możliwość przesuwania.

source: By default, sliders go left to right to increase (and bottom up to increase when vertical). The coloration provides a visual indicator of how large the value you are selecting is.
fr: Par défaut, les curseurs vont de gauche à droite pour augmenter (et de bas en haut pour augmenter lorsqu'ils sont verticaux). La coloration fournit un indicateur visuel de l'importance de la valeur que vous sélectionnez.
pl: Domyślnie, suwaki idą od lewej do prawej, aby coś zwiększyć (oraz z dołu do góry, aby coś zwiększyć w pionie). Zabarwienie wzrokowo wskazuje jak dużą wartość wybierasz.

source: `value`: contains the value at which the handle is placed, and can also be set manually to provide a default starting value
fr: « value » : contient la valeur à laquelle la poignée est placée. Elle peut également être définie manuellement pour fournir une valeur de départ par défaut.
pl: `value`: zawiera wartość, przy której umieszczony jest uchwyt i która może być ustawiona ręcznie, aby określić domyślną wartość początkową

source: `to`: defines the range of the slider by specifying the maximum value it can go to
fr: « to » : définit la portée du curseur en spécifiant la valeur maximale à laquelle il peut aller.
pl: `to`: określa zakres suwaka, określając największą dopuszczalną wartość, którą może osiągnąć

source: `orientation`: allows the slider to be set to a vertical orientation with `Qt.Vertical`
fr: « orientation » : permet de définir l'orientation verticale du curseur avec « Qt.Vertical ».
pl: `orientation`: umożliwia suwakom ustawienie swojego położenia przy użyciu `Qt.Vertical`

source: ![A set of sliders](/docs/use/kirigami/components-controls/controls-sliders.png)
fr: ![Un ensemble de curseurs](/docs/use/kirigami/components-controls/controls-sliders.png)

source: Another useful property we can use is `stepSize`. Setting this to a numerical value allows us to create a slider that snaps onto values that are multiples of the specified `stepSize`, with these multiples being indicated by tickmarks. Therefore if we set this property to `2.0`, when the user drags the slider handle, they will only be able to select `0.0`, `2.0`, `4.0`, etc. up to the value specified in the `to` property.
fr: Une autre propriété utile que nous pouvons utiliser est « stepSize ». En lui attribuant une valeur numérique, nous pouvons créer un curseur paramétré grâce à des valeurs multiples du paramètre « stepSize » spécifié, ces multiples étant indiqués par des signets. Par conséquent, si nous donnons à cette propriété la valeur « 2.0 », lorsque l'utilisateur fera glisser la poignée du curseur, il ne pourra sélectionner que « 0.0 », « 2.0 », « 4.0 », etc. jusqu'à la valeur spécifiée dans la propriété « to ».
pl: Kolejną użyteczną własnością, której możemy użyć, jest `stepSize`. Ustawienie tego na wartość numeryczną umożliwia nam utworzenie suwaka, który przyciąga się do wartości, które są wielokrotnością danego `stepSize`, gdzie wielokrotności te są oznaczane kresami. Stąd, jeśli ustawimy tę wartość na `2.0`, to gdy użytkownik przeciągnie uchwyt suwaka, to będzie w stanie zaznaczyć `0.0`, `2.0`, `4.0`, itd. aż do wartości określonej we właściwości `to`.

source: ![A set of tickmarked sliders](/docs/use/kirigami/components-controls/controls-tickmarkedsliders.png)
fr: ![Un ensemble de curseurs gradués](/docs/use/kirigami/components-controls/controls-tickmarkedsliders.png)

source: Range slider
fr: Curseur d'intervalle
pl: Suwak zakresu

source: QtQuick Controls also provides ranged sliders. These have two handles, hence allowing you to define a range of numbers between the two handles.
fr: QtQuick Controls fournit également des curseurs avec intervalles. Ceux-ci ont deux poignées, vous permettant ainsi de définir un intervalle de numéros entre les deux poignées.
pl: QtQuick Controls dostarcza także suwaków zakresu. Mają one dwa uchwyty, które umożliwiają określenie zakresu liczb pomiędzy dwoma uchwytami.

source: Two new properties are important to keep in mind: `first.value` and `second.value`, which hold the values of the two handles. Like the `value` property of the standard sliders, these can be pre-set.
fr: Il est important de conserver à l'esprit deux nouvelles propriétés : « first.value » et « second.value », contenant les valeurs des deux poignées. Comme la propriété « value » des curseurs standard, elles peuvent être prédéfinies.
pl: Ważne, aby zapamiętać dwie nowe właściwości: `first.value` oraz `second.value`, które przechowują wartości dwóch uchwytów. Można je nastawić, tak samo jak właściwość `value` zwyczajnych suwaków.

source: ![A set of range sliders](/docs/use/kirigami/components-controls/controls-rangesliders.png)
fr: ![Une ensemble de curseurs d'intervalle](/docs/use/kirigami/components-controls/controls-rangesliders.png)

source: We can also make it a tickmarked slider by setting the `stepSize` property value to a number, in the exact same way as a standard slider.
fr: Nous pouvons également en faire un curseur gradué en fixant la valeur de la propriété « stepSize » à un nombre, de la même manière qu'un curseur standard.
pl: Możemy także stworzyć suwak z kresami poprzez ustawienie właściwości `stepSize` na jakąś liczbę, w ten sam sposób, co w zwyczajnym suwaku.

source: `Kirigami.GlobalDrawer` components are what we use to create such drawers. These are set to the `globalDrawer` property of the `Kirigami.ApplicationWindow` that forms the basis of our Kirigami application.
fr: Les composants « Kirigami.GlobalDrawer » sont ceux que nous utilisons pour créer de tels tiroirs. Ils sont définis sur la propriété « globalDrawer » du composant « Kirigami.ApplicationWindow » constituant la base de notre application sous Kirigami.
pl: Składniki `Kirigami.GlobalDrawer` są tymi, których używamy do tworzenia takich półek. Są one ustawione na właściwość `globalDrawer` składnika `Kirigami.ApplicationWindow`, która tworzy podstawę naszej aplikacji Kirigami.

source: ![Our new global drawer](/docs/use/kirigami/components-drawers/globaldrawer_simple.png)
fr: ![Un nouveau tiroir global](/docs/use/kirigami/components-drawers/globaldrawer_simple.png)

source: Your chosen header component can be set with the global drawer's `header` property.
fr: Le composant d'en-tête que vous avez choisi peut être défini avec la propriété « header » du tiroir global.
pl: Twój wybrany składnik nagłówka można ustawić z właściwością globalnej półki `header`.
pt: O seu componente de cabeçalho poderá ser configurado com a propriedade `header` da área global.

source: ![Search bar header global drawer](/docs/use/kirigami/components-drawers/globaldrawer_header.png)
fr: ![Un tiroir global avec en-tête comme barre de recherche](/docs/use/kirigami/components-drawers/globaldrawer_header.png)

source: Our global drawer now shows the search bar component we set as the header.
fr: Notre tiroir global affiche maintenant le composant de la barre de recherche que nous avons défini comme en-tête.
pl: Nasza globalna półka pokazuje teraz składnik paska wyszukiwania, który ustawiliśmy jako nagłówek.

source: While panel-style global drawers can be useful in mobile environments, they might be too large on the desktop.
fr: Si les tiroirs globaux de type panneau peuvent être utiles dans les environnements mobiles, ils peuvent être trop grands sur le bureau.
pl: Podczas gdy globalne półki w postaci paneli mogą być użyteczna w środowiskach przenośnych, to mogą być zbyt duże w środowiskach urządzeń biurkowych.
pt: Embora as áreas globais do tipo painel possam ser úteis em ambientes móveis, poderão ser demasiado grandes para o computador.

source: Thankfully, Kirigami global drawers provide an `isMenu` property. When set to `true`, our global drawers turn into more traditional menus only on the desktop.
fr: Heureusement, les tiroirs globaux de Kirigami fournissent une propriété « isMenu ». Lorsqu'elle est définie à « True », nos tiroirs globaux se transforment en menus plus traditionnels uniquement sur le bureau.
pl: Na szczęście, globalne półki Kirigami posiadają właściwość `isMenu`. Gdy ustawi się ją na `true`, to nasze globalne półki zamieniają się w bardziej tradycyjne menu takie, jakie można zobaczyć na urządzeniach biurkowych.
