Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: To integrate logic into the application, we need C++ backend classes that can do the important calculations. Writing logic in the QML files is discouraged, so try to move as much as possible to the backend, so QML is purely used for displaying the user interface, which is what it is best at.
eo: Por integri logikon en la aplikaĵon, ni bezonas klasojn de backend C++, kiuj povas fari la gravajn kalkulojn. Skribi logikon en la QML-dosieroj estas malinstigita, do provu movi kiel eble plej multe al la backend, do QML estas pure uzata por montri la uzantinterfacon, kio estas tio, kion ĝi plej taŭgas.
es: Para integrar la lógica en la aplicación, necesitamos clases de motores C++ que puedan realizar los cálculos importantes. No se aconseja escribir la lógica en los archivos QML, por lo que debería intentar mover todo lo que le sea posible al motor, de modo que QML se use exclusivamente para mostrar la interfaz de usuario, que es lo que hace mejor.
fr: Pour intégrer la logique dans l'application, nous avons besoin de classes du moteur C++, pouvant effectuer les calculs importants. L'écriture de la logique dans les fichiers QML est déconseillée. Essayez donc de transférer le plus possible vers le moteur, de sorte que QML ne soit utilisé que pour afficher l'interface utilisateur, ce pour quoi il est le plus adapté.
nl: Om logica in de toepassing te integreren, hebben we C++ backend-classes nodig die de belangrijke berekeningen kan doen. Logica schrijven in de QML-bestanden wordt ontraden, probeer het dus zoveel als mogelijk naar de backend te verplaatsen, QML wordt dus puur gebruikt voor het tonen van de gebruikersinterface, waarvoor het het best geschikt is.
pl: Aby zaszyć logikę w aplikacji, potrzebujemy klas logiki programu, które będą mogły wykonywać ważne obliczenia. Odradzamy pisanie logiki w plikach QML, więc spróbuj przenieść tyle ile się da do logiki programu tak, aby QML był używany tylko do interfejsu użytkownika, w czym jest najlepszy.
pt: Para integrar a lógica na aplicação, iremos precisar das classes de infra-estrutura de C++ que conseguem fazer os cálculos importantes. O desenvolvimento de lógica nos ficheiros QML não é encorajado, pelo que deverá mover o máximo de código para a infra-estrutura, para que o QML seja praticamente usado apenas para a apresentação da interface de utilizador, que é onde ele é melhor.
sl: Za vključitev logike v aplikacijo potrebujemo razrede zaledja C++, ki lahko opravljajo pomembne izračune. Pisanje logike v QML-datoteke odsvetujemo, zato poskusite premakniti čim več na zaledje, tako da se QML uporablja izključno za prikaz uporabniškega vmesnika, kar je tisto, v čemer je najboljše.
sv: För att integrera logik i programmet behöver vi C++ bakgrundsklasser som kan utföra de viktiga beräkningarna. Att skriva logik i QML-filer avråds från, så försök att flytta så mycket som möjligt till bakgrundskoden, så att QML enbart används för att visa användargränssnittet, vilket är vad det är bäst på.
uk: Щоб інтегрувати логіку до самої програми нам знадобляться класи модуля обробки мовою C++, які зможуть виконувати важливі обчислення. Не варто вписувати логіку до самих файлів QML — слід переносити якомога більшу її частину до модуля обробки, щоб код QML використовувався лише для показу інтерфейсу користувача — того, для чого його, власне, призначено.

source: For your new backend class, create two new files called `backend.cpp` and `backend.h`. Don't forget to add the new cpp file to the executable in `src/CMakeLists.txt`, next to main.cpp.
eo: Por via nova backend klaso, kreu du novajn dosierojn nomitajn `backend.cpp` kaj `backend.h`. Ne forgesu aldoni la novan cpp-dosieron al la plenumebla en `src/CMakeLists.txt`, apud main.cpp.
es: Para la nueva clase de motor, cree dos archivos llamados `backend.cpp` y `backend.h`. No se olvide de añadir el nuevo archivo cpp al ejecutable en `src/CMakeLists.txt`, junto a `main.cpp`.
fr: Pour votre nouvelle classe de moteur, veuillez créer deux nouveaux fichiers appelés « backend.cpp » et « backend.h ». N'oubliez pas d'ajouter le nouveau fichier « cpp » à l'exécutable dans le fichier « src/CMakeLists.txt », à côté du fichier « main.cpp ».
nl: Voor uw nieuwe backend klasse, maak twee nieuwe bestanden genaamd `backend.cpp` en `backend.h`. Vergeet niet om het nieuwe cpp-bestand aan het uitvoerbare bestand in `src/CMakeLists.txt` toe te voegen, naast main.cpp.
pl: Dla nowej klasy backend, utwórz dwa nowe pliki o nazwie `backend.cpp` oraz `backend.h`. Nie zapomnij dodać nowego pliku cpp do pliku wykonywalnego w `src/CMakeLists.txt`, obok main.cpp.
pt: Para a sua nova classe de infra-estrutura, crie dois ficheiros novos chamados `backend.cpp` e `backend.h`. Não se esqueça de adicionar o novo ficheiro .cpp ao executável no `src/CMakeLists.txt`, junto ao main.cpp.
sl: Za nov razred zaledja ustvarite dve novi datoteki, imenovani »backend.cpp« in »backend.h«. Ne pozabite dodati nove datoteke cpp k izvršilni v »src/CMakeLists.txt« poleg glavnega .cpp.
sv: Skapa två nya filer som heter `backend.cpp` och `backend.h` för din nya bakgrundsklass. Glöm inte bort att lägga till den nya cpp-filen för den körbara filen i `src/CMakeLists.txt`, intill main.cpp.
uk: Для нового класу модуля обробки створіть два файли із назвами `backend.cpp` і `backend.h`. Не забудьте додати нові файли cpp до модуля збирання виконуваного файла у `src/CMakeLists.txt`, поруч із main.cpp.

source: Add the following content to the new header file (`backend.h`):
eo: Aldonu la sekvan enhavon al la nova kapdosiero (`backend.h`):
es: Añada el siguiente contenido al nuevo archivo de cabecera (`backend.h`):
nl: Voeg de volgende inhoud toe aan het nieuwe header-bestand (`backend.h`):
pt: Adicione o seguinte conteúdo ao novo ficheiro de inclusão (`backend.h`):
sl: Dodajte naslednjo vsebino v novo datoteko glave (`backend.h`):
sv: Lägg till följande innehåll i den nya deklarationsfilen (`backend.h`):
uk: Додайте такі рядки до нового файла заголовків (`backend.h`):

source: The `backend.cpp` file containing the definitions is similarly empty right now, it should contain something like the following:
eo: La dosiero `backend.cpp` enhavanta la difinojn estas simile malplena nun, ĝi devus enhavi ion kiel la jenon:
es: El archivo `backend.cpp` que contiene las definiciones también está vacío ahora; debe contener algo similar a lo siguiente:
nl: Het bestand `backend.cpp` met de definities is nu evenzo leeg, het zou zoiets als het volgende moeten bevatten:
pt: O ficheiro `backend.cpp` que contém as definições está agora mais ou menos vazio, contendo algo como o seguinte:
sl: Datoteka`backend.cpp`, ki vsebuje definicije, je trenutno podobno prazna, vsebovati bi morala nekaj podobnega:
sv: Filen `backend.cpp` som innehåller definitionerna är också tom för tillfället. Den ska innehålla något som liknar följande:
uk: Файл `backend.cpp`, який має містити визначення, так само зараз є порожнім. У ньому мають міститися десь такі рядки:

source: Currently the user interface doesn't know about your backend class. To change that, we need to register the new type in `main.cpp`. The backend will be created as a singleton, that means it will only be created once and exist through the whole time from starting the application to closing it.
eo: Nuntempe la uzantinterfaco ne scias pri via backend klaso. Por ŝanĝi tion, ni devas registri la novan tipon en `main.cpp`. La backend estos kreita kiel unuopaĵo, tio signifas, ke ĝi estos kreita nur unufoje kaj ekzistos dum la tuta tempo de ekfunkciado de la aplikaĵo ĝis fermo de ĝi.
es: Hasta ahora, la interfaz de usuario no sabe nada sobre la clase del motor. Para cambiar esto, necesitamos registrar el nuevo tipo en `main.cpp`. El motor se creará como *singleton*, lo que significa que solo se creará una vez y existirá durante todo el tiempo, desde que se inicia la aplicación hasta que se cierra.
fr: Actuellement, l'interface utilisateur ne connaît pas la classe de votre moteur. Pour changer cela, nous devons enregistrer le nouveau type dans « main.cpp ». Le moteur sera créé comme un singleton, ce qui signifie qu'il ne sera créé qu'une seule fois et existera pendant toute la durée de l'application, de son démarrage à sa fermeture.
nl: Op dit moment weet het gebruikersinterface niets van uw backend klasse. Om dat te wijzigen moeten we het nieuwe type registreren in `main.cpp`. De backend zal aangemaakt worden als een singleton, dat betekent dat het slechts één keer aangemaakt wordt en bestaat tijdens de gehele tijd vanaf het begin van de toepassing tot het sluiten ervan.
pl: Obecnie, interfejs użytkownika nie wie o twojej klasie z logiki programu. Aby to zmienić, musimy zarejestrować nowy rodzaj w `main.cpp`. Logika programu zostanie utworzona jako singleton, co oznacza, że zostanie utworzona tylko raz i będzie istnieć przez cały czas od otwarcia do zamknięcia programu.
pt: De momento, a interface de utilizador não sabe nada sobre a sua classe de infra-estrutura. Para mudar isso, teremos de registar o novo tipo no `main.cpp`. A infra-estrutura será criada como um `singleton`, o que significa que só será criado uma vez e existirá durante todo o tempo, desde o início da aplicação até fechá-la.
sl: Trenutno uporabniški vmesnik ne ve za vaš razred zaledja. Da bi to spremenili, moramo novo vrsto registrirati v `main.cpp`. Zaledje bo ustvarjeno kot singleton, kar pomeni, da bo ustvarjeno samo enkrat in obstaja skozi ves čas od zagona do zaprtja aplikacije.
sv: För närvarande känner inte användargränssnittet till din bakgrundsklass. För att ändra det måste vi registrera den nya typen i `main.cpp`. Bakgrundskoden skapas som en singleton, vilket betyder att den bara skapas en gång och existerar hela tiden från programmet startas till det stängs.
uk: На цей момент інтерфейсу користувача нічого не відомо про клас модуля обробки. Щоб повідомити про модуль, нам слід зареєструвати новий тип у `main.cpp`. Модуль обробки буде створено як одинак, що означає, що його буде створено лише одноразово і він існуватиме увесь час — від запуску програми до завершення її роботи.

source: Right after creating the [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), add the [type registration](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) to `main.cpp` as follows:
eo: Tuj post kreado de la [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), aldonu la [tipregistradon](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) al `main.cpp` jene:
es: Después de crear el [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), añada el [registro de tipo](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) a `main.cpp` de este modo:
nl: Direct na maken van de [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), voeg de [type registratie](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) toe aan `main.cpp` als volgt:
sl: Takoj po stvaritvi [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), dodajte [type registration](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) v `main.cpp` kot sledi:
sv: Direkt efter att ha skapat [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), lägg till [typregistreringen](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) i `main.cpp` på följande sätt:
uk: Одразу після створення [QQmlApplicationEngine](docs:qtqml;QQmlApplicationEngine), додайте [реєстрацію типу](https://doc.qt.io/qt-6/qtqml-cppintegration-definetypes.html) до `main.cpp` ось так:

source: Don't forget to include the new header file at the top of `main.cpp`.
eo: Ne forgesu enmeti la novan kapdosieron ĉe la supro de `main.cpp`.
es: No olvide incluir el nuevo archivo de cabecera al principio de `main.cpp`.
fr: N'oubliez pas d'inclure le nouveau fichier d'en-tête en haut de « main.cpp ».
nl: Vergeet niet om het nieuwe headerbestand bovenaan `main.cpp` in te voegen.
pl: Nie zapomnij dołączyć pliku nowego nagłówka na górze `main.cpp`.
pt: Não se esqueça de incluir o novo ficheiro de inclusão no topo do `main.cpp`.
sl: Ne pozabite vključiti nove datoteke glave na vrhu `main.cpp`.
sv: Glöm inte att inkludera den nya deklarationsfilen längst upp i `main.cpp`.
uk: Не забудьте додати новий файл заголовків у початковій частині `main.cpp`.

source: From now on, the backend will be known to QML as `Backend`. It is contained in a module called `org.kde.example`. Since the module is part of the application, you don't need to worry about versioning it, just stay with `1.0` and use it consistently throughout the application.
eo: De nun, la backend estos konata al QML kiel `Backend`. Ĝi estas enhavita en modulo nomita `org.kde.example`. Ĉar la modulo estas parto de la aplikaĵo, vi ne bezonas zorgi pri versio de ĝi, simple restu kun `1.0` kaj uzu ĝin konstante tra la aplikaĵo.
es: A partir de este momento, QML conocerá el motor como `Backend`. Está contenido en un módulo llamado `org.kde.example`. Como el módulo es parte de la aplicación, no tiene que preocuparse por su número de versión: solo tiene que quedarse con `1.0` y usarlo de forma consistente en toda la aplicación.
nl: Vanaf nu zal de backend aan QML bekend zijn als `Backend`. Het zit in een module genaamd `org.kde.example`. Omdat de module onderdeel is van de toepassing, hoeft u zich geen zorgen te maken over versies, blijf bij `1.0` en gebruik het consistent in de toepassing.
pt: A partir de agora, a infra-estrutura ficará conhecida perante o QML como `Backend`. Está contida dentro de um módulo chamado `org.kde.example`. Dado que o módulo faz parte da aplicação, não precisa de se preocupar com a gestão de versões do mesmo; deixe-se ficar na `1.0` e use-a de forma consistente em toda a aplicação.
sl: Od zdaj naprej bo zaledje QML znano kot `Backend`. Vsebovano je v modulu, imenovanem `org.kde.example`. Ker je modul del aplikacije, vam ni treba skrbeti za različice, samo ostanite pri 1.0 in ga dosledno uporabljajte skozi celotno aplikacijo.
sv: Från och med nu är bakgrundskoden känd för QML som `Backend`. Den finns i en modul som kallas `org.kde.example`. Eftersom modulen är en del av programmet, behöver du inte bekymra dig om versionshantering, behåll bara `1.0` och använd det konsekvent i hela programmet.
uk: З цього моменту у QML модуль обробки буде відомий як `Backend`. Він міститиметься у модулі із назвою `org.kde.example`. Оскільки модуль є частиною програми, вам не варто перейматися щодо встановлення його версій, просто лишіть версію `1.0` і використовуйте його послідовно у всій програмі.

source: In `main.qml`, import the new module:
eo: En `main.qml`, importu la novan modulon:
es: En `main.qml`, importe el nuevo módulo:
fr: Dans le fichier « main.qml », importez le nouveau module :
nl: Importeer in `main.qml` de nieuwe module:
pl: W `main.qml`, zaimportuj nowy moduł:
pt: No `main.qml`, importe o novo módulo:
sl: V `main.qml` uvozite novi modul:
sv: Importera den nya modulen i `main.qml`:
uk: У `main.qml` імпортуйте новий модуль:

source: Right under the [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT) macro, add a new [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
eo: Ĝuste sub la makroo [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), aldonu novan [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
es: Justo debajo de la macro [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), añada una nueva [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
nl: Direct onder de macro [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), voeg een nieuwe [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
pt: Logo abaixo da macro [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), adicione uma nova [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
sl: Prav pod makrojem [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), dodajte novega [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
sv: Direkt under makrot [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT), lägg till en ny [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).
uk: Одразу після макроса [Q_OBJECT](docs:qtcore;QObject::Q_OBJECT) додайте новий макрос [Q_PROPERTY](docs:qtcore;QObject::Q_PROPERTY).

source: To the public section, add
eo: Al la publika sekcio, aldonu
es: En la sección `public`, añada
fr: Dans la section publique, ajoutez
nl: Voeg aan de sectie publiek toe
pl: Do działu publicznego, dodaj
pt: Na secção 'public', adicione
sl: V javni razdelek dodajte
sv: Lägg till följande i den öppna sektionen
uk: У розділі public додайте

source: The first function is the getter, the second the setter, and the third a signal that is emitted when the property is changed. The signal doesn't need any implementation in `backend.cpp` file, since it doesn't do much more than being emitted, but the getter and setter need to be implemented similar to the following:
eo: La unua funkcio estas la ricevilo, la dua la agordilo, kaj la tria signalo kiu estas elsendita kiam la propreco estas ŝanĝita. La signalo ne bezonas ajnan efektivigon en `backend.cpp` dosiero, ĉar ĝi ne faras multe pli ol esti elsendita, sed la ricevilo kaj agordilo devas esti efektivigitaj simile al la sekvanta:
es: La primera función es el *getter*, la segunda es el *setter* y la tercera es una señal que se emite cada vez que se cambie la propiedad. La señal no necesita estar implementada en el archivo `backend.cpp`, ya que no hace otra cosa que emitirse, aunque el *getter* y el *setter* deben implementarse de un modo similar al siguiente:
nl: De eerste functie is de getter, de tweede de setter en de derde een signaal dat is uitgezonden wanneer de eigenschap is gewijzigd. Het signaal behoeft geen enkele implementatie in het bestand `backend.cpp`, omdat het niet veel meer doet dan uitgezonden worden, maar de getter en setter moeten geïmplementeerd worden lijkend op het volgende:
pt: A primeira função é o método de leitura, a segunda é o método de escrita e a terceira é um sinal que é emitido quando a propriedade tiver sido modificada. O sinal não necessita de nenhuma implementação no ficheiro `backend.cpp`, dado que não faz muito mais do que ser emitido, mas os métodos de leitura e escrita têm de ser implementados de forma semelhante à seguinte:
sl: Prva funkcija je getter, druga seter, tretja pa je signal, oddan ob spremembi lastnosti. Signal ne potrebuje nobene implementacije v datoteki `backend.cpp`, saj ne naredi veliko več od oddajanja, vendar je treba getter in setter izvajati podobno naslednjemu:
sv: Den första funktionen är hämtningsfunktionen,den andra är tilldelningsfunktionen, och den tredje en signal som skickas när egenskapen ändras. Signalen behöver ingen implementering i filen `backend.cpp`, eftersom den inte gör mycket mer än att skickas, men hämtnings- och tilldelningsfunktionen behöver implementeras på liknande sätt som det följande:
uk: Перша функція є отримувачем даних, друга — встановлювачем, а третя — сигналом, який видається, коли змінюється значення властивості. Сигнал не потребує реалізації у файлі `backend.cpp`, оскільки він не виконує майже нічого, окрім видання, але функції отримання та встановлення значення має бути реалізовано десь так:

source: To display the text, add a heading to `main.qml` under the `title` property of the [Kirigami.Page](docs:kirigami2;Page) element already contained in the template.
eo: Por montri la tekston, aldonu titolon al `main.qml` sub la `titolo` propreco de la elemento [Kirigami.Page](docs:kirigami2;Page) jam enhavita en la ŝablono.
es: Para mostrar el texto, añada un encabezado a `main.qml` bajo la propiedad `title` del elemento [Kirigami.Page](docs:kirigami2;Page) que ya contiene la plantilla.
nl: Om de tekst te tonen, voeg een kop toe aan `main.qml` onder de eigenschap `title` van het element [Kirigami.Page](docs:kirigami2;Page) dat al in het sjabloon zit.
pt: Para mostrar o texto, no `main.qml` adicione um cabeçalho que o mostra à direita da propriedade `title` do elemento [Kirigami.Page](docs:kirigami2;Page) que já está contido dentro do modelo.
sv: För att visa texten, lägg till en rubrik i `main.qml` under egenskapen `title` för elementet [Kirigami.Page](docs:kirigami2;Page), som redan finns i mallen.
uk: Щоб показати текст у `main.qml` додайте заголовок під властивістю `title` елемента [Kirigami.Page](docs:kirigami2;Page), який вже міститься у шаблоні.

source: Now compile and start your program again.
eo: Nun kompilu kaj rekomencu vian programon.
es: Ahora, vuelva a compilar el programa y ejecútelo.
fr: Maintenant, compiler et lancer votre programme à nouveau.
nl: Nu kunt u uw programma opnieuw compileren en starten.
pl: Teraz skompiluj i uruchom twój program ponownie.
pt: Agora compile e inicie o seu programa de novo.
sl: Zdaj prevedite in znova zaženite svoj program.
sv: Kompilera och starta nu programmet igen.
uk: Тепер зберіть і запустіть вашу програму знову.

source: Connect models to your QML user interface
eo: Konektu modelojn al via uzantinterfaco de QML
nl: Modellen verbinden naar uw QML gebruikersinterface
sv: Ansluta modeller till QML-användargränssnittet
uk: З'єднання моделей з вашим інтерфейсом користувача QML

source: Connect models from C++ backend to QML frontend
eo: Konekti modelojn de C++ backend al QML fasado
nl: Modellen verbinden uit de C++-backend naar de QML-frontend
sv: Ansluta modeller från C++ bakgrundsprogrammet till QML-gränssnittet
uk: З'єднання моделей з модуля обробки на C++ із оболонкою на QML
