Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: ![An inline message with rich text and a hyperlink](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
ca: ![Un missatge inclòs amb text enriquit i un enllaç](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
eo: ![Enlinia mesaĝo kun riĉa teksto kaj hiperligo](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
es: ![Un mensaje en línea con texto enriquecido y un enlace](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
nl: ![Een inline melding met opgemaakte tekst en een hyperlink](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
pt: ![Uma mensagem incorporada com texto formatado e uma hiperligação](/docs/getting-starteted/kirigami/components-inlinemessages/inlinemessages-richtext.png)
sl: ![Znotrajvrstično sporočilo z obogatenim besedilom in hiperpovezavo](/docs/use/kirigami/components-inlinemessages/inlinemessages-richtext.png)
sv: ![Ett meddelande på plats med rich text och en hyperlänk](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)
uk: ![Вбудоване повідомлення із форматованим текстом та гіперпосиланням](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-richtext.png)

source: You can also customise the icon that appears on the top left of your message by providing a system icon name for the [icon.source](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#icon.source-prop) property. These icon names should correspond to icons installed on your system; you can use an application such as Cuttlefish provided by [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) to browse and search the icons available on your system, and see what their names are.
ca: També podreu personalitzar la icona que apareix a la part superior esquerra del missatge, proporcionant un nom d'icona de sistema per a la propietat [icon.source](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#icon.source-prop). Aquests noms d'icona s'han de correspondre amb les icones que hi ha al vostre sistema. Podeu utilitzar una aplicació com Cuttlefish proporcionada per [plasma-sdk](https://invent.kde.org/plasma/plasma-sdk) per a explorar i cercar les icones disponibles en el sistema, i quins són els seus noms.

source: ![An inline message with a custom icon](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
ca: ![Un missatge inclòs amb una icona personalitzada](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
eo: ![Enlinia mesaĝo kun propra piktogramo](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
es: ![Un mensaje en línea con un icono personalizado](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
nl: ![Een inline melding met een eigen pictogram](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
pt: ![Uma mensagem incorporada com um ícone específico](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
sl: ![Znotrajvrstično sporočilo z ikono po meri](/docs/use/kirigami/components-inlinemessages/inlinemessages-icon.png)
sv: ![Ett meddelande på plats med en angiven ikon](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)
uk: ![Вбудоване повідомлення із нетиповою піктограмою](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-icon.png)

source: Using actions in inline messages
ca: Utilitzar accions en els missatges inclosos
eo: Uzante agojn en enliniaj mesaĝoj
es: Uso de acciones en mensajes en línea
fr: Utilisation des actions dans les messages en ligne
nl: Acties in inline meldingen gebruiken
pl: Używanie działań w wiadomościach w wierszu
pt: Usar acções nas mensagens incorporadas
sl: Uporaba dejanj v znotrajvrstičnih sporočilih
sv: Använda åtgärder i meddelanden på plats
uk: Використання пунктів дій у вбудованих повідомленнях

source: If your messages need to be interactive, you can attach Kirigami actions to your inline messages. Like with pages, you can do this by setting the [InlineMessage.actions](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#actions-prop) property to either a [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) or an array containing [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) components.
ca: Si els missatges han de ser interactius, podreu adjuntar accions de Kirigami als missatges inclosos. Igual que amb les pàgines, podreu fer això establint la propietat [InlineMessage.actions](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#actions-prop) del missatge inclòs ja sigui en una [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action) o en una matriu que contingui els components d'una [Kirigami.Action](docs:kirigami;org.kde.kirigami.Action).

source: ![An inline message with two actions](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
ca: ![Un missatge inclòs amb dues accions](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
eo: ![Enlinia mesaĝo kun du agoj](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
es: ![Un mensaje en línea con dos acciones](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
nl: ![Een inline melding met twee acties](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
pt: ![Uma mensagem incorporada com duas acções](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
sl: ![Znotrajvrstično sporočilo z dvema dejanjema](/docs/use/kirigami/components-inlinemessages/inlinemessages-actions.png)
sv: ![Ett meddelande på plats med två åtgärder](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)
uk: ![Вбудоване повідомлення із двома пунктами дій](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-actions.png)

source: Close buttons
ca: Botons de tancar
eo: Fermu butonojn
es: Botones de cierre
fr: Boutons de fermeture
nl: Knoppen voor afsluiten
pl: Przyciski zamykające
pt: Botões de fecho
sl: Gumbi za zapiranje
sv: Stängningsknappar
uk: Кнопки закриття

source: Inline messages provide a close button that can be used to easily dismiss them.
ca: Els missatges inclosos proporcionen un botó de tancament que es pot utilitzar per a descartar-los amb facilitat.
eo: Enliniaj mesaĝoj disponigas fermbutonon, kiu povas esti uzata por facile forĵeti ilin.
es: Los mensajes en línea proporcionan un botón de cierre que se puede usar para descartarlos fácilmente.
fr: Les messages en ligne comportent un bouton de fermeture pouvant être utilisé pour les rejeter facilement.
nl: Inline meldingen leveren een sluitknop die gebruikt kan worden om ze gemakkelijk af te wijzen.
pl: Wiadomości w treści dają przycisk zamykania, którego można łatwo użyć do ich odwoływania.
pt: As mensagens incorporadas oferecem um botão de fecho que poderá ser usado para as descartar facilmente.
sl: Znotrajvrstična sporočila zagotavljajo gumb za zapiranje, ki ga lahko uporabite za enostaven izhod.
sv: Meddelanden på plats tillhandahåller en stängningsknapp som kan användas för att enkelt avfärda dem.
uk: До вбудованого повідомлення додається кнопка закриття, якою можна скористатися для прибирання панелей повідомлень.

source: By default, this close button is hidden, but this can be overridden by setting the [showCloseButton](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#showCloseButton-prop) property to `true`.
ca: De manera predeterminada, aquest botó de tancament estarà ocult, però ho podeu anul·lar establint la propietat [showCloseButton](https://api.kde.org/qml-org-kde-kirigami-inlinemessage.html#showCloseButton-prop) a `true`.

source: ![An inline message with close button to its right side](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
ca: ![Un missatge inclòs amb el botó de tancar a la seva banda dreta](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
eo: ![Enlinia mesaĝo kun fermbutono dekstre](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
es: ![Un mensaje en línea con un botón de cierre en la parte derecha](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
nl: ![Een inline melding met sluitknop aan de rechterkant](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
pt: ![Uma mensagem incorporada com o botão de fecho no lado direito](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
sl: ![Znotrajvrstično sporočilo z gumbom za zapiranje na desni strani](/docs/use/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
sv: ![Ett meddelande på plats med stängningsknapp på höger sida](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)
uk: ![Вбудоване повідомлення із кнопкою закриття праворуч від нього](/docs/getting-started/kirigami/components-inlinemessages/inlinemessages-closebutton.png)

source: List views
ca: Vistes de llista
eo: Listo vidoj
es: Vistas de lista
fr: Vues en liste
nl: Lijstweergaven
pl: Widoki listy
pt: Listas
sl: Pogledi seznama
sv: Listvyer
uk: Списки

source: A list view can help you easily display many components dynamically.
ca: Una vista de llista pot ajudar-vos a mostrar amb facilitat molts components de forma dinàmica.
eo: Listvido povas helpi vin facile montri multajn komponantojn dinamike.
es: Una vista de lista le puede ayudar a mostrar fácilmente muchos componentes de forma dinámica.
fr: Un affichage en liste peut vous aider à afficher facilement et dynamiquement de nombreux composants.
nl: Een lijstweergave kan u helpen om gemakkelijk veel componenten dynamisch te tonen.
pl: Widok listy może pomóc w tym, aby łatwo wyświetlić wiele składników dynamicznie.
pt: Uma lista podê-lo-á ajudar a mostrar facilmente vários componentes de forma dinâmica.
sl: Pogled seznama vam lahko pomaga pri dinamičnem prikazu številnih komponent.
sv: En listvy kan hjälpa dig att enkelt visa många komponenter dynamiskt.
uk: Панель перегляду списку може спростити для вас динамічний показ багатьох компонентів.

source: [List views](docs:qtquick;QtQuick.ListView) can help you display objects from a model in an attractive way. To use a list view, you have to keep track of three things:
ca: Les [List views](docs:qtquick;QtQuick.ListView) poden ajudar a mostrar objectes d'un model d'una manera atractiva. Per a utilitzar una vista de llista, haureu de realitzar un seguiment de tres coses:

source: The **model**, which contains the data you want your list view to display
ca: El **model**, el qual conté les dades que voleu mostrar a la vista de llista.
eo: La **modelo**, kiu enhavas la datumojn, kiujn vi volas ke via listvido montru
es: El **modelo**, que contiene los datos que quiere que muestre la vista de lista
fr: Le **modèle** contenant les données que vous souhaitez afficher dans votre vue en liste.
nl: Het **model**, dat de gegevens bevat die u in uw lijstweergave wilt tonen
pl: **model**, który zawiera dane, które chcesz, aby wyświetlał twój widok listy
pt: O **modelo**, que contém os dados que deseja apresentar na sua lista
sl: **model**, ki vsebuje podatke, ki jih želite prikazati v pogledu seznama
sv: En **modell**, som innehåller data som du vill att din listvy ska visa
uk: **Моделлю**, яка містить дані, які має бути показано на вашій панелі списку

source: The **delegate**, which defines how each element in the model will be displayed
ca: El **delegat**, el qual defineix com es mostrarà cada element en el model.
eo: La **delegito**, kiu difinas kiel ĉiu elemento en la modelo estos montrata
es: El **delegado**, que define cómo se muestran los elementos del modelo
fr: Le **délégué**, définissant comment chaque élément du modèle sera affiché.
nl: De **delegate**, die definieert hoe elk element in het model getoond zal worden
pl: **Delegat**, który określa w jaki sposób będzie wyświetlana każda rzecz w modelu
pt: O **delegado**, que define como será apresentado cada elemento no modelo
sl: **delegat**, ki določa, kako bo vsak element v modelu prikazan
sv: En **delegat**, som definierar hur varje element i modellen kommer att visas
uk: **Делегата**, який визначає, як буде показано кожне з елементів моделі

source: The **list view** itself, which will display information from the model according to the delegate
ca: La **vista de llista** en si, la qual mostrarà la informació del model segons el delegat.
eo: La **listvido** mem, kiu montros informojn el la modelo laŭ la delegito
es: La **vista de lista**, propiamente dicha, que mostrará la información del modelo como indica el delegado
fr: **L'affichage en liste** lui-même, qui affichera les informations du modèle en fonction du délégué.
nl: De **list view** zelf, die de informatie uit het model volgens de delegate zal tonen
pl: **Widok listy**, który wyświetli szczegóły z modelu w zależności od delegata
pt: A **lista** em si, que irá mostrar informações do modelo de acordo com o método-delegado
sl: Sam **pogled seznama**, ki bo prikazoval informacije iz modela v skladu z delegatom
sv: Själva **listvyn**, som visar information från modellen enligt delegaten
uk: Самої **панелі списку**, на якій буде показано відомості щодо моделі, відповідно до параметрів делегата

source: If you would like further clarification, the Qt documentation has [an informative page](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) on the topic.
ca: Per a més aclariments, la documentació de les Qt té [una pàgina informativa](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) sobre el tema.
eo: Se vi ŝatus plian klarigon, la Qt-dokumentaro havas [informan paĝon](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) pri la temo.
es: Si necesita más aclaraciones, la documentación de Qt tiene [una página informativa](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) sobre este tema.
nl: Als u verdere verheldering wilt, de Qt-documentatie heeft [een informatieve pagina](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) over het onderwerp.
sl: Če želite dodatno pojasnilo, ima dokumentacija Qt [informativna stran](https://doc.qt.io/qt-5/qtquick-modelviewsdata-modelview.html) na to temo.
sv: Om du vill ha ytterligare klargöranden, har Qt-dokumentationen [en informativ sida](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) om ämnet.
uk: Якщо вам потрібні додаткові пояснення, у документації Qt є [інформативна сторінка](https://doc.qt.io/qt-6/qtquick-modelviewsdata-modelview.html) щодо цього питання.

source: Essentials of models and views
ca: Essencials de models i vistes
eo: Esencaj de modeloj kaj vidoj
es: Lo esencial de modelos y vistas
nl: Essenties van modellen en weergaven
sl: Osnove modelov in pogledov
sv: Grunderna i modeller och vyer
uk: Базові дані щодо моделей та панелей перегляду

source: A list view has two essential properties we must pay attention to:
ca: Una vista de llista té dues propietats essencials a les quals hem de parar atenció:
eo: Listvido havas du esencajn ecojn, pri kiuj ni devas atenti:
es: Una vista de lista tiene dos propiedades esenciales a las que debemos prestar atención:
fr: Une vue en liste possède deux propriétés essentielles auxquelles nous devons prêter attention :
nl: Een lijstweergave heeft twee essentiële eigenschappen waar we aandacht aan moeten besteden:
pl: Widok listy ma dwie istotne właściwości, na które musimy zwrócić uwagę:
pt: Uma lista tem duas propriedades essenciais que deveremos prestar atenção:
sl: Seznamski pogled ima dve bistveni lastnosti, na kateri moramo biti pozorni:
sv: En listvy har två grundläggande egenskaper som vi måste ta hänsyn till:
uk: У панелі списку є дві ключові властивості, на які нам слід звернути увагу:

source: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), which accepts the data or the `id` of the object that holds the data
ca: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), el qual accepta les dades o l'`id` de l'objecte que conté les dades
eo: [modelo](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), kiu akceptas la datumojn aŭ la `id` de la objekto kiu tenas la datumojn
es: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), que acepta los datos o el `id` del objeto que contiene los datos
nl: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), die de gegevens accepteert of de `id` van het object dat de gegevens bevat
pt: O [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), que aceita os dados ou o `id` do objecto que contém os dados
sl: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), ki sprejema podatke ali 'id' predmeta, ki nosi podatke
sv: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), som accepterar objektets `id` som innehåller data
uk: [model](https://doc.qt.io/qt-6/qml-qtquick-listview.html#model-prop), яка приймає дані або `id` об'єкта, який містить дані

source: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), which accepts the component we will use to display the data in the model
ca: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), el qual accepta el component que utilitzarem per a mostrar les dades en el model
eo: [delegito](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), kiu akceptas la komponanton, kiun ni uzos por montri la datumojn en la modelo
es: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), que acepta el componente que usaremos para mostrar los datos del modelo
nl: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), die de component accepteert die we willen gebruiken om de gegevens in het model te tonen
pt: O [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), que aceita o componente-delegado que será usado para mostrar os dados no modelo
sl: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), ki sprejema komponento, ki jo bomo uporabili za prikaz podatkov v modelu
sv: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), som accepterar komponenten vi ska använda för att visa data i modellen
uk: [delegate](https://doc.qt.io/qt-6/qml-qtquick-listview.html#delegate-prop), яка приймає компонент, якими ми скористаємося для показу даних у моделі

source: The model is not visible, as it only contains data. Typically the delegate will be wrapped in a Component so that it is reusable: it serves as a blueprint for how to instantiate each delegate.
ca: El model no és visible, ja que només conté dades. Normalment, el delegat s'embolcallarà en un Component perquè sigui reutilitzable: serveix com a esquema per a conèixer com instanciar cada delegat.
eo: La modelo ne estas videbla, ĉar ĝi enhavas nur datumojn. Tipe la delegito estos envolvita en Komponento tiel ke ĝi estas reuzebla: ĝi servas kiel skizo por kiel ekzempligi ĉiun delegiton.
es: El modelo no es visible, ya que solo contiene datos. Normalmente, el delegado se envuelve en un componente para ser reutilizable: sirve como modelo para crear instancias de cada delegado.
nl: Het model wordt niet getoond, omdat het alleen data bevat. Standaard wordt de delegatie ingepakt in een component zodat het herbruikbaar is: het dient als blauwdruk voor hoe een delegatie moet worden gecreëerd.
sl: Model ni viden, saj vsebuje le podatke. Običajno bo delegat zavit v komponento, tako da jo je mogoče ponovno uporabiti: služi kot načrt za instanciranje vsakega delegata.
sv: Modellen är inte synlig, eftersom den endast innehåller data. Vanligtvis omges delegaten av en komponent så att den är återanvändbar: den fungerar som en ritning för hur man instansierar varje delegat.
uk: Модель є невидимою, оскільки вона лише містить дані. Типово, делегат буде загорнуто до Component, щоб його можна було використати повторно: він слугує як шаблон того, як створити екземпляр кожного делегата.

source: Here is an example that contains exactly one list view, one model and one delegate, using a [Kirigami.SubtitleDelegate](docs:kirigami;org.kde.kirigami.delegates.SubtitleDelegate):
ca: Aquí hi ha un exemple que conté exactament una vista de llista, un model i un delegat, utilitzant un [Kirigami.SubtitleDelegate](docs:kirigami;org.kde.kirigami.delegates.SubtitleDelegate):
sl: Tukaj je primer, ki vsebuje natanko en pogled seznama, en model in enega delegata z uporabo [Kirigami.SubtitleDelegate](docs:kirigami;org.kde.kirigami.delegates.SubtitleDelegate):

source: And the exact same example, inline:
ca: I el mateix exemple, en línia:
eo: Kaj la ĝusta sama ekzemplo, enlinia:
es: Y exactamente el mismo ejemplo en línea:
nl: En precies hetzelfde voorbeeld, inline:
sl: In popolnoma enak primer, v vrstici:
sv: Och exakt samma exempel på plats:
uk: І точно той самий приклад, вбудований:

source: Understanding models
ca: Entendre els models
eo: Kompreni modelojn
es: Entendiendo los modelos
nl: Modellen begrijpen
sl: Razumevanje modelov
sv: Förstå modeller
uk: Розбираємося із моделями

source: The model contains the data that will be used to populate the list view. Different ways to use models have different ways to access the data:
ca: El model conté les dades que s'utilitzaran per a emplenar la vista de llista. Les maneres diferents d'utilitzar els models tenen maneres diferents d'accedir a les dades:
eo: La modelo enhavas la datumojn, kiuj estos uzataj por plenigi la listvidon. Malsamaj manieroj uzi modelojn havas malsamajn manierojn aliri la datumojn:
es: El modelo contiene los datos que se usarán para rellenar la vista de lista. Los distintos modos de usar los modelos tienen diferentes formas de acceder a los datos:
nl: In het model is de data dat wordt gebruikt om dat zal worden gebruikt om de getoonde lijst te bevolken. De verschillende manieren om de modellen te gebruiken hebben verschillende manieren om toegang te krijgen tot de data:
sl: Model vsebuje podatke, ki bodo uporabljeni za zapolnitev pogleda seznama. Različni načini uporabe modelov imajo različne načine za dostop do podatkov:
sv: Modellen innehåller data som användas för att fylla listvyn. Olika sätt att använda modeller har olika sätt att komma åt data:
uk: Модель містить дані, які буде використано для заповнення панелі перегляду списку. Для різних способів використання моделей передбачено різні способи доступу до даних:

source: WAY TO USE
ca: MANERA D'UTILITZAR
eo: VOJ DE UZINO
es: MODO DE USO
nl: HOE TE GEBRUIKEN
sl: NAČIN UPORABE
sv: SÄTT ATT ANVÄNDA
uk: СПОСІБ ВИКОРИСТАННЯ

source: HOW TO ACCESS
ca: COM ACCEDIR-HI
eo: KIEL ALIRI
es: CÓMO SE ACCEDE
nl: HOE TOEGANG TE KRIJGEN
sl: KAKO DOSTOPATI
sv: HUR MAN KOMMER ÅT DEN
uk: ДОСТУП

source: WHEN TO USE
ca: QUAN EMPRAR-HO
eo: KIAM UZI
es: CUÁNDO SE USA
nl: WANNEER TE GEBRUIKEN
sl: KDAJ UPORABITI
sv: NÄR MAN ANVÄNDER DEN
uk: УМОВИ ВИКОРИСТАННЯ

source: Qt models with more than one role
ca: Models Qt amb més d'un rol
eo: Qt-modeloj kun pli ol unu rolo
es: Modelos de Qt con más de un rol
nl: Qt modellen met meer dan een rol
sl: Modeli Qt z več kot eno vlogo
sv: Qt-modeller med mer än en roll
uk: Моделі Qt із декількома ролями

source: In most cases
ca: En la majoria dels casos
eo: Plej ofte
es: En la mayoría de casos
nl: Voor de meeste gevallen
sl: V večini primerov
sv: I de flesta fall
uk: У більшості випадків
