Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: A single page with light blue color to show the page's dimensions
ca: Una sola pàgina amb color blau clar per a mostrar les dimensions de la pàgina
eo: Ununura paĝo kun helblua koloro por montri la dimensiojn de la paĝo
es: Una sola página con color azul claro para mostrar las dimensiones de la página
nl: Een enkele pagina met lichtblauwe kleur om afmetingen van de pagina te tonen
pt: Uma única página com uma cor azul-clara para mostrar as dimensões da página
sl: Ena sama stran s svetlo modro barvo, ki prikazuje dimenzije strani
sv: En enstaka sida med ljusblå färg för att visa sidans dimensioner
uk: Одинарна сторінка із світло-блакитним кольором для демонстрації розмірів сторінки

source: There are two improvements that can be done here. The first is that, with [initialPage](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop), we can both set `mainPage` to be the first page that appears in the page row, and have its dimensions be managed by the page row instead of via manual [anchors](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [positioners](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) or [layouts](https://doc.qt.io/qt-6/layout.html). The second is to have a toolbar, which can be set by defining a toolbar style with [globalToolBar.style](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#globalToolBar-prop). There are a few styles we can choose from, but we'll go with `Kirigami.ApplicationHeaderStyle.Auto` for now.
ca: Aquí es poden fer dues millores. El primer és que, amb [initialPage](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop), podem establir que `mainPage` sigui la primera pàgina que aparegui a la fila de la pàgina, i que les seves dimensions siguin gestionades per la fila de la pàgina en lloc de fer-ho a través d'[ancoratges](https://doc.qt.io/qt-6/qtquick-positioning-anchors.html), [posicionadors](https://doc.qt.io/qt-6/qtquick-positioning-layouts.html) o [disposicions](https://doc.qt.io/qt-6/layouts.html) manuals. El segon és tenir una barra d'eines, que es pot establir definint un estil d'eines amb [globalToolBar.style](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#globalToolBar-prop). Hi ha alguns estils que podem triar, però continuarem amb el `Kirigami.ApplicationHeaderStyle.Auto` per ara.

source: <!-- TODO: investigate why Kirigami.ApplicationHeaderStyle doesn't show up in the tag file. -->
ca: <!-- PER FER: Investigar per què Kirigami.ApplicationHeaderStyle no apareix al fitxer d'etiquetes. -->
sl: <!-- ZA NAREDITI: raziščite, zakaj se Kirigami.ApplicationHeaderStyle ne prikažev datoteki z oznakami. -->

source: A single page with toolbar and light blue color to show the page's dimensions
ca: Una sola pàgina amb barra d'eines i color blau clar per a mostrar les dimensions de la pàgina
eo: Ununura paĝo kun ilobreto kaj helblua koloro por montri la dimensiojn de la paĝo
es: Una sola página con barra de herramientas y color azul claro para mostrar las dimensiones de la página
nl: Een enkele pagina met werkbalk en lichtblauwe kleur om afmetingen van de pagina te tonen
pt: Uma única página com uma barra de ferramentas e uma cor azul-clara para mostrar as dimensões da página
sl: Ena stran z orodno vrstico in svetlo modro barvo, ki prikazuje dimenzije strani
sv: En enstaka sida med verktygsrad och ljusblå färg för att visa sidans dimensioner
uk: Одинарна сторінка з панеллю інструментів та світло-блакитним кольором для показу розмірів сторінки

source: There are only two ways of adding pages to a page row: by setting its [initialPage](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop) (which can optionally take an array of pages) or by using [push()](docs:kirigami;org.kde.kirigami.PageRow::push). To delete a page from the page row, you should use [pop()](docs:kirigami;org.kde.kirigami.PageRow::pop), whereas [goBack()](docs:kirigami;org.kde.kirigami.PageRow::goBack) or [goForward()](docs:kirigami;org.kde.kirigami.PageRow::goForward) can be used to navigate between pages.
ca: Només hi ha dues maneres d'afegir pàgines a una fila de pàgines: establint la seva [initialPage](https://api.kde.org/qml-org-kde-kirigami-pagerow.html#initialPage-prop) (que opcionalment pot prendre una matriu de pàgines) o utilitzant [push()](docs:kirigami;org.kde.kirigami.PageRow::push). Per a suprimir una pàgina de la fila de pàgines, haureu d'utilitzar [pop()](docs:kirigami;org.kde.kirigami.PageRow::pop), mentre que [goBack()](docs:kirigami;org.kde.kirigami.PageRow::goBack) o [goForward()](docs:kirigami;org.kde.kirigami.PageRow::goForward) es pot utilitzar per a navegar entre les pàgines.

source: Initial page with light blue color
ca: Pàgina inicial amb un color blau clar
eo: Komenca paĝo kun helblua koloro
es: Página inicial con color azul claro
nl: Initiële pagina met lichtblauwe kleur
pt: Página inicial com uma cor azul-clara
sl: Začetna stran s svetlo modro barvo
sv: Initial sida med ljusblå färg
uk: Початкова сторінка зі світло-блакитним кольором

source: Upon clicking \"Push!\", a second page with light green color shows up
ca: En fer clic a \"Push!\", apareix una segona pàgina de color verd clar
eo: Alklakante \"Puŝu!\", aperas dua paĝo kun helverda koloro
nl: Bij klikken op \"Druk!\" zal een tweede pagina verschijnen met een lichtgroene kleur
pt: Depois de carregar em \"Push!\" (Sobrepor!), irá aparecer uma segunda página de cor verde-clara
sl: Ko kliknete \"Push!\", se prikaže druga stran s svetlo zeleno barvo
sv: Vid klick på \"Push!\", dyker en andra sida med ljusgrön färg upp
uk: Після натискання «Push!» буде показано другу сторінку із світло-зеленим кольором

source: The application's stack of pages
ca: La pila de pàgines de l'aplicació
eo: La stako de paĝoj de la aplikaĵo
es: La pila de páginas de la aplicación
nl: De stapel pagina's van de toepassing
pt: A pilha de páginas da aplicação
sl: Sklad strani aplikacije
sv: Programmets stapel av sidor
uk: Стос сторінок програми

source: If a [Kirigami.PageRow](docs:kirigami;org.kde.kirigami.PageRow) with a toolbar looks familiar to you, that is because you have seen it before. An [ApplicationWindow.pageStack](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) is nothing more than a very convenient, global page row. Every function available to a `PageRow` is also available to the `pageStack`.
ca: Si un [Kirigami.PageRow](docs:kirigami;org.kde.kirigami.PageRow) amb una barra d'eines us sembla familiar, és perquè l'heu vist abans. Una [ApplicationWindow.pageStack](https://api.kde.org/qml-org-kde-kirigami-abstractapplicationwindow.html#pageStack-prop) no és més que una fila de pàgines global molt útil. Cada funció disponible per a una `PageRow` també està disponible per a `pageStack`.

source: The previous example can be reduced significantly with a `pageStack`, with the added bonus of navigation actions:
ca: L'exemple anterior es pot reduir significativament amb una `pageStack`, amb la bonificació afegida de les accions de navegació:
eo: La antaŭa ekzemplo povas esti reduktita signife per "pageStack", kun la kroma bonuso de navigaciaj agoj:
es: El ejemplo anterior se puede reducir significativamente con una `pageStack`, con el beneficio adicional de tener acciones de navegación:
nl: Het vorige voorbeeld kan aanzienlijk gereduceerd worden met een `pageStack`, met de toegevoegde bonus met navigatie-acties:
pt: O exemplo anterior poderá ser reduzido de forma significativa com uma `pageStack`, com o bónus adicional das acções de navegação:
sl: Prejšnji primer je mogoče znatno zmanjšati s `pageStack` z dodanim bonusom dejavnosti navigacije:
sv: Det föregående exemplet kan reduceras avsevärt med en `pageStack`, med den extra bonusen av navigeringsåtgärder:
uk: Попередній приклад можна значно скоротити за допомогою `pageStack`, із додаванням бонуса дій з навігації:

source: In general you'll want to use a `pageStack` rather than implement your own [PageRow](docs:kirigami;org.kde.kirigami.PageRow), especially when your application gets bigger and you need your components living in separate files. If you create your window in your `Main.qml` using a [Kirigami.ApplicationWindow](docs:kirigami;org.kde.kirigami.ApplicationWindow), a component residing in another file can still directly invoke the global `pageStack` by means of a call to the [applicationWindow()](docs:kirigami;org.kde.kirigami.AbstractApplicationWindow::applicationWindow):
ca: En general, voldreu utilitzar una `pageStack` en lloc d'implementar la vostra [PageRow](docs:kirigami;org.kde.kirigami.PageRow), especialment quan la vostra aplicació es fa més gran i necessiteu els vostres components residint en fitxers separats. Si creeu la finestra al vostre `Main.qml` utilitzant un [Kirigami.ApplicationWindow](docs:kirigami;ApplicationWindow), un component que resideix en un altre fitxer encara pot invocar directament la `pageStack` global mitjançant una crida a la [applicationWindow()](docs:kirigami;org.kde.kirigami.AbstractApplicationWindow::applicationWindow):

source: and
ca: i
eo: kaj
es: y
nl: en
pt: e
sl: in
sv: och
uk: і

source: Clicking the button pushes a new page with help of applicationWindow
ca: En fer clic al botó s'empeny una pàgina nova amb l'ajuda d'«applicationWindow»
eo: Alklakante la butonon puŝas novan paĝon helpe de applicationWindow
es: Al hacer clic en el botón se abre una nueva página con la ayuda de applicationWindow
nl: Op de knop klikken brengt een nieuwe pagina met behulp van applicationWindow
pt: Se carregar no botão, irá sobrepor uma nova página com a ajuda da 'applicationWindow'
sl: Klik na gumb potisne novo stran s pomočjo applicationWindow
sv: Att klicka på knappen lägger till en ny sida med hjälp av applicationWindow
uk: Натискання кнопки виштовхує нову сторінку за допомогою applicationWindow

source: Progress bars and indicators
ca: Barres de progrés i indicadors
eo: Progresaj stangoj kaj indikiloj
es: Barras de avance e indicadores
nl: Voortgangsbalken en indicatoren
sl: Vrstice napredka in indikatorji
sv: Förloppsrader och indikatorer
uk: Смужки поступу і індикатори

source: Provide your users with loading state information using progress bars.
ca: Proporcionant als usuaris la informació sobre l'estat de càrrega mitjançant barres de progrés.
eo: Provizu al viaj uzantoj ŝargostatajn informojn per plenumskaloj.
es: Proporcione a sus usuarios información sobre el estado de carga mediante barras de avance.
fr: Fournissez à vos utilisateurs des informations sur l'état de chargement à l'aide de barres de progression.
nl: Bied uw gebruikers de informatie over de ladingstatus met voortgangsbalken.
pl: Pokaż swoim użytkownikom postęp wczytywania przy użyciu pasków postępu.
pt: Ofereça aos seus utilizadores a informação do carregamento do estado com as barras de progresso.
sl: Svojim uporabnikom zagotovite informacije o stanju nalaganja z uporabo vrstic napredka.
sv: Tillhandahåll dina användare med information om inläsningstillstånd genom att använda förloppsrader.
uk: Надання вашим користувачам даних щодо стану завантаження за допомогою смужок поступу.

source: Whenever your application does something that takes a noticeable amount of time, you will want to use a visual element that tells the user that something is happening in the background.
ca: Sempre que l'aplicació faci alguna cosa que requereixi una quantitat considerable de temps, voldreu utilitzar un element visual que digui a l'usuari que en segon pla està succeint alguna cosa.
eo: Kiam ajn via aplikaĵo faras ion, kio daŭras rimarkindan tempon, vi volos uzi vidan elementon, kiu diras al la uzanto, ke io okazas en la fono.
es: Siempre que su aplicación haga algo que requiera una cantidad considerable de tiempo, querrá usar un elemento visual que le diga al usuario que algo está sucediendo en segundo plano.
fr: Chaque fois que votre application effectue une action prenant un temps considérable, vous voudrez utiliser un élément visuel indiquant à l'utilisateur que quelque chose se passe en arrière-plan.
nl: Wanneer uw toepassing iets doet dat een merkbare hoeveelheid tijd kost, wilt u een visueel element gebruiken dat de gebruiker vertelt dat er iets in de achtergrond gebeurt.
pl: Za każdym razem, gdy twoja aplikacja robi coś, co trwa znaczą ilość czasu, to będziesz chciał, aby użytkownik mógł widzieć postęp i że coś się dzieje w tle.
pt: Sempre que a sua aplicação faça algo que demore uma quantidade de tempo notória, irá querer usar um elemento visual que indique ao utilizador que algo está a acontecer em primeiro plano.
sl: Kadarkoli vaša aplikacija naredi nekaj, kar zahteva vidno količino časa, bi želeli uporabiti vizualni element, ki uporabniku pove, da se nekaj dogaja v ozadju.
sv: När programmet än gör något som tar en märkbart lång tid, bör du använda ett visuellt element som talar om för användaren att någonting händer i bakgrunden.
uk: Кожного разу, коли ваша програма виконує якісь завдання, для виконання яких потрібно доволі багато часу, вам знадобиться візуальний елемент, який повідомлятиме користувачу про те, що щось відбувається у фоновому режимі.

source: QtQuick Controls provides two useful components that you can use to this end.
ca: Els QtQuick Controls proporcionen dos components útils que podreu utilitzar per a aquesta finalitat.
eo: QtQuick Controls provizas du utilajn komponantojn, kiujn vi povas uzi ĉi-cele.
es: Los controles de QtQuick proporcionan dos componentes útiles que puede usar para este fin.
fr: QtQuick Controls fournit deux composants utiles que vous pouvez utiliser à cette fin.
nl: QtQuick Controls biedt twee nuttige componenten die u hiervoor kunt gebruiken.
pl: QtQuick Controls daje dwa użyteczne składniki, których możesz użyć do tego.
pt: Os controlos do QtQuick oferecem dois componentes úteis que poderá usar para esse fim.
sl: QtQuick Controls ponuja dve uporabni komponenti, ki jih lahko uporabite v ta namen.
sv: QtQuick Controls tillhandahåller två användbara komponenter som du kan använda i detta syfte.
uk: У QtQuick Controls передбачено два корисних компоненти, якими ви можете скористатися для виконання цього завдання.

source: Progress bar
ca: Barra de progrés
eo: Progresa stango
es: Barra de avance
fr: Barre de progression
nl: Voortgangsbalk
pl: Pasek postępu
pt: Barra de progresso
sl: Vrstica napredka
sv: Förloppsrad
uk: Панель поступу

source: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) is a component that lets you easily include progress bars in your application. There are four main properties you will need to use:
ca: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) és un component que permet incloure amb facilitat barres de progrés en la vostra aplicació. Hi ha quatre propietats principals que haureu d'utilitzar:
eo: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) estas komponanto, kiu ebligas vin facile inkluzivi progresbretojn en via aplikaĵo. Estas kvar ĉefaj propraĵoj, kiujn vi devos uzi:
es: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) es un componente que le permite incluir barras de avance con facilidad en una aplicación. Existen cuatro propiedades principales que tendrá que usar:
nl: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) is een component die u gemakkelijk voortgangsbalken in uw toepassing laat gebruiken. Er zijn vier hoofdeigenschappen die u nodig hebt bij gebruik:
pt: O [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) é um componente que lhe permite incluir facilmente barras de progresso na sua aplicação. Existem quatro propriedades principais que irá necessitar de usar:
sl: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) je komponenta, ki vam v aplikacijo dovoli enostavno vključiti vrstico napredka. Obstajajo štiri glavne lastnosti, ki jih boste morali uporabiti:
sv: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) är en komponent som enkelt låter dig inkludera förloppsrader i programmet. Det finns fyra huvudegenskaper som du behöver använda:
uk: [Controls.ProgressBar](docs:qtquickcontrols;QtQuick.Controls.ProgressBar) є компонентом, який надає вам змогу просто включити смужки поступу до вашої програми. Існує чотири основних властивості, якими вам потрібно буде скористатися:

source: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): the minimum value represented by the start of the progress bar
ca: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): el valor mínim representat pel començament de la barra de progrés
eo: [de](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): la minimuma valoro reprezentita de la komenco de la progresbreto
es: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): el valor mínimo representado por el inicio de la barra de avance
nl: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): de minimale waarde gerepresenteerd bij het begin van de voortgangsbalk
pt: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): o valor mínimo representado pelo início da barra de progresso
sl: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): najmanjša vrednost, ki jo predstavlja začetek vrstice napredka
sv: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): Det minsta värdet som representeras av förloppsradens början
uk: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): мінімальне значення, яке відповідає початку смужки поступу

source: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): the maximum value represented by the end of the progress bar
ca: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): el valor màxim representat pel final de la barra de progrés
eo: [al](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): la maksimuma valoro reprezentita per la fino de la progresbreto
es: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): el valor máximo representado por el final de la barra de avance
nl: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): de maximale waarde gerepresenteerd bij het einde van de voortgangsbalk
pt: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): o valor máximo representado pelo fim da barra de progresso
sl: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): največja vrednost, ki jo predstavlja konec vrstice napredka
sv: [from](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#from-prop): Det maximala värdet som representeras av förloppsradens slut
uk: [to](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#to-prop): максимальне значення, яке відповідає кінцю смужки поступу

source: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): the current value of the action that is in progress (e.g. 50% loaded)
ca: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): el valor actual de l'acció que està en curs (p. ex., 50% carregat)
eo: [valoro](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): la aktuala valoro de la ago kiu estas en progreso (ekz. 50% ŝargita)
es: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): el valor actual de la acción que está en proceso (por ejemplo, 50% cargado)
nl: [value]](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop):: de huidige waarde van de actie die voortgang aanduidt (bijv. 50% geladen)
pt: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): o valor actual da acção em curso (p.ex., 50% carregado)
sl: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): trenutna vrednost dejavnosti, ki je v teku (npr. 50% naloženo)
sv: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): Det aktuella värdet för åtgärden som pågår (t.ex. 50 % inläst)
uk: [value](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#value-prop): поточне значення рівня виконання дії (наприклад, отримано 50% даних)

source: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): if the action that is in process currently has no clear progress value, you can set this property to `true` to show the user that something is happening but its progress is not yet clear (but will be soon).
ca: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): si l'acció que està en procés actualment no té un valor de progrés clar, podreu establir aquesta propietat a `true` per a mostrar a l'usuari que està succeint alguna cosa, però el seu progrés encara no està clar (però que ho estarà aviat).
eo: [nedeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): se la ago kiu estas en procezo nuntempe ne havas klaran progresvaloron, vi povas agordi ĉi tiu propreco al `vera` por montri al la uzanto ke io okazas sed ĝia progreso ankoraŭ ne estas klara (sed estos baldaŭ).
es: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): si la acción que está en proceso en la actualidad no tiene un valor de avance claro, puede definir esta propiedad a `true` para indicar al usuario que está ocurriendo algo, pero que su avance todavía no está claro (aunque lo estará en breve).
nl: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): als de actie die nu bezig is geen heldere voortgangswaarde heeft, dan kunt u deze eigenschap op true instellen om aan de gebruiker te tonen dat er iets gebeurt maar dat de voortgang nog niet helder is (maar spoedig wel).
pt: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): se a acção que está a ser processada não tem um valor de progresso em concreto, poderá configurar esta propriedade como `true` para mostrar o utilizador que algo está a acontecer, mas que a sua evolução ainda não está bem definida (mas que o estará em breve).
sl: nedoločljivo [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): če dejanje, ki je v postopku, trenutno nima jasne vrednosti napredka, lahko to lastnost nastavite tako, da bo uporabniku pokazala, da se nekaj dogaja, vendar njegov napredek še ni jasen (vendar bo kmalu).
sv: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): om åtgärden som för närvarande pågår har inget klart förloppsvärde, kan du ställa in den här egenskapen till `true` för att visa för användaren att någonting händer men att förloppet inte ännu är klart (men snart är det).
uk: [indeterminate](https://doc.qt.io/qt-6/qml-qtquick-controls2-progressbar.html#indeterminate-prop): якщо дія, яка зараз виконується не має точного значення рівня поступу, ви можете встановити для цієї властивості значення `true` для показу користувачу того, що щось відбувається, але параметри поступу цього не є очевидними (але невдовзі ці параметри буде отримано).
