Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: The main content of the card has been populated with the cell phone number and the email of the contact, structured as a [column](https://doc.qt.io/qt-5/qml-qtquick-column.html) of [labels](https://doc.qt.io/qt-5/qml-qtquick-controls2-label.html).
fr: Le contenu principal de la carte a été rempli avec le numéro de téléphone portable et l'adresse électronique du contact, structuré comme une [colonne](https://doc.qt.io/qt-5/qml-qtquick-column.html) [d'étiquettes](https://doc.qt.io/qt-5/qml-qtquick-controls2-label.html).
pl: Główna treść karty została wypełniona numerem telefonu komórkowego i adresem email kontaktu, ułożonym jako [kolumna](https://doc.qt.io/qt-5/qml-qtquick-column.html) [etykiet](https://doc.qt.io/qt-5/qml-qtquick-controls2-label.html).

source: The application should look like this:
fr: L'application devrait ressembler à ceci :
pl: Aplikacja powinna wyglądać następująco:
pt: A aplicação deverá ficar semelhante ao seguinte:

source: ![Simple grid of cards](implementation.png)
fr: ! [Une grille simple de cartes](implementation.png)
pl: ![Prosta siatka kart](implementation.png)
pt: ![Grelha de cartões simples](implementation.png)

source: You can find the full source code of the tutorial at [invent.kde.org](https://invent.kde.org/dkardarakos/kirigami-tutorial).
fr: Vous pouvez trouver le code source complet du tutoriel à l'adresse [invent.kde.org](https://invent.kde.org/dkardarakos/kirigami-tutorial).
pl: Pełny kod źródłowy tego samouczka możesz pobrać z [invent.kde.org](https://invent.kde.org/dkardarakos/kirigami-tutorial).
pt: Poderá encontrar o código-fonte do tutorial na totalidade em [invent.kde.org](https://invent.kde.org/dkardarakos/kirigami-tutorial).

source: As a last step we will add some dummy functionality to each card. In particular, a "call" action will be added. Nevertheless, instead of a real call, a passive notification will be displayed. So, let's change the card Component to the following:
fr: Dans un dernier temps, nous ajouterons quelques fonctionnalités factices à chaque carte. En particulier, une action « Appel » sera ajoutée. Néanmoins, au lieu d'un appel réel, une notification passive sera affichée. Ainsi, modifions donc le composant de la carte comme suit :
pl: W ostatnim korku dodamy pewną fikcyjną funkcjonalność do każdej karty. W szczególności, zostanie dodane działanie "call". Mimo tego, zamiast rzeczywistego wywołania, zostanie wyświetlone bierne powiadomienie. Tak więc zmieńmy składnik karty następująco:

source: So, we added an [action](docs:kirigami2;Action) that, as soon as it is triggered (by pressing the action button), a [passive notification](docs:kirigami2;AbstractApplicationWindow) is displayed.
fr: Nous avons donc ajouté une [action](docs:kirigami2;Action) qui, dès qu'elle est déclenchée (en appuyant sur le bouton d'action), affiche une [notification passive](docs:kirigami2;AbstractApplicationWindow).
pl: Tak więc dodaliśmy [działanie](docs:kirigami2;Action), które zaraz po jego wyzwoleniu (poprzez naciśnięcie przycisku działania), wyświetli [bierne powiadomienie](docs:kirigami2;AbstractApplicationWindow).

source: Finally, our application should look like this:
fr: A la fin, notre application devrait ressembler à ceci :
pl: Na końcu, nasza aplikacja powinna wyglądać następująco:
pt: Finalmente, a nossa aplicação deverá ficar parecida com o seguinte:

source: ![Grid with calling action triggered](implementation-actions.png)
fr: ! [Grille avec les appels d'actions déclenchés](implementation-actions.png)
pl: ![Siatka z wywołanym działaniem wywołującym](implementation-actions.png)
pt: ![Grelha com acção de chamada desencadeada](implementation-actions.png)

source: Now that we understand how pages work, it is time to add stuff to ours. We will be going through a number of important layout components and elements that will be useful when designing our app.
fr: Maintenant que nous comprenons le fonctionnement des pages, il est temps d'ajouter des éléments aux nôtres. Nous allons passer en revue un certain nombre de composants et d'éléments de mise en page importants qui nous seront utiles lors de la conception de notre application.
pl: Teraz, gdy już rozumiemy jak działają strony, pora na dodanie naszych rzeczy. Przejdziemy przez kilka ważnych składników układów i rzeczy, które będą użyteczne przy tworzeniu naszej aplikacji.
pt: Agora que compreendemos como funcionam as páginas, é a altura de adicionarmos alguma coisa às nossas. Iremos percorrer um conjunto de componentes de disposição importantes e pelos elementos que serão úteis ao desenhar a nossa aplicação.

source: Don't be scared by the big chunks of code! We'll be going over everything that we haven't covered before, and by the end of this section you'll have a neat-looking app.
fr: Ne soyez pas effrayé par les gros morceaux de code ! Nous allons passer en revue tout ce que nous n'avons pas encore abordé et à la fin de cette section, vous aurez une application tout à fait soignée.
pl: Niech nie przeraża cię duża ilość kodu! Przejdziemy przez wszystko, o czym jeszcze nie mówiliśmy, a na końcu tego rozdziału będziesz miał ładnie wyglądającą aplikację.
pt: Não tenha medo dos grandes blocos de código! Iremos percorrer tudo o que ainda não vimos antes e, no fim desta secção, irá ter uma aplicação com bom aspecto.

source: If you've ever used Discover, NeoChat, or Plasma's System Settings, you will have come across a ListView. Quite simply, ListViews let you display data on a list.
fr: Si vous avez déjà utilisé Discover, NeoChat ou les configuration du système Plasma, vous avez forcément rencontré un affichage en liste. Ces derniers vous permettent tout simplement d'afficher des données dans une liste.
pl: Jeśli kiedykolwiek używałeś Odkrywcy, NeoChat lub Ustawień Systemowych Plazmy, to na pewno widziałeś widok ListView. Ujmując to prosto, widoki ListViews umożliwiają ci wyświetlanie danych na liście.

source: That seems cryptic, but don't worry. Let's start from the top.
fr: Cela semble mystérieux mais ne vous inquiétez pas. Commençons par le début.
pl: Wydaje się to tajemnicze, lecz nie przejmuj się. Zacznijmy od góry.

source: The first thing you'll notice is that we're using `Kirigami.CardsListView`. This is a ListView that allows us to easily display cards in a list. However, ListViews are made to show data taken from a model - to automatically populate itself from a set of data that we point it to. That's where the `model` property comes in: in this example, it's pointing to `kountdownModel`.
fr: La première chose que vous remarquerez est que nous utilisons « Kirigami.CardsListView ». Il s'agit d'un objet « ListView » nous permettant d'afficher facilement des cartes dans une liste. Cependant, ces objets « ListViews » sont conçus pour afficher des données provenant d'un modèle - pour se remplir automatiquement à partir d'un ensemble de données que nous lui indiquons. C'est là que la propriété « model » intervient : dans cet exemple, elle pointe vers « kountdownModel. »
pl: Pierwszą rzeczą jaką zauważysz, jest to, że używamy `Kirigami.CardsListView`. Jest to ListView, który umożliwia nam łatwe wyświetlanie kart na liście. Jednakże, ListViews są stworzone do wyświetlanie danych pobranych z modelu - aby samoczynnie wypełnić się zestawem danych, na który wskażemy. To miejsce, w którym do gry wchodzi właściwość `model`: w tym przykładzie wskazuje ona na `kountdownModel`.

source: A model defines the way that a data entry is structured. By looking at our ListElement above we can see how elements of kountdownModel are structured: they contain a name, a description, and a date. The first two are just strings, and the third is a number we're using as a placeholder.
fr: Un modèle définit la manière dont une entrée de données est structurée. En regardant notre objet « ListElement » ci-dessus, nous pouvons voir comment les éléments de l'objet « kountdownModel » sont structurés : ils contiennent un nom, une description et une date. Les deux premiers sont simplement des chaînes de caractères et le troisième est un nombre que nous utilisons comme caractère de remplacement.
pl: Tryb modalny określa sposób w jaki wpisywanie danych jest ułożone. Patrząc na nasz ListElement powyżej możemy zobaczyć w jaki sposób rzeczy kountdownModel są ułożone: zawierają nazwę, opis oraz datę. Pierwsze dwa są tylko ciągani znaków, a trzeci jest liczbą, która używamy jako pole zastępcze.

source: ListModelName.append(jsobject yourobject) adds a JavaScript object you provide to the ListModel, and places it after the last item in the model. For this to happen correctly, you must provide a JavaScript Object with the correct properties and corresponding datatypes.
fr: La méthode « ListModelName.append(jsobject yourobject) » ajoute un objet JavaScript que vous fournissez à l'objet « ListModel » et le place après le dernier élément du modèle. Pour que cela se réalise correctement, vous devez fournir un objet JavaScript avec les propriétés correctes et les types de données correspondants.
pl: ListModelName.append(jsobject yourobject) dodaje obiekt JavaScript, który dostarczysz do ListModel i umieszcza go za ostatnią rzeczą w modelu. Aby odbyło się to poprawnie, musisz dostarczyć obiekt JavaScript z poprawnymi właściwościami i odpowiednimi rodzajami danych.

source: ListModelName.get(int index) returns the JSObject at the index location you provide.
fr: ListModelName.get(int index) renvoie l'objet « JSObject » à l'emplacement de l'index que vous avez fourni.
pl: ListModelName.get(int index) zwraca JSObject w miejscu indeksu, który podasz.

source: ListModelName.remove(int index, int count) removes the JSObject at the provided index location, and as many after that index location as you wish (1 includes only the JSObject at the provided index)
fr: La fonction « ListModelName.remove(int index, int count) » supprime l'objet « JSObject » à l'emplacement de l'index fourni, et autant après cet emplacement d'index que vous le souhaitez (1 adresse seulement l'objet « JSObject » à l'indice fourni).
pl: ListModelName.remove(int index, int count) usuwa JSObject w miejscu wskazanym przez index i tyle obiektów po nim ile chcesz (1 oznacza tylko jeden JSObject wskazany przez index)

source: ListModelName.set(int index, jsobject yourobject) changes the item at the provided index location with the values provided in yourobject. Same rules as with `.append`.
fr: La fonction « ListModelName.set(int index, jsobject yourobject) » modifie l'élément à l'emplacement de l'index fourni avec les valeurs fournies dans « yourobject ». Les mêmes règles s'appliquent avec « .append ».
pl: ListModelName.set(int index, jsobject twójObiekt) zmienia rzecz pod podanym indeksem na wartości podane w twójObiekt. Te same zasady co z `.append`.

source: Delegate
fr: Déléguer
pl: Deleguj
pt: Delegado

source: The delegate handles how your ListModel's data will be displayed in the ListView. CardsListView elements are designed with card-type delegates in mind, and we have indeed used a `Kirigami.AbstractCard` element as our delegate in the excerpt above.
fr: Le délégué gère la façon dont les données de votre objet « ListModel » seront affichées dans l'objet « ListView ». Les éléments « CardsListView » sont conçus avec des délégués de type carte en tête et nous avons effectivement utilisé un élément « Kirigami.AbstractCard » comme notre délégué comme indiqué dans l'extrait ci-dessus.
pl: Delegat określa jak dane naszego modelu ListModel będą wyświetlane na widoku ListView. Rzeczy z CardsListView zostały stworzone dla delegatów o rodzaj karty i rzeczywiście użyliśmy rzeczy `Kirigami.AbstractCard` w naszym delegacie w wycinku powyżej.

source: Delegates automatically receive the properties of the ListElements that we have specified in our model. We can therefore just refer to the `name`, `description`, and `date` properties of our ListElements as if they were a conventional variable within our delegate.
fr: Les délégués reçoivent automatiquement les propriétés des objets « ListElement » que nous avons spécifié dans notre modèle. Nous pouvons donc simplement se référer aux propriétés « name », « description » et « date » de nos objets « ListElement », comme si elles étaient une variable conventionnelle dans notre délégué.
pl: Delegaci samoczynnie otrzymują właściwości ListElements, które określiliśmy w naszym modelu. Stąd możemy odnosić się do właściwości `name`, `description` oraz `date` naszej ListElements tak, jakby były zwykłymi zmiennymi w naszym delegacie.
pt: Delega automaticamente as propriedades dos ListElements que tivermos configurado no nosso modelo. Poderemos assim fazer referência às propriedades `name`, `description` e `date` dos nossos ListElement's, como se fossem uma variável normal dentro do nosso objecto-delegado.

source: Building our delegate card
fr: Construction de notre carte déléguée
pl: Budowanie naszej karty delegata
pt: Construir o nosso cartão delegado

source: Looking at our Kirigami.AbstractCard, the first properties we set are `implicitWidth` and `implicitHeight`. We have set these to the `delegateLayout.implicitWidth` and `delegateLayout.implicitHeight`, i.e. the `implicitWidth` and `implicitHeight` of the `GridLayout` element. Implicit widths and heights are properties that are set as a sort of default, i.e. if there is no explicit width or height set for these components. We have therefore set the `implicitWidth` and `implicitHeight` of our `Kirigami.AbstractCard` to that of the `GridLayout` below to ensure the `GridLayout` does not spill out of the card.
fr: En regardant notre « Kirigami.AbstractCard », les premières propriétés que nous définissons sont « implicitWidth » et « implicitHeight ». Nous leur avons attribué les valeurs « delegateLayout.implicitWidth » et « delegateLayout.implicitHeight », c'est-à-dire les valeurs « implicitWidth » et « implicitHeight » de l'élément « GridLayout ». Les largeurs et hauteurs implicites sont des propriétés définies par défaut, c'est-à-dire si aucune largeur ou hauteur explicite ne sont définies pour ces composants. Nous avons donc défini les propriétés « implicitWidth » et « implicitHeight » de notre « Kirigami.AbstractCard » selon celles de l'élément « GridLayout » ci-dessous pour nous assurer que ce dernier ne déborde pas de la carte.
pl: Patrząc na nasze Kirigami.AbstractCard, pierwszymi właściwościami, które nadamy, to `implicitWidth` oraz `implicitHeight`. Ustawiliśmy je na `delegateLayout.implicitWidth` oraz `delegateLayout.implicitHeight`, tj. `implicitWidth` oraz `implicitHeight` rzeczy `GridLayout`. Niejednoznacznie podane szerokości i wysokości są rodzajem domyślnych wartości, tj. nie ma podanej jednoznacznie szerokości i wysokości dla tych składników. Stąd ustawiliśmy `implicitWidth` oraz `implicitHeight` naszej `Kirigami.AbstractCard` na tę z `GridLayout` poniżej, aby upewnić się, że `GridLayout` nie wyleje naszej karty.

source: The `GridLayout` is inside the `Item` component we have provided for the property `contentItem`. This is the item that contains what will be displayed in your card.
fr: Le « GridLayout » se trouve à l'intérieur du composant « Item » que nous avons fourni pour la propriété « contentItem ». Il s'agit de l'élément contenant ce qui sera affiché dans votre carte.
pl: `GridLayout` znajduje się wewnątrz składnika `Item`, który podaliśmy we właściwości `contentItem`. Jest to rzecz, która zawiera to, co będzie wyświetlane w naszej karcie.

source: We also need to choose a layout for our components so that they don't just pile on top of each other. There are three main types that we can choose from:
fr: Nous devons également choisir une disposition pour nos composants afin qu'ils ne s'empilent pas les uns sur les autres. Il existe trois types principaux parmi lesquels nous pouvons choisir :
pl: Musimy także wybrać układ dla naszych składników tak, aby nie zgrupowały się jeden na drugim. Istnieją trzy różne rodzaje, z których możemy wybrać:

source: `ColumnLayout` lays out your components vertically, in a single column
fr: « ColumnLayout » présente vos composants verticalement, dans une seule colonne.
pl: `ColumnLayout` układa twoje składniki w pionie, w pojedynczej kolumnie

source: `RowLayout` lays out your components horizontally, in a single row
fr: « RowLayout » dispose vos composants horizontalement, sur une seule ligne.
pl: `RowLayout` układa twoje składniki w poziomie, w pojedynczym wierszu

source: `GridLayout` lays out your components in a grid with a composition of your choosing
fr: « GridLayout » dispose vos composants dans une grille avec une disposition de votre choix.
pl: `GridLayout` układa składnik w siatkę z układem taki jaki sobie wybierzesz

source: With ColumnLayout and RowLayout, all we have to do is write our components inside the Layout component. As you can see, we went with a grid layout, which entails a bit more handiwork.
fr: Avec les paramètres « ColumnLayout » et « RowLayout », tout ce que nous avons à faire est d'écrire nos composants à l'intérieur du composant « Layout ». Comme vous pouvez le constater, nous avons opté pour une disposition en grille, ce qui implique un peu plus de travail manuel.
pl: Z ColumnLayout oraz RowLayout jedyne, co musimy zrobić to wpisać nasze składniki do wewnątrz składnika Layout. Jak widzisz, wybraliśmy układ siatki, który wymaga trochę więcej pracy ręcznej.

source: The first thing you see is our `anchor`. QtQuick's anchoring system provides a useful way of making sure your components are positioned on certain parts of a parent component. We have anchored our `GridLayout` to the left, top, and right of the parent card, ensuring our content stretches across the whole card.
fr: La première chose que vous voyez est notre « ancre ». Le système d'ancrage de QtQuick fournit un moyen utile de s'assurer que vos composants sont positionnés sur certaines parties d'un composant parent. Nous avons ancré notre objet « GridLayout » à gauche, en haut et à droite de la carte parente, en nous assurant que notre contenu s'étende sur la totalité de la carte.
pl: Pierwszą rzeczą jaką zobaczysz jest nasza `anchor`. System kotwiczenia QtQuick dostarcza użytecznych sposobów na zapewnienie, że rzeczy są umieszczone w pewnych częściach rzeczy nadrzędnej. Zakotwiczyliśmy nasz `GridLayout` do lewe, do góry i dp prawej naszej karty nadrzędnej, upewniając się, że nasza treść rozciągnie się na całą kartę.

source: Next we specify the spacing between the rows and columns within our grid, so that our components don't bunch up. Kirigami provides a number of handy pre-defined units to use for this purpose:
fr: Ensuite, nous spécifions l'espacement entre les lignes et les colonnes de notre grille, pour que nos composants ne s'entassent pas. Kirigami fournit un certain nombre d'unités pratiques prédéfinies à utiliser pour cela :
pl: Następnie określamy odstępy pomiędzy wierszami i kolumnami w naszej siatce, tak aby nasze składniki nie zgrupowały się. Kirigami dostarcza kilka przydatnych jednostek do tego celu:

source: gridUnit
fr: Unité de grille

source: We have also used a conditional here to vary the number of columns in our grid depending on the screen we are using. If we are using a widescreen (i.e. a computer monitor or a phone in landscape) the grid will have 4 columns, else it will have 2.
fr: Nous avons également utilisé une conditionnelle ici pour faire varier le nombre de colonnes de notre grille selon l'écran que nous utilisons. Si nous utilisons un écran large (c'est-à-dire un écran d'ordinateur ou un téléphone en mode paysage), la grille aura 4 colonnes, sinon elle en aura 2.
pl: Użyliśmy tutaj także warunku, aby zmienić liczbę kolumn na naszej siatce w zależności od ekranu, którego używamy. Jeśli używamy szerokiego ekranu (tj. monitora komputerowego lub telefonu w ustawieniu poziomym) to siatka będzie miała 4 kolumny, w przeciwnym przypadku 2.

source: Interior components
fr: Composants intérieurs
pl: Składniki wnętrza

source: We could just create three labels within our delegate component and call it a day. But that wouldn't look particularly nice.
fr: Nous pourrions simplement créer trois étiquettes au sein de notre composant délégué et l'appeler une journée. Mais cela n'aura pas un bel aspect.
pl: Moglibyśmy stworzyć trzy etykiety wewnątrz naszego składnika delegata i powiedzieć to wszystko. Nie wyglądałoby to jednak szczególnie ładnie.
pt: Poderemos criar apenas três legendas dentro do nosso componente delegado e seria tudo. Mas não ficaria propriamente bonito.

source: Left, `Kirigami.Heading`: uses the `ListElement`'s `date` as a level 1 heading.
fr: À gauche, « Kirigami.Heading » : utilise la « date » de l'« ListElement » comme un titre de niveau 1.
pl: Po lewej, `Kirigami.Heading`: używa `date` rzeczy `ListElement` na 1 poziomie nagłówka.

source: Middle, `ColumnLayout`: has a `Kirigami.Heading` that displays the task name; a `Kirigami.Separator`, which provides the horizontal line; and a `Controls.Label`, that displays a task's optional description. The latter two components have a `visible` property, which checks if the description is empty or not and displays the components depending on the result of `description.length > 0`.
fr: Au milieu, « ColumnLayout » : possède un objet « Kirigami.Heading » affichant le nom de la tâche, un objet « Kirigami.Separator » fournissant la ligne horizontale et un objet « Controls.Label » affichant la description optionnelle d'une tâche. Les deux derniers composants possèdent une propriété « visible », vérifiant si la description est vide ou non et affiche les composants en fonction du résultat de la condition « description.length > 0 ».
pl: Środkowe, `ColumnLayout`: ma `Kirigami.Heading`, który wyświetla nazwę zadania; `Kirigami.Separator`, który stanowi linię w poziomie; oraz `Controls.Label`, który wyświetla dobrowolny opis zadania. Dwa drugie składniki mają właściwość `visible`, która sprawdza, czy opis jest pusty, czy nie i wyświetla składniki w zależności od wyniku `description.length > 0`.

source: Right, `Controls.Button`: a button that will do something... soon!
fr: A droite, « Controls.Button » : un bouton qui fera quelque chose... bientôt !
pl: Po prawej, `Controls.Button`: przycisk, który będzie coś robić... wkrótce!

source: Over the past few tutorials you have built a basic but functional Kirigami application that lets you add, edit, and delete date countdowns. In doing so we have learned about Kirigami and QtQuick components, some of QML's systems, basic application layouts, and more. Not bad at all!
fr: Au cours des derniers tutoriels, vous avez construit une application basique avec Kirigami mais fonctionnelle, vous permettant d'ajouter, de modifier et de supprimer des comptes à rebours. Ainsi, nous avons appris à connaître les composants de Kirigami et de QtQuick, certains systèmes de QML, les dispositions de base des applications, et plus encore. Pas mal du tout !
pl: Przez kilka poprzednich samouczków zbudowałeś podstawową, lecz funkcjonalną aplikację Kirigami, która umożliwia dodawanie, zmianę oraz usuwanie odliczeń dat. Robiąc, to dowiedzieliśmy się więcej o składnikach Kirigami oraz QtQuick, niektórych systemach QML, podstawowych układach aplikacji oraz więcej. Całkiem nieźle!
