Repository: KDE/documentation-develop-kde-org
Catalog: po/*/kirigami-tutorial.po
Languages: ca, eo, es, fr, nl, pl, pt, sl, sv, uk

source: We have several pieces of documentation that can help guide you towards becoming a contributor. We recommend you take a look at the developer-specific section of [our 'Get Involved' guide](https://community.kde.org/Get_Involved/development) which can help you learn more about the KDE Community's development workflow. We also recommend you take a look at our documentation for KDE's GitLab instance, called [Invent](https://community.kde.org/Infrastructure/GitLab), as you will likely need to interact with it during the development process. The KDE Community interacts mainly through Matrix, and we also have [a page on the community wiki](https://community.kde.org/Matrix) that will guide you with setting up with your very own account.
fr: Plusieurs documents sont disponibles pour vous aider à devenir un contributeur. Nous vous recommandons de jeter un coup d'œil à la section spécifique aux développeurs dans [notre guide « Soyez impliqué »](https://community.kde.org/Get_Involved/development) pouvant vous aider à en apprendre davantage sur le flux de travail de développement de la communauté KDE. Nous vous recommandons également de consulter notre documentation sur l'instance « GitLab » de KDE, appelée [Invent](https://community.kde.org/Infrastructure/GitLab). En effet, vous aurez probablement besoin d'interagir avec elle au cours du processus de développement. La communauté KDE interagit principalement par le biais de Matrix et nous avons également [une page sur le wiki de la communauté](https://community.kde.org/Matrix) pour vous guider dans la création de votre propre compte.
pl: Mamy klika części dokumentacji, które pomogą ci stać się twórcą. Polecamy zajrzeć do naszego działu poświęconego programistom [naszego przewodnika o 'Dołączeniu'](https://community.kde.org/Get_Involved/development), który pomoże ci dowiedzieć się więcej o obiegu pracy w pracach Społeczności KDE. Polecamy także zajrzeć do naszej dokumentacji na GitLabie KDE, o nazwie [Invent](https://community.kde.org/Infrastructure/GitLab), bo z pewnością będziesz musiał z niej korzystać podczas swojego tworzenia. Społeczność KDE porozumiewa się głównie poprzez Matriksa, mamy także [stronę o społeczności na wiki](https://community.kde.org/Matrix), która pomoże ci ustawić swoje własne konto.

source: A touch friendly calendar application designed for mobile devices
fr: Une application conviviale d'agenda, conçue pour les appareils mobiles.
pl: Kalendarz dla urządzeń przenośnych, pomyślany do obsługi przez dotyk

source: [Understanding CMakeLists](/docs/kirigami/advanced-understanding_cmakelists)
fr: [Comprendre le fichier « CMakeLists »](/docs/kirigami/advanced-understanding_cmakelists)
pl: [Rozumienie CMakeLists](/docs/kirigami/advanced-understanding_cmakelists)

source: [Figuring out main.cpp](/docs/kirigami/advanced-maincpp)
fr: [Comprendre le fichier principal « main.cpp »](/docs/kirigami/advanced-maincpp)
pl: [Rozumienie main.cpp](/docs/kirigami/advanced-maincpp)

source: Getting to grips with the central C++ file that handles your applications' initialisation.
fr: Maîtriser le fichier principal C++ gérant l'initialisation de vos applications.
pl: Zrozumienie głównego pliku C++, który zaczyna twoją aplikację.

source: [Connect logic to your QML user interface](/docs/kirigami/advanced-connect_backend)
fr: [Connecter une logique à votre interface utilisateur « QML »](/docs/kirigami/advanced-connect_backend)
pl: [Podłącz logikę do swojego interfejsu użytkownika QML](/docs/kirigami/advanced-connect_backend)

source: If you are completely new to C++ there are numerous resources available throughout the web. Here are some that may be useful.
fr: Si vous êtes totalement débutant en développement en C++, il existe de nombreuses ressources disponibles sur le Internet. En voici quelques-unes qui pourraient vous être utiles.
pl: Jeśli jesteś zupełnie nowym w C++, to istnieje wiele zasobów w sieci. Oto kilka, które mogą być użyteczne.

source: If you'd like to work on more complex KDE applications such as Dolphin, Kontact, or Kate, you will need to learn more about how to use QtWidgets, which encompass a completely different way of developing user interfaces with Qt. While not interchangeable with QML/Kirigami - they each have a different set of tradeoffs - older and more complex KDE applications tend to be built with QtWidgets.
fr: Si vous souhaitez travailler sur des applications pour KDE plus complexes telles que Dolphin, Kontact ou Kate, vous devrez apprendre à utiliser QtWidgets, qui englobe une manière complètement différente de développer des interfaces utilisateur avec Qt. Bien qu'ils ne soient pas interchangeables avec QML / Kirigami - ils ont chacun un ensemble différent de concepts - les applications de KDE plus anciennes et plus complexes ont tendance à être construites avec QtWidgets.
pl: Jeśli chciałbyś pracować nad bardziej złożonymi aplikacjami KDE, takimi jak Dolphin, Kontact lub Kate, to będziesz musiał się nauczyć jak używać QtWidgets, co obejmuje zupełnie inny sposób tworzenia interfejsów użytkownika w Qt. Nie są one zamienne z QML/Kirigami i oba mają swoje wady i zalety. Starsze i bardziej złożone aplikacje KDE są zazwyczaj zbudowane przy użyciu QtWidgets.

source: QtWidgets are somewhat more daunting to work with than QML (and *much* more C++ intensive!). Luckily, we have [a set of tutorials](/content/docs/getting_started) in the KDE Docs that will help you become more familiar with them.
fr: Les composants « QtWidgets » sont un peu plus intimidants à utiliser que QML (et *beaucoup* plus intensif en C++ !). Heureusement, nous avons [un ensemble de tutoriels](/content/docs/getting_started) dans les documentations de KDE pour vous aider à vous familiariser avec eux.
pl: QtWidgets są w pewnym sensie trudniejsze do pracy niż QML (oraz *dużo* bardziej nastawione na C++ !). Na szczęście, mamy [zestaw samouczków](/content/docs/getting_started) w Dokumentacji KDE, która pomoże ci się z nimi zaznajomić.

source: If you want to look up what specific components do, look no further than [Qt's official QML documentation.](https://doc.qt.io/qt-5/qtquick-index.html)
fr: Si vous voulez savoir ce que font certains composants, ne cherchez pas plus loin que la [documentation QML officielle de Qt](https://doc.qt.io/qt-5/qtquick-index.html).
pl: Jeśli chcesz zobaczyć, co dane składniki robią, to nie szukaj dalej niż w [oficjalnej dokumentacji QML od Qt.](https://doc.qt.io/qt-5/qtquick-index.html)
pt: Se quiser saber mais o que fazem determinados componentes, não precisa de procurar mais lado nenhum que não seja a [documentação oficial sobre QML do Qt.](https://doc.qt.io/qt-5/qtquick-index.html)

source: We recommend you also take a look at Kirigami Gallery (`kirigami2gallery`), an application designed by KDE developers to demonstrate Kirigami's tools and capabilities. It provides both interactive examples of Kirigami components as well as links to the source code of these examples so you can see how they were built. You can read more about Kirigami Gallery in our [specific Kirigami Gallery tutorial](/docs/kirigami/introduction-kirigami-gallery).
fr: Nous vous recommandons également de jeter un coup d'œil à la galerie de Kirigami (« kirigami2gallery »), une application conçue par les développeurs de KDE pour présenter les outils et les capacités de Kirigami. Elle fournit à la fois des exemples interactifs de composants de Kirigami et des liens faciles vers le code source de ces exemples afin que vous puissiez voir comment ils ont été construits. Vous pouvez en apprendre plus sur la galerie de Kirigami grâce à notre [tutoriel spécifique sur la galerie de Kirigami](/docs/kirigami/introduction-kirigami-gallery).
pl: Zalecamy także spojrzenie na Galerię Kirigami (`kirigami2gallery`), aplikację stworzoną przez programistów KDE do przedstawienia narzędzi i możliwości Kirigami. Zapewnia zarówno interaktywne przykłady składników Kirigami, a także odnośniki do kodu źródłowego tych przykładów, żebyś mógł zobaczyć, jak zostały one zbudowane. Więcej o Galerii Kirigami możesz przeczytać w naszym osobnym [samouczku poświęconym Galerii Kirigami](/docs/kirigami/introduction-kirigami-gallery).

source: Don't be intimidated by all the material on here! No one starts off being able to create something like Plasma from scratch. But KDE is no multi-billion dollar company with a high barrier for entry - we have no five-round coding interviews! - and as long as you are nice, you will be welcomed.
fr: Ne vous laissez pas intimider par tout ce que vous trouverez ici ! Personne ne commence par être capable de créer quelque chose comme Plasma à partir de rien. Mais KDE n'est pas une entreprise de plusieurs milliards de dollars avec un ticket d'entrée élevé. Nous n'avons pas d'entretiens de codage à cinq tours ! Et tant que vous êtes gentil, vous êtes le bienvenu.
pl: Nie zniechęcaj się całym przedstawionym tutaj materiałem! Nikt nie jest w stanie od zera stworzyć czegoś takiego jak Plazma. Jednak KDE, to nie wielomiliardowa firma, która ma wysoki próg wejścia - nie mamy pięcioetapowych rozmów o pracę nt. kodowania! - tak długo jak będziesz \ miły, jesteś mile widziany.

source: Creating overlay sheets
fr: Création de feuilles de recouvrement
pl: Tworzenie arkuszy nakładkowych
pt: Criar folhas sobrepostas

source: Getting to grips with overlay sheets.
fr: Prendre en main les feuilles de recouvrement.
pl: Poznanie tego jak działają arkusze nakładkowe.
pt: Aprender a lidar com as folhas sobrepostas.

source: Instead, we'll be using an overlay sheet.
fr: Au lieu de cela, nous allons utiliser une feuille de recouvrement.
pl: Zamiast tego, użyjemy arkusza nakładkowego.
pt: Em vez disso, iremos usar uma folha sobreposta.

source: Countdown-adding sheet
fr: Feuille pour l'ajout d'un compte à rebours
pl: Arkusz z dodawaniem odliczań
pt: Folha de adição de contagem

source: The new component we add is `Kirigami.OverlaySheet`. Overlay sheets hover above the contents of the window and can be used for a variety of purposes, such as providing extra information relevant to the current content. They are sort of like fancy pop-up windows, except they can't be moved.
fr: Le nouveau composant que nous ajoutons est « Kirigami.OverlaySheet ». Les feuilles de recouvrement survolent le contenu de la fenêtre et peuvent être utilisées à des fins diverses, comme fournir des informations supplémentaires pertinentes pour le contenu actuel. Elles sont en quelque sorte des fenêtres contextuelles fantaisistes, sauf qu'elles ne peuvent pas être déplacées.
pl: Nowy składnik, który dodamy to `Kirigami.OverlaySheet`. Arkusze nakładkowe unoszą się nad zawartością okna i mogą być użyte do różnych celów, takich jak danie odpowiednich szczegółów do bieżącej treści. Są na kształt ciekawych okien wysuwnych, z tą różnicą, że nie można ich przesuwać.

source: The parse() method parses a string and returns the number of milliseconds since January 1, 1970, 00:00:00 UTC.
fr: La méthode « parse() » analyse une chaîne de caractères et renvoie le nombre de millisecondes depuis le premier janvier 1970, 00:00:00 UTC.
pl: Metoda parse() przetwarza ciąg znaków i zwraca liczbę milisekund od 1. stycznia 1970, 00:00:00 UTC.
pt: O método parse() processa um texto e devolve o número de milisegundos desde 1 de Janeiro de 1970, às 00:00:00 UTC.

source: We can give overlay sheets a header. These are set with the `header` property. We have provided ours with a `Kirigami.Heading` containing a relevant title: 'Add Kountdown'.
fr: On peut donner une en-tête aux feuilles de recouvrement. Celles-ci sont définies avec la propriété « header ». Nous avons fourni aux nôtres, un paramètre « Kirigami.Heading » contenant un titre pertinent : « Add Kountdown ».
pl: Arkuszom nakładowym możemy nadać nagłówek. Ustawia się je poprzez właściwość `header`. Naszemu arkuszowi nadaliśmy nagłówek poprzez `Kirigami.Heading` podając odpowiedni tytuł: 'Add Kountdown'.

source: Then we come to a `Kirigami.FormLayout`. This allows us to easily create responsive input forms, which neatly displays labels for inputs and the inputs themselves on both widescreen displays and narrower mobile devices. These form layouts are designed to work with a variety of different input types, though we're sticking to simple `Controls.Textfield` inputs that give us simple text boxes to write things in.
fr: Nous arrivons ensuite à un objet « Kirigami.FormLayout ». Il nous permet de créer facilement des formulaires de saisie réactifs, affichant correctement les étiquettes des entrées et les entrées elles-mêmes sur les écrans larges et les appareils mobiles plus réduits. Ces dispositions de formulaire sont conçues pour fonctionner avec différents types d'entrées, bien que nous nous en tenions aux simples entrées « Controls.Textfield », nous donnant des zones de texte simples pour y saisir du texte.
pl: Następnie docieramy do `Kirigami.FormLayout`. Umożliwia nam to łatwe tworzenie responsywnych formularzy wprowadzania, które ładnie wyświetlają etykiety dla pól do wprowadzania oraz same pola zarówno na szerokich ekranach jak i na ekranach urządzeń przenośnych. Układy formularzy są stworzone do działania z różnymi rodzajami wprowadzanych danych, mimo to będziemy trzymać się danych rodzaju `Controls.Textfield`, która daje nam proste pola tekstowe, do których można wpisywać różne rzeczy.

source: We have created `Controls.Textfield` elements that act as:
fr: Nous avons créé des éléments « Controls.Textfield » agissant comme :
pl: Stworzyliśmy składnik `Controls.Textfield`, które działają jak:

source: Input for the date we are counting down towards, which must be provided in a `YYYY-MM-DD` format.
fr: Saisissez la date à partir de laquelle nous effectuons le compte à rebours, qui doit être fournie au format « AAAA-MM-JJ ».
pl: Pole wprowadzania dla daty, w kierunku której odliczamy, która musi być podana w następującej postaci `RRRR-MM-DD`.
pt: Introdução da data contra a qual estamos a fazer a contagem, que deverá ser indicada no formato `AAAA-MM-DD`.

source: Within each of these `Controls.Textfield` elements, we are setting a `Kirigami.FormData.label` property that lets us define labels for them. The form will present the correct labels for each of these text inputs. We are also setting placeholder text inside the fields with the `placeholderText` property -- this text will disappear as soon as the user begins typing in the field. Finally, we are also setting the `onAccepted` property to trigger the `forceActiveFocus()` method of the following field; this will switch the active field once the user hits the ENTER key, improving the usability of our form.
fr: Dans chacun de ces éléments « Controls.Textfield », nous définissons une propriété « Kirigami.FormData.label » nous permettant de leur attribuer des étiquettes. Le formulaire présentera les étiquettes correctes pour chacune de ces entrées de texte. Nous définissons également un texte de remplacement à l'intérieur des champs avec la propriété « placeholderText » -- ce texte disparaîtra dès que l'utilisateur commencera à faire une saisie dans le champ. Enfin, nous définissons également la propriété « onAccepted » pour déclencher la méthode « forceActiveFocus() » du champ suivant. Cela changera le champ actif une fois que l'utilisateur aura appuyé sur la touche « Entrée », améliorant ainsi la convivialité de notre formulaire.
pl: Wewnątrz każdej z rzeczy `Controls.Textfield`, nadajemy właściwość `Kirigami.FormData.label`, która umożliwia nam nadane im etykiet. Formularz będzie przedstawiać poprawne etykiety dla każdego z tych pól tekstowych. Określamy także tekst zastępczy w tych polach poprzez właściwość `placeholderText` -- tekst ten zniknie zaraz po tym jak użytkownik zacznie pisać w tym polu. Na końcu, określamy właściwość `onAccepted`, aby wyzwalała metodę `forceActiveFocus()` danego pola; przełączy to bieżące pole, gdy użytkownik naciśnie klawisz ENTER, polepszając użyteczność naszego formularza.

source: We have also set a property called `inputMask` on the text field for our date. Setting this to `"0000-00-00"` prevents users from entering something that might break the functionality of the application (such as text), restricting them to only entering digits which we can then try to parse into a date object.
fr: Nous avons également défini une propriété appelée « inputMask » sur le champ de texte pour notre date. La définition de cette propriété à « 0000-00-00 » empêche les utilisateurs de saisir quelque chose pouvant casser la fonctionnalité de l'application (comme du texte), en limitant la saisie à des chiffres que nous pouvons analyser dans un objet de date.
pl: Ustawiliśmy także właściwość `inputMask` dla pola tekstowego naszej daty. Ustawiając to na `"0000-00-00"` uniemożliwia nam wpisanie czegoś (np. tekstu ), co mogłoby popsuć działanie naszej aplikacji, ograniczając wpisywanie tylko do cyfr, które później możemy spróbować przetworzyć na obiekty dat.

source: At the end of our form we are including a button that adds our new countdown to the list model. We have set the `enabled` property to a conditional statement that checks whether the name field is empty or not: if it is, the button is disabled, and vice versa. When the button is triggered, it triggers the `append` method of our `kountdownModel` list model, adding a Javascript object including the properties we have provided. We also make sure to clear the text fields by setting their `text` properties to an empty string. We finally call a method on our overlay sheet, `close()`, which closes it.
fr: À la fin de notre formulaire, nous incluons un bouton ajoutant notre nouveau compte à rebours au modèle de liste. Nous avons défini la propriété « enabled » par une instruction conditionnelle vérifiant si le champ du nom est vide ou non. S'il l'est, le bouton est désactivé et inversement. Lorsque le bouton est déclenché, il exécute la méthode « append » de notre modèle de liste « kountdownModel », ajoutant un objet Javascript avec les propriétés fournies. Nous nous assurons également d'effacer les champs de texte en donnant une valeur vide à leurs propriétés « text ». Enfin, nous appelons une méthode sur notre feuille de superposition, « close() », réalisant sa fermeture.
pl: Na końcu formularza dodajemy przycisk, który dodaje nowe odliczanie do modelu listy. Ustawiliśmy własność `enabled` na wyrażenie warunkowe, które sprawdza, czy pole to jest puste czy nie: jeśli tak, to pole jest wyłączone i na odwrót. Po naciśnięciu przycisku, wyzwala się metoda `append` naszego modelu listy `kountdownModel`, dodająca obiekt Javascript wraz z właściwościami, które określiliśmy. Upewniamy się także, żeby wyczyścić pola tekstowe nadając właściwościom `text` puste ciągi znaków. Na końcu wywołujemy metodę `close()` na naszym arkuszu nakładkowym, który go zamyka.

source: Using our sheet
fr: Utilisation de notre feuille
pl: Używanie naszych arkuszy
pt: Usar a nossa folha

source: Overlay sheets have two methods, `open()` and `close()` which control the opening and closing of this component. In this case, we have set the sheet to be opened when we trigger our action. Once we save our files and build our program, we'll be able to add our own customised countdowns!
fr: Les feuilles de recouvrement possèdent deux méthodes, « open() » et « close() », contrôlant l'ouverture et la fermeture de ce composant. Dans ce cas, nous avons configuré la feuille pour qu'elle soit ouverte lorsque nous déclenchons notre action. Une fois que nous aurons enregistré nos fichiers et construit notre programme, nous serons en mesure d'ajouter nos propres comptes à rebours personnalisés !
pl: Arkusze nakładkowe zawierają dwie metody, `open()` oraz `close()`, które odpowiadają za otwieranie i zamykanie tego składnika. W tym przypadku, określiliśmy, aby arkusz otwierał się, gdy wyzwolimy nasze działanie. Po zapisaniu naszych plików i zbudowaniu naszego programu, będziemy w stanie dodawać nasze własne odliczania!

source: Explaining Pages
fr: Explications sur les pages
pl: Wyjaśnianie stron

source: These tutorials will focus on creating an application that lets the user see how many days are left until an event of their choice. That doesn't mean you shouldn't deviate and try to create your own thing! Just make sure you pay close attention to how things work *first*, so that you can adjust when things are different in your own code. We also recommend you check out the [Kirigami Gallery](https://apps.kde.org/en/kirigami2.gallery), which provides a number of useful UI examples and provides easy access to all the code.
fr: Ces tutoriels se concentreront sur la création d'une application permettant à l'utilisateur de voir combien de jours il reste avant un évènement de son choix. Cela ne veut pas dire que vous que vous ne devez pas vous écarter et d'essayer de créer votre propre chose ! Veuillez-vous simplement prêter une attention particulière à la façon dont les choses fonctionnent *d'abord*, afin que vous puissiez vous adapter lorsque les choses sont différentes dans votre propre code. Nous vous recommandons également de consulter la galerie de Kirigami](https://apps.kde.org/en/kirigami2.gallery), fournissant un certain nombre d'exemples utiles d'interface utilisateur et vous permettant d'accéder facilement à tout le code.
pl: Samouczki te skupią się na tworzeniu aplikacji, która umożliwia użytkownikowi zobaczenie ile dni pozostało do wydarzenia, które sobie określił. Nie oznacza to jednak, że nie wolno ci zboczyć i tworzyć swoich własnych rzeczy! *Najpierw* upewnij się tylko, że wiesz jak rzeczy działają tak, abyś mógł się dostosować, gdy rzeczy będą miały działać inaczej w twoim kodzie. Polecamy także zajrzenie do [Galerii Kirigami](https://apps.kde.org/en/kirigami2.gallery), która zawiera kilka przydatnych przykładów interfejsów i umożliwia łatwy dostęp do kodu.

source: Kirigami apps are typically organized in [Pages](docs:kirigami2;Page). Those are the different ‘Screens’ of an app. You will want to have a page dedicated to specific aspects of your app's interaction, and you can create different QML files each containing the code for separate pages.
fr: Les applications Kirigami sont généralement organisées en [Pages](docs:kirigami2;Page). Ces pages sont les différents « écrans » d'une application. Vous voudrez avoir une page dédiée à des aspects spécifiques de l'interaction de votre application et vous pouvez créer différents fichiers QML contenant chacun le code de pages distinctes.
pl: Aplikacje Kirigami są zazwyczaj ułożone na [Stronach](docs:kirigami2;Page). Są to różne ‘Ekrany‘ aplikacji. Zalecamy posiadanie stron dla różnych części oddziaływania z twoją aplikacją. Możesz tworzyć różne pliki QML, gdzie każdy zawiera kod dla innej strony osobno.

source: Pages are organized in a pagestack where they can be pushed and popped. On a phone only the topmost page is shown, whereas on a larger screen (desktop or tablet) multiple pages can be shown next to each other.
fr: Les pages sont organisées dans une pile de pages où elles peuvent être empilées et retirées. Sur un téléphone, seule la page la plus haute est affichée, alors que sur un écran plus grand (ordinateur de bureau ou tablette), plusieurs pages peuvent être affichées les unes à côté des autres.
pl: Strony są ułożone w stosy stron, na które mogą być wrzucone lub z których mogą być pobrane. Na telefonach, pokazywana jest tylko szczytowa strona, podczas gdy na dużym ekranie (komputer lub tablet) wiele stron może być pokazanych obok siebie.

source: ![A single page on the phone](mobile.png)
fr: ! [Une seule page sur le téléphone](mobile.png)
pl: ![Pojedyncza strona na telefonie](mobile.png)
